{"id":365505,"name":"tokenize","type":"verb","us_sound":"ˈtoʊ.kən.aɪz","us_link":"../audio/t/cdo0123ustoke2377.mp3","uk_sound":"ˈtəʊ.kən.aɪz","uk_link":"../audio/t/cdo0123uktoke2717.mp3","content":"tokenize verb [T]\n(COMPUTING)\nAdd to word list\nAdd to word list\ncomputing, language\n&#160; specialized to divide a series of characters (= letters, numbers, or other marks or signs used in writing or printing) into separate tokens (= units) that have a meaning: The stream of characters in a natural language text must be tokenized (broken up into distinct meaningful units) before any language processing can happen.\ncomputing\n&#160; specialized to replace a private piece of data with a token (= a different piece of data that represents the first one), in order to prevent private information being seen by someone who is not allowed to do so: When we receive the transaction securely, we tokenize it and send back a token to the merchant so they never have to see a card number for settlement.\nMore examplesFewer examples First, your script must be tokenised and converted into meaningful units.Use the huge archive of previous customer searches and tokenize these into words.Tokenising a card transaction is considered safer as the actual card details are not shared.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\nmeg\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCodes & decoding\ntokenize verb [T]\n(PERSON)\nto do something that seems to support or help a group of people who are treated unfairly in society, such as giving a member of that group an important or public position, but that does not make changes that would help that group of people in a lasting way: He did not feel as if he had been tokenized while at college but had been held to the same standards as everyone else. Related word\ntokenism\nMore examplesFewer examplesMany employees feel that they are being tokenised in publicity materials, while their concerns about bias and inequality are not actually being addressed.How can you tell if you're being tokenized at your workplace?They listed 8 ways people of colour are tokenized in nonprofits.\nSMART Vocabulary: related words and phrases\nUnfairness and favouring someone unfairly\nableism\nableist\nagism\nagist\nAnglocentric\ndiscrimination\ndiscriminative\ndiscriminatorily\ndiscriminatory\ndrumhead\none-sided\none-sidedly\none-sidedness\nthe old school tie\nthe old-boy network idiom\ntwo-tier\nunbalance\nunequal\nunequally\nuneven\nSee more results »\nRelated word\ntokenization"}