{"id":365584,"name":"toll","type":"noun","us_sound":"toʊl","us_link":"../audio/t/toll.mp3","uk_sound":"təʊl","uk_link":"../audio/t/uktold_009.mp3","content":"toll noun\n(CHARGE)\nAdd to word list\nAdd to word list\nC1 [ C ] a small amount of money that you have to pay to use a road, cross a bridge, etc.: Tolls are now collected electronically on most motorways.\n[ C ] US the money a long-distance phone call costs: Is Bayonne a toll call (= a more expensive phone call) from New York?\nMore examplesFewer examplesThe toll of bankruptcies was rising daily.The toll of babies born with AIDS is rising.\nSMART Vocabulary: related words and phrases\nOn the road: driving & operating road vehicles\naquaplaning\nback someone up\nbiting point\nboxed in\nbranch off\nchauffeur\ngun\nhandle\njam\nplatooning\npull\npull someone up\npush start\nrange anxiety\nreverse\nroad rage\nskid\nspeeding\nthe RAC\nton\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTaxation\nBills & invoices\nCommunications - by telephone\ntoll noun\n(SUFFERING)\nC2 [ U ] suffering, deaths, or damage: Independent sources say that the death toll from the earthquake runs into thousands.\nSMART Vocabulary: related words and phrases\nDeath and dying\nbereave\nbite\nbleed out\nbuy the farm idiom\ncadaveric\ndeath toll\ndepart this life idiom\nfatality\nghost\nmacabre\npredecease\npush\nraise\nremains\nsnuff\nstarvation\nsuicidally\nterminally\nthose whom the gods love die young idiom\nwatery\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInjuring and injuries\nDamaging and spoiling\nIdiom\ntake its/a toll\nto (cause a large bell to) ring slowly and repeatedly: In the distance, a church bell tolled the hour (= showed the time by ringing).\nSMART Vocabulary: related words and phrases\nSounds made by objects, movement or impact\nbang around\nbong\nburble\nchoo-choo\nchuff\nclick away\nclicker\nclinking\ncrunch\nplop\nresonance\nspit\nsplat\nsputter\nsqueak\nswoosh\ntinkly\ntintinnabulation\nunsounded\nwhirr\nSee more results »\ntoll noun\n(MONEY)\nAdd to word list\nAdd to word list\n[ C ] an amount of money that you have to pay to travel along some main roads, to cross bridges, etc., or to make telephone calls over long distances: They’re raising the bridge toll to $5.00. The number you dialed is a toll call – please deposit an additional fifty cents.\ntoll noun\n(SUFFERING)\n[ U ] a high degree of suffering or damage: In addition to the physical destruction caused by the flooding, the emotional toll on its victims was immense.\ntoll verb [I/T]\n(RING)\n(of a large bell) to ring slowly and repeatedly, or to cause a large bell to ring in this way: [ I ] The town hall bell tolled at noon.\nAdd to word list\nAdd to word list\n[ C ]\n&#160; TRANSPORT an amount of money that you have to pay to use a road or bridge: Motorists in the region paid more than $11.6 million in tolls last year.pay/collect a toll Vehicles would be fitted with an electronic tag allowing drivers to pay tolls by credit card, over the phone or electronically. road/bridge/motorway tolls a toll bridge/highway/motorway\n[ C ]\n&#160; INTERNET, COMMUNICATIONS an amount of money that you have to pay to use the internet or to visit particular websites: Cable companies must treat all online traffic equally, without imposing higher tolls for certain content.\n[ C ]\n&#160; COMMUNICATIONS\n&#160; US the cost of a long-distance phone call\n[ S ] the total number of bad things or amount of damage that happens as a result of something: The final toll of bankruptcies for this year is high. The death toll from the earthquake was over a million.financial/economic/emotional toll Layoffs carry a large human and financial toll.\nto take its/their toll (on sth/sb)\nif something takes its toll, it causes damage: The recession is taking its toll on small businesses. The building was once a model of its kind, but years of neglect have taken their toll. Stress can take a heavy toll on your health."}