{"id":365769,"name":"tomorrow","type":"adverb","us_sound":"təˈmɔːr.oʊ","us_link":"../audio/t/tomorrow.mp3","uk_sound":"təˈmɒr.əʊ","uk_link":"../audio/t/uktold_026.mp3","content":"Add to word list\nAdd to word list\nA1 on the day after today: I don't have time now. I'll do it tomorrow. I'm having dinner with Rachel tomorrow night.tomorrow week UK He'll be back tomorrow week (= a week from tomorrow).a week tomorrow UK We're leaving on holiday a week tomorrow (= a week from tomorrow).\nMore examplesFewer examplesDr Jones is very busy but I'm sure she'll be able to fit you in tomorrow.She gets the test results tomorrow.Let's stay here tonight, then move on tomorrow morning.\nSMART Vocabulary: related words and phrases\nDays, & parts of the week\nat the weekend phrase\nat weekends phrase\ncalends\nFri.\nFriday\nMon.\nMonday\nnones\nsat\nSaturday\nschool night\nsun\ntoday\nTue.\nTuesday\nwed\nWednesday\nweekend\nweeknight\nyesterday\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIn the future & soon\n[ U ] the day after today: You feel bad now, but tomorrow is another day. Oh, leave it till tomorrow. Is John coming to tomorrow's meeting?week from tomorrow US He'll be back a week from tomorrow.\nC2 [ C or U ] a time in the future: Today's problem child may be tomorrow's criminal. We make sacrifices now to give our children a better tomorrow. At my age you look back and begin to realize that you have more yesterdays than tomorrows.\nMore examplesFewer examplesI've got to get this essay finished by tomorrow.I've got a load of work to get through before tomorrow.I hope they play better in tomorrow's game.Let's wait and see what tomorrow brings.\nSMART Vocabulary: related words and phrases\nDays, & parts of the week\nat the weekend phrase\nat weekends phrase\ncalends\nFri.\nFriday\nMon.\nMonday\nnones\nsat\nSaturday\nschool night\nsun\ntoday\nTue.\nTuesday\nwed\nWednesday\nweekend\nweeknight\nyesterday\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIn the future & soon\nIdiom\nlike there is/was no tomorrow\nAdd to word list\nAdd to word list\non the day after today: He said he’ll call tomorrow after work.\nthe day after today: [ U ] Tomorrow’s meeting has been postponed.\nIf you say you will see someone tomorrow morning/night/at noon/etc., you mean you will see that person on the next day at that time: [ U ] I’ve arranged to see Rachel tomorrow morning/at ten.\nTomorrow can also mean the future: [ U ] Today’s problem child may be tomorrow’s brilliant scientist."}