{"id":365787,"name":"tonal","type":"adjective","us_sound":"ˈtoʊ.nəl","us_link":"../audio/t/ustobag027.mp3","uk_sound":"ˈtəʊ.nəl","uk_link":"../audio/t/uktold_029.mp3","content":"tonal adjective\n(MUSIC)\nAdd to word list\nAdd to word list\nmusic\n&#160; specialized relating to the quality of sound of a musical instrument or singing voice: The performance showed off the tonal power and richness of the symphony.\nmusic\n&#160; specialized Tonal music is music that is based on major and minor keys: He had originally worked as a nightclub pianist and his music was tonal and accessible. Compare\natonal\nMore examplesFewer examplesThe soprano sang with a stunning blend of tonal warmth, emotional depth and precision.She showed great tonal variety in the three Poulenc chansons.The second and third movements featured some rich tonal texturing and sumptuous sounds from the string section.Much of the music was tonal and contained attractive melodic material.\nSMART Vocabulary: related words and phrases\nTechnical music terms\naccidental\nadagio\naleatory\nantiphonal\narpeggio\narr.\ncadence\ngiusto\nglide\ngroove\nharmonic\nharmonic progression\nharmony\nlegato\nsyncopated\nsyncopation\ntempered\ntempo\ntimbre\ntime signature\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of music\ntonal adjective\n(LANGUAGE)\nlanguage, phonetics\n&#160; specialized expressing differences in meaning with the use of different intonation (= the sound changes produced by the rise and fall of the voice when speaking) for words that have a similar sound: Non-native speakers trying to learn a tonal language have great difficulty with tone. Tonal languages include Chinese, Vietnamese, Lithuanian, and most sub-Saharan languages.\nMore examplesFewer examplesTonal languages also have intonation patterns that can override the basic tone of the words.The present study reveals that \"secondary baby talk\" also occurs in Japanese, a tonal language.Most sub-Saharan African languages are tonal.\nSMART Vocabulary: related words and phrases\nLinguistics: phonology & phonetics\naccommodation\nalliterative\nalveolar\napheresis\naphesis\nassonance\ndiphthong\nhomonym\nintrusive\nlabial\nlabialize\nlabiodental\nplosive\npostalveolar\npostconsonantal\nretroflex\nrhotic\nthe International Phonetic Alphabet\nunpronounceable\nunrepeatable\nSee more results »\ntonal adjective\n(COLOUR)\nrelating to a form or degree of a colour: The interior design features the use of an autumnal tonal colour palette.\nMore examplesFewer examplesThe designer scanned the images and gray-scaled them so that they all had the same tonal range.A tonal palette of black, grey and white, with beige and khaki in places, was used on the mid-length dresses.The photographer was an influential master of light, form, subtle tonal shading and darkroom techniques.\nSMART Vocabulary: related words and phrases\nThe qualities of colour\nanalogous\nbrightly\nbrightness\ncolourful\ncolourfully\ndarkness\nfluorescent\nharsh\nlurid\nneutrally\nnon-complementary\nnon-fluorescent\nnon-yellowing\nover-bright\npastel\nvibrantly\nviolent\nvivid\nvividly\nvividness\nSee more results »\nAdd to word list\nAdd to word list\nmusic organized based a particular note and the relationship of other notes to it"}