{"id":365979,"name":"too","type":"adverb","us_sound":"tuː","us_link":"../audio/t/to.mp3","uk_sound":"tuː","uk_link":"../audio/t/uka30053.mp3","content":"too adverb\n(MORE)\nAdd to word list\nAdd to word list\nA1 more than is needed or wanted; more than is suitable or enough: I'm too fat.a bit too I can't reach the shelf - it's a bit too high.(far) too There were (far) too many people for such a small room.too something (for someone) to do something It's too hard (for me) to explain.too something a something for someone/something It was too expensive a desk for a child's room.(all) too It's (all) too much (= more than I can deal with) - I can't stand it. all too\nused before an adjective or adverb to emphasize a negative meaning: The holidays flew by all too quickly.\nSee more only too\nused before an adjective to emphasize a positive meaning: \"Would you like to make a donation?\" \"I'd be only too pleased.\"\nSee more\nMore examplesFewer examplesDon't fill your glass too full or you'll spill it.This book is a bit too grown-up for you.I can't pick the kettle up - the handle's too hot.By the time I saw the job advertised it was already too late to apply.That hill's far too steep to cycle up.\nSMART Vocabulary: related words and phrases\nToo much and unnecessary\nado\nbe up to your neck (in something) idiom\nbellyful\nbinge\ncarry/take coals to Newcastle idiom\ndrown\ngush\nhave your (fair) share of something idiom\nhyper\nimmoderate\nimmoderately\ninappeasable\nplay gooseberry idiom\nplenty\npleonasm\npleonastic\nplethora\nunnecessary\nunwarranted\nweigh someone/something down\nSee more results »\ntoo adverb\n(ALSO)\nA1 (especially at the end of a sentence) in addition, also: I'd like to come too.informal \"I love chocolate.\" \"Me too.\"\nused to show surprise: It's a wonderful picture of light shining through trees - and by a child too! Compare\nas well (as)\nmoreover formal\nwhat's more\nMore examplesFewer examplesYou want a restaurant that serves good food but has a bit of atmosphere too.By the way, please tell Ellis that he's welcome to come too.Cars must stop at red traffic lights: similarly , bicycles should stop too.\"Well, I hate you too!\" she snapped.\"I hope they stay together.\" \"I hope so too.\"\nSMART Vocabulary: related words and phrases\nAlso, extra, and in addition\nadded\nadditional\nadditionally\nagain\nalong\net cetera\netc.\nexcess\nfiller\nfor good measure idiom\nhand\nrate\nsame\nsecond\nsecondly\nside\nsuchlike\nsupernumerary\nthirdly\ntouch\nSee more results »\ntoo adverb\n(VERY)\nA2 very, or completely: too pleased/happy He wasn't too pleased/happy when I told him about the mistake.too well My mother hasn't been too well recently.too kind formal Thank you, you're too kind.\nMore examplesFewer examplesI like detective stories and romances - nothing too intellectual.He has suffered a mild heart attack - nothing too serious.Don't come too near me - you might catch my cold.If we all work together, it shouldn't take too long.He prefers plain food - nothing too fancy.\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabsolutely\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\ntoo adverb\n(CERTAINLY)\nUS informal used to emphasize a positive answer to a negative statement: \"I'm not going to school today.\" \"You are too!\"\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabsolutely\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\nGrammar\nTooToo is an adverb. …\nToo meaning ‘more than enough’We use too meaning ‘more than enough’ in different positions. …\nToo meaning ‘also’We can use too to mean ‘also’. It is more common than also in informal situations. We normally use it at the end of the clause: …\nAlso, as well or too?Also, as well and too are adverbs and mean ‘in addition’. …\nAlsoAlso is commonly used in writing, but is less common in speaking. Also occupies different positions in a sentence. …\nAs wellAs well is much more common in speaking than in writing, and is more common in speaking than also. …\nTooWe usually put too in end position: …\nLinking negativesWe use either not also, as well or too to connect two negative ideas: …\nAlso, as well and too: typical errorWe don’t use as well at the beginning of a clause. As well usually comes at the end of a clause: …\nAdding with and … tooIn speaking, we can also use and … too to connect words, phrases and clauses. Too focuses on the addition: …\nIdioms\nin too deep\ntoo bad\ntoo good to be true\ntoo good to miss\ntoo much like hard work\ntoo much of a good thing\ntoo adverb [not gradable]\n(MORE)\nAdd to word list\nAdd to word list\nmore than is needed or wanted; more than is suitable or enough: The sofa is too big for this room. The apartment was nice but it was just too expensive. This dress is too large for me – I’ll need a smaller size.\ntoo adverb [not gradable]\n(VERY)\nvery, or completely: I’m not too sure I want to go out tonight.\ntoo adverb [not gradable]\n(ALSO)\n(esp. at the end of a sentence) in addition; also: Bring your tennis racket, and your bathing suit, too.\nIdioms\n(that's) too bad\n(it's) too bad that\ntoo good to be true"}