{"id":365985,"name":"tool","type":"noun","us_sound":"tuːl","us_link":"../audio/t/tool.mp3","uk_sound":"tuːl","uk_link":"../audio/t/uktoned016.mp3","content":"tool noun [C]\n(EQUIPMENT)\nAdd to word list\nAdd to word list\na piece of equipment that you use with your hands to make or repair something: power tools machine tools\nsomething that helps you to do a particular activity: useful tool A free low-interest credit card can be a useful budgeting tool. tool of the trade [ usually plural ]\nA tool of the trade is something you need to use to do your job: The artist was surrounded by paints, brushes, and other tools of the trade.\nSee more\nMore examplesFewer examplesThis tool is used to make holes in leather.A hammer is a simple tool.I always keep a set of tools in the back of my car.Early humans shaped tools out of stone.Our lawn mower and lots of garden tools were stolen from the shed.\nSMART Vocabulary: related words and phrases\nTools in general\naid\nambidextrous\nblade\nblaster\ncontrivance\ncutter\ndevice\nfan\ngadget\ngrabber\nhardware\nmachine tool\npower tool\nprecision instrument\nratchet\nspacer\nspreader\ntoolkit\nutensil\nutility belt\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThings needed for a task\ntool noun [C]\n(PERSON)\ndisapproving someone whose decisions and actions are unfairly controlled by others: tool of The president was widely regarded as the tool of the military.\nSMART Vocabulary: related words and phrases\nLack of freedom to act\nbe in bondage to something idiom\nbe locked in something\nbondage\nbound\nboxed in\ndisempowered\ndisempowering\ndisenfranchisement\nheel\nlock\nnon-voluntary\nparalytic\nqualified\nregimented\nservitude\nshackle\nsomeone's hands are tied idiom\nthumb\ntie\nunder someone's thumb idiom\nSee more results »\ntool noun [C]\n(PENIS)\noffensive a penis\noffensive an insulting word for a person who you dislike very much or who behaves very stupidly\nSMART Vocabulary: related words and phrases\nInsults & abuse\nabusive\nabusively\nbackhanded compliment\nbrickbat\ncontumely\ncut (someone) to the quick idiom\ndenigration\ndis\njeer\nleft-handed compliment\nmouth\nname\nneg\nnegging\npoint-scoring\nput something/someone down\nrevile\nsledging\nslight\nstick\nSee more results »\nAdd to word list\nAdd to word list\na piece of equipment that you use to help you do a job, esp. something that you use with your hands to make or repair something: The only tools you need for this job are a hammer and a screwdriver.\nA tool is also anything that helps you to do something you want to do: We believe the new law will be an effective tool in fighting poverty.\nAdd to word list\nAdd to word list\na small piece of equipment that you use with your hands to make or repair something: They sell agricultural machinery and tools. You can assemble our furniture using hand tools or very basic power tools.\nsomething that helps you in a particular activity: An educated sales force is one of the most effective tools any company can have. Our online presence gives us a powerful new tool to maintain market position. a business/marketing/research tool a strategic/managerial/statistical tool\nIT a program or feature of a program that helps you do particular things on a computer: The spreadsheet program offers several useful tools for manipulating the material. Companies in the industry tend to use identical, or at least compatible, software tools.\ntool of the trade\nsomething that is necessary for doing a particular job: A personal computer and laptop are essential tools of the trade for any journalist. The ability to write clearly is another tool of the trade. See also\nmachine tool"}