{"id":366345,"name":"torch","type":"noun","us_sound":"tɔːrtʃ","us_link":"../audio/t/torch.mp3","uk_sound":"tɔːtʃ","uk_link":"../audio/t/uktop__026.mp3","content":"Add to word list\nAdd to word list\nB2 [ C ] UK (US flashlight) a small light that is held in the hand and usually gets its power from batteries: She flashed/shone the torch into the dark room.\n_LeS_/iStock/Getty Images Plus/GettyImages\n[ C ] a thick stick with material that burns tied to the top of it, used to give light: a flaming/blazing torchliterary Many buildings were put to the torch (= burned intentionally) during the riots.\nIgor Golovniov/EyeEm/GettyImages\n[ S ] approving used as a symbol of a political movement or idea that has an important positive influence: She promised that the party would carry the torch of progressivism into the next decade.\nMore examplesFewer examplesThe torch sends out a powerful beam of light.The policeman walked along the street, shining a torch into every car.The lighting of the Olympic torch symbolizes peace and friendship among the nations of the world.She flashed the torch into the dark room.\nSMART Vocabulary: related words and phrases\nLighting & light fittings in the home\ncandelabra\ncandle\ncandlestick\ncandlewick\nchandelier\nhalogen lamp\nhead torch\nheadlamp\nhurricane lamp\nlamp\nluminaire\nnightlight\npenlight\npillar candle\nrope light\ntable lamp\ntaper\ntea light\ntiki torch\nunlit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTools\nSigns, signals and symbols\nto burn a building or other large thing, intentionally and usually illegally: They smashed a side door to get in and then torched the warehouse when they had taken what they wanted.\nThesaurus: synonyms, antonyms, and examples\nto burn down or burn something downburn downThe family home burned down in a matter of hours.burn to the groundToday marks 400 years since the theatre burned to the ground.go upAfter the initial explosion, the building went up in a matter of minutes.go up in flamesThe precious collection went up in flames.go up in smokeAll my life's work has gone up in smoke.consumeAll her possessions were consumed in the blaze.\nSee more results »\nSMART Vocabulary: related words and phrases\nStarting fires\narsonist\nbellows\ncombust\nfire\nfire starter\nfirelighter\nignite\nignition\nkindle\nkindling\nlight\nmake\nmake something up\nput\nput something out\nreignition\nset fire to something/someone idiom\nset something/someone on fire idiom\nstrike\ntinder\nSee more results »\nAdd to word list\nAdd to word list\na stick that burns at one end and is held at the other end and is used esp. as a light: Which athlete will carry the Olympic torch into the stadium?\nfig. The torch is the basic responsibilities and characteristics of a group, organization, or society, esp. when someone new takes control: After he retired, the torch passed to his daughter, who now runs the organization.\nA torch is also a blowtorch.\nto burn something intentionally and usually illegally: They torched the warehouse and ran."}