{"id":366630,"name":"tortoiseshell","type":"noun","us_sound":"ˈtɔːr.t̬əs.ʃel","us_link":"../audio/t/tortoiseshell.mp3","uk_sound":"ˈtɔː.təʃ.ʃel","uk_link":"../audio/t/uktorme026.mp3","content":"tortoiseshell noun\n(ANIMAL SHELL)\nAdd to word list\nAdd to word list\n[ U ] the hard shell of a turtle that is yellow, orange, and brown and that is used to make decorative objects, or an artificial substance made to look like this: Nowadays, jewellery that is marketed as \"tortoiseshell\" is actually plastic. This area is the centre of a deadly illegal trade in tortoiseshell and turtle meat.\nSteve Wisbauer/Photodisc/GettyImages\nMore examplesFewer examplesThe little mirror was backed with tortoiseshell. He was presented with a set of ceremonial vessels and knives made of tortoiseshell and wood.\nSMART Vocabulary: related words and phrases\nThe skin, hair & bone of non-human animals\nbaleen\nbristly\nbushy\ncoated\ndander\neiderdown\nfeather\nfleece\ngoatskin\nhackles\nhorsehair\nlambswool\nmane\nmother-of-pearl\nsable\nsealskin\nseashell\nsheepskin\nspine\nwishbone\nSee more results »\ntortoiseshell noun\n(CAT)\n[ C ] ( also tortoiseshell cat) a cat with black, brown, and orange fur: Ella, a seven-year-old tortoiseshell, disappeared from her home three months ago. The tortoiseshell cat was found injured and frightened and was taken to an animal sanctuary. Compare\ncalico\ntabby\nDave King/Dorling Kindersley/GettyImages\nMore examplesFewer examplesWe have two cats - a tortoiseshell and a tabby.A tortoiseshell cat is actually a cat that is part black and part red tabby, giving it a tri-coloured look.I looked out of the window and there was a little tortoiseshell cat sitting outside.In the United Kingdom a tortoiseshell cat with white markings is called simply a \"tortoiseshell and white\", while in the United States it is known as a \"calico\" or a \"calico cat\".\nSMART Vocabulary: related words and phrases\nFelines (cats)\nBengal tiger\nbig cat\ncalico\ncat\ncat-sit\nHimalayan\njaguar\nkitten\nleopard\nlion\nocelot\npanther\nPersian cat\npuma\npuss\ntigress\ntom\ntomcat\ntortie\nwildcat\nSee more results »\ntortoiseshell noun\n(BUTTERFLY)\n[ C ] (also tortoiseshell butterfly) a type of butterfly (= an insect with large, often brightly coloured wings) that has reddish-orange, black and yellow marks on its wings: From the shape of its wings and manner of flight, the butterfly was almost certainly a small tortoiseshell. The food plant for the tortoiseshell butterfly is the stinging nettle.\nMore examplesFewer examplesA large tortoiseshell flew past the window.Last year's mild weather saw species that hibernate, such as peacock and tortoiseshell, survive in great numbers throughout the winter.\nSMART Vocabulary: related words and phrases\nInsect names\nanopheles\nant\naphid\nbeastie\nbedbug\ndragonfly\ndust mite\nearwig\nearworm\nelm bark beetle\nhousefly\ninsect\njigger\nladybird\nlepidopterist\nsilverfish\nsow bug\nspider mite\nstick insect\nswallowtail\nSee more results »\ntortoiseshell adjective\n(ANIMAL SHELL)\nmade of tortoiseshell or of a material that has been made to look like tortoiseshell: One of her presents was a tortoiseshell brush, comb, and mirror set. glasses with tortoiseshell frames\nMore examplesFewer examplesPlease don't buy the corals or tortoiseshell souvenirs that are offered for sale.The manicure set is sold in a black leather case with mock tortoiseshell handles.Among the objects on display are an engraved tortoiseshell comb and its case, dating to 1689.\nSMART Vocabulary: related words and phrases\nThe skin, hair & bone of non-human animals\nbaleen\nbristly\nbushy\ncoated\ndander\neiderdown\nfeather\nfleece\ngoatskin\nhackles\nhorsehair\nlambswool\nmane\nmother-of-pearl\nsable\nsealskin\nseashell\nsheepskin\nspine\nwishbone\nSee more results »\ntortoiseshell adjective\n(CAT)\n(of a cat or its fur) black, brown, and orange in colour: They had adopted a tortoiseshell kitten. Male cats are almost never tortoiseshell. Compare\ncalico\ntabby\nMore examplesFewer examplesSeveral of the cats had tortoiseshell markings.Only females have two X chromosomes, so only female cats can display the red plus non-red tortoiseshell combination.The cat's tortoiseshell, so I'm assuming it's a girl.\nSMART Vocabulary: related words and phrases\nFelines (cats)\nBengal tiger\nbig cat\ncalico\ncat\ncat-sit\nHimalayan\njaguar\nkitten\nleopard\nlion\nocelot\npanther\nPersian cat\npuma\npuss\ntigress\ntom\ntomcat\ntortie\nwildcat\nSee more results »\nAdd to word list\nAdd to word list\nthe hard shell of a turtle that has attractive brown and yellow patterns, or plastic made to look like this shell: a tortoiseshell barrette tortoiseshell eyeglass frames"}