{"id":366658,"name":"torture","type":"noun","us_sound":"ˈtɔːr.tʃɚ","us_link":"../audio/t/torture.mp3","uk_sound":"ˈtɔː.tʃər","uk_link":"../audio/t/uktorme030.mp3","content":"Add to word list\nAdd to word list\nC2 [ U ] the act of causing great physical or mental pain in order to persuade someone to do something or to give information, or to be cruel to a person or animal: Half of the prisoners died after torture and starvation. He revealed the secret under torture.\nC1 [ C or U ] informal a very unpleasant experience: The rush-hour traffic was sheer torture as usual.\nMore examplesFewer examplesEven under torture, he refused to deny his faith.They used sleep deprivation as a form of torture.Human rights campaigners have discovered documentary evidence of torture.She was subjected to torture and lengthy interrogations.The torture failed to break the prisoner's spirit.\nSMART Vocabulary: related words and phrases\nTreating people or animals badly\nabuser\nanti-harassment\nat the hands of someone idiom\nbatten\nbatten on someone\nhit someone where it hurts idiom\nill-treat\nill-treatment\nill-used\nimpose\npick\npick on someone\nprey\nprey on something\nput someone through something\ntyranny\nuncared for\nuse\nvictimization\nvictimize\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDifficult situations and unpleasant experiences\nC2 to cause great physical or mental pain to someone intentionally: It is claimed that the officers tortured a man to death in a city police station.\nThesaurus: synonyms, antonyms, and examples\nto hurt someone physicallyhurtI hurt my arm climbing over the fence.injureThe bomb killed ten people and injured many more.woundHe was wounded so badly in the attack that doctors said he might never walk again.maimThe atrocities have killed or maimed thousands of people.tortureThe guards were accused of torturing prisoners.stabHe was fatally stabbed with a kitchen knife.\nSee more results »\nto cause mental pain: He tortured himself for years with the thought that he could have stopped the boy from running into the road.\nMore examplesFewer examplesHe was tortured in prison.They were tortured until they revealed where the weapons were hidden.If they catch him, they will torture him.As a child, he liked to torture insects.\nSMART Vocabulary: related words and phrases\nTreating people or animals badly\nabuser\nanti-harassment\nat the hands of someone idiom\nbatten\nbatten on someone\nhit someone where it hurts idiom\nill-treat\nill-treatment\nill-used\nimpose\npick\npick on someone\nprey\nprey on something\nput someone through something\ntyranny\nuncared for\nuse\nvictimization\nvictimize\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking people sad, shocked and upset\nRelated word\ntorturer\nAdd to word list\nAdd to word list\nan injury or severe mental pain: [ C ] All drivers suffer the tortures of traffic and bad weather.\nTorture is also the act of injuring someone or making someone suffer in an effort to force that person to do or say what you want to be done or said: [ U ] The museum has many examples of instruments of torture.\nto cause great physical or mental pain to someone: She was tortured by the memory of their last argument."}