{"id":366395,"name":"tory","type":"noun","us_sound":"ˈtɔːr.i","us_link":"../audio/t/ustorme019.mp3","uk_sound":"ˈtɔː.ri","uk_link":"../audio/t/uktortu003.mp3","content":"Add to word list\nAdd to word list\na member of the British Conservative Party: Margaret Thatcher was elected to lead the Tories in 1975.\na member of the main conservative political party in Canada: Liberal Martha Hall Findlay accused the Tories of keeping Canadians in the dark about the costs.\nUS a person who supported the British government during the American Revolution: During the American Revolution, the Tories were bitterly denounced.\nMore examplesFewer examplesThere are five Tories in the group.One source said that most of the seats up for grabs this year are in urban areas, where the Tories are still struggling to make an impact. His grandmother was a Tory who had helped her brothers break out of jail when they were locked up there by patriots during the Revolution.\nSMART Vocabulary: related words and phrases\nPolitics - general words\nanti-capitalism\nanti-capitalist\nanti-communism\nanti-communist\nanti-fascism\ninterparty\ninterpellate\ninterpellation\ninterventionist\nlab\non message\nOrwellian\noverstep\nparliament\nparty politics\nstatesman\nstatesmanlike\nstateswoman\nsubsidiarity\nsuper-conservative\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRenaissance: 1501 to 1899\nRelated word\nToryism\nbelonging to, supporting, or relating to the British Conservative Party: They are both Tory voters living in Cornwall. There was a Tory government in Britain throughout the 1980s.\nbelonging to, supporting, or relating to the main conservative political party in Canada: With 24 Tory MPs from Ontario, his party now had a credible national voice.\nUS supporting the British government during the American Revolution: Bristol, Connecticut was a hotbed of Tory activity during the Revolution.\nMore examplesFewer examplesShe's a contender for a place in the Tory shadow cabinet.The approach to spending cuts is not the only difference between the Tory leader and his Shadow Chancellor. He's a former adviser to both Tory and Labour administrations.\nSMART Vocabulary: related words and phrases\nPolitics - general words\nanti-capitalism\nanti-capitalist\nanti-communism\nanti-communist\nanti-fascism\ninterparty\ninterpellate\ninterpellation\ninterventionist\nlab\non message\nOrwellian\noverstep\nparliament\nparty politics\nstatesman\nstatesmanlike\nstateswoman\nsubsidiarity\nsuper-conservative\nSee more results »\nAdd to word list\nAdd to word list\npolitics &amp; government a member of the main conservative political party in Canada\npolitics &amp; government A Tory is also a member of the main conservative political party in Great Britain.\nUS history During the American Revolution, a Tory was a person who supported the British government: Loyalist"}