{"id":366711,"name":"toss","type":"verb","us_sound":"tɑːs","us_link":"../audio/t/toss.mp3","uk_sound":"tɒs","uk_link":"../audio/t/uktortu006.mp3","content":"toss verb\n(THROW)\nAdd to word list\nAdd to word list\nC2 [ T usually + adv/prep ] to throw something carelessly: He glanced at the letter and then tossed it into the bin. The bull tossed him up into the air. [ + two objects ] Andrew tossed him the ball.\nThesaurus: synonyms, antonyms, and examples\nto throw somethingthrowThe kids were outside throwing snowballs at each other.tossShe tossed the keys into her bag and went out.chuckHe read the letter and chucked it into the bin.flingHe crumpled up the letter and flung it into the fire.hurlIn a fit of temper he hurled the book across the room.lobThe boys spent an hour lobbing stones into the lake.\nSee more results »\nMore examplesFewer examplesLet's toss a coin to see who'll go first.He tossed the letter into the bin.They tossed the beggars a few coins.I tossed a few clothes into a suitcase.I tossed a clove of garlic into the stew.\nSMART Vocabulary: related words and phrases\nThrowing\narm\ncast\nflick\nfling\nheave\nhurl\noutpitch\noverhand\npeg\npelt\nproject\nshy\nsling\nstone\nthread\nthrow something in\nunderarm\nunderhand\nwang\nwhang\nSee more results »\ntoss verb\n(FOOD)\n[ T ] When you toss food you shake or mix small pieces of it together with a sauce or dressing: a tossed salad(be) tossed in Serve French beans tossed in a little garlic butter. toss a pancake UK\nto quickly and suddenly lift the pan in which a pancake (= a thin, flat, round cake) is cooking so that the pancake goes up into the air and turns over before falling back into the pan: Ben came second in the competition after tossing a pancake 21 times.\nSee more\nSMART Vocabulary: related words and phrases\nPreparing food\nbatch cooking\nbiga\nbind\nboil\nbutter\nbuttered\ncan't boil an egg idiom\nclarify\nglaze\nglazed\ngrate\ningredient\njerk\nre-season\nrecipe\nrehydrate\nrestuff\nrice\ntailgate\nzap\nSee more results »\ntoss verb\n(MOVE)\n[ T ] If you toss your hair or a part of your body you move it up and back suddenly: She tossed her head in annoyance. She tossed back her hair. toss and turn C2 [ I ]\nto move about from side to side or turn a lot in bed, especially because you cannot sleep: I was tossing and turning all night.\nSee more\nSMART Vocabulary: related words and phrases\nMaking short, sudden movements\naquiver\nchatter\nchoppily\nchoppiness\nconvulse\nconvulsion\nflick\njerk\njerkily\njerkiness\njerky\njig\nquake\nquiver\nrecoil\nshaky\nshook\nshudder\nsquirm\nwhip\nSee more results »\ntoss verb\n(COIN)\nC1 [ I or T ] (also toss someone for something); (UK also toss up) to throw a coin up into the air and guess which side will land facing up, as a way of making a decision: toss (a coin) Let's toss (a coin) to see who'll go first. \"I'll toss you for it - heads or tails?\"\nSMART Vocabulary: related words and phrases\nDecisions and deciding\nascription\nbalance\nbe make or break for someone/something idiom\nbe on the horns of a dilemma idiom\nchoose\nclinch\nconclusion\nfix\nget it together idiom\nget something into your head idiom\nhammer something out\nhave a, some, etc. say in something idiom\nif/when it comes to the crunch idiom\nresolution\nsleep\ntake the plunge idiom\ntightrope\ntilt\ntilt the balance/scales idiom\ntop-down\nSee more results »\ntoss verb\n(THROW OUT)\n[ T usually passive ] US informal to order a sports player or manager to leave a game because they have broken a rule: I got tossed after I argued with the officials. The umpire tossed our pitcher for deliberately throwing at a batter.\nSMART Vocabulary: related words and phrases\nEmitting and ejecting\ndischarge\ndisplace\ndisplaced\ndisplacement\nejaculation\neject\nejection\nejector\nemission\nemit\nemitter\nexpel\nexpulsion\nexude\npuff\nre-emission\nre-emit\nsend\nsend something out\nshed\nSee more results »\nPhrasal verbs\ntoss something around\ntoss something aside\ntoss something away\ntoss something off\ntoss (someone) off\ntoss something out\ntoss up\ntoss noun\n(MOVEMENT)\n[ C usually singular ] a sudden quick movement: toss of someone's head \"I don't care,\" she replied with a toss of her head.\nSMART Vocabulary: related words and phrases\nMaking short, sudden movements\naquiver\nchatter\nchoppily\nchoppiness\nconvulse\nconvulsion\nflick\njerk\njerkily\njerkiness\njerky\njig\nquake\nquiver\nrecoil\nshaky\nshook\nshudder\nsquirm\nwhip\nSee more results »\ntoss noun\n(THROW)\na coin toss (also a toss of a coin)\nan act of throwing a coin in the air and guessing which side will land facing upward as a way of deciding something: United won the coin toss.\nSee more win/lose the toss\nto guess correctly/wrongly which side of a coin will be facing up when it lands on the ground after being thrown: The team that wins the toss gets to start the game.\nSee more\n[ C ] an act of throwing something in a careless or relaxed way\nSMART Vocabulary: related words and phrases\nThrowing\narm\ncast\nflick\nfling\nheave\nhurl\noutpitch\noverhand\npeg\npelt\nproject\nshy\nsling\nstone\nthread\nthrow something in\nunderarm\nunderhand\nwang\nwhang\nSee more results »\nIdiom\nnot give/care a toss\nAdd to word list\nAdd to word list\nto throw gently or easily: He tossed his dirty clothes on the floor. Matthew tossed the ball to his brother.\nWhen you toss food, you gently mix small pieces of it together or with a sauce: I tossed the salad.\nIf you toss your hair or your head, you move it suddenly: The girl tossed her hair out of her eyes. toss a coin\nIf you toss a coin, you choose between two possibilities by throwing a coin into the air and letting each side represent one of the possibilities, then accepting the possibility represented by the side that lands facing up: We tossed to see who would go first. Idiom\ntoss (and turn)Phrasal verbs\ntoss around something\ntoss off something\ntoss out something\na sudden, quick movement or throw: \"I don’t care,\" she replied with a toss of her head."}