{"id":366739,"name":"total","type":"noun","us_sound":"ˈtoʊ.t̬əl","us_link":"../audio/t/total.mp3","uk_sound":"ˈtəʊ.təl","uk_link":"../audio/t/uktortu009.mp3","content":"Add to word list\nAdd to word list\nB1 the amount you get when several smaller amounts are added together: At that time of day, cars with only one occupant accounted for almost 80 percent of the total. A total of 21 horses were entered in the race. We made $1,000 in total, over three days of trading.\nThesaurus: synonyms, antonyms, and examples\nto add up numbersaddAdd 24, 63, and 55.add upMy job was to add up the scores at the end. totalTotal the daily payments for a month and you arrive at your monthly expenditure. find the sumFind the sum of the following numbers.find the totalFind the total of £26.33, £55.09, and £109.65.add up toThe figures add up to a huge amount.\nSee more results »\nMore examplesFewer examplesThe school bazaar raised a total of £550.The trip cost a total of £250, insurance included.The average of the three numbers 7, 12 and 20 is 13, because the total of 7, 12 and 20 is 39, and 39 divided by 3 is 13.These figures are expressed as a percentage of the total.Unemployment is likely to reach the highest total that has ever been recorded.\nSMART Vocabulary: related words and phrases\nCalculations & calculating\nalgebraic\nalgebraically\nalgo\nalgorithmic\namount\ncalculate\nguesstimate\ninterpolate\ninverse function\nlinear equation\nmathematical\nmatrix\nmiscalculate\nmiscalculation\nmiscount\nmultigrid\noperator\nsum\nsum total\nwork something out\nSee more results »\ntotal adjective\n(AMOUNT)\nB1 [ before noun ] including everything: the total cost Total losses were $800.\nMore examplesFewer examplesThe total amount raised so far is approaching $1000.When you include all my overtime, my total pay is quite good.What is the total oil output from the British sector of the North Sea?We need to work out the total cost of the project.Although sexual and violent crimes have increased by 10%, they remain only a tiny fraction of the total number of crimes committed each year.\nSMART Vocabulary: related words and phrases\nComplete and whole\n(all) in one piece idiom\nabsolute\naggregate\nall or nothing idiom\nall told idiom\nall-in-one\nall-inclusive\nfell\nfibre\nfull strength\nfull-fledged\nfull-length\nfully\nfully fledged\nthorough\nthoroughgoingly\nthoroughly\nthrough and through idiom\nto the last idiom\ntotality\nSee more results »\ntotal adjective\n(VERY GREAT)\nB2 very great or of the largest degree possible: total secrecy a total disregard for their feelings total silence The organization of the event was a total shambles (= very bad). The collapse, when it came, was total.\nMore examplesFewer examplesShe stared at him in total incomprehension.Literary critics were in total disagreement about the value of the book.The meeting was a total failure.The Workers' Coalition experienced the ignominy of total defeat in the last election.He's a total no-hoper - he'll never achieve anything.\nSMART Vocabulary: related words and phrases\nComplete and whole\n(all) in one piece idiom\nabsolute\naggregate\nall or nothing idiom\nall told idiom\nall-in-one\nall-inclusive\nfell\nfibre\nfull strength\nfull-fledged\nfull-length\nfully\nfully fledged\nthorough\nthoroughgoingly\nthoroughly\nthrough and through idiom\nto the last idiom\ntotality\nSee more results »\ntotal verb [L only + noun, T]\n(ADD UP)\nC1 to have as a complete amount, or to calculate this: This is the eighth volume in the series, which totals 21 volumes in all. We totalled (up) the money we had each earned, and then shared it equally between the three of us.\nThesaurus: synonyms, antonyms, and examples\nto add up numbersaddAdd 24, 63, and 55.add upMy job was to add up the scores at the end. totalTotal the daily payments for a month and you arrive at your monthly expenditure. find the sumFind the sum of the following numbers.find the totalFind the total of £26.33, £55.09, and £109.65.add up toThe figures add up to a huge amount.\nSee more results »\nMore examplesFewer examplesHe ran up debts totalling nearly £3,000.If you total their earnings for the year, you will see they are quite substantial.Their combined service in the company totalled 50 years.\nSMART Vocabulary: related words and phrases\nCalculations & calculating\nalgebraic\nalgebraically\nalgo\nalgorithmic\namount\ncalculate\nguesstimate\ninterpolate\ninverse function\nlinear equation\nmathematical\nmatrix\nmiscalculate\nmiscalculation\nmiscount\nmultigrid\noperator\nsum\nsum total\nwork something out\nSee more results »\ntotal verb [L only + noun, T]\n(DAMAGE)\nmainly US (UK write off) to damage a vehicle so badly that it cannot be repaired: His son totaled the pickup when it was ten months old.\nto damage something extremely badly: The company hasn't just jeopardized its brand; it may have totaled it.\nSMART Vocabulary: related words and phrases\nDestroying and demolishing\nannihilate\nannihilation\napocalypse\nbash\nbash through (something)\nbe sacrificed on the altar of something idiom\ncostly\nerosionally\nerosive\nextirpate\nextirpation\nfall in\nsack\nsacking\nsacrifice\nscarred\nself-destruct\nself-devouring\nsink\nwipe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOn the road: accidents involving vehicles\nDamaging and spoiling\ntotal noun [C]\n(AMOUNT)\nAdd to word list\nAdd to word list\nthe whole amount: Add these up and give me the total. We paid a total of $473. in total\nIn total means including everything added together: Last week 45 people in total came to the senior center.\ntotal adjective [not gradable]\n(COMPLETE)\ncomplete or extreme: Negotiations had to be held in total secrecy.\ntotal adjective [not gradable]\n(INCLUDING AMOUNT)\nincluding the whole amount: Total grain exports have increased.\ntotal verb [T]\n(DESTROY)\nto destroy something completely: She didn’t total the car, but she did a lot of damage.\ntotal verb [T]\n(HAVE AS AMOUNT)\n-l- | -ll- to have as a whole amount, or to calculate this: This history series totals twelve volumes in all.\nAdd to word list\nAdd to word list\nthe amount or number that you get when several smaller amounts are added together: a total of $20/£1,000/€3m, etc. We calculated all costs to the company and came to a total of $5,500. We employ 534 staff in total. We have a large workforce with women representing 30% of the total. See also\ngrand total\nrunning total\nsubtotal\nsum total\n[ before noun ] including everything in a calculation or every person in a group: total cost/expense These figures show the total cost of the project including staff salaries.total gains/losses Can you give us an idea of our total losses? The UK All Companies performance category averaged an 18.1% total return over the year. Women represent a very small percentage of our total workforce.\ncomplete or very great: The project was a total disaster. The audience listened in total silence.\nUK -ll | US -l- to add up to a particular amount: The annual salary bill totals more than $3 million. They incurred losses totalling over $2 million.\n(also total up) to add up amounts to get a final number: All costs have been totaled at the bottom of the column. When they totalled up their losses, they realised they could not continue in business.\ninformal to destroy a car in an accident: They will pay the full cost to buy a new car if you total your car within the first year."}