{"id":366854,"name":"touch","type":"verb","us_sound":"tʌtʃ","us_link":"../audio/t/touch.mp3","uk_sound":"tʌtʃ","uk_link":"../audio/t/uktortu022.mp3","content":"touch verb\n(PUT HAND ON)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to put your hand or another part of your body lightly onto and off something or someone: That paint is wet - don't touch (it).touch someone on something He touched the girl on the arm to get her attention.touch something with something The boy touched the worm with (= using, in his hand) a twig.figurative The setting sun touched the trees with red (= made them appear red for a short time).\nMore examplesFewer examplesDon't touch the machine when it's in use.The water's not deep here - look, I can touch the bottom.I could feel myself tense up as he touched my neck.A new baby will automatically curl its fingers round any object it touches.\"You're burning up!\" she said, touching his forehead.\nSMART Vocabulary: related words and phrases\nTouching & feeling\narm\ndab\nfelt\nfiddle\nfiddle (around) with something\nget to second base idiom\nget to third base idiom\ngraze\nhandle\nkiss\nnudge\npaw\npet\nretexture\nsecond base\ntactile\ntactilely\ntactility\ntexturally\ntoy\nSee more results »\ntouch verb\n(BE CLOSE TOGETHER)\nB2 [ I or T ] (of two or more things) to be so close together that there is no space between; to be in contact: He fell asleep as soon as his head touched the pillow. She pushed the two bookcases together until they touched/were touching.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconverge\nconvergence\ncor\ncross-Channel\ncumulate\njointed\njunction\nkludge\nknit\nknock\nunified\nunify\nunion\nunseparated\nwad\nSee more results »\ntouch verb\n(HARM/DAMAGE)\nC2 to harm someone, or use or damage something: Please don't touch any of my stuff while I'm away.\nSMART Vocabulary: related words and phrases\nDamaging and spoiling\nadulterate\nadulterated\nadulteration\napplecart\nat-risk\nbutcher\neat\neat away at something\nerode\nflaw\nfoul\nfoul (something) up\nqueer\nrain on someone's parade idiom\nrampage\nravage\nravages\nseismic\nsour\nwreck\nSee more results »\ntouch verb\n(EAT/DRINK)\n[ T ] informal (usually used in negative sentences) to eat or drink something: They didn't touch any of the food we left for them.touch a drop Honestly, I haven't touched a drop (= drunk any alcohol) all night.\nSMART Vocabulary: related words and phrases\nAbstaining and refraining\nabstain\nabstain from something\nabstainer\nabstemious\nabstemiously\ncut\ndesist\ndisengagement\nfast\nforbear\nforbearance\ngive\ngive up\npull\npull back\nstep\nstep back\nstop\nstop short of something idiom\ntruck\nSee more results »\ntouch verb\n(INFLUENCE)\n[ T ] to influence someone or something emotionally, or cause feelings of sympathy in someone: Tragedy touched their lives when their son was 16. The TV report about the children's work for charity touched thousands of people's hearts.\nThesaurus: synonyms, antonyms, and examples\nto have power to cause a change in someone or somethingaffectLow-income women were disproportionately affected by the legislation. influenceThe jury could have been influenced by all the media coverage surrounding the case.be/fall under someone's influence/spellThe young queen seemed to fall under the spell of her counsellor, believing everything he told her.be under someone's spellWe warned her about him, but all he had to do was turn on the charm and she was under his spell.guideHe is guided by the core beliefs of his religion.impactSevere storms will impact on travel across the region tonight.\nSee more results »\nSMART Vocabulary: related words and phrases\nMaking people sad, shocked and upset\naback\namiss\nappal\nbe laughing on the other side of your face idiom\nbite\nbum\nget to\ngnaw\nhaunt\nheartbreaker\nheartbreakingly\nnerve\nscrew (something) up\nsensitivity\nshake someone out of something\nshake someone up\nshake/rock something to its foundations idiom\nshattering\ntoxic\nwipe\nSee more results »\ntouch verb\n(BE AS GOOD)\n[ T ] (usually used in negative sentences) to have or reach the same standard (= level of quality) as someone or something: can't touch Her novels can't touch (= are not as good as) those of her sister.there's no one to touch someone as something There's no one to touch him as an illustrator of children's books.\nSMART Vocabulary: related words and phrases\nWorse and worst\naggravating\naggravation\nat your worst idiom\nbe in a different league idiom\ncan't hold a candle to idiom\nhold\nleague\nmatch\nnot be a patch on something idiom\nnot be in the same league idiom\nnot half as idiom\nnot in the same league idiom\nnot the same idiom\npatch\nstick\nstick someone with something\nto top it all idiom\ntopper\nvillain\nworse\nSee more results »\nIdioms\ntouch base\ntouch wood\ntouch/strike/hit a (raw) nerve\nsb wouldn't touch something/someone with a bargepole/barge polePhrasal verbs\ntouch down\ntouch (something) down\ntouch something in\ntouch something off\ntouch on/upon something\ntouch something up\ntouch someone up\ntouch noun\n(SMALL AMOUNT)\nC2 [ S ] a small amount: a touch \"Would you like milk?\" \"Just a touch.\"touch of There was a touch of irony/humour in her voice.\n[ S ] informal To show that an illness is not too serious, you can say you have had a touch of it: I had a touch of flu/hay fever.\nC2 [ C ] a small addition or detail that makes something better: The speech had several comic touches.touch of genius Using a sailing ship as the company logo was a touch of genius (= a good/clever idea or action).finishing touch The flowers on the table provided the finishing touch. a touch\nslightly: The weather has turned a touch too cold for my liking. For me, the first course was just a touch bland. It's a touch ironic. It seems a touch premature to start celebrating now. The meat was a touch overcooked. Isn't that a touch hypocritical? She talks, perhaps a touch optimistically, about retiring by the age of 35.\nMore examplesFewer examplesThere was so much publicity and hype beforehand, that the performance itself was a touch anticlimactic.There was a touch of frost on the hills.Add just a touch of cream to the mixture.His work has a touch of pathos.The gold decoration will add a touch of class.\nSMART Vocabulary: related words and phrases\nWords meaning small pieces and amounts\nby a nose idiom\nclipping\ncrumb\ndab\ndash\ndollop\ngrain\nhint\nort\nparing\npeewee\npinch\npotsherd\nskinny\nspark\nswatch\ntad\nthimbleful\ntidbit\ntiddler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDisease & illness - general words\nAlso, extra, and in addition\nSome and quite\ntouch noun\n(FEELING)\nB2 [ U ] the ability to know what something is like by feeling it with the fingers: the sense of touchby touch I found the right coin in the dark by touch. to the touch B2 (also to your touch)\nused after an adjective to express how something feels when you put your hand on it: The material was soft to the touch.\nSee more\nMore examplesFewer examplesAlthough snakes look slimy their skin is actually dry to the touch.I felt a gentle touch on my arm.I can control the doors at the touch of a switch.Her skin was icy to the touch.\nSMART Vocabulary: related words and phrases\nThe senses in general\nfeeling\nhearing\nhyperacute\nhyperaesthetic\nintersensory\nnight vision\nnon-visual\nsensate\nsensately\nsensation\nsense\nsensory\nsensually\nsight\nsmell\nsynaesthesia\nsynesthesia\nvision\nSee more results »\ntouch noun\n(MOVEMENT ONTO/OFF)\nB2 [ C usually singular ] a quick, light movement of one thing, especially a hand, onto and off another thing: I felt a cold touch on my arm.touch of At a/the touch of a button, the door opened.\nSMART Vocabulary: related words and phrases\nTouching & feeling\narm\ndab\nfelt\nfiddle\nfiddle (around) with something\nget to second base idiom\nget to third base idiom\ngraze\nhandle\nkiss\nnudge\npaw\npet\nretexture\nsecond base\ntactile\ntactilely\ntactility\ntexturally\ntoy\nSee more results »\ntouch noun\n(COMMUNICATION)\nbe, get, keep, etc. in touch\nB1 to communicate or continue to communicate with someone by using a phone or writing to them: Are you still in touch with any of your old school friends?\nSee more lose touch\nB2 to stop communicating with someone, usually because they do not live near you now: We lost touch over the years.\nSee more\ntouch noun\n(ABILITY)\n[ S or U ] an ability to do things in the stated, especially positive, way: He has a deft touch with tricky painting jobs. She gave the job her own special/magic/professional/personal touch. I admire her lightness/sureness of touch as a cook.lose your touch He used to be a good writer but I think he's losing his touch.\nSMART Vocabulary: related words and phrases\nSkill, talent and ability\nability\naccomplishment\naccuracy\nacumen\nadroitness\nendowment\nflair\nforte\nfunctional skills\nfunctioning\ngenius\nnon-technical\npolish\nprestidigitation\nproficiency\nprowess\nwhat someone is (really) made of idiom\nwheelhouse\nwizardry\nworkmanship\nSee more results »\ntouch noun\n(BALL CONTROL)\n[ C or U ] in sports such as football, a player's ability to control the ball and make it do what they want, or an occasion when a player controls the ball with their foot: Salah squandered the chance to score when his touch let him down in front of goal. Hazard took several touches before crossing.\nSMART Vocabulary: related words and phrases\nFootball/soccer\n18-yard box\n2 3 5\n4 3 2 1\n4 4 2\n4 5 1\nfootball pools\nfooty\nformation\nfoul throw\nfour five one\nfour four two\nfour three two one\nreducer\nrelegation zone\nreserve team\nroute one football\nrow Z\nsweeper\ntreble\nwoodwork\nSee more results »\ntouch noun\n(SPORT)\n[ U ] the area outside either of the long edges of the space on which football, rugby, and other sports are played: into touch Playing for safety, he kicked the ball into touch.in touch He clearly catches the ball with both feet in touch. See also\ntouchline\nMore examplesFewer examplesA quick lineout can be taken behind where the ball went into touch .Twice the home side opted to kick penalties into touch.The next time the ball is in touch, it's game over.\nSMART Vocabulary: related words and phrases\nSurfaces on which sports take place\n18-yard box\nastroturf\nbound\nbowling green\ncanvas\nclimbing wall\ncourt\ngoal line\nground staff\nout of bounds idiom\nplayability\nplayable\nplaying field\npump track\nrecreation center\nring\nrink\nsideline\nskatepark\nupright\nSee more results »\ntouch noun\n(KNOWLEDGE)\nbe in/out of touch\nC2 If you are in touch/out of touch with a subject, activity, or situation, your knowledge about it is recent/not recent: He's not really in touch with what young people are interested in.\nSee more\ntouch verb\n(USE FINGERS)\nAdd to word list\nAdd to word list\n[ I/T ] to put the fingers or hand lightly on or against something: [ I ] That paint is wet, so don’t touch.\n[ I/T ] infml If you cannot touch something, you are not allowed to have or use it: [ T ] She can’t touch the money from her father until she’s 21.\n[ I/T ] infml If you say you do not touch something, you mean that you do not drink or eat it: [ T ] I never touch candy.\ntouch verb\n(BE CLOSE)\n[ I/T ] to be so close together that there is no space between: [ T ] Don’t let the back of the chair touch the wall. [ I ] Push the bookcases together until they touch.\n[ I/T ] If one thing does not touch something similar, it is not as good as the other thing: [ T ] Her cooking can’t touch her sister’s.\ntouch verb\n(CAUSE FEELINGS)\n[ T ] to cause someone to feel sympathetic or grateful: Your kindness has touched my family.\nIdioms\ntouch base (with someone)\nsomeone wouldn't touch something with a ten-foot polePhrasal verbs\ntouch down\ntouch off something\ntouch on something\ntouch up something\ntouch noun\n(SKILL)\n[ U ] a skill or special quality: He seems to be losing his touch at poker. The flowers were a nice touch.\ntouch noun\n(SMALL AMOUNT)\n[ C ] a small amount: There was a touch of regret in her voice. I had a touch of flu yesterday.\ntouch noun\n(BEING CLOSE)\n[ U ] the state of being close together or in contact with someone or something\ntouch noun\n(FEELING WITH FINGERS )\n[ C/U ] the ability to know what something is like by putting your hand or fingers on it: [ U ] This cloth is soft to the touch.\n[ C/U ] A touch is an act of putting your hand or fingers briefly on something to operate it: [ C ] At a touch of the button, the door opened. Idioms\nin touch (with someone)\nin touch (with something)\nAdd to word list\nAdd to word list\nto put your fingers or hand lightly on the surface of something: Don't touch the machine when it's in use.\nnobody/nothing can touch sb/sth\nused to say that someone or something is the best of a particular kind: As a hard worker, no one can touch him. This computer is so powerful, no other laptop can touch it.\ntouch base\nto talk with someone for a short time: He wants to touch base on some of the significant items that we've been dealing with.\nPhrasal verbs\ntouch on/upon sth\ntouch sth up\n[ C ] a small addition or detail which makes something better: Adding music to your presentation was a nice touch. I am just putting the finishing touches to my monthly report.\nin touch\ncommunicating or continuing to communicate with someone by phone, email, etc.: get/keep/stay in touch (with sb) We need to get in touch with our suppliers right away. Let's keep in touch over the next few days while the installation is in progress.\naware of what is happening: in touch with sth It's very important to stay in touch with the practices of other employers in the city."}