{"id":366907,"name":"toughness","type":"noun","us_sound":"ˈtʌf.nəs","us_link":"../audio/t/toughness.mp3","uk_sound":"ˈtʌf.nəs","uk_link":"../audio/t/uktouch009.mp3","content":"toughness noun [U]\n(STRENGTH)\nAdd to word list\nAdd to word list\nC2 the quality of being strong and not easily broken or damaged: The toughness of the cast iron furnaces is remarkable.\nC2 the quality of being not easily defeated or made weaker: She has a reputation for toughness and resilience. He demonstrated the skills and mental toughness that are crucial for a goalkeeper.\nthe quality of being determined or severe: He made the point that toughness on crime must be matched by toughness on its causes.\nthe quality of being violent or not kind or pleasant: They studied the \"toughness\" of the neighbourhood (for example, whether it was safe walking to school).\nMore examplesFewer examplesThe building's toughness protected people working inside.The designer was inspired by the toughness of leathers used in clothes for motorcycle racing.I developed physical strength, mental toughness, and the ability to work towards daunting goals.Especially in a time of war, toughness is a part of the presidential demeanour.The prison's approach is a mixture of toughness and compassion for offenders who are at the end of the line in the juvenile system.In the photos, kids bragged about the toughness of the area around East 123rd between Lenacrave and Angelus avenues.\nSMART Vocabulary: related words and phrases\nPhysically strong and powerful\n(as) tough as old boots idiom\nbeefy\nbilly-o\nbrute\nbulletproof\nburly\nimpregnably\nindestructible\nindestructibly\nindustrial-strength\nintensely\nruggedly\nshatterproof\nshockproof\nsinewy\nsouped-up\nstalwart\nviolent\nwashboard stomach\nwith a vengeance idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStrength of will and determination\nStubborn and determined people\nSerious and severe\nViolent or aggressive\ntoughness noun [U]\n(DIFFICULTY)\nthe quality of being difficult to deal with: They can't face the toughness of the competition. The toughness of the children's life is reflected in their faces.\nMore examplesFewer examplesI respect her because of the change she went through and the toughness of the decision she made.Passion is what gives you the resilience to overcome the toughness of the job.\nSMART Vocabulary: related words and phrases\nCausing difficulties for oneself or others\nask questions of someone/something idiom\nbe a tall order idiom\nbe asking for trouble idiom\nbe your own worst enemy idiom\nbother someone with something\ncatch\nmake heavy weather of something idiom\nobduracy\noverburden\npitchfork someone into something\nplunge\nsand\nshoot\nstress\nsuicidal\nswamp\ntall\nthrow sand in the gears idiom\nvexingly\nwrong-foot\nSee more results »\ntoughness noun [U]\n(FOOD)\n(of food) the quality of being difficult to cut or eat: The hamburger was spoiled by the toughness of the meat.\nMore examplesFewer examplesWhat causes toughness in meat? Largely incorrect cooking.The cooking time will depend on the age and toughness of the particular batch of vegetables, how thick they are and how you've cut them.\nSMART Vocabulary: related words and phrases\nVarious qualities of food\ncandy coat\ncandy-coated\ncitric\ncordon bleu\ncreamily\nfarmhouse\nfruity\nherby\nhomegrown\nhomemade\nhoppy\ninstant\nnutritious\nnutty\nripe\nsharpness\nshelf-stable\nsingle-estate\nstore-bought\nsugar-coated\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNot pleasant to eat or drink\nSee\ntough\nAdd to word list\nAdd to word list\nthe quality of being strong and determined: He lacks the inner toughness needed in a leader."}