{"id":366891,"name":"tough","type":"adjective","us_sound":"tʌf","us_link":"../audio/t/tough.mp3","uk_sound":"tʌf","uk_link":"../audio/t/uktouch005.mp3","content":"tough adjective\n(STRONG)\nAdd to word list\nAdd to word list\nB2 strong; not easily broken or made weaker: These toys are made from tough plastic. Children's shoes need to be tough. Synonyms\ndurable\nhard (SOLID)Opposites\ndelicate (EASILY DAMAGED)\nfragile\nThesaurus: synonyms, antonyms, and examples\nhaving a lot of physical or mental strengthstrongHe is a big, strong man.strongTwo thirds of voters see him as a strong leader.powerfulHe is the most powerful fighter I have seen in a boxing ring.muscularHe is tall with a muscular body.muscledShe has worked hard to achieve that muscled body.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nnot breaking easilystrongYou will need a strong cardboard box to carry all those books.toughCeramic tiles are tougher than plastic shower screens.sturdyYou'll need sturdy boots for this weather.solidYou will need to build a good solid base for your shed.hard-wearingCotton canvas is the most hard-wearing fabric.\nSee more results »\nof a person, able to deal with difficult situations and not be easily defeated, frightened or upset: You have to be tough to be successful in politics. Even tough guys need to cry sometimes.informal Their lawyer is a real tough customer (= person).\nC2 severe in limiting what is allowed or in punishing people who do not obey rules or laws: Tough new safety standards have been introduced for cars. There have been calls for tougher controls/restrictions on what online retailers are allowed to sell. I think it's time the police got tougher on/with (= treated more severely) people who drink and drive. The government is continuing to take a tough line on terrorism. Synonym\nstrictOpposite\nlax (NOT CAREFUL)\nThesaurus: synonyms, antonyms, and examples\nstrictstrictHer parents were very strict.firmI was always very firm with my children.take a hard line onThe school takes a hard line on bullying.authoritarianThe country was under the rule of an authoritarian leader.stringentStringent safety regulations were introduced after the accident.\nSee more results »\nMore examplesFewer examplesI can't eat this meat - it's too tough.Polyurethane varnish provides a tough, scratch-resistant finish.We need a mayor who is tough enough to clean up this town.You'll need some fairly tough footwear to go walking up mountains.Several governments have adopted tough new anti-terrorist legislation in the wake of the attacks.\nSMART Vocabulary: related words and phrases\nPhysically strong and powerful\n(as) tough as old boots idiom\nbeefy\nbilly-o\nbrute\nbulletproof\nburly\nimpregnably\nindestructible\nindestructibly\nindustrial-strength\nintensely\nruggedly\nshatterproof\nshockproof\nsinewy\nsouped-up\nstalwart\nviolent\nwashboard stomach\nwith a vengeance idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStrong-willed\ntough adjective\n(DIFFICULT)\nB2 difficult to do or to deal with: They've had an exceptionally tough life. They will be a tough team to beat. The company is going through a tough time at the moment. We've had to make some very tough decisions. My boss has given me a tough job/assignment. Many homeless people are facing a tough winter. After some tough bargaining, we finally agreed on a deal. Synonym\nhard (SEVERE)Opposite\neasy (COMFORTABLE)\nMore examplesFewer examplesIt's been a tough six months and I feel I've earned a few weeks off.We'll have to make some tough decisions - there are no easy options.It's going to be a tough competition but I'm mentally prepared for it.This course is really tough, - sometimes I feeling like packing it all in.Now I'm going to ask you a really tough question - are you ready?\nSMART Vocabulary: related words and phrases\nComplicated and difficult to do\nadvanced\nambitious\nambitiously\nanother\narduous\nformidable\nformidably\nget blood out of/from a stone idiom\ngrail\ngruelling\nonerous\nonerously\noverdemanding\npainstaking\npicnic\ntricky\ntuff\nultra-sensitive\nunintuitive\nunresolvable\nSee more results »\ntough adjective\n(FOOD)\nB2 Tough food is difficult to cut or eat: This steak is very tough. These apples have tough skins. Opposite\ntender (SOFT)\nSMART Vocabulary: related words and phrases\nNot pleasant to eat or drink\n(as) tough as old boots idiom\nacrid\nbitter\nbitterness\nbland\nchewy\ndishwater\ninsipidly\ninsipidness\nlike dishwater idiom\nmouldy\noverripe\npungent\nstale\nstaleness\nstick to someone's ribs idiom\nstodginess\nstodgy\nunripe\nwatery\nSee more results »\ntough adjective\n(VIOLENT)\nlikely to be violent or to contain violence; not kind or pleasant: a tough neighbourhood Many of the country's toughest criminals are held in this prison.\nSMART Vocabulary: related words and phrases\nViolent or aggressive\nabusively\naggressive\naggressively\naggressiveness\naggro\nferociously\nferocity\nfierce\nfierceness\nfighting words\noffensively\noutrage\nproactive aggression\npugnacious\npugnaciously\nuntameable\nvicious\nviciously\nviciousness\nviolence\nSee more results »\ntough adjective\n(UNLUCKY)\nC2 informal unlucky: \"I have to work late today because I'm very behind on my work.\" \"Oh, tough luck!\" It's tough on Geoff that he's going to miss the party.\nThesaurus: synonyms, antonyms, and examples\nresulting in bad things happening by chanceunluckyAn unlucky bounce led to the winning goal against the home team.unfortunateNo one was to blame - it was just an unfortunate accident.ill-fatedSeven crew members were killed on the ill-fated voyage.ill-starredHis ill-starred reign began with a famine and ended with civil war.\nSee more results »\ninformal sometimes used to show that you have no sympathy for someone's problems or difficulties: \"I don't have any money left.\" \"Well, (that's just) tough - you shouldn't have spent it all on cigarettes.\"\nSMART Vocabulary: related words and phrases\nGood luck and bad luck\nalign\nbad/hard/tough luck! idiom\nbe bad luck on someone idiom\nbe down on your luck idiom\nbe in/out of luck idiom\nblessing\nfortune cookie\nfortune smiles on someone idiom\nget the short end of the stick idiom\ngodsend\ngrace\nmerciful\nmercifully\nmercy\nmiracle\nmisadventure\nstreak\nvoodoo\nwith any luck idiom\nyour luck's in! idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExpressions meaning 'it isn't important to me'\nRelated words\ntoughly\ntoughnessIdioms\nit's tough at the top\n(as) tough as old boots\ntough luck\na violent person: Bands of armed toughs roamed the city. Synonyms\nhoodlum old-fashioned\nhooligan\nruffian old-fashioned or humorous\nthug\nyob UK informal\nMore examplesFewer examplesThere are some pretty tough children in his class.He worked for a group of tough masters.His bosses were really tough.\ntough adjective [-er/-est only]\n(STRONG)\nAdd to word list\nAdd to word list\nnot easily broken, weakened, or defeated; strong: These toys are made of tough plastic. You have to be tough to be successful in politics. The police are getting tougher on illegal parking.\nResults or actions that are tough are severe and determined: Tough new safety standards for cars are being introduced this week.\ntough adjective [-er/-est only]\n(DIFFICULT)\ndifficult to do or deal with: They will be a tough team to beat. We’ve had to make some very tough decisions. It’s going to be a tough winter.\nFood that is tough is difficult to cut or eat: a tough steak\ntough adjective [-er/-est only]\n(VIOLENT)\nlikely to be violent or to contain violence: a tough guy a tough neighborhood\nIdioms\na tough act to follow\na tough row to hoe\ntough (luck)"}