{"id":366932,"name":"touring","type":"adjective","us_sound":"ˈtʊr.ɪŋ","us_link":"../audio/t/ustouch010.mp3","uk_sound":"ˈtʊə.rɪŋ","uk_link":"../audio/t/uktouch014.mp3","content":"Add to word list\nAdd to word list\n(of musicians, sports teams, exhibitions, etc.) going to several places in a country or area to perform, compete, be seen, etc.: a touring opera company It was the world's top touring band, grossing more than $26 million that year. She's the subject of a touring exhibition that will come to Washington in April. He told the audience he was tired from a busy touring schedule.\nmainly UK relating to a journey to visit several places in a country or area for pleasure, especially as a holiday: UK Explore the real America on a touring holiday through Washington State and Oregon. See\ntour\nMore examplesFewer examplesHis passengers were about 70 touring seniors.They passed through the town on a touring holiday.There has been a really strong market for touring caravans. For more information about touring dates and venues, visit our website.She still leads a touring dance troupe.The touring team made 465, surpassing the 460 they scored in Auckland.The song is a popular part of his touring repertoire.\nSMART Vocabulary: related words and phrases\nSpectacles & performances\naerobatic\namateur theater\nbalancing act\nbravura performance\nbullfight\nmano a mano\nminstrel show\nmusic hall\nnon-musical\none-night stand\none-person\nroutine\nspectacular\nstrip\nstripping\nstriptease\nsuper-spectacle\nsupershow\nswansong\ntattoo\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nJourneys\nthe activity of visiting several places in a country or area to perform, compete, be seen, etc.: The band has built an extensive fan base through relentless touring. After almost 50 years of recording and touring, why do you still do it?\nmainly UK the activity of visiting several places in a country or area for pleasure, especially as a holiday: Touring is a marvellous, carefree way to get to know Italy. There is no better place than Colorado for motorcycle touring.\nMore examplesFewer examplesConstant touring and radio performances honed him into a slick entertainer.A revival of international touring has taken the orchestras to Europe and the Far East.It is a terrific vehicle for general off road touring.In the morning we hire a tuk tuk to go touring.\nSMART Vocabulary: related words and phrases\nSpectacles & performances\naerobatic\namateur theater\nbalancing act\nbravura performance\nbullfight\nmano a mano\nminstrel show\nmusic hall\nnon-musical\none-night stand\none-person\nroutine\nspectacular\nstrip\nstripping\nstriptease\nsuper-spectacle\nsupershow\nswansong\ntattoo\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nJourneys"}