{"id":366998,"name":"tout","type":"verb","us_sound":"taʊt","us_link":"../audio/t/tout.mp3","uk_sound":"taʊt","uk_link":"../audio/t/uktouch022.mp3","content":"tout verb\n(MAKE KNOWN)\nAdd to word list\nAdd to word list\n[ T ] to advertise, talk about, or praise something or someone repeatedly, especially as a way of encouraging people to like, accept, or buy something: The minister has been touting these ideas for some time. He is being widely touted as the next leader of the party. A local car dealership was touting its services/wares on the radio.\n[ I ] mainly UK to repeatedly try to persuade people to buy your goods or services: There were hundreds of taxis at the airport, all touting for business/custom.\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ncustomer relationship management\ndetoxify\ndifferentiator\ndogfooding\nflyer\no.n.o.\noff-brand\non-brand\noverexpose\noverexposure\ntie (something) in\nunadvertised\nunbilled\nunbranded\nunmarketable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSelling\ntout verb\n(SELL UNOFFICIALLY)\n[ T ] UK disapproving (US scalp) to sell tickets for something such as a sports game or theatre performance unofficially, usually at a much higher price than the official price: £30 seats for the match were being touted for £500.\nSMART Vocabulary: related words and phrases\nTrafficking & racketeering\nanti-racketeering\nanti-smuggling\nbagman\nblack market\ncontraband\ncounter\ngun-running\nmissell\nmisselling\nmodern slavery\npass\npeople trafficking\nracket\nscalp\nscam\nscammer\nsell someone a bill of goods idiom\nsmuggle\nsmuggling\ntraffic\nSee more results »\na person who touts tickets: Britain's best-known ticket tout once boasted that he could get you tickets for anything.\nSMART Vocabulary: related words and phrases\nPeople who sell things\nagent\nassistant\nauctioneer\nbarker\nbarrow boy\nflower girl\nfranchisee\ngallerist\nhaberdasher\nhawker\nreseller\nretailer\nsales assistant\nsales force\nsales rep\nsupplier\ntradesman\ntradespeople\nvendor\nwholesaler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMiscellaneous criminals\nAdd to word list\nAdd to word list\nto advertise or praise something, often to encourage its use or sale: Various studies have been published touting the benefits of pre-kindergarten programs.\nIf you tout someone's good character, knowledge, skills, achievements, etc., you praise those characteristics: The President was in Ohio on Saturday, touting his accomplishments and urging supporters to re-elect him.\nAdd to word list\nAdd to word list\n[ T ]\n&#160; MARKETING to advertise or praise something, especially as a way of encouraging people to buy it: tout the benefits of sth He appears in ads touting the benefits of leasing corporate jets. Several insurance companies tout their services on local radio.\n[ T ] if someone or something is touted as something, many people say that they are or will be that thing: be touted as sth He is being widely touted as the company's next CEO.\ntout for business\nto stop or speak to many people in order to try to persuade them to buy your goods or services: Hundreds of taxis at the airport tout for business.\n→\nticket tout"}