{"id":367020,"name":"tow","type":"verb","us_sound":"toʊ","us_link":"../audio/t/toe.mp3","uk_sound":"təʊ","uk_link":"../audio/t/uktobyj007.mp3","content":"Add to word list\nAdd to word list\nto pull a car, boat, etc. along, fastened behind another vehicle or boat: You shouldn't drive fast when your car is towing a caravan. The road was closed while the vehicles that had been involved in the accident were towed away/off. The damaged boat was towed to safety.\nThesaurus: synonyms, antonyms, and examples\nto pull somethingpullPull your chair over here so you can see the screen. dragShe dragged the canoe down to the water.haulThey hauled the boat out of the water.towYou shouldn't drive fast when your car is towing a trailer.yankShe marched to the door and yanked it open.wrenchThe phone had been wrenched from the wall.\nSee more results »\n(also tow something away) to take away a vehicle that has been parked illegally using an official truck, to a place from which the driver has to pay to pick it up: You're not allowed to park here - your car will be towed away .US This part of town is a tow zone (= one in which cars left illegally will be removed).\nSMART Vocabulary: related words and phrases\nPulling\ndraft\ndrag\ndraught\ndraw something up\nhaul\nheave\nheave-ho\nheft\nhitch something up\npluck\nreel\nreel something in/out\nretract\nretractable\nsuck\ntow-away\ntractive\ntrail\ntwitch\nyank\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTaking things away from someone or somewhere\ngive someone/something a tow\nto pull someone's vehicle using a rope or chain tied to your vehicle: When my car broke down, a police car gave me a tow to the nearest garage. on tow UK (US in tow); (Australian English also under tow)\nbeing pulled along: The car in front of us is on tow - that's why we're going so slowly.\nSMART Vocabulary: related words and phrases\nPulling\ndraft\ndrag\ndraught\ndraw something up\nhaul\nheave\nheave-ho\nheft\nhitch something up\npluck\nreel\nreel something in/out\nretract\nretractable\nsuck\ntow-away\ntractive\ntrail\ntwitch\nyank\nSee more results »\nIdiom\nin tow\nAdd to word list\nAdd to word list\nto pull a car, boat, aircraft, etc., using a rope or a chain attached to another vehicle: The town tows abandoned cars and then fines their owners.\nthe act of pulling someone's vehicle using a rope or chain attached to your vehicle: My car broke down and Bob gave me a tow. Idiom\nin tow"}