{"id":367031,"name":"towards","type":"preposition","us_sound":"tɔːrdz","us_link":"../audio/t/cdo0318ustowa5139.mp3","uk_sound":"təˈwɔːdz","uk_link":"../audio/t/uktouch024.mp3","content":"towards preposition\n(MOVEMENT)\nAdd to word list\nAdd to word list\nB1 in the direction of, or closer to someone or something: She stood up and walked towards him. He leaned towards his wife and whispered, \"Can we go home soon?\" She kept glancing towards the phone. The country seems to be drifting towards war. There is a trend towards healthier eating among all sectors of the population.\nMore examplesFewer examplesA wasp came towards us and Howard started flailing his arms around.We were heading towards Kumasi when our truck broke down.The horse and cart jogged down the rough track towards the farm.I walked backwards towards the door.When she came towards me shouting, I retreated behind my desk.\nSMART Vocabulary: related words and phrases\nDescribing movement towards\n-ways\nat\nconvergent\nearthward\nfacing\nfor\nforward\nforwards\nhither\ninwards\non\noncoming\nonward\nonwards\nround\nthither\nto\nup\nward\nwise\nSee more results »\ntowards preposition\n(RELATION)\nB2 in relation to something or someone: They've always been very friendly towards me. There has been a change in government policy towards energy efficiency. He feels a lot of anger/hostility/antagonism/animosity towards his father. A lot of people think that most newspapers are biased towards one particular political party.\nMore examplesFewer examplesHe's always behaved courteously toward my family.He's adopted a remarkably light-hearted attitude towards the situation.A parent must be careful not to show favouritism towards any one of their children.They showed open hostility towards their new neighbours.He claims that society has been far too permissive towards drug taking.\nSMART Vocabulary: related words and phrases\nRegarding and concerning\nabout\napply to\napropos\napropos of something\naround\nas\ncover\ndeal with someone\ndepartment\nhereof\nin respect of something idiom\nin the brain/looks department idiom\ninto\nrange\nrelate\nsay\nsomething\nthereof\nvis-à-vis\nwise\nSee more results »\ntowards preposition\n(POSITION)\nC1 near to, just before, or around a time or place: Our seats were towards the back of the theatre. I often get hungry towards the middle of the morning. We're getting towards winter and it's getting dark earlier.\nMore examplesFewer examplesHe went mad towards the end of his life.The weather is expected to settle towards the end of the week.The tape speeded up towards the end.Johnson came on as a substitute towards the end of the match.The shop becomes a lot less busy towards lunchtime.\nSMART Vocabulary: related words and phrases\nCloseness in distance and time\na hair's breadth idiom\na stone's throw idiom\nabout\nace\nanywhere\nanywhere near idiom\napproachable\naround\nfloat\nfloat around\nhand to hand idiom\nhard by\nhere\nproximately\nproximity\nroof\nround the corner idiom\nshadow\nshout\nstep\nSee more results »\ntowards preposition\n(PURPOSE)\nC1 for the purpose of buying or achieving something: I'm saving up to buy a car, and Dad has given me some money towards it. Would you like to make a contribution (= give some money) towards a present for Linda? The work that students do during the term counts towards their final grade.\nMore examplesFewer examplesAren't you going to contribute towards Jack's leaving present?The work that the students do during the year will count towards their final degrees.Their policies are all towards the creation of wealth.Do you agree with the principle that everyone should pay something towards the cost of health care?The Friends of the Royal Academy raised £10 000 towards the cost of the exhibition.\nSMART Vocabulary: related words and phrases\nGoals and purposes\naffordance\nambition\navail\ncause\ndedicated\ndeflect\ndream\neye\nit's the thought that counts idiom\nkey performance indicator\nKPI\nmoonshot\nobjective\npoint\ntarget\ntarget setting\nthought\nundedicated\nundirected\nunfocused\nSee more results »\nGrammar\nTowards or toward?Towards and toward are prepositions. We can use both forms, but towards is much more common than toward. …"}