{"id":367087,"name":"town","type":"noun","us_sound":"taʊn","us_link":"../audio/t/town.mp3","uk_sound":"taʊn","uk_link":"../audio/t/uktouch030.mp3","content":"Add to word list\nAdd to word list\nA1 [ C or U ] a place where people live and work, containing many houses, shops, places of work, places of entertainment, etc., and usually larger than a village but smaller than a city: a seaside/coastal town a fishing/mining/industrial town He was born in the small town of Castleford, in Yorkshire. We stayed in the best hotel in town. the main road into/out of town See also\ndowntown adjective adverb US\nhometown\nuptown US\nA2 [ S or U ] mainly UK the part of a town where most of the businesses are: I'm going into/to town at lunchtime to do some shopping. I met Charles while I was in town. Compare\ndowntown\n[ U ] UK the most important city or town in a country or area: We went up to town to see a play. Many people commute into town (= London) from Essex.\nB1 [ U ] mainly US the place where you live or work: I'm leaving town for a few days. Barbara is out of town on business this week. the town [ S ]\n[ + sing/pl verb ] the people who live in the town: The whole town is/are hoping that their team will win the final tomorrow.\nUK a town or city, rather than the countryside: I've always lived in the town.\nMore examplesFewer examplesThere's not much in the way of entertainment in this town - just the cinema and a couple of pubs.We spent our holidays in a small French town.The town's main features are its beautiful mosque and ancient marketplace.As agriculture became more capital intensive, many farm labourers moved to the towns and cities to look for work.When you're in town could you pick up the books I ordered?\nSMART Vocabulary: related words and phrases\nTowns & regions: towns, cities & villages (general)\naerotropolis\nanti-city\nanti-urban\nbackwater\nCantabrigian\ncentral city\ncivic\nconurbation\ndormitory town\ngarden city\nmetro\nmunicipal\nnative place\nnon-municipal\nopen city\nretirement community\nretirement village\nsmall-town\nsmoke\nurbanite\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTowns & regions: areas in towns & cities\nPeople who live or settle somewhere\nIdioms\ngo to town\non the town\nAdd to word list\nAdd to word list\na place where there are a lot of houses, stores, and other buildings which is smaller than a city: [ C ] He was born in the small town of Elnora, Indiana. [ U ] We stayed at the best hotel in town.\nTown can also mean the place where you live or work: [ U ] Barbara is out of town this week.\nTown is also the part of a town where the main stores are: [ U ] I’m going into/to town to do some shopping.\nTown can also refer to the people who live in the town: [ C ] The whole town is hoping our team will win. Idiom\non the town"}