{"id":367459,"name":"track","type":"noun","us_sound":"træk","us_link":"../audio/t/track.mp3","uk_sound":"træk","uk_link":"../audio/t/uktowni020.mp3","content":"track noun\n(PATH)\nAdd to word list\nAdd to word list\nC1 [ C or U ] the pair of long metal bars fixed on the ground at an equal distance from each other, along which trains travel: a ten-mile stretch of track Passengers are requested not to walk across the tracks.\nPeter Owen/EyeEm/GettyImages\nB1 [ C ] UK a path or rough road that is made of soil rather than having a surface covered with stone or other material: The house is at the end of a dirt/an unmade track.\nClicked by Avik Chakraborty/Moment/GettyImages\nMore examplesFewer examplesThe horse and cart jogged down the rough track towards the farm.There's a track that leads directly to the reservoir.After a while the narrow track merges with a wider path.The track petered out after a mile or so.Turn left where the road tapers off into a track.\nSMART Vocabulary: related words and phrases\nRailways & railway lines\nAmtrak\nartery\nbranch line\nelectrify\nfunicular\njunction\nlevel crossing\nlight rail\nlight railway\nmetro\nmonorail\nrailroad\nrailroad tie\nRR\nsiding\nsignal\nsignal box\nswitch\nswitchback\nunderground\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRoads: pedestrian routes\ntrack noun\n(SPORT)\nB1 [ C ] a type of path or road, often in the shape of a ring, that has been specially designed and built for sports events, especially racing: an all-weather track a dog/horse track The runners are now on their final lap of the track. See also\nracetrack\nAlan Schein/Corbis/GettyImages\nB2 [ U ] US a sport in which people compete with each other by running a race on a specially prepared circular path: a track event Sam runs track on the high school team.\n[ U ] US (also track and field); (UK athletics) the general name for a particular group of sports in which people compete, including running, jumping, and throwing\nMore examplesFewer examplesAt the gun, the runners sprinted away down the track.The racing car left the track at 120 mph and scythed through the crowd of spectators, killing ten.Stewards will be inspecting the race track at 9.00.She was carried off the track on a stretcher.Her life is as eventful off the track as on it.\nSMART Vocabulary: related words and phrases\nSurfaces on which sports take place\n18-yard box\nastroturf\nbound\nbowling green\ncanvas\nclimbing wall\ncourt\ngoal line\nground staff\nout of bounds idiom\nplayability\nplayable\nplaying field\npump track\nrecreation center\nring\nrink\nsideline\nskatepark\nupright\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAthletics\ntrack noun\n(MARKS)\nB2 [ C usually plural ] a mark or line of marks left on the ground or on another surface by an animal, person, or vehicle that has moved over it, showing the direction they moved in: Police found tyre tracks in the mud. The hunters followed the tracks of the deer for hours. The burglars were careful not to leave any tracks behind them.\nAmir Mukhtar/Moment/GettyImages be on the track of someone/something\nto be examining marks or pieces of information that show where a person or animal has gone, in order to catch him, her, or it: The police are on the track of the killer. Once again, he plays a cop on the track of a serial killer. I feel sure we're on the track of something big here. He's like a police dog on the track of a criminal. In her next novel, the amateur sleuth discovers a stash of money and finds herself on the track of a criminal gang.\nMore examplesFewer examplesWe found some badger tracks in the field.There are deep tyre tracks in the mud.The dogs did not leave any tracks.Houses in the track of the storm were destroyed.The hunters are skilled at following animal tracks in the wood.\nSMART Vocabulary: related words and phrases\nHoles, hollows and dips\nanti-crack\naperture\nblistered\nchink\ncranny\ncratering\ngouge\nhatch\nhollow\nimpression\nimprint\ninterstice\nladder\nleak\nleaky\nnook\npinprick\nshaft\nspyhole\nvoid\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPursuing\ntrack noun\n(DIRECTION)\n[ C ] the direction that something has taken or will take through the air: People living in the track of the hurricane have been advised to leave their homes until it has passed.\nSMART Vocabulary: related words and phrases\nMovement through the air\nairborne\nbuoyantly\nbuzz\nflight\nfloat\nfly\nglide\nhover\nlevitate\nlevitation\nlift\nnon-flying\nskim\nsoar\nsoaring\nsomersault\nswishy\nswoop\nwaft\nwheel\nSee more results »\ntrack noun\n(DEVELOPMENT)\nC2 [ C or U ] the direction in which someone's job or education develops: She was a lawyer, but then she changed track completely and became a doctor.\n[ C usually singular ] the way in which a thought or idea has developed or might develop: I found it difficult to follow the track of his argument. get off the track\nto start talking about something that is not part of what you should be talking about: I think we're getting off the track here - we're supposed to be discussing our advertising campaign. Anyway, we're getting off the track and need to be a bit more focused. Sorry, I'm getting off the track. Aren't we getting off the track here? We're getting off the track a little and I'm aware that we don't have long to make a decision. Abbie always lets us know if we get off the track at any point.\nSMART Vocabulary: related words and phrases\nMaking progress and advancing\nadvance the cause\nadvancement\nage\nahead\nahead of\nboom\nevolve\nevolved\nflourish\nflower\nformatively\nfrom A to B idiom\njourney\nmature\nprogressively\npunctuated equilibrium\nrebuild\nregenerate\nripen\nspread\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLogic and reason\nDigressing and being indirect or evasive\ntrack noun\n(EDUCATION)\n[ C ]\n&#160; education\n&#160; US specialized (UK stream) a set of classes for school students with similar ability who are approximately the same age and are taught together: Students who do well in their 8th grade classes will qualify for the honors track in high school. the top/bottom track\n[ C ]\n&#160; education\n&#160; US specialized an arrangement in which a group of students attends school at a particular time when another group at the same school is on holiday: This is a year-round school and parents with several children may have to place them on different tracks. In a school with a single track, the entire student body is on the same calendar. Compare\nmultitrack US specialized\nSMART Vocabulary: related words and phrases\nStudents & pupils\n-grader\nalum\nalumna\nalumnae\nalumni\nalumnus\napprentice\nentrant\nformer\nfrosh\ngraduate\nhomeschooler\nhouseman\nsalutatorian\nscholar\nschool-leaver\nschoolboy\nschoolchild\ntheologian\nyear\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClasses & courses\ntrack noun\n(MUSIC)\nB2 [ C ] one of several songs or pieces of music on a CD or other musical recording: The album includes four previously unreleased tracks. See also\nsoundtrack\n[ C ] a part of a magnetic strip onto which sound can be recorded, with several tracks on one magnetic strip: When a piece of music is recorded, each instrument is recorded separately on a 24 or 48-track tape.\nMore examplesFewer examplesAnd this next record is the title track on the album '\"he Red Shoes\" .The first track on the album is surprisingly tuneful.Which is your favourite track on the album?He played me a track from their new album.\nSMART Vocabulary: related words and phrases\nSound and image recordings\naudiobook\nautotune\nB-side\nBlu-ray\nbox set\ncompact disc\nconcept album\njewel case\nLP\nMD\nMiniDisc\nmultitrack\nreissue\nsample\nsharpness\ntagging\ntalking head\nvideo clip\nVOD\nVR\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAudio & video equipment\nIdioms\nbe on the right/wrong track\nin your tracks\nkeep track\nlose track\nmake tracks\noff track\non track\ntrack verb\n(FOLLOW)\nC2 [ T ] to follow a person or animal by looking for proof that they have been somewhere, or by using electronic equipment: It's difficult to track an animal over stony ground. The military use radar satellites to track targets through clouds and at night. The terrorists were tracked to (= found in) Amsterdam. See also\nbacktrack (GO BACK)\nsidetrack verb\nThesaurus: synonyms, antonyms, and examples\nto follow someone or somethingfollowFollow me - this way!tag alongDo you mind if my little brother tags along?chaseHe was running and the dog was chasing him.pursueThe robber was pursued by several members of the public.tailThe car was tailed by police for several hours.shadowThe police think the robbers shadowed their victims for days before the crime.\nSee more results »\nC2 [ T ] to record the progress or development of something over a period: The study tracked the careers of 1,226 doctors who trained at the Medical School.\nMore examplesFewer examplesHis book tracks the development of modern English.She has tracked her family back three centuries.Police tracked the gun to an abandoned warehouse.We spent the day tracking deer in the forest.Radar equipment tracked the progress of the ships.\nSMART Vocabulary: related words and phrases\nPursuing\nbe hot on someone's track/trail idiom\nbe on someone's tail idiom\nbear\nbear down on someone/something\nbring\nbring up the rear idiom\nconvoy\nflight\nhound\nhumbug\nin hot pursuit idiom\non the scent idiom\npester\npursue\nshadow\nstick\ntailgating\ntargetable\ntrack and trace\ntrail\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnalysing and evaluating\ntrack verb\n(MOVE)\n[ I ] If a film or video camera tracks in a particular direction, it moves along while it is filming: The movie ends with a long tracking shot around the deserted house.\n[ I ]\n&#160; media\n&#160; specialized If a moving part of a recording machine tracks, it gets into the correct position for operating: Our VCR tracks automatically.\nSMART Vocabulary: related words and phrases\nCinema - general words\n12A\nanimation\nanimator\naudio described\naudio description\ncomputer-generated imagery\nfade\nfilmic\nfilmically\nfilming\nfilmstrip\nflick\nfootage\nRambo\nremake\nrerelease\nrescreen\nreshoot\nsting\ntheatrical\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAudio & video equipment\ntrack verb\n(FINANCE)\n[ T ] to follow the level of an interest rate, share price, etc.: The mortgage deal will track the Bank of England base rate plus 0.75 percent. Tony is putting £500 a month into a a savings account that tracks the FTSE All-Share index.\ntrack verb\n(STUDENTS)\n[ T ] US (UK stream) to group and teach together school students with similar abilities who are approximately the same age: We start to track the children in the third form.\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nconcordance\ndescribe\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nset something up\nshake someone down\nshort-list\nshortlist\nsort\ntick\nSee more results »\nPhrasal verb\ntrack something/someone down\ntrack noun\n(PATH)\nAdd to word list\nAdd to word list\n[ C ] a path that is narrower than a road, often with an uneven surface: We walked along a muddy track at the side of the field.\n[ C ] A track is also one or a pair of parallel metal bars on which trains travel.\ntrack noun\n(MARKS)\n[ C usually pl ] a mark or line of marks left on a surface, esp. the ground, by a moving animal, person, or vehicle, that shows the direction of travel: deer tracks in the snow\ntrack noun\n(SPORTS)\n[ C/U ] the sport of competitive running, or a wide, circular path that is made for this sport: [ U ] Fall sports include football, hockey, and track.\n[ C/U ] A track is also a specially prepared surface for any kind of racing: [ C ] a dog/thoroughbred track\ntrack noun\n(MUSIC)\n[ C ] one of several songs or pieces of music on a musical recording Idioms\non track\non the right track\non the wrong track\ntrack verb [T]\n(MAKE MARKS)\nto follow something that moves or changes by noticing marks or signs that it has left behind: The study tracked the careers of 1226 doctors who trained at Harvard Medical School.\nIf you track something messy or dirty, you leave messy or dirty marks when walking because you had something on your shoes or feet: The kids are always tracking mud in the kitchen. Phrasal verb\ntrack down someone/something\nAdd to word list\nAdd to word list\nthe direction that something has taken or in which it is moving: They are able to forecast the track of the storm days in advance.\nthe way in which something develops or might develop: on the right/wrong track We believe we are on the right track to grow the business in the coming months.\nthe type of education or career someone chooses and the way it develops: She was a lawyer, but then she changed track completely and became a doctor. Students perform better once engaged in a career track with clear expectations of what it takes to get a job. a vocational/academic track\nthe way in which a thought or idea has developed or might develop: I found it difficult to follow the track of his argument.\nkeep track (of sth)\nto keep a record of something, or make certain that you know or remember what has happened: Keep track of the hours you work. His job is to keep track of all the shipments going out to customers.\nlose track (of sth)\nto stop keeping a record of something, or stop being certain that you know or remember what has happened: I have lost track of the number of times you have been late this month. So many customers came in that I lost track after an hour.\non track\nmaking progress and likely to succeed or achieve a particular thing: They're on track to make record profits. See also\nfast track\nhave the inside track\n[ T ] to follow the movement or progress of something or someone: The company set up a database to help track sales across the country. Investigators are tracking streams of the contaminated food through several states.\n[ T ] to record the progress or development of something over a period: We have been tracking the trends in computer sales for over ten years. The study tracked the careers of 1226 doctors who trained at the University of Michigan Medical School.\n[ T ]\n&#160; BANKING, FINANCE to follow the level of an interest rate: The mortgage deal will track the Bank of England base rate plus 0.75 pc.\n[ T ]\n&#160; FINANCE, STOCK MARKET to follow the level of a particular share index: Tony is putting £500 a month into a savings account which tracks the FTSE All-Share index. Phrasal verb\ntrack sb/sth down"}