{"id":367325,"name":"traced","type":"verb","us_sound":"treɪs","us_link":"../audio/t/trace.mp3","uk_sound":"treɪs","uk_link":"../audio/t/uktowni015.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\ntrace\ntrace verb [T]\n(FIND)\nC1 to find someone or something that was lost: The police are trying to trace the mother of a newborn baby found abandoned outside a hospital. Attempts to trace the whereabouts of a man seen leaving the scene of the crime have so far been unsuccessful. Their missing daughter was finally traced to (= found in) Manchester.\nThesaurus: synonyms, antonyms, and examples\nto find someone or somethingfindI've looked everywhere for my keys but can't find them.discoverThe missing wallet was discovered under the chair.locatePolice are still trying to locate the suspect.uncoverReporters uncovered evidence of corruption.unearthOur investigation unearthed mountains of evidence that implicated the city.come acrossWe came across a lovely little restaurant in the village.\nSee more results »\nC1 to find the origin of something: The phone company was unable to trace the call. No one has yet been able to trace the source of the rumour.\nto discover the causes or origins of something by examining the way in which it has developed: The outbreak of food poisoning was traced to some contaminated shellfish. She has traced her family history back to the seventeenth century. The practice of giving eggs at Easter can be traced back to (= first happened in) festivals in ancient China.\nto describe the way in which something has developed: The film traces the events leading up to the Russian Revolution in 1917.\nMore examplesFewer examplesThe city of Tours can trace its roots back to Roman times.The new system can trace a phone call in a fraction of a second.He has traced his family back to Norman times.We are trying to trace everyone who spoke to her that day.Police are trying to trace a man in connection with the murder.\nSMART Vocabulary: related words and phrases\nFinding and discovering\nascertain\nbreak (fresh/new) ground idiom\nbreakthrough\nbring something to light idiom\ncatch someone red-handed idiom\nflush someone/something out\nfossick\nfound\ngeocache\ngeocaching\npinpoint\nrake\nred-handed\nrediscover\nrediscovery\nrefind\nrefound\nsniff\nsuss\nuncover\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDefining & explaining\ntrace verb [T]\n(DRAW)\nto copy a drawing or pattern, etc. by drawing over its lines through a thin piece of transparent paper: Did you draw this picture yourself, or did you trace it? She learned to write her name by tracing out the letters.\nto draw a shape by showing the main or outer lines: The child was tracing patterns in/on the sand with a stick.\nSMART Vocabulary: related words and phrases\nPainting, drawing & printing\nairbrush\naxonometric\nbrushstroke\nbrushwork\nchiaroscuro\ndescribe\ndrawn\nengraving\netching\nface painting\nforeshorten\nillustrate\npainterly\npainting\npainting by numbers idiom\npentimento\npicturize\nshade\nsketch\nvanishing point\nSee more results »"}