{"id":367464,"name":"tracked","type":"verb","us_sound":"træk","us_link":"../audio/t/track.mp3","uk_sound":"træk","uk_link":"../audio/t/uktowni020.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\ntrack\ntrack verb\n(FOLLOW)\nC2 [ T ] to follow a person or animal by looking for proof that they have been somewhere, or by using electronic equipment: It's difficult to track an animal over stony ground. The military use radar satellites to track targets through clouds and at night. The terrorists were tracked to (= found in) Amsterdam. See also\nbacktrack (GO BACK)\nsidetrack verb\nThesaurus: synonyms, antonyms, and examples\nto follow someone or somethingfollowFollow me - this way!tag alongDo you mind if my little brother tags along?chaseHe was running and the dog was chasing him.pursueThe robber was pursued by several members of the public.tailThe car was tailed by police for several hours.shadowThe police think the robbers shadowed their victims for days before the crime.\nSee more results »\nC2 [ T ] to record the progress or development of something over a period: The study tracked the careers of 1,226 doctors who trained at the Medical School.\nMore examplesFewer examplesHis book tracks the development of modern English.She has tracked her family back three centuries.Police tracked the gun to an abandoned warehouse.We spent the day tracking deer in the forest.Radar equipment tracked the progress of the ships.\nSMART Vocabulary: related words and phrases\nPursuing\nbe hot on someone's track/trail idiom\nbe on someone's tail idiom\nbear\nbear down on someone/something\nbring\nbring up the rear idiom\nconvoy\nhumbug\nin hot pursuit idiom\non the scent idiom\npester\npursue\npursuer\nrun\nstalk\nstick\ntag\ntailgate\ntrack\ntrack and trace\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnalysing and evaluating\ntrack verb\n(MOVE)\n[ I ] If a film or video camera tracks in a particular direction, it moves along while it is filming: The movie ends with a long tracking shot around the deserted house.\n[ I ]\n&#160; media\n&#160; specialized If a moving part of a recording machine tracks, it gets into the correct position for operating: Our VCR tracks automatically.\nSMART Vocabulary: related words and phrases\nCinema - general words\n12A\nanimation\nanimator\naudio described\naudio description\ncomputer-generated imagery\nfade\nfilmic\nfilmically\nfilming\nfilmstrip\nflick\nfootage\nRambo\nremake\nrerelease\nrescreen\nreshoot\nsting\ntheatrical\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAudio & video equipment\ntrack verb\n(FINANCE)\n[ T ] to follow the level of an interest rate, share price, etc.: The mortgage deal will track the Bank of England base rate plus 0.75 percent. Tony is putting £500 a month into a a savings account that tracks the FTSE All-Share index.\ntrack verb\n(STUDENTS)\n[ T ] US (UK track) to group and teach together school students with similar abilities who are approximately the same age: We start to track the children in the third form.\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nconcordance\ndescribe\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nset something up\nshake someone down\nshort-list\nshortlist\nsort\ntick\nSee more results »\nPhrasal verb\ntrack something/someone down"}