{"id":367534,"name":"trade","type":"noun","us_sound":"treɪd","us_link":"../audio/t/trade.mp3","uk_sound":"treɪd","uk_link":"../audio/t/uktract003.mp3","content":"trade noun\n(BUYING AND SELLING)\nAdd to word list\nAdd to word list\nB1 [ U ] the activity of buying and selling, or exchanging, goods and/or services between people or countries: trade in The country's trade in manufactured goods has expanded in the last ten years.trade with 70 percent of the country's trade is with Europe.trade agreement The two countries have signed a trade agreement for one year only. Synonyms\nbusiness (SELLING)\ncommerce\nenterprise (BUSINESS)\n[ U ] business activity: Since the supermarket opened, many small local shops have lost up to 50 percent of their trade.roaring/brisk trade in In hot weather, shops do a roaring/brisk trade in (= sell a lot of) cold drinks and ice cream. This level of confidence in the economy is good for trade generally.\nMore examplesFewer examplesThe investigation uncovered evidence of a large-scale illegal trade in wild birds.Russia has just drawn up a trade agreement with Norway.The latest trade figures have dealt a severe blow to hopes of an early economic recovery.We are planning to develop our export trade.There's a flourishing trade in second-hand video machines.\nSMART Vocabulary: related words and phrases\nBuying & selling - general words\nall-you-can-eat\nanti-consumer\nanti-dumping\nback order\nbarter\ndeal in something\ndealership\ndesk research\nebay\neconomic activity\nflood\nhammer\npre-emption\npre-order\nprocurement\nrewards card\nsanctions-busting\nshelf\nstretch\ntender\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBusiness - general words\ntrade noun\n(BUSINESS)\nC1 [ C ] a particular business or industry: the trade the building/catering/tourist trade the book/car/fur tradein a trade He worked in the same trade all his life. Synonyms\nbusiness (COMPANY)\nconcern (BUSINESS)\nenterprise (BUSINESS)\nB2 [ C or U ] a job, especially one that needs special skill, that involves working with your hands: She went to college to learn a trade.by trade He's a carpenter by trade. the trade [ S ]\nthe people who work in a particular business or industry or in the same one: in the trade People who work in the trade can buy their books at a discount. The company only supplies its goods to the (building/catering) trade, not direct to the public.\nMore examplesFewer examplesThere's a flourishing trade in second-hand video machines.This has been a difficult year for the motor trade.His is a family trade, passed down from generation to generation.For the modern sales executive, a car phone is one of the tools of the trade.Business people wailed that their trade would be ruined.\nSMART Vocabulary: related words and phrases\nIndustry & industrial processes\nadditive manufacturing\nbiomanufacturing\ncarding\ncleantech\ncompression moulding\nindustry-wide\ninjection moulding\ninter-industry\njust-in-time\nlight industry\nnon-industry\nnon-technical\nprebuilt\nprefabricated\nprefabrication\nsunrise industry\nsunset industry\nsynthetic\nsynthetically\nvitrification\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBusiness - general words\nEnterprises\n[ before noun ]\n&#160; publishing\n&#160; specialized used to refer to the publishing of books, etc. that are aimed at the general public: trade publishing My friend just moved to trade publishing after years in academic publishing. trade fiction The paperback edition has been on the Times's trade fiction bestseller list for nearly thirty weeks. trade publication/journal/magazine/paper\na newspaper, etc. produced for people working in a particular business or industry: a steel industry trade journal\nSee more\nSMART Vocabulary: related words and phrases\nBooks: kinds of books\nabridgment\nannual\nanthology\naudiobook\nbacklist\ndigest\ndime novel\ne-reader\neasy read\nexercise book\nmulti-volume\nmust-read\nnovel\nnovelette\nnovelistic\ntome\ntrilogy\nvade mecum\nworkbook\nya\nSee more results »\ntrade verb\n(BUY AND SELL)\nB2 [ I or T, usually + adv/prep ] to buy and sell goods or services, especially between countries: trade with For centuries, Native Americans traded with European settlers.trade in The company has been trading in oil for many years.trading partner The two countries have become close trading partners. Our books are traded throughout Asia. See also\nhorse-trade\n[ I or T ] to be bought and sold, or to buy and sell shares, on the stock exchange: The volume of stocks traded today was very high.trade actively Shares in the company traded actively.\nMore examplesFewer examplesIt was several months before the company started to trade profitably .Native Americans traded furs with early European settlers.In the meantime, the shares will continue to trade on the open market.Only licensed stall-holders are allowed to trade here.It is a well-respected family business which has traded in the town for over 50 years.\nSMART Vocabulary: related words and phrases\nBuying & selling - general words\nall-you-can-eat\nanti-consumer\nanti-dumping\nback order\nbarter\ndeal in something\ndealership\ndesk research\nebay\neconomic activity\nflood\nhammer\npre-emption\npre-order\nprocurement\nrewards card\nsanctions-busting\nshelf\nstretch\ntender\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStock markets\ntrade verb\n(EXCHANGE)\n[ T ] to exchange something, or to stop using or doing something and start using or doing something else instead: The children traded comics. [ + two objects ] I'll trade you some of my chocolate for some of your ice cream.trade someone/something for someone/something I wouldn't trade you for the world (= I do not want a different partner). See also\ntrade something in\n[ T ] If people trade statements of a particular type, they say or tell them to each other: We sat around the dinner table, trading stories.trade insults The two politicians didn't really discuss the issues, they just traded insults.\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\ncompensation\nmake up for something\nname\nnovate\npart exchange\npinch-hit\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitutable\nsubstitution\nsubstitutive\nsucceed\nsuccession\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWays of talking\nPhrasal verbs\ntrade something in\ntrade something off\ntrade on something\ntrade up/down\ntrade noun [C/U]\n(BUYING AND SELLING)\nAdd to word list\nAdd to word list\nthe activity of buying and selling goods and services esp. between countries: [ U ] foreign trade [ U ] a trade agreement\nA trade is the act of exchanging one thing for another.\ntrade noun [C/U]\n(JOB)\na job, esp. one that needs special skill and that involves working with your hands, or the type of work in which such skills are needed: [ C ] the building trades [ U ] He’s an auto mechanic/electrician by trade.\nA trade is also any business: [ C ] the book/tourist trade\ntrade verb [I/T]\n(BUY AND SELL)\nto buy, sell, or exchange goods: [ I ] For centuries, Native Americans traded with European settlers.\nTo trade is also to exchange something: [ T ] The children traded comics. [ T ] The two players traded insults and nearly came to blows.\nIf you trade something in, such as a car, you give it as part of the payment for something new: [ M ] He recently traded in his Jeep for a red Mercedes.\nPhrasal verb\ntrade on/upon something\nAdd to word list\nAdd to word list\n[ U ]\n&#160; COMMERCE the buying and selling of goods between people, companies, or countries: trade between sb and sb The policy is intended to increase trade between India and southeast Asia.trade in sth The country's trade in manufactured goods has expanded in the last ten years.a trade body/group Leaders of industry trade groups are urging caution in raising oil taxes. the minister for trade and industry global/international/regional trade trade policies/practices trade concessions/liberalization trade deals/negotiations/talks\n[ C ] a particular business or industry: Members of the building trade have opposed the measure. the catering/retail/tourist trade the car/diamond/fur trade\n[ U ]\n&#160; ECONOMICS a country's imports and exports in a particular period: Consumer spending slowed down and investment and net trade recovered. The dollar has been boosted by two months of better American trade figures.\n[ U ] business activity: lose/boost trade Many small local shops have lost up to 50% of their trade since the supermarket opened. Trade is always slow in the winter months.\n[ C or U ] a job, especially one that needs special skill and involves working with your hands: He's an electrician by trade. She wants to go to college and learn a trade.\n[ C or U ] a situation in which you exchange something that you own for something that you want: Does anyone want to do a trade for my mobile phone? We have hundreds of CDs available for sale or trade.\n[ C or U ]\n&#160; FINANCE, STOCK MARKET the activity of buying and selling shares, investments, etc. or an occasion when people do this: EBS claims to broker about 10,000 trades a day. afternoon/morning trade was brisk.\ndo a roaring trade (in sth) (also do a brisk trade (in sth))\nto sell a lot of something: We do a roaring trade in ice-creams during the hot weather.\nthe trade\na particular business or industry, and the people who work in it: People who work in the trade can buy their books at a discount. The website offers a huge choice of private and trade sales for secondhand buyers. a trade journal/magazine\nSee also\nbalance of trade\nbarrier to trade\ncap and trade\ncarry trade\nchamber of trade\ncountertrade\ndistributive trades\nexternal trade\nfair trade\nforeign trade\nView all\nfree trade\nglobal trade\ninsider trade\ninvisible trade\noverseas trade\npassing trade\nthe rag trade\nstock-in-trade\nterms of trade\nvisible trade\nwash trade\n[ I or T ]\n&#160; COMMERCE to buy and sell goods or services: be traded between sb and sb The plan knocks down tariffs on goods traded between the two countries.trade with sb All councils trade electronically with their suppliers.trade in sth Besides trading in goods, we also trade in services.\nto give something that you own as part of the payment for something that you buy, especially a new type of the same product: trade sth for sth I traded my car for a new vehicle.\n[ I ] to exist and operate as a business: trade as sth The company trades as 'Pioneer Clothing'. The business traded under the name of College Crackers. The supermarket ceased trading in 2009.\n[ I or T ]\n&#160; STOCK MARKET, FINANCE to buy and sell shares on a stock market: Investors will be offered the choice of three ways to trade. Around 95,000 long gilt contracts were traded on Liffe today.\n[ I ]\n&#160; FINANCE, STOCK MARKET to be bought and sold on a stock market: Only six months ago the shares were trading as high as 35.5p. Foreign stock markets were trading down about 2%.\n[ T ] to exchange something, or to stop doing or using something and start doing or using something else instead: trade sth for sth Most investors would trade a steadily climbing market for a volatile index any day.\n[ I ]\n&#160; COMMERCE\n&#160; US to buy goods or do your shopping at a particular store: We don't trade at his store anymore. See also\nfairly-traded\novertrade\npublicly-tradedPhrasal verbs\ntrade down\ntrade sth in\ntrade sth off\ntrade up"}