{"id":367540,"name":"trademark","type":"noun","us_sound":"ˈtreɪd.mɑːrk","us_link":"../audio/t/trademark.mp3","uk_sound":"ˈtreɪd.mɑːk","uk_link":"../audio/t/uktract004.mp3","content":"trademark noun [C]\n(PRODUCT)\nAdd to word list\nAdd to word list\na name or symbol on a product that shows it was made by a particular company, and that it cannot be used by other companies without permission: Velcro is a registered trademark.\nSMART Vocabulary: related words and phrases\nSpecific signs and symbols\nargent\narrow\nbadge\nbrand\nBritannia\ncheck something off\nchevron\ncoat of arms\ncrested\ncross\ndot\nhallmark\nMaltese cross\nMorse code\nregistered trademark\nsable\nsemaphore\nservice mark\nshield\nunderscore\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNames and titles\ntrademark noun [C]\n(TYPICAL)\nsomething very noticeable that a person typically has or does: He was wearing one of the brightly coloured ties that are his trademark. She gave one of her trademark smiles.\nSMART Vocabulary: related words and phrases\nTypifying, illustrating and exemplifying\nanalogy\narchetypal\narchetypically\nbe someone all over idiom\nbetoken\ninstance\ninstantiate\nmirror\nMr\nMrs\nstereotype\nsum\nsum (something/someone) up\nsummation\nsymbolic\nsymbolization\nsymptom\nterritory\ntoken\ntranslate\nSee more results »\nAdd to word list\nAdd to word list\na symbol, name, design, or phrase on a product that shows it is made by a particular company\nAdd to word list\nAdd to word list\nLAW a name or symbol on a product that shows it was made by a particular company, and that it cannot be used by other companies without permission: Google is a trademark of Google Technologies.trademark infringement/protection/violation The retail giant has taken action against a number of small businesses over trademark infringement. trademark laws/rights trademark holders/owners\nsomething that a person or company has or does that makes them easy to notice or recognize: The advert shows a house built out of the bank's trademark red building blocks. See also\nregistered trademark\nto protect a name or symbol on a product or products so that it cannot be used by other companies without permission: trademark a name/phrase/product The phrase was never trademarked by the company."}