{"id":367537,"name":"traded","type":"verb","us_sound":"treɪd","us_link":"../audio/t/trade.mp3","uk_sound":"treɪd","uk_link":"../audio/t/uktract003.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\ntrade\ntrade verb\n(BUY AND SELL)\nB2 [ I or T, usually + adv/prep ] to buy and sell goods or services, especially between countries: For centuries, Native Americans traded with European settlers. The company has been trading in oil for many years. The two countries have become close trading partners. Our books are traded throughout Asia. See also\nhorse-trade\n[ I or T ] to be bought and sold, or to buy and sell shares, on the stock exchange: The volume of stocks traded today was very high. Shares in the company traded actively.\nMore examplesFewer examplesIt was several months before the company started to trade profitably .Native Americans traded furs with early European settlers.In the meantime, the shares will continue to trade on the open market.Only licensed stall-holders are allowed to trade here.It is a well-respected family business which has traded in the town for over 50 years.\nSMART Vocabulary: related words and phrases\nBuying & selling - general words\nall-you-can-eat\nanti-consumer\nanti-dumping\nback order\nbarter\ndeal in something\ndealership\ndesk research\nebay\neconomic activity\nflood\nhammer\npre-emption\npre-order\nprocurement\nrewards card\nsanctions-busting\nshelf\nstretch\ntender\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStock markets\ntrade verb\n(EXCHANGE)\n[ T ] to exchange something, or to stop using or doing something and start using or doing something else instead: The children traded comics. [ + two objects ] I'll trade you some of my chocolate for some of your ice cream. I wouldn't trade you for the world (= I do not want a different partner). See also\ntrade something in\n[ T ] If people trade statements of a particular type, they say or tell them to each other: We sat around the dinner table, trading stories. The two politicians didn't really discuss the issues, they just traded insults.\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\ncompensation\nmake up for something\nname\nnovate\npart exchange\npinch-hit\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitutable\nsubstitution\nsubstitutive\nsucceed\nsuccession\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWays of talking\nPhrasal verbs\ntrade something in\ntrade something off\ntrade on something\ntrade up/down"}