{"id":367569,"name":"traditionalist","type":"noun","us_sound":"trəˈdɪʃ.ən.əl.ɪst","us_link":"../audio/t/ustrade005.mp3","uk_sound":"trəˈdɪʃ.ən.əl.ɪst","uk_link":"../audio/t/uktract013.mp3","content":"Add to word list\nAdd to word list\nsomeone who believes in and follows traditional ideas: Religious traditionalists objected to theories of evolution being taught in schools. The old general was a traditionalist who believed in the rule of authority. Compare\ndiehard disapproving\nMore examplesFewer examplesTraditionalists were outraged by both changes.Progressive in his youth, he has become a traditionalist.But traditionalists were horrified, saying that the reform represented a dangerous tightening of the executive's grip over the legislature.\nSMART Vocabulary: related words and phrases\nCustom, tradition & conformity\nAmericanization\nanti-classical\nanti-conventional\nanti-institutional\nanti-traditional\nconventionalized\nconventionally\ncounter-tradition\ncrowd\ncustom\nmores\nmulticultural\nmulticulturalism\nmulticulturally\nnon-classical\ntraditionally\nultra-conservatism\nultra-conservative\nultra-traditional\nunconventional\nSee more results »\nbelieving in and following traditional ideas: She holds traditionalist Muslim views.UK He provoked anger among traditionalist Conservatives with an attack on Margaret Thatcher's policy towards the former apartheid regime in South Africa.\ndone in the same way as has been done for a long time, without any changes: This production of \"Swan Lake\" is in traditionalist style. His was a traditionalist approach to cricket.\nMore examplesFewer examplesHundreds of traditionalist clergy objected to the consecration of women bishops.He is not entirely pleased with the traditionalist wing of his party either.The thing that attracts me, and it seems to attract both collectors of the avant-garde and collectors of traditionalist work, is that there is a certain playfulness in it. The show touched country's various bases: from traditionalist honky-tonk and heartbreak to the music's modern incarnations.\nSMART Vocabulary: related words and phrases\nCustom, tradition & conformity\nAmericanization\nanti-classical\nanti-conventional\nanti-institutional\nanti-traditional\nconventionalized\nconventionally\ncounter-tradition\ncrowd\ncustom\nmores\nmulticultural\nmulticulturalism\nmulticulturally\nnon-classical\ntraditionally\nultra-conservatism\nultra-conservative\nultra-traditional\nunconventional\nSee more results »\nAdd to word list\nAdd to word list\nsomeone who believes in and follows traditional ideas"}