{"id":367613,"name":"traffic","type":"noun","us_sound":"ˈtræf.ɪk","us_link":"../audio/t/traffic.mp3","uk_sound":"ˈtræf.ɪk","uk_link":"../audio/t/uktract016.mp3","content":"traffic noun [U]\n(VEHICLES)\nAdd to word list\nAdd to word list\nA2 the number of vehicles moving along roads, or the amount of aircraft, trains, or ships moving along a route: There was heavy/a lot of traffic on the roads this morning. We got stuck in traffic for several hours. New measures have been introduced to try and ease traffic congestion in the city. Five people were injured in a traffic accident (= one involving vehicles).US I heard about the accident on the traffic report on the radio this morning. Air traffic has increased 30 percent in the last decade.\npeople or goods transported by road, air, train, or ship, as a business: The airline halved its overseas service because of a sharp reduction in traffic. Environmental groups want more passenger and freight traffic moved off the roads and onto trains.\nMore examplesFewer examplesSorry I'm late, I got held up in traffic.There was a police officer directing the traffic.The council is to examine ways of reducing traffic in the city centre.The traffic was quite light so we got through London quickly.I don't want a load of traffic going past my house all night, keeping me awake.\nSMART Vocabulary: related words and phrases\nOn the road: traffic jams\nback\nback someone up\nbacked up\nbottleneck\ncongested\ncongestion\ngridlocked\nhigh-traffic\njam\nrasta roko\nrush hour\nsnarl-up\nsock\nsock something/someone in (with sb)\ntail\ntail back\ntailback\ntraffic calming\ntraffic jam\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTravellers & visitors\ntraffic noun [U]\n(TRADE)\nillegal trade: to cut down the traffic in drugs/the drug traffic Police are looking for ways of curbing the traffic in guns.\nSMART Vocabulary: related words and phrases\nTrafficking & racketeering\nanti-racketeering\nanti-smuggling\nbagman\nblack market\ncontraband\ncounter\ngun-running\nmissell\nmisselling\nmodern slavery\npass\npeople trafficking\nracket\nscalp\nscam\nscammer\nsell someone a bill of goods idiom\nsmuggle\nsmuggling\nunder the counter idiom\nSee more results »\ntraffic noun [U]\n(INTERNET)\ninternet &amp; telecoms\n&#160; specialized the activity of data and messages passing through an online communication system or the number of visits to a particular website: internet traffic Twitter traffic web/website/site traffic We can give you advice on how to improve your site traffic and generate sales.\nSMART Vocabulary: related words and phrases\nInternet terminology\n.plc.uk\n2FA\n2SV\nabove/below the fold idiom\naddress bar\naffiliate link\nhybrid\ninternet-enabled\ninterweb\nIP\nkeyboard warrior\nlanding page\nping\npodcast\nservice provider\ntweeter\ntweetstorm\ntwitterati\nTwitterer\ntwittering\nSee more results »\n[ I ] to buy and sell goods illegally: They were arrested for trafficking in the eggs of protected species of birds.\n[ T ] to illegally buy or sell people, or make money from work they are forced to do, such as sex work: It is estimated that between 700,000 and 2 million women and children are trafficked globally each year.\nSMART Vocabulary: related words and phrases\nTrafficking & racketeering\nanti-racketeering\nanti-smuggling\nbagman\nblack market\ncontraband\ncounter\ngun-running\nmissell\nmisselling\nmodern slavery\npass\npeople trafficking\nracket\nscalp\nscam\nscammer\nsell someone a bill of goods idiom\nsmuggle\nsmuggling\nunder the counter idiom\nSee more results »\nRelated word\ntrafficking\ntraffic noun [U]\n(MOVING THINGS)\nAdd to word list\nAdd to word list\nthe movement of vehicles or people along roads, or the movement of aircraft, trains, or ships along a route: heavy/rush-hour traffic Air traffic has increased 30% in the last decade.\ntraffic noun [U]\n(TRADE)\nillegal trade: They’re trying to cut down on the traffic in exotic birds being sold illegally.\nto buy and sell something illegally: He was charged with trafficking in stolen goods.\nAdd to word list\nAdd to word list\nTRANSPORT all the vehicles that are on a road or all the aircraft, trains, or ships that are along a route or in an area at a particular time: air/rail/road traffic All commercial air traffic in the area has been cancelled. Rome has a video tracking system installed to help reduce traffic congestion. Banks study migration and traffic trends in deciding where to locate branches.\nTRANSPORT, COMMERCE people or goods transported by road, air, train, or ship, as a business: The loss of passenger and freight traffic to ferries and low cost airlines have forced Eurotunnel to produce yet another recovery programme.\nIT the amount of data moving between computers or systems at a particular time: We need a telecom infrastructure that can handle fast-growing internet traffic. They need to convert to broadband to cope with the growing volume of data and voice traffic.\nMARKETING the number of people buying goods or using a service at a particular time: Many casino companies produced solid earnings from heavy traffic during the New Year's holiday. The sites that are attracting traffic are professional blogs.\nthe illegal trade of goods or people: the brutal trade in human traffictraffic in/of sth Most of the traffic of narcotics is not detected. See also\nfoot traffic\npage traffic\nstore traffic\nto buy and sell goods or people illegally: He pleaded no contest to trafficking 10,000 pounds of marijuana.traffic sb/sth somewhere An estimated 600,000 to 800,000 victims are trafficked across international borders each year.\nPhrasal verb\ntraffic in sth"}