{"id":367635,"name":"tragedy","type":"noun","us_sound":"ˈtrædʒ.ə.di","us_link":"../audio/t/tragedy.mp3","uk_sound":"ˈtrædʒ.ə.di","uk_link":"../audio/t/uktract020.mp3","content":"Add to word list\nAdd to word list\nB2 a very sad event or situation, especially one involving death or suffering: The pilot averted a tragedy when he succeeded in preventing the plane from crashing. Hitler's invasion of Poland led to the tragedy of the Second World War. His life was touched by hardship and personal tragedy. Not long after they moved, tragedy struck - their son was killed in an accident. [ + (that) ] It's a tragedy (that) so many young people are unable to find jobs.\na play about death or suffering with a sad end, or this type of play generally: Shakespeare's tragedies include \"Hamlet\", \"King Lear\", and \"Othello\". In Greek tragedy, the role of the chorus is to express the audience's reactions to what is happening in the play.\nMore examplesFewer examplesWe are deeply saddened by this devastating tragedy.News of the tragedy has sobered us.It's a tragedy that these young people were struck down in their prime.The tragedy of being a dancer is that you're all washed up by the time you're 35.Within hours of the tragedy happening, an emergency rescue team had been assembled.\nSMART Vocabulary: related words and phrases\nAccidents and disasters\naccident\naccidental\naccidentally\naccidentally on purpose idiom\nan accident waiting to happen idiom\ncalamitously\ncalamity\ncataclysm\ncataclysmic\ncataclysmically\ndisaster\ndisaster area\ndisastrous\ndisastrously\ndumpster fire\nmisadventure\nmishap\nnatural disaster\nnon-emergency\nperfect storm\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLiterature\nAdd to word list\nAdd to word list\na very sad event or situation, esp. one involving death or suffering: [ U ] His reckless driving was bound to end in tragedy.\nA tragedy is also a situation or result that is bad: [ C ] It’s a tragedy (that) so many children are unable to get a decent education.\nliterature In the theater, a tragedy is a serious play that ends with the death or suffering of the main character: [ C ] Shakespeare’s tragedies"}