{"id":367701,"name":"trail","type":"noun","us_sound":"treɪl","us_link":"../audio/t/trail.mp3","uk_sound":"treɪl","uk_link":"../audio/t/uktract025.mp3","content":"trail noun\n(PATH)\nAdd to word list\nAdd to word list\nB2 [ C ] a path through a countryside, mountain, or forest area, often made or used for a particular purpose: a forest/mountain trail a walking/snowshoeing/cross-country skiing trail\nImage by Chris Winsor/Moment/GettyImages\nMore examplesFewer examplesUnusually high winds left a trail of destruction over southern Britain.The storm left behind it a trail of devastation.A narrow trail of blood led directly into the cave.Mind out for falling rocks on this part of the trail.The trail began to steepen near the top of the hill.\nSMART Vocabulary: related words and phrases\nRoads: pedestrian routes\nalley\nboardwalk\nbreezeway\nbridle path\ncar-free\ncart track\nesplanade\nlabyrinth\nley line\nmaze\nmazy\nnature strip\npathway\npedestrianize\npiazza\nrail trail\nsidewalk\nstepping stone\nswitchback\nthe highways and byways idiom\nSee more results »\ntrail noun\n(SIGNS)\nC2 [ C ] the smell or series of marks left by a person, animal, or thing as it moves along: follow a trail The dogs are trained to follow the trail left by the fox.leave a trail of He left a trail of muddy footprints behind him.\n[ S ] various pieces of information that together show where someone you are searching for has gone: leave a trail The police admit that the robbers have left no trail for them to follow up. be on the trail of someone/something\nto be searching for someone or something by examining information you find about where they went: The three men went to the Bahamas, on the trail of a sunken 17th-century galleon full of treasure.\nSee more\nSMART Vocabulary: related words and phrases\nAnimal (non-human) behaviour\naccidental\napex predator\nbeg\nbehave\nbehaviour\nbehavioural science\nclaw\nfawn\ngambol\ngroom\nhoming\nhousebroken\nmigrate\nmonogamously\nmonogamy\nmurmuration\nnocturnal\nnon-migrant\nnuzzle\nscent\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPursuing\ntrail verb\n(MOVE SLOWLY)\n[ I or T, usually + adv/prep ] to (allow something to) move slowly along the ground or through the air or water, after someone or something: trail in Katherine, your skirt's trailing in the mud!trail something in something As the boat moved along, he trailed his hand in the water.\nC2 [ I usually + adv/prep ] to move slowly and without energy or enthusiasm: trail back The delegates trailed back into the conference room for the afternoon session.be trailing behind After a mile or two the youngest children were trailing behind.\nMore examplesFewer examplesHer scarf was trailing on the ground.He is trailing now in the third set of the match.We trailed wearily up the stairs to bed.The cape was trailing in the mud.His team is trailing badly now.\nSMART Vocabulary: related words and phrases\nPulling\ndraft\ndrag\ndraught\ndraw something up\nhaul\nheave\nheave-ho\nheft\nhitch something up\npluck\nreel\nreel something in/out\nretract\nretractable\nsuck\ntow\ntow-away\ntraction\nwrest\nyank\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSlow and moving slowly\ntrail verb\n(IN A COMPETITION/GAME)\nbe trailing\nC2 to be losing to your competitor in a competition: be trailing by The Canadian team is trailing by six points.\nSee more\ntrail verb\n(FOLLOW)\n[ T ] to follow the trail of someone or something\nThesaurus: synonyms, antonyms, and examples\nto follow someone or somethingfollowFollow me - this way!tag alongDo you mind if my little brother tags along?chaseHe was running and the dog was chasing him.pursueThe robber was pursued by several members of the public.tailThe car was tailed by police for several hours.shadowThe police think the robbers shadowed their victims for days before the crime.\nSee more results »\nSMART Vocabulary: related words and phrases\nPursuing\nbe hot on someone's track/trail idiom\nbe on someone's tail idiom\nbear\nbear down on someone/something\nbring\nbring up the rear idiom\nconvoy\nflight\nhound\nhumbug\nin hot pursuit idiom\non the scent idiom\npester\npursue\nshadow\nstick\ntailgating\ntargetable\ntrack\ntrack and trace\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHunting & fishing\nPhrasal verb\ntrail away/off\ntrail noun [C]\n(PATH)\nAdd to word list\nAdd to word list\na path through the countryside, often made or used for a particular purpose: a bike/mountain/nature trail fig. Presidential candidates were on the campaign trail in Mississippi yesterday.\nA trail is also a series of marks left by a person, animal, or thing as it moves along: The kids left a trail of muddy footprints across the kitchen floor.\ntrail verb [I/T]\n(FOLLOW)\nto follow or come behind: [ T ] Ray trailed Kate up to the porch. [ I always + adv/prep ] A string of police cars led the president’s limousine and others trailed behind.\nIn a competition, to trail is to be losing to someone: [ I ] Dallas trailed 34-21 with less than seven minutes to play in the football game. [ T ] Bush trailed the governor by only 4 percentage points. [ I ] Though trailing in the polls, she predicted victory. Phrasal verb\ntrail off\nAdd to word list\nAdd to word list\n[ I or T ] to be less successful than competitors or than expected: This company's shares have left most rivals trailing. Precious-metal stocks trailed, at 124.35.trail behind sth Prices of mortgage-backed securities trailed behind the gains of the Treasury. Internet access in the U.S. trails Japan when it comes to speed.\n[ T ] to advertise something before it is available to buy, see, use, etc: The heavily trailed announcements on ISA changes were widely welcomed. The home secretary trailed his new law in an article in a newspaper yesterday.\n[ I or T ] to happen after or follow something: trail behind sth The service, free at the point of use, perpetually trails behind demand. History suggests that consumer spending declines usually trail consumer confidence declines by about 3 months.\nPhrasal verb\ntrail off\na series of activities that someone does in order to achieve something: acquisition/campaign/comeback trail The bank's acquisition trail across the globe might slow a little although it continues to look at potential opportunities.\nbe on/go on/hit the trail\nto be trying to find, get, or achieve something: He tells candidates to raise money early, before they hit the trail for speeches and handshakes.\nblaze a/the trail\nto be the first to do something new: Netscape and Hotmail were both swallowed up after blazing the trail for larger, less agile competitors. I'm not blazing a trail for women, I'm doing this for myself.\n(hot) on the trail (of sth)\nvery close to finding or achieving something: NPR's reporter is hot on the trail of the story.\nleave a trail of sth\nto leave a series or number of things behind you: His company went into liquidation leaving a trail of debts. Over the past 12 months, the company has underperformed the index by over 20%, leaving a trail of disappointed investors. See also\naudit trail\npaper trail"}