{"id":367761,"name":"training","type":"noun","us_sound":"ˈtreɪ.nɪŋ","us_link":"../audio/t/training.mp3","uk_sound":"ˈtreɪ.nɪŋ","uk_link":"../audio/t/uktrain002.mp3","content":"training noun [U]\n(LEARNING)\nAdd to word list\nAdd to word list\nB1 the process of learning the skills you need to do a particular job or activity: a training course a teacher-training collegehave/receive training in New staff have/receive a week's training in how to use the system. be (in) training for something\nto exercise a lot and eat particular food in order to prepare yourself for a competition: Earlier this week Dan revealed that he's in training for the London marathon.\nSee more be good training for something\nto be a useful experience that will be helpful when doing a particular thing in the future: His experience as a teacher was good training for parenthood.\nSee more\nMore examplesFewer examplesBoth soldiers spent two weeks in training before being allowed to rejoin their unit.His experience as a teacher was good training for parenthood.The treatment for people addicted to tranquillizers includes training in stress management and relaxation techniques.The 21-year-old runner twisted his ankle in a training session last Friday.No formal qualifications are required for the work - you'll get on-the-job training.\nSMART Vocabulary: related words and phrases\nLearning & knowing\nabsorptive capacity\nacquirable\nacquire\nacquisition\nassimilate\nbone\nfamiliar\nhit the books idiom\nminor\nmislearn\nmug (something) up\nnon-academic\nnon-library\nrecognition\nshadow\nsubspecialty\nswot up (something)\nteachable\nthose\nuncultivated\nSee more results »\ntraining noun [U]\n(SUPPLYING DATA)\nin machine learning (= the study of creating computer systems that can improve their own ability to carry out tasks by analysing new data), the process of creating or improving a computer representation of a system or process by supplying it with data: training data The study investigates the impact of biased training data on generative AI performance. The models performed well when tested on new categories not seen during training.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nword processing\nSee more results »\nAdd to word list\nAdd to word list\nthe process of learning the skills you need to do a particular job or activity: We got two weeks of on-the-job training on how to conduct interviews.\nWhen you are in training for a competition, you exercise in a way that prepares you for it.\nAdd to word list\nAdd to word list\nWORKPLACE, HR the activity of learning or teaching the skills and knowledge needed for a particular job or activity: Every new sales recruit must do an initial training period. It is a three-stage examination, with a considerable element of on-the-job training required.be in training In some cases, junior doctors still in training have been enlisted to teach.give/offer/provide training Providing adequate training helps to develop a high level of motivation in a sales force.have/get/receive training She has received very little training. See also\nassertiveness training\ncomputer-based training\nmanagement training\nsensitivity training"}