{"id":367737,"name":"train","type":"noun","us_sound":"treɪn","us_link":"../audio/t/train.mp3","uk_sound":"treɪn","uk_link":"../audio/t/uktract028.mp3","content":"train noun\n(VEHICLE)\nAdd to word list\nAdd to word list\nA1 [ C ] a railway engine connected to carriages for carrying people or to wheeled containers for carrying goods: goods/freight/passenger train The line was closed yesterday after a goods/freight/passenger train derailed.train to/from The train to/from Bristol has been delayed due to a signal failure.train journey We decided to take a train journey together. train station The architect is best known for designing the city's train station. by train Did you come by train?catch/take a train She caught/took the train to Edinburgh.miss a train Hurry up, or we'll miss (= arrive too late for) the train.\nATGImages/iStock Editorial/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nRailways: trains & parts of trains\nbogie\nbullet train\ncarriage\ncowcatcher\nemergency cord\nfootplate\nfreight car\nguard's van\ninterurban\nloco\nlocomotive\nluggage van\npassenger\npuffer train\nrolling stock\nshunter\nsleeper\nsleeping car\nsmoker\nthird rail\nSee more results »\ntrain noun\n(SERIES)\ntrain of thought/events\nC2 a series of connected thoughts or events: What amazing train of thought led you from Napoleon to global warming?\nSee more\n[ C ] a line of animals, people, or things moving along together: a wagon train a mule/camel train\nSMART Vocabulary: related words and phrases\nThings collected in lines or rings\nchain\ncolumn\ncrocodile\nfile\ninterrow\nline\nqueue\nrank\nring\nrope\nrow\nsingle file\nstring\nthread\ntier\ntwo-tier\ntrain noun\n(PART OF DRESS)\n[ C ] the part of a long dress that spreads out onto the floor behind the person wearing it: an elaborate wedding dress with a long train\nsimon2579/iStock/Getty Image Plus/GettyImages\nSMART Vocabulary: related words and phrases\nDecorations for clothes\nbadged\nbadging\nbemedalled\nepaulette\neyelet\nflash\nfob\nfrill\nfringe\nfrou-frou\nnacre\npiping\npussy bow\nshoulder pad\nspangle\nstud\nstudded\ntassel\ntrim\ntrimming\nSee more results »\nIdiom\nput/set something in train\ntrain verb\n(TEACH)\nB1 [ I or T, I or T ] to prepare someone or yourself for a job, activity, or sport, by learning skills and/or by mental or physical exercise: train as She trained as a pilot. [ + to infinitive ] John trained to be an accountant.train for She trained hard for the race, sometimes running as much as 60 miles a week.\nThesaurus: synonyms, antonyms, and examples\nto teach someoneteachShe is teaching me French.instructHis job is to instruct people in the use of the gym equipment.trainShe trains new hairdressers.coachHe coaches young football players.tutorShe tutors students in French.educateHow much does it cost to educate a child privately?\nSee more results »\n[ T, I or T ] to teach a person or an animal a habit: train someone to do something I'm trying to train my kids to pick up after themselves. [ + to infinitive ] I had to train myself to be more assertive at work. Try to train your mind to tune out distractions. Working in such a difficult environment trained her not to give up when things got difficult. These dogs are very intelligent and eager to please, so it's easy to train them.\nMore examplesFewer examplesWe're trying to train our dog to sit.Doctors are trained to recognize the symptoms of different diseases.I had to take an aptitude test before I began training as a nurse.How I wish I could train the children to leave their dirty shoes at the door!We believe that he has been training an army and storing up arms.I have trained myself to look at the facts objectively.\nSMART Vocabulary: related words and phrases\nTeaching in general\nasynchronous\nchief academic officer\nCLIL\nclue\nclue in\ncommunicative\ndidactic\nhothouse\ninstruct\nmiseducation\nMoodle\nmulti-course\nnon-conditioned\nnon-didactic\nsocialization\nsocializing\nspecial education\nSRE\nsynchronous\ntutelage\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExercising & training\nAnimal (non-human) behaviour\ntrain verb\n(AIM)\n[ T usually + adv/prep ] formal to aim or point a gun, camera, light, etc. at someone or something: be trained on With five guns suddenly trained on him, he was understandably nervous.\nSMART Vocabulary: related words and phrases\nAiming and aim\naim\ncrosshairs\ndirect\nhome\nhome in on something/someone\nlevel\nlevel something at someone\nretarget\ntarget\nzero\nzero in on something/someone\ntrain verb\n(DIRECT GROWTH)\n[ T ] to direct the growth of a plant in a particular direction by cutting it and tying it: be trained over The vines were trained over an arch, providing shade as well as fruit.\nSMART Vocabulary: related words and phrases\nGardening - general words\nallotmenteer\nallotmenteering\naquaponics\narborist\nbed\nhedging\nhomegrown\nhorticultural\nhorticulturally\nhorticulture\nprune\nregraft\nregreen\nrepot\nresod\nweeding\nweedy\nwindow box\nxeriscaping\nyardwork\nSee more results »\ntrain verb\n(SUPPLY DATA)\n[ T ] in machine learning (= the study of creating computer systems that can improve their own ability to carry out tasks by analysing new data), to create or improve a computer representation of a system or process by supplying it with data: be trained on This chatbot has been trained on a collection of customer service conversations to ensure that it can generate human-like text in an interactive context. Deep neural nets require a lot of data to train. Machine learning models trained with incompletely annotated datasets often make similar errors.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nword processing\nSee more results »\ntrain noun [C]\n(VEHICLE)\nAdd to word list\nAdd to word list\na railroad engine and the connected, wheeled containers it pulls along the tracks in carrying goods or people: a freight/passenger train a commuter train\ntrain noun [C]\n(SERIES)\na line of animals, people, or things moving along together, or a series of connected thoughts or events: a mule/wagon train Now I’ve lost my train of thought and forgot what I was going to say.\ntrain noun [C]\n(PART OF DRESS)\nthe part of a long dress that spreads out onto the floor behind\ntrain verb [I/T]\n(PREPARE)\nto prepare someone or be prepared for a job, activity, or sport by learning skills or by mental or physical exercise: [ I ] She trained as a pilot. [ T ] He trains teachers to use new technology. [ I ] She trained hard for the race, sometimes running as much as 60 miles a week.\nAdd to word list\nAdd to word list\n[ T ] to teach someone the skills and knowledge needed for a particular job or activity: Younger recruits are considered easier to train. It takes at least six years to train a doctor.train sb to be/do sth We trained them to be computer specialists.\n[ I ] to learn the skills and knowledge needed for a particular job or activity: train as sth He trained as an accountant.train for sth Rebecca is training for her commercial truck driving certificate.train to be/do sth They were training to be pilots.\na railway engine connected to a group of vehicles for carrying people or goods: catch/take a train He usually wakes up before dawn to catch a train just after 5 a.m. London is two and a half hours away by train. a commuter/freight/passenger train a train company/operator/service\nSee also\ngoods train\ngravy train"}