{"id":367710,"name":"trailer","type":"noun","us_sound":"ˈtreɪ.lɚ","us_link":"../audio/t/trailer.mp3","uk_sound":"ˈtreɪ.lər","uk_link":"../audio/t/uktract026.mp3","content":"trailer noun [C]\n(VEHICLE)\nAdd to word list\nAdd to word list\na box on wheels that is pulled by a car and is used for taking things from one place to another: The car was pulling a trailer with a motorcycle on it.\ntopae/iStock/Getty Images Plus/GettyImages\nthe separate back part of a large truck\nalgre/iStock/Getty Images Plus/GettyImages\nUS (also travel trailer); (UK caravan) a wheeled vehicle for living or travelling in, especially for holidays, that contains beds and cooking equipment and can be pulled by a car\nduckycards/E+/GettyImages\nSMART Vocabulary: related words and phrases\nHandcarts, trolleys & prams\nbaby carriage\nbarrow\nbuggy\ncart\ndoll's pram\ndolly\nfood cart\nhand truck\nhandcart\nperambulator\npram\npushchair\nsack barrow\nsack truck\nshopping cart\nstroller\ntea cart\nwheelbarrow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTrucks, vans & caravans\ntrailer noun [C]\n(ADVERTISEMENT)\nan advertisement for a film or a television or radio programme, consisting of short parts taken from it: I saw a trailer for the new series of \"Game of Thrones\" last night.\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ncustomer relationship management\ndetoxify\ndifferentiator\ndogfooding\nflyer\no.n.o.\noff-brand\non-brand\noverexpose\noverexposure\ntie (something) in\ntout\nunadvertised\nunbilled\nunbranded\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBroadcasting: programmes & other broadcasts\ntrailer noun [C]\n(VEHICLE)\nAdd to word list\nAdd to word list\na vehicle without an engine, often in the form of a flat frame or a container, that can be pulled by another vehicle\nA trailer is also a house on wheels that can be moved by pulling it: We bought a trailer for camping trips.\nA trailer is also a mobile home\ntrailer noun [C]\n(ADVERTISEMENT)\nan advertisement for a movie, often showing a few, brief parts of it\nAdd to word list\nAdd to word list\nMARKETING an advertisement for a film, or television or radio programme, consisting of short parts taken from it: You can watch a trailer for the new series online. Hollywood has been circulating movie trailers on the Web for years.\nTRANSPORT the separate back part of a large truck used for carrying goods: It isn't cost-effectitve to have trucks carrying half-empty trailers for part of their journey.\nTRANSPORT a box on wheels that is pulled by a car and is used for taking things from one place to another"}