{"id":367902,"name":"tramway","type":"noun","us_sound":"ˈtræm.weɪ","us_link":"../audio/t/cdo1121ustram4284.mp3","uk_sound":"ˈtræm.weɪ","uk_link":"../audio/t/cdo1121uktram4187.mp3","content":"Add to word list\nAdd to word list\nmainly UK a system of transport using trams (= electric vehicles that go along metal tracks in the road): Many cities and towns are introducing or reintroducing tramways of ultra modern design.\nUK the metal tracks that trams or other vehicles run along: The whole area is interwoven with narrow gauge tramways for transporting the sugar harvest to the crushing plant.\nUS (also aerial tramway) a vehicle that hangs from and is moved by a cable (= a thick, strong wire) and transports people or goods up steep slopes or above an area of land: Roosevelt Island Tramway: Hitch a ride over the East River to Roosevelt Island and back on one of the City's more novel and fun forms of transit. You can enjoy a bird's-eye view of the zoo from the Skyfari aerial tramway, or take a guided tour bus. In the 1880s local limestone was carried on a complex aerial tramway to be loaded onto ships at Rockland Landing. Synonym\ncable car\nMore examplesFewer examplesIt's no sweat getting here by subway or tramway, and it really takes you away from the hustle and bustle mind-set of the City.However, the days of the South Metropolitan Electric Tramways and Lighting Co. Ltd., were now numbered.All the other deep mines have gone the same way, leaving a legacy of inclines, tramways and rusting machinery that can be visited on a number of walks. Ascending the Aiguille du Midi – the Needle of the South – via an aerial tramway, he can't bear to look down from his airborne plexiglass prison.\nSMART Vocabulary: related words and phrases\nBuses, trams & coaches\nbus\nbus captain\nbus conductor\ncoach\ncombi\ndouble-decker\ngangway\nHOV\njitney\nkombi\nlimousine\nlocal\nminibus\nomnibus\nschool bus\nthrough\ntram\ntramlines\ntrolley\ntrolleybus\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRailways & railway lines"}