{"id":368087,"name":"transduce","type":"verb","us_sound":"trænsˈduːs","us_link":"../audio/t/cdo1121ustran4288.mp3","uk_sound":"trænzˈdʒuːs","uk_link":"../audio/t/cdo1121uktran4191.mp3","content":"transduce verb [T]\n(CELLS)\nAdd to word list\nAdd to word list\nbiology\n&#160; specialized to move genetic material (= part of the DNA in cells) from one cell or bacterium to another, for example using a virus: An adenovirus was used to transduce the primary muscle-derived cells with BMP-2 DNA. See also\nco-transduce\nMore examplesFewer examplesLentivirus can effectively transduce both dividing and non-dividing mammalian cells.The same viral solution was used to transduce myoblasts in vitro prior to the ex vivo gene transfer to the same animal. The fact that we can transduce the cells with pseudotyped lentivirus indicates the potential for genetic modification of the cells in a therapeutic context.This approach avoids the need to transduce glioma cells from individual patients as it allows gene-based immunotherapy to be given immediately.\nSMART Vocabulary: related words and phrases\nGenetics\nadenine\nanaphase\nautosomal\nautosomally\nautosome\ngenomic\ngenomics\ngermline\ngermplasm\nhalf-breed\nheredity\nheterozygous\nhomozygous\noncogene\npanmictic\npanmixia\nparthenogenetic\nPatau syndrome\npaternally\nrecessive\nSee more results »\ntransduce verb [T]\n(ENERGY)\nphysics\n&#160; specialized to cause energy to change from one form to another: We learned how sensory systems gather stimuli and transduce specific stimuli into action potentials.\nMore examplesFewer examplesPhotoreceptor cells (rods and cones) in the retina transduce incident light into neuronal impulses.We record action potentials from neurons, and then we transduce the signal and can extract information about intended movement from that.\nSMART Vocabulary: related words and phrases\nPhysics: energy, force & power\nanimal magnetism\nanti-gravity\natmospheric pressure\nattract\nattraction\nballistic\nerg\nexcited\nfrictional\nfrictionless\nfundamental force\ngeothermal\ninertia\nradiant energy\nself-propulsion\nsine curve\nsinusoid\nsolarize\nthe sound barrier\nthermodynamics\nSee more results »\nRelated word\ntransduction"}