{"id":368559,"name":"transport","type":"noun","us_sound":"ˈtræn.spɔːrt","us_link":"../audio/t/transport_01_01.mp3","uk_sound":"ˈtræn.spɔːt","uk_link":"../audio/t/uktrans120.mp3","content":"transport noun\n(GOODS/PEOPLE)\nAdd to word list\nAdd to word list\nB2 [ U ] the movement of people or goods from one place to another: the transport of live animals The company will arrange transport from the airport.\nB1 [ U ] UK (US transportation) a system of vehicles, such as buses, trains, aircraft, etc. for getting from one place to another: the Department of Transportpublic transport Passenger organizations yesterday called for greater investment in public transport (= buses, trains, etc. available for everyone to use). Do you have your own transport (= vehicle)?form/means of transport Bicycles are a cheap and efficient form/means of transport.\nMore examplesFewer examplesThe city's transport system is one of the most efficient in Europe.The tour operator will arrange transport and plan your itinerary.Travelling by train is still one of the safest methods of transport.If you think that these transport problems can be solved by building more roads, you completely misunderstand the nature of the problem.Please let the organizers know if you're able to offer transport to or from the campsite for this year's Cub camp.\nSMART Vocabulary: related words and phrases\nTravelling\naround Robin Hood's barn idiom\nbackpack\nbag drop\nbourne\nbum\nbum around\ncommunication\ncommuting\nconnection\nhitch\nmove\nnegotiate\nRobin Hood\nshuttle\nsuper-commuting\ntaken\ntour\ntransoceanic\nvisa\nwell travelled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRoad vehicles in general\ntransport noun\n(FEELING)\nin transports (of delight) literary\nextremely pleased or happy: She was in transports of delight as she beheld the scene.\nSee more\ntransport verb [T]\n(GOODS/PEOPLE)\nB2 to take goods or people from one place to another: transport something across something to something The pipeline was constructed to transport oil across Alaska to ports on the coast.transport something (by something) Such heavy items are expensive to transport (by plane). Synonyms\ncarry (TRANSPORT)\ncart\ndrag (PULL)\nferry\nlug informal\ntote informal\nThesaurus: synonyms, antonyms, and examples\nto move someone or something from one place to anothercarryThese rail cars carry coal.haulHe grew up hauling coal out of the mines six days a week.cartThe suspects were carted away by police.lugI have to lug the shopping in from the car by myself!humpHe humped the mattress up to his third-floor flat by himself.schlepI need to schlep the trash to the curb.\nSee more results »\n(in the past) to send a criminal to live in a country far away as a punishment: be transported to 162,000 convicts were transported to Australia from 1788 to 1868.\nMore examplesFewer examplesThe prisoners were transported under military escort.The emergency building is transported in individual modules, such as bedrooms and a kitchen, which are put together on site.Environmentalists argue that more goods should be transported by rail.The two prisoners were kept under restraint while they were transported between prisons.\nSMART Vocabulary: related words and phrases\nTransferring and transporting objects\nbear\nbearer\nbike\nborne\nbring\nbudge\ncall for someone\ncarry\nchauffeur\nconvey\nhump\nimport\npayload\npickup\nportable\nportage\npost-delivery\nput something/someone down\ntransplant\ntruck\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPunishing someone by sending them somewhere else\ntransport verb [T]\n(FEELING)\nliterary If something transports you to a different time or place, it makes you feel as if you were in it: transport someone back to something The film transports you back to the New York of the 1950s.\nSMART Vocabulary: related words and phrases\nRemembering, reminding and reminders\naide-mémoire\nannal\nawaken someone to something\nbe engraved on someone's memory/mind idiom\nbe etched on/in someone's memory idiom\ncommit\nhooky\nif my memory serves me right idiom\nimprint\nindelible\njog\njog someone's memory idiom\nremember\nremind\nremind someone of something/someone\nreminder\nreminisce\nresonance\nresonant\nstamp\nSee more results »\nAdd to word list\nAdd to word list\nto take goods or people from one place to another: The movers will transport thousands of pictures, charts, and recordings to the library. transportation noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌtræns·pərˈteɪ·ʃən/\nIn many cities, people depend on public transportation to get around.\nsomething that takes things, esp. soldiers or military supplies, from one place to another: [ U ] I had to arrange for transport to get to my new assignment.\nbiology Transport also means the movement of a chemical substance in and out of living cells.\nAdd to word list\nAdd to word list\na system of vehicles, for example buses, trains, and aircraft, for getting from one place to another: Future economic growth may be damaged by the failure of the Treasury to invest in the UK's transport infrastructure. Improved transport links for rural communities are part of the Party's latest manifesto. Effective passenger transport systems are essential for European economies. People are being encouraged to try local transport for short journeys. road/rail/air transport transport systems/services/networks a transport group/company/business the transport sector/industry the transport department/minister/secretarya form/means/mode of transport In recent years, there has been an enormous increase in air traffic and other forms of transport.cheap/free transport Thanks to cheaper transport, prices across the world have converged.\na vehicle for a person or group of people to use for a particular journey: Guests will need their own transport to get to the convention center.arrange/provide transport You will have to arrange your own transport to the airport.\nthe activity of moving goods or gas, oil, etc. from one place to another: the transport of sth Security measures surrounding the transport of export-bound oil have been heightened in the wake of the recent disaster.\nSee also\npublic transport\nsurface transport\nto move goods or gas, oil, etc. from one place to another: We will stick firmly to bilateral agreements when transporting energy to world markets.be transported to/from/by Natural gas can be frozen and liquefied, allowing it to be transported to regions lacking in supplies.\nto take people from one place to another on a bus, train, plane, etc.: be transported to/from/by Passengers were transported from the immobilized jet to a spare aircraft."}