{"id":368484,"name":"transparency","type":"noun","us_sound":"trænˈsper.ən.si","us_link":"../audio/t/transparency.mp3","uk_sound":"trænˈspær.ən.si","uk_link":"../audio/t/uktrans112.mp3","content":"transparency noun\n(SEE THROUGH)\nAdd to word list\nAdd to word list\n[ U ] the characteristic of being easy to see through: The old-fashioned type of plastic lacked transparency.\n[ C ]\n&#160; art\n&#160; specialized a photograph or picture printed on plastic that you can see on a screen by shining a light through it\nSMART Vocabulary: related words and phrases\nTransparent\nclear\ncrystal\ncrystal clear idiom\ncrystalline\ndensely\ndiaphanous\ndiaphanously\nfilminess\nfilmy\nhyaline\nimpenetrable\nlimpid\nliquid\nopacity\nopaquely\npellucid\ntranslucency\ntranslucent\ntranslucently\ntransparent\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysics: optics, microscopy & lasers\ntransparency noun\n(OPEN)\n[ U ] the quality of being done in an open way without secrets: We want more transparency in government.\nSMART Vocabulary: related words and phrases\nHonesty, openness & sincerity\nabove board\nanti-corruption\nartless\nartlessly\nartlessness\nearnest\nhonestly\nhonourably\nin\nin all honesty/seriousness/truthfulness idiom\nin good faith idiom\nintegrity\nsincerely\nsincerity\nskinny\nspotless\nsqueaky-clean\nstainless\nthe straight and narrow idiom\nupright\nSee more results »\nAdd to word list\nAdd to word list\nthe quality of being easy to see through: [ U ] This plastic has the transparency of glass.\nA transparency is a picture you can show on a screen: [ C ] They used transparencies to show pages of the new book.\nAdd to word list\nAdd to word list\n[ U ] a situation in which business and financial activities are done in an open way without secrets, so that people can trust that they are fair and honest: We need to strike balance between the need for transparency and respect for individual privacy. Using personal accounts to conduct city business reduces the transparency of the public process. The Treasury suggested a greater role for independent auditors to increase transparency and accountability. Our goal is to make sure that union leaders operate with the utmost degree of transparency. financial/market/corporate transparencymore/greater/improved transparency Consumer groups are backing demands for more transparency in car-hire pricing.transparency in/on sth We need greater transparency in the market after last year's scandals.a lack/shortage of transparency Concerns have been raised about a lack of transparency regarding the company's healthcare and pension liabilities. promote/create/ensure transparency Compare\nopacity\n[ C ] a thin piece of clear plastic with writing or drawing on it that you can show on a wall or screen using an overhead projector: colour transparencies See also\nacetate"}