{"id":368130,"name":"transferable","type":"adjective","us_sound":"trænsˈfɝː.ə.bəl","us_link":"../audio/t/ustrade022.mp3","uk_sound":"trænsˈfɜː.rə.bəl","uk_link":"../audio/t/uktrans004.mp3","content":"Add to word list\nAdd to word list\nable to be used or legally owned by someone else: The tickets were marked \"not transferable\". These service plans are all fully transferable to subsequent owners. Parental leave should be transferable between partners.\nthat can be used in a different situation, or for a different purpose: Students gain transferable skills, the school says. Researchers will get advice on how to make their scientific work relevant and easily transferable to industry.\n(of a disease) that can be passed from one person or animal to another: There are some diseases that are transferable between humans and animals.\nMore examplesFewer examplesPrizes are not transferable except to a surviving spouse.They are showing their support for marriage by offering a transferable personal tax allowance exclusively to married couples with young children.In some cases, workers have transferable skills. They can, for example, use computers with ease. Anthrax is not easily transferable.\nSMART Vocabulary: related words and phrases\nTickets\naccommodation\napex\nboarding pass\ncoach class\ne-ticket\neconomy class\nhalf\nhall pass\npass\nrain check\nreturn fare\nround fare\nround-trip ticket\nseason ticket\nsingle\nstandby\nsupersaver\nticketing\nticketless\ntimed ticket\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGiving, providing and supplying\nUseful or advantageous\nPassing on illness & causing disease\nSee\ntransfer\nAdd to word list\nAdd to word list\nable to be moved from one place or situation to another: The file is not transferable to a disk or to another computer.\nsuitable for different situations or uses: transferable to sth We are sure this approach is transferable to all levels of the company.\nallowed to become legally the property of another person: Prizes are not transferable except to a surviving spouse. Shares must be freely transferable."}