{"id":368566,"name":"transportation","type":"noun","us_sound":"ˌtræn.spɚˈteɪ.ʃən","us_link":"../audio/t/transportation.mp3","uk_sound":"ˌtræn.spɔːˈteɪ.ʃən","uk_link":"../audio/t/uktrans122.mp3","content":"Add to word list\nAdd to word list\nB2 the movement of people or goods from one place to another: the safe transportation of used nuclear fuel In the past, British convicts could be sentenced to transportation (to Australia).\nB1 US (UK transport) a vehicle or system of vehicles, such as buses, trains, etc. for getting from one place to another: Bicycles are a cheap and efficient form/means of transportation.\nMore examplesFewer examplesIt's an ecologically friendly means of transportation.We need to find some other means of transportation.The transportation of live animals is a controversial issue.\nSMART Vocabulary: related words and phrases\nTransferring and transporting objects\nbear\nbearer\nbike\nborne\nbring\nbudge\ncall for someone\ncarry\nchauffeur\nconvey\nhump\nimport\npayload\npickup\nportable\nportage\npost-delivery\nput something/someone down\ntransplant\ntruck\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRoad vehicles in general\nAdd to word list\nAdd to word list\nUS (UK transport) a system of vehicles, for example buses, trains, and aircraft, for getting from one place to another: New legislation does little to solve the state's transportation problems and puts other crucial services at risk. The plan provided $850 million for transportation in 2008-09 and $900 million in 2009-10. Thanks to diverse forms of transportation and communication, the global economy is now open to trade and investment in a way that was not possible before.a mode/means/form of transportation Hydrogen fuel-cell vehicles promise to be the cleanest mode of transportation. transportation services/systems/networks a transportation plan/program/project transportation companies/industries transportation departments/directors/officials transportation costs/funding state/regional/local transportation free/cheap transportation\nthe activity of moving goods or gas, oil, etc. from one place to another: the transportation of sth Disclosure of the transportation of hazardous waste emerged after documents were leaked. See also\npublic transportation"}