{"id":368180,"name":"transform","type":"verb","us_sound":"trænsˈfɔːrm","us_link":"../audio/t/transform.mp3","uk_sound":"trænsˈfɔːm","uk_link":"../audio/t/uktrans009.mp3","content":"Add to word list\nAdd to word list\nB2 to change completely the appearance or character of something or someone, especially so that that thing or person is improved: The reorganization will transform the entertainment industry. the power of art to transform experience Whenever a camera was pointed at her, Marilyn would instantly transform herself into a radiant star.\nThesaurus: synonyms, antonyms, and examples\nto make differentchangeShe'll always be like that - you can't change her.alterWe've had to alter our plans.varyTry to vary the children's diet a little.convertWe're going to convert the spare bedroom into an office.turn intoThere are plans to turn his latest book into a film.transformThe riverside area has been transformed into a shopping and sports complex.\nSee more results »\nMore examplesFewer examplesThe scheme would transform the park into a tourist mecca.The new haircut completely transformed her.The discovery of anaesthesia transformed medical surgery.Since getting that job, he has been a transformed character.The growth of the textile industry transformed the area.\nSMART Vocabulary: related words and phrases\nChanging\nabout-face\nabout-turn\nalterable\naltered\nalternate\ndisturb\ndrip\nmeta\nmetamorphose\nmodulate\nmodulation\nmorph\nmove on\npervert\nrewrite\nsanitization\nsemi-domesticated\nshake someone out of something\nshake someone up\nstead\nSee more results »\nAdd to word list\nAdd to word list\nto change completely the appearance or character of something or someone: Computers have transformed the way work is done. Salinas dramatically transformed the country’s economy.\nAdd to word list\nAdd to word list\nto change completely the character or appearance of something in order to improve it: Smart metropolitan developments have transformed former industrial areas in cities such as Birmingham and Manchester. Social and political changes are transforming the way people think about social, economic, and environmental problems.transform sth/yourself into sth Her strategic vision transformed an unglamourous supermarket chain into a retail giant with sales of £46 bn.be transformed into/by/from sth Entire apartment blocks are being transformed into subsidised accommodation for young people.transform a company/business/organization Performance incentives transformed the organization and its culture.transform a country/market(place)/product Market reforms have helped to transform China into one of the great centres of globalization.\nto change the physical or chemical properties of a substance in order to make something else: transform sth into sth New forms of iron ore can be transformed into steel without the need for blast furnaces."}