{"id":368128,"name":"transfer","type":"verb","us_sound":"ˈtræns.fɝː","us_link":"../audio/t/transfer.mp3","uk_sound":"trænsˈfɜːr","uk_link":"../audio/t/uktrans003.mp3","content":"Add to word list\nAdd to word list\nB1 [ T ] to move someone or something from one place, vehicle, person, or group to another: He has been transferred to a psychiatric hospital. She transferred her gun from its shoulder holster to her handbag. We were transferred from one bus into another. Police are investigating how £20 million was illegally transferred from/out of the trust's bank account. The aim is to transfer power/control/responsibility to self-governing regional councils.\nto arrange for someone to answer phone calls received on one telephone on another telephone: I'll be upstairs, so could you transfer my phone calls up there, please?\nB2 [ I or T, usually + adv/prep ] to change to a different job, team, place of work, etc., or to make someone do this: After a year he transferred to University College, Dublin. My employer wanted to transfer me to another department. Some very high-profile players have transferred to clubs abroad. He threatened to give up playing if his club didn't transfer him (= sell him to another team).\n[ T ] to make something the legal property of another person: She transferred the house to her daughter before she died.\nMore examplesFewer examplesThe new government's policy is to transfer state industries from the public sector to the private sector.It was his instinct for self-preservation that led him to abandon his former friends and transfer his allegiance to the new rulers.I transferred the mixture to an oven-proof dish.She has transferred her affection to someone else now.He transferred to the Paris branch in May.\nSMART Vocabulary: related words and phrases\nTransferring and transporting objects\nbear\nbearer\nbike\nborne\nbring\nbudge\ncall for someone\ncarry\nchauffeur\nconvey\nhump\nimport\npayload\npickup\nportable\nportage\npost-delivery\nput something/someone down\ntransplant\ntruck\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChanging homes & moving\nCommunications - by telephone\nPromoting staff\nInheriting & bequeathing\nRelated word\ntransferable\ntransfer noun\n(MOVE/CHANGE)\nB2 the movement of something or someone from one place, position, etc. to another: the transfer of information Black's transfer to the Austin office came as a shock his colleagues. The official transfer of ownership will take a few days to complete.\nMore examplesFewer examplesHis transfer to Liverpool hit the headlines.Any transfer of cash must be registered.The transfer of responsibility to our department means a heavier workload.\nSMART Vocabulary: related words and phrases\nPromoting staff\naggrandizement\nanointment\nascend\nascension\ncareer-limiting\nelevation\nexalt\nfast track\nfree transfer\nglass cliff\nhand off\npromote\npromotion\nreinstall\nreinstallation\nrelegate\nsecondment\nsubordinate\nwilderness\nwilderness years idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTransferring and transporting objects\ntransfer noun\n(SPORTS)\n[ C ] a player who has moved from one sports team to another: He came to the team as a transfer from Tottenham.\nSMART Vocabulary: related words and phrases\nCompetitors & participants in sports & games\nback four\nballer\nballplayer\nbase jumper\nbenchwarmer\nchallenger\njumper\nkeeper\nlogroller\nlong-jumper\nlongboarder\nmajor league\nmid-table\nracer\nretire\ntrampolinist\ntrialist\ntriathlete\ntriple jumper\ntriple threat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPromoting staff\ntransfer noun\n(TRANSPORT)\n[ C ] transport provided between two places, for example between an airport and hotel: The price includes flight, hotel and all transfers.\nSMART Vocabulary: related words and phrases\nTravelling\naround Robin Hood's barn idiom\nbackpack\nbag drop\nbourne\nbum\nbum around\ncommunication\ncommuting\nconnection\nhitch\nmove\nnegotiate\nRobin Hood\nshuttle\nsuper-commuting\ntaken\ntour\ntransoceanic\nvisa\nwell travelled\nSee more results »\ntransfer noun\n(TRAVEL TICKET)\n[ C ] US a ticket that allows a passenger to change routes or to change from one bus or train to another\nSMART Vocabulary: related words and phrases\nTickets\naccommodation\napex\nboarding pass\ncoach class\ne-ticket\nhalf\nhall pass\npass\nrain check\nreturn fare\nreturn ticket\nround fare\nround-trip ticket\nseason ticket\nsingle\nstandby\nsupersaver\nticketing\nticketless\ntimed ticket\nSee more results »\ntransfer noun\n(PATTERN)\n[ C ] a picture or pattern that can be attached to a surface by pressing it against the surface and then rubbing or heating it: The kids bought transfers and ironed them onto their T-shirts. Compare\ndecal mainly US\nSMART Vocabulary: related words and phrases\nPictures\n-scape\nabstract\naquatint\nautostereogram\nballoon\ncanvas\ncaricature\ngraphic arts\ngraphic novel\nhalo\nhellscape\nidentikit\npastel\npencil\nposter\nraster\nrehang\nscreen print\nshade\nsketch\nSee more results »\nAdd to word list\nAdd to word list\nto move from one place, person, or position to another, or to cause someone or something to move: [ I ] She studied for two years at Smith College, then transferred to the University of Chicago. [ T ] Transfer your weight to your front foot as you swing.\nWhen property is transferred to someone, legal ownership is changed from one person to another: [ T ] Franklin transferred the car to his brother. transferable adjective us/trænsˈfɜr·ə·bəl/\nPrizes are not transferable except to a surviving spouse.\na move from one place, person, or position to another : [ C ] I got my money through an electronic transfer into my account.\nAdd to word list\nAdd to word list\n[ T ] to move someone or something from one place to another: transfer sb/sth to sth The company is to transfer 1500 jobs to India by the end of the year. Anyone transferring a pension from one company to another could be hit by early exit penalties. The idea is to transfer all the firm's operational business to the web.\n[ I or T ]\n&#160; WORKPLACE to change to a different job, team, place of work, or situation, or to make someone do this: transfer to sth A small number of employees will be offered a chance to transfer to California.transfer sb to sth The manager transferred him to another store.transfer between sth You can transfer between ISA providers during the tax year.\n[ T ]\n&#160; BANKING, FINANCE to move money from one account to another: transfer sth to/into sth The money will be transferred into your bank account. He opened an instant access account and transferred his savings.\n[ T ]\n&#160; IT to move data from one computer, system, etc. to another: transfer sth to sth All forms have been transferred to disk.\n[ T ]\n&#160; LAW to make something the legal property of another person: transfer sth to sb Married couples do not have to pay this tax if property is transferred from one to the other after death.\n[ T ]\n&#160; COMMUNICATIONS to pass a phone call from one phone to another: transfer sb to sb Please hold while I transfer you to my supervisor.\n[ U ] the process of moving someone or something from one place to another: Very little of the bank's business will be affected by the parent group's transfer of jobs to Asia. Technical problems were delaying the money transfer.\n[ C ] an occasion when someone or something moves from one place to another: Many merchants who prefer electronic transfers to dealing with the paper checks. This account requires 14 days' notice for transfers out. He loved living there but had to sell because of a job transfer.\n[ U ]\n&#160; LAW the act of making something the legal property of another person: You will need to pay a solicitor to handle the transfer of ownership of the property from the seller to you.\nSee also\nbalance transfer\nbank transfer\nblank transfer\nbook transfer\ncable transfer\ncapital transfer tax\ncredit transfer\ndeed of transfer\nfile transfer\ntelegraphic transfer\nView all\nwireless transfer"}