{"id":368281,"name":"transit","type":"noun","us_sound":"ˈtræn.zɪt","us_link":"../audio/t/transit.mp3","uk_sound":"ˈtræn.zɪt","uk_link":"../audio/t/uktrans020.mp3","content":"Add to word list\nAdd to word list\nthe movement of goods or people from one place to another: in transit It is possible to make an insurance claim for any goods lost or damaged in transit. The question is whether road transit is cheaper than rail.rapid-transit We booked tickets on the rapid-transit train.\nSMART Vocabulary: related words and phrases\nTransferring and transporting objects\nbear\nbearer\nbike\nbike rack\nborne\nbring\nbudge\ncall for someone\nchauffeur\nconvey\nhump\nimport\npickup\nportable\nportage\npost-delivery\nput something/someone down\ntransplant\ntransportation\ntruck\nSee more results »\nto pass through or across a place, an area, or a country on the way to somewhere else: transit through Millions of passengers transit through Dubai airport every year. We assume that mammoths habitually transited areas colder than many other creatures could tolerate.\nastronomy\n&#160; specialized (of a planet or other object in space) to pass across another heavenly body (= a planet, star, moon, etc.) or a meridian (= an imaginary line or circle passing through the poles): The course offers skilled amateur astronomers the opportunity to help in the search for planets transiting stars. Astronomers are searching for possible signs of a planet transiting across the distant Sun's face.\nin astrology, to move towards or pass across a particular star sign: We are transiting into the sign of Aquarius, the sign of the water-carrier. Neptune will transit Pisces for a short period between April 4 and August 5 and this may affect your emotional balance.\nMore examplesFewer examplesBefore booking your flights, make sure to check the entry requirements with the Consulate of the country or countries being visited or transited through.Many drug smugglers get caught when transiting through an airport.Franco had banned males over 18 from transiting through Spain.They are also known as \"transiting planets\" because their paths carry them directly across the surface of their suns. The spacecraft was designed to study the physics of distant stars and to detect any transiting planets while doing so.Investors are taking a risk this year as Pluto transits its Sagittarian Sun.\nSMART Vocabulary: related words and phrases\nCrossing and moving through\nbash through (something)\nbreak\nbreak through something\ncriss-cross\ncrossable\ncrossed\ncut\nford\npenetrable\npenetrate\npenetration\npenetrative\npercolate\npierce\nrip\nrip through something\nscissor\nspan\nstraddle\nuncrossed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAstronomy\nAstrology\na brand name for a type of road vehicle used especially for carrying goods: He was seen driving a white Transit van near Leeds.\nSMART Vocabulary: related words and phrases\nTrucks, vans & caravans\narmoured car\narticulated lorry\nbakkie\nbin lorry\nbowser\nbreakdown truck\ncamper\ncaravan\nCaterpillar track\ndumper\nJCB\ntender\ntipper\ntrucking\nute\nutility truck\nutility vehicle\nUTV\nvan life\nWinnebago\nSee more results »\nAdd to word list\nAdd to word list\nthe process of moving, or the movement of goods or people from one place to another: Our boxes are in transit and should arrive tomorrow.\nAdd to word list\nAdd to word list\n[ U ]\n&#160; TRANSPORT\n&#160; US a system of vehicles, for example, buses, trains, and aircraft, for getting from one place to another: Prompt action is needed to enhance the region's transportation network, including highways and transit. Using public transit could save the average two-adult household $6,251 each year, according to a recent study. a transit system/service/network a transit agency/authority transit funding/subsidies\n[ S or U ] the activity or process of transporting goods or materials from one place to another: transit of sth Further threats have been made to disrupt the transit of Russian gas to Europe. transit pipelines\nin transit\ngoods or people that are in transit are being transported from one place to another: be damaged/lost in transit Some of the equipment was damaged in transit.\nSee also\nmass transit\nstoppage in transit"}