{"id":368095,"name":"transect","type":"verb","us_sound":"trænˈsekt","us_link":"../audio/t/cdo0318ustran5162.mp3","uk_sound":"trænˈsekt","uk_link":"../audio/t/cdo0318uktran1451.mp3","content":"Add to word list\nAdd to word list\nto cut across something; to divide something by cutting it: The surgeon accidentally transected the right renal artery during the procedure, said the family's lawyer.\nMore examplesFewer examples No contraction or retraction is seen when a vein is transected. After 4 days, the average number of mitotic figures per section was 90% lower in transected nerves than in the uncut control nerves.They noted that Acadian cleavage also typically transects Silurian rocks in the Lake District.The trachea was transected above the tumor.\nSMART Vocabulary: related words and phrases\nCutting and stabbing\nabrasion\nbayonet\nbutcher\ncarve\ncarving\nchisel\nchop\nimpaler\nincise\njulienne\nlacerate\nlacerated\nshearing\nsheep shearing\nslash\nslice\nsliced\nslit\nsnip\nspike\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical treatment: surgery\na line or narrow area along or within which measurements are taken, and items counted, etc. in scientific studies: Each transect was walked at a slow pace noting the mammals seen in the vicinity of the path.\nMore examplesFewer examplesThe size of the list increased when they began collecting along seven transects, or imaginary lines, drawn from the shoreline of the Keys several miles into the ocean. What he envisioned was a colossal version of an ecological transect - a standard means of sampling an ecosystem, in which a scientist tallies plants and animals along a straight path. This sample transect went through forest, farmland and woodland, and also through five small villages.Along the whole transect 7622 individual ants were collected by litter sifting.\nSMART Vocabulary: related words and phrases\nGeography: areas of land in general\nberm\nbioregion\ncircuit\ncurtilage\ndemesne\necoregion\nenclosure\nground\ninterlacustrine\nintermountain\nlandbank\nnon-desert\norography\nparcel\npatch\npocket\nreach\nswathe\nsweep\ntract\nSee more results »"}