{"id":368409,"name":"transmit","type":"verb","us_sound":"trænsˈmɪt","us_link":"../audio/t/transmit.mp3","uk_sound":"trænzˈmɪt","uk_link":"../audio/t/uktrans105.mp3","content":"transmit verb\n(SEND OUT)\nAdd to word list\nAdd to word list\nC1 [ I or T ] to broadcast something, or to send out or carry signals or messages using radio, television, etc.: Radio Seven transmits on 201 medium wave (= uses those particular radio waves to broadcast on). The information is transmitted electronically to the central computer. Department stores use EDI to transmit orders to suppliers. Sound is transmitted from the eardrum to the sound-sensitive cells in the ear by means of a bridge of three tiny bones.\nMore examplesFewer examplesInstructions were transmitted to the pilots through their headphones.The programmes were being transmitted from illegal radio stations.His broadcasts were transmitted late at night.In some call centres, operators use four computer screens to gather and transmit information to police or fire/rescue units.RFID tags are tiny devices that transmit information about the objects on which they reside.\nSMART Vocabulary: related words and phrases\nBroadcasting in general\nairplay\nairtime\nairwaves\naudio described\naudio description\ncarry\ncommentary box\nheadline\nhost\ninterchannel\nlive stream\nlocation\nmistune\nproduce\nserialize\nshowrunner\nslow motion\nstation\nstation break\nsubtitled\nSee more results »\ntransmit verb\n(PASS)\nC2 [ T ] to pass a disease from one person or animal to another: COVID-19 is transmitted through droplets of saliva or discharge from the nose when an infected person coughs or sneezes. Some diseases are transmitted from one generation to the next. Other diseases, such as hepatitis, can be transmitted by blood. a sexually transmitted disease\n[ T ] to pass a particular feeling from one person to another or others, or to an animal: Somehow your panic and fear transmits itself to the horse that you're riding. That tension and sense of antipication will inevitably be transmitted to the team. I'm transmitting my feelings through music.\nMore examplesFewer examplesCholera is transmitted through contaminated water.Some types of the anopheles mosquito transmit malaria to humans. He transmits that joyous feeling right through the TV screen.The captain's fighting spirit transmitted itself to England's bowlers.There are socially transmitted patterns which dominate the feelings, thought and behavior of individuals in all human communities.\nSMART Vocabulary: related words and phrases\nPassing on illness & causing disease\naerosolize\ncatching\ncommunicability\ncommunity transmission\ncontact tracer\ncontact tracing\nepidemic\nharbour\ninfect\ninfected\nnon-communicable\nnon-infected\nnon-infectious\nnoncarrier\nnoncontagious\ntransferable\ntransmissibility\ntransmissible\ntransmittable\nunhygienic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunicating & keeping in touch\nAdd to word list\nAdd to word list\nto send or give something: [ T ] Germs transmit disease. [ I ] To avoid delay, transmit by fax.\nAdd to word list\nAdd to word list\n[ I or T ]\n&#160; COMMUNICATIONS, IT to send out electrical signals using a radio, television, or computer network: transmit data/information Bluetooth chips allow mobile phone users to transmit data over short distances to other mobile phones.transmit a signal/code/message Voice over Internet Protocol transmits messages in small data packets.be transmitted to sb/sth The company's in-house television station is transmitted to handheld devices owned by its employees.be transmitted digitally/electronically Orders may be transmitted electronically from or to the Floor of the Exchange.\n[ T ] to send something to another person or place: transmit sth to sb Your bank will transmit funds by wire to our central bank in New York. be transmitted to sb/sth Tender offer materials that are transmitted to security holders must include the information required by paragraph (d)(1) of this section.\n[ T ] to broadcast a programme on television, radio, or the internet: The BBC didn't transmit the documentary again, due to its controversial content.\n[ T ] to cause or spread a disease so that a person or group of people is infected: be transmitted to sb Scientists say the disease is transmitted to humans by eating infected beef.be transmitted by sth/sb Malaria is transmitted by mosquitoes from human to human.\n[ T ] to communicate information, knowledge, beliefs, etc. to others: Training appears to be an effective way to transmit information about diversity and its importance The company uses the system of professional mentorship in order to transmit family values."}