{"id":368317,"name":"translate","type":"verb","us_sound":"trænsˈleɪt","us_link":"../audio/t/eus74608.mp3","uk_sound":"trænzˈleɪt","uk_link":"../audio/t/uktrans027.mp3","content":"Add to word list\nAdd to word list\nB1 to change words into a different language: We were asked to translate a list of sentences.translate from something into something She works for the UN, translating from English into French. Compare\ninterpret (BETWEEN LANGUAGES)\nC2 to change something into a new form, especially to turn a plan into something real: translate into So how does this theory translate into practical policy?translate well to The ways of working that he had learned at college did not translate well (= were not suitable) to the world of business. translate something as something\nto decide that words, behaviour, or actions mean a particular thing: He mumbled something which I translated as agreement.\nSee more\nMore examplesFewer examplesYou'll lose marks if you translate too literally.It is a difficult passage, but just translate it as best you can.Her novels have been translated into sixteen languages.It can be very difficult to translate idioms.\nSMART Vocabulary: related words and phrases\nUsing other languages\nAnglocentric\nAnglocentrism\nbilingual education\nbilingualism\nbilinguality\ninterpret\nmistranslate\nmistranslation\nmonolingual\nmother tongue\nmultilingually\nnatively\nnon-native\nrender\nrendering\ntarget language\ntranslator\ntransliterate\ntrilingual\nword for word idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChange and changes\nAdd to word list\nAdd to word list\nto change writing or speech from one language into another: [ I ] Poetry does not translate easily.\nIf you translate an activity, you change it into a new form or condition: [ I ] The ability to talk clearly does not automatically translate into the ability to write clearly. translation noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/trænsˈleɪ·ʃən/\n[ C ] I do translations at international meetings. translator noun [ C ] us\nYour browser doesn't support HTML5 audio\n/trænsˈleɪ·t̬ər, ˈtræns·leɪ·t̬ər/\nHe is a translator at the UN.\nAdd to word list\nAdd to word list\n[ I or T ] to change something into a different form, or to be changed in this way: be translated into sth An organization's \"mission statement\" is typically translated into a set of goals and measures which are then passed down to individual departments.translate into sth Higher R&amp;D spending does not always translate into competitive advantage.translate sth into sth The Purchase Funnel Assessment assesses how effectively a brand translates awareness into purchases and retention.\n[ I or T ] to change the words of one language into the words in another language that have the same meaning: Finding interpreters who can translate directly from Estonian to Portuguese is almost impossible.translate sth into sth You can't just translate an English website into Spanish and assume it will still be effective.be translated into sth The book has been translated into more than twenty languages.\n[ T ]\n&#160; FINANCE, ACCOUNTING if an amount in one currency is translated into another currency, its value is given in the other currency: be translated into sth Foreign income is translated into U.S. dollars at the average exchange rate for the tax year in which the transactions are conducted."}