{"id":368184,"name":"transformation","type":"noun","us_sound":"ˌtræns.fɚˈmeɪ.ʃən","us_link":"../audio/t/transformation.mp3","uk_sound":"ˌtræns.fəˈmeɪ.ʃən","uk_link":"../audio/t/uktrans010.mp3","content":"Add to word list\nAdd to word list\nC1 a complete change in the appearance or character of something or someone, especially so that that thing or person is improved: Local people have mixed feelings about the planned transformation of their town into a regional capital. I'd never seen Jose in a tuxedo before - it was quite a transformation.\nMore examplesFewer examplesThere's been a transformation in Carl since he started going out with Annie.Have you seen the transformation of our garden?The internet has led to a transformation in shopping habits.\nSMART Vocabulary: related words and phrases\nChange and changes\nadjustment\nalteration\nanti-evolutionism\nbe ahead of the curve idiom\nblip\nevolutionism\nflatten\nflip-flop\nfluctuation\ngradation\ngyrate\nreinterpretation\nretransformation\nreversal\nreversion\nrevolution\nuntick\nvariation\nvicissitudes\nyouthquake\nSee more results »\nAdd to word list\nAdd to word list\na complete change in the appearance or character of something or someone: [ C ] This plan means a complete transformation of our organization.\nbiology Transformation is also a permanent change in a cell that results when DNA comes from a different type of cell.\nAdd to word list\nAdd to word list\nthe process of changing completely the character or appearance of something in order to improve it: Thanks to senior management's commitment to modifying planning infrastructures and processs, the company's transformation continues.transformation of sth We're in the middle of a huge transformation of the way deforestation takes place in Amazonia. Economic development is often accompanied by a process of transformation in corporate governance. economic/industrial/organizational transformation transformation processes/programs a complete/major/dramatic transformationtransformation from/in/into sth Rapid advances in information technologies are central to transformations in local and global markets.undergo/go through a transformation Many small businesses have undergone a transformation from a delivery-oriented approach to a strategy of innovation.bring about/accomplish/make a transformation Do organizations need a crisis in order to make successful transformations?transformation begins/takes place/occurs The organization's transformation occurred largely through HR strategic initiatives and cultural change.\nthe process of changing the physical or chemical properties of a substance in order to make or produce something else: transformation into sth At the state's ethanol plant crops undergo a two-day transformation into auto fuel."}