{"id":368286,"name":"transition","type":"noun","us_sound":"trænˈzɪʃ.ən","us_link":"../audio/t/transition.mp3","uk_sound":"trænˈzɪʃ.ən","uk_link":"../audio/t/uktrans021.mp3","content":"Add to word list\nAdd to word list\nC2 a change from one form or type to another, or the process by which this happens: The health-care system is in transition at the moment. There will be an interim government to oversee the transition to democracy.\nchanges, which may be social, legal, or medical, that lead to someone living their life as a person of a different gender to the one they were said to have at birth: She began her transition from male to female almost seven years ago.\nin basketball and other sports, the act of changing from playing on defence to offence, or from offence to defence, after a player scores or when there is a change in possession, including running to the correct new positions on the court (= playing area): After Delmon grabbed the rebound, the team made a quick transition up the court.\nMore examplesFewer examplesThe transition from a totalitarian state to a free country will be long and slow.The transition from boyhood to manhood can be a confusing period.There will be a transition period before Jenny takes over as boss.\nSMART Vocabulary: related words and phrases\nChange and changes\nadjustment\nalteration\nanti-evolutionism\nbe ahead of the curve idiom\nblip\nevolutionism\nflatten\nflip-flop\nfluctuation\ngradation\ngyrate\nreinterpretation\nretransformation\nreversal\nreversion\nrevolution\nuntick\nvariation\nvicissitudes\nyouthquake\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBasketball, netball & volleyball\n[ I or T ] mainly US to change, or make someone or something change, from one form or situation to another: Some National Guard members experienced financial difficulties when they transitioned from state to federal control. Texas schools have traditionally transitioned students from Spanish to English in elementary school.\n[ I or T ] If someone transitions, they make changes, which may be social, legal, or medical, that lead to them living as a person of a different gender to the one they were said to have at birth: Louise transitioned from male to female almost 20 years ago. It wasn't easy transitioning gender in the military.\n[ I ] in basketball and other sports, to change from playing on defence to offence, or from offence to defence, after a player scores or when there is a change in possession, for example by running to the correct new positions on the court (= playing area): After scoring, the team transitioned too slowly and left a lane open for Mowry to score an easy layup.\nMore examplesFewer examplesHe said that they had transitioned many people off welfare very successfully.The state this year transitioned to a different type of standardized test of educational achievement. He recalled the turbulent years when the civil rights movement transitioned into demands for Black Power.\nSMART Vocabulary: related words and phrases\nChanging\nabout-face\nabout-turn\nalterable\naltered\nalternate\ndisturb\ndrip\nmeta\nmetamorphose\nmodulate\nmodulation\nmorph\nmove on\npervert\nrewrite\nsanitization\nsemi-domesticated\nshake someone out of something\nshake someone up\nstead\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBasketball, netball & volleyball\nAdd to word list\nAdd to word list\nthe process of changing, or a change from one form or condition to another: [ U ] It was a neighborhood in transition from Jewish to Italian with a sprinkling of Irish. [ C ] Retirement is a big transition.\nliterature, music A transition is also a link between ideas or sections in a work of literature or music. transitional adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/trænˈzɪʃ·ə·nəl/\nWe’re in a transitional period right now, and no one knows what to expect.\nAdd to word list\nAdd to word list\na process of changing from one system, method, etc. to another: Following changes in taxation laws, the Internal Revenue Service has promised to issue guidelines on how to deal with the transition.transition from sth (to sth) Government ministers believe that a gentler approach is needed during the transition from a government-led economy to one where the private sector plays the dominant role. a transition period/phase economic/political transitionthe transition from sth Financial support, especially for mothers making the transition from welfare to work situations, is critical.the transition to sth The transition to the euro took place in 1999.make a transition (from/to sth) The region is slowly making a transition to a more knowledge-based economy.a smooth/difficult/tough transition Both sides need to work together in order to ensure a smooth transition of power.manage/achieve/complete a transition How do you plan to complete a transition that is so far-reaching in terms of its targets without compromising the corporate culture?a period/state of transition Our economy is in a period of transition .\nin transition\nin the process of changing or developing: Emission reduction schemes in economies in transition have increased by 50%."}