{"id":368399,"name":"transmission","type":"noun","us_sound":"trænˈsmɪʃ.ən","us_link":"../audio/t/eus75974.mp3","uk_sound":"trænzˈmɪʃ.ən","uk_link":"../audio/t/uktrans104.mp3","content":"transmission noun\n(SENDING OUT)\nAdd to word list\nAdd to word list\nC2 [ C or U ] the process of broadcasting or sending out something by radio or television, on the internet, etc., or something that is broadcast or sent out : Broadband transmission has speeded up access to these sites. We rely on high-speed transmission of data. We apologize for the interruption to our transmissions this afternoon.\nMore examplesFewer examplesThe microphone converts acoustic waves to electrical signals for transmission.Satellite transmissions of medical data will enable doctors at the two institutions to do long-distance consultations.TV transmissions were interrupted for the announcement of the princess's death.\nSMART Vocabulary: related words and phrases\nBroadcasting in general\nairplay\nairtime\nairwaves\naudio described\naudio description\ncarry\ncommentary box\nheadline\nhost\ninterchannel\nlive stream\nlocation\nmistune\nproduce\nserialize\nshowrunner\nslow motion\nstation\nstation break\nsubtitled\nSee more results »\ntransmission noun\n(PASSING)\nC2 [ U ] the process of passing something from one person or place to another: Communication is the sharing of meaning through the transmission of information. The guidelines focus on preventing the transmission of infectious animal diseases to humans. The drug AZT is used to prevent transmission of HIV from mother to child. Regular hand-washing is one of the main ways to help prevent the transmission of coronavirus. See also\ncommunity transmission\nMore examplesFewer examplesThey studied the neurotransmitter systems involved in the transmission of information between the different brain regions.Mosquitoes are the primary means of transmission of the virus between birds and humans.Jails are places where transmission of infectious diseases can occur, because of the nature of the population. They're in enclosed spaces.These restrictions are in place to reduce the risk of transmission of coronavirus to you or to your baby.\nSMART Vocabulary: related words and phrases\nPassing on illness & causing disease\naerosolize\ncommunicability\ncommunity transmission\ncontact tracer\ncontact tracing\nepidemic\nharbour\ninfect\ninfected\nnon-communicable\nnon-infected\nnon-infectious\nnoncarrier\nnoncontagious\ntransferable\ntransmissibility\ntransmissible\ntransmit\ntransmittable\nunhygienic\nSee more results »\ntransmission noun\n(VEHICLE)\n[ C or U ] the machinery that brings the power produced by the engine to the wheels of a vehicle: automatic transmission The car had a faulty transmission.\nSMART Vocabulary: related words and phrases\nThe engine & engine parts\nair filter\nalternator\nanti-roll\nantifreeze\nbiting point\nbrake\ncam\ncarburation\ncarburettor\nchoke\ndisc brake\ndistributor\ninternal combustion engine\nmanual transmission\nmuffler\nneutral\nsuspension\ntailpipe\ntappet\nwater-cooled\nSee more results »\nAdd to word list\nAdd to word list\nthe act of sending or giving something: [ U ] You can stop the transmission of some diseases by washing your hands often.\nThe transmission in a vehicle is the machinery that moves power from to the engine to the wheels.\nAdd to word list\nAdd to word list\n[ U ] the process of sending something, for example gas or electricity, from one place to another: Large investments are currently required: perhaps $500m a year in electricity generation, and a similar sum in transmission and distribution.transmission of sth The project will upgrade the transmission of electricity into the area. Major transmission lines connecting dams to the West Coast grid still have considerable unused capacity. gas/electricity/power transmission transmission networks/grids/facilities\n[ U ] the process of sending out electrical signals using a radio, television, or computer network: transmission of sth New networks will allow less-expensive transmission of multimedia and interactive services. data transmission\n[ C ] a programme that is broadcast on television or radio, or a message that is broadcast on radio: radio/satellite transmissions\n[ U ] a process by which an illness is spread from one person or thing to another: transmission of sth Water quality plays a crucial role in determining the transmission of disease. See also\nmoney transmission"}