{"id":368726,"name":"trap","type":"noun","us_sound":"træp","us_link":"../audio/t/trap.mp3","uk_sound":"træp","uk_link":"../audio/t/uktrap_001.mp3","content":"trap noun\n(SOMETHING THAT PREVENTS ESCAPE)\nAdd to word list\nAdd to word list\nB2 [ C ] a device or hole for catching animals or people and preventing their escape: The fox got its foot caught in a trap.\nxxmmxx/E+/GettyImages\nB2 [ S ] a dangerous or unpleasant situation which you have got into and from which it is difficult or impossible to escape: The undercover agents went to the rendezvous knowing that it might be a trap. She's too smart to fall into the trap of working without pay.\nMore examplesFewer examplesDon't fall into the trap of thinking you can learn a foreign language without doing any work.His foot was caught in the jaws of the trap.We set a trap and they walked right into it.They put rabbit traps all over the wood.We set traps to try to control the mice.\nSMART Vocabulary: related words and phrases\nHunting & fishing\nangler\nangling\nanti-hunt\nanti-hunter\nanti-hunting\nbarb\nfisher\nfishhook\nfishing line\nfishing rod\nfly fishing\noutcatch\noutfish\noverfishing\npiscatory\npoach\nquarry\nravening\nwhaler\nyoicks\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlotting & trapping\ntrap noun\n(MOUTH)\n[ C ] slang a mouth: Oh, shut your trap (= stop talking) - I don't want to hear it anymore! It's a secret, so keep your trap shut (= don't say anything about it).\nSMART Vocabulary: related words and phrases\nThe mouth & throat\n-throated\nadenoid\nalveolar\nalveolar ridge\nbuccal\nbuccinator\nhard palate\nlabial\nlabiodental\nlaryngeal\nlarynx\nlingual\nmandibular\nsoft palate\ntemporalis\ntensor veli palatini muscle\ntrachea\nuvula\nuvular\nvocal cords\nSee more results »\ntrap noun\n(VEHICLE)\n[ C ] a small, light carriage (= a vehicle pulled by horses, used especially in the past) with two wheels, pulled by one horse: He offered to give his friend a lift in his trap. I was met at the station in a pony and trap and taken to my new employer. The doctor came in a horse and trap in the late 19th century but later had a chauffeur driven car.\nduncan1890/DigitalVision Vectors/GettyImages\nSMART Vocabulary: related words and phrases\nCarriages & carts\nbrougham\nbuggy\ncarriage\ncarryall\nchaise\nchuckwagon\ncoupe\ncovered wagon\ndray\ngig\nhorse-drawn\nhorsebox\nox-drawn\npopemobile\nsedan chair\nstagecoach\nsurrey\ntrishaw\ntuktuk\nwagon\nSee more results »\ntrap noun\n(AMERICAN FOOTBALL)\nsports\n&#160; specialized (also trap play) in American football, a play (= action) in which a defensive player (= one trying to stop the opponents from scoring) is allowed to cross the line of scrimmage (= the line on which the ball is positioned at the beginning of play) and then blocked so that the player carrying the ball can go through the gap: Houston kept gaining big yardage with a trap. They opened a hole for the fullback to make a 23-yard gain on a trap play.\nSMART Vocabulary: related words and phrases\nFootball/soccer\n18-yard box\n2 3 5\n4 3 2 1\n4 4 2\n4 5 1\nfootball pools\nfooty\nformation\nfoul throw\nfour five one\nfour four two\nfour three two one\nreducer\nrelegation zone\nreserve team\nroute one football\nrow Z\nsweeper\ntreble\nwoodwork\nSee more results »\ntrap noun\n(MUSIC)\n[ U ] short for\ntrap music See also\nlike a steel trap\nto catch an animal in a trap: She survived in the wilderness by eating berries and trapping small animals and birds.\nThesaurus: synonyms, antonyms, and examples\nto take a wild or loose animalcatchThe dog got out, but we caught her.netWe netted a ton of fish downstream.trawlCommercial fisheries trawl these waters for cod.trollThey troll for tuna far offshore. lassoThe cowboys learned at a young age how to lasso horses and steers.trapThe turtles are trapped for their flesh.\nSee more results »\nto keep something such as heat or water in one place, especially because it is useful: A greenhouse stays warm because the glass traps the heat of the sun. be trapped\nB2 If someone or something is trapped, that person or thing is unable to move or escape from a place or situation: The two men died when they were trapped in a burning building. Fire officers used cutting equipment to free his legs, which were trapped under a steel beam.figurative Jack left the job after ten years because he was beginning to feel trapped. be trapped into (doing) something\nto be forced or tricked into doing something that you do not want to do: In his book, Holden speculates that Shakespeare was an unfaithful husband who was trapped into marriage. She had been trapped into saying something she did not mean.\nsports\n&#160; specialized to bring a football that is moving or falling through the air under control using your feet: In training, we get players to practise trapping the ball from awkward angles.\nMore examplesFewer examplesShe went to the aid of a man trapped in his car.Firefighters helped to dig out the people trapped in the snowdrift.Rescuers are doing everything that is humanly possible to free the trapped people.Jane is trapped in a joyless marriage.We could hear the moans of someone trapped under the rubble.\nSMART Vocabulary: related words and phrases\nHunting & fishing\nangler\nangling\nanti-hunt\nanti-hunter\nanti-hunting\nbarb\nfisher\nfishhook\nfishing line\nfishing rod\nfly fishing\noutcatch\noutfish\noverfishing\npiscatory\npoach\nquarry\nravening\nwhaler\nyoicks\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nKeeping and storing things\nPlotting & trapping\nCausing somebody to act\nFootball/soccer\ntrap noun [C]\n(DEVICE FOR CATCHING)\nAdd to word list\nAdd to word list\na device or hole for catching and holding things: A bear was caught in the trap.\nA trap is also a bad situation from which it is difficult or impossible to escape: Simply by answering the letter, Robin had fallen into a trap.\ntrap noun [C]\n(MOUTH)\nslang a mouth: Oh, shut your trap! trap verb [ T ] us\nYour browser doesn't support HTML5 audio\n/træp/ -pp-\nMorrison was trapped by the fire."}