{"id":368842,"name":"trauma","type":"noun","us_sound":"ˈtrɑː.mə","us_link":"../audio/t/trauma.mp3","uk_sound":"ˈtrɔː.mə","uk_link":"../audio/t/uktrap_015.mp3","content":"trauma noun [U or C]\n(SHOCK)\nAdd to word list\nAdd to word list\nC2 severe and lasting emotional shock and pain caused by an extremely upsetting experience, or a case of such shock happening: the trauma of marriage breakdown He had psychotherapy to help him deal with his childhood traumas.\nMore examplesFewer examplesChildren exposed to chronic stress or trauma may also have problems with learning, memory and concentration.The two men bonded over their shared traumas.They need a lawyer and they need support for the trauma that they have suffered for the past two months.\nSMART Vocabulary: related words and phrases\nMental illnesses\nad\nadjustment disorder\nage-associated memory impairment\nanhedonia\nanorexia nervosa\nanorexic\nattention deficit hyperactivity disorder\ngeneralized anxiety disorder\nhealth anxiety\nhoard\nhoarder\nhoarding\nmanic depression\nobsessive-compulsive disorder\npsychosis\nsad\nscarred\nself-alienation\nsenility\nsociopathic\nSee more results »\ntrauma noun [U or C]\n(INJURY)\nmedical\n&#160; specialized physical injury, usually caused by an accident or attack, or a case of such injury happening: Central pain syndrome can result from trauma to the brain or spinal cord. to suffer brain/head trauma She was carried off on a stretcher and taken to the trauma centre at the city's Mercy Hospital. Infection in a person recovering from a trauma such as a car accident or severe burns can be as deadly as the incident itself.\nMore examplesFewer examplesYoung people tend to have a better likelihood of recovering from brain trauma.Athletes need educating with respect to the risks of repeated head trauma. Headache can be caused by circulation problems or trauma.She sustained severe head trauma and permanent and irreversible brain damage.Lymphedema can be inheritable or result from a trauma.\nSMART Vocabulary: related words and phrases\nInjuring and injuries\nat-risk\nbe in the wars idiom\nbite\nboo-boo\nbrain damage\ndisable\nharm\ninjure\ninjury\nlesion\nlesional\nreinjure\nreinjury\nscarred\nscathe\nsprain\nstrain\ntwist\nvictim\nwounded\nSee more results »\nAdd to word list\nAdd to word list\nsevere shock caused by an injury: [ U ] She never recovered from the trauma of her mother’s illness. [ U ] The surgeon specialized in trauma (= sudden, severe injury), especially from gunshots. traumatic adjective us\nYour browser doesn't support HTML5 audio\n/trɔˈmæt̬·ɪk, trɑʊ-/\nThe death of someone we love is a traumatic event. traumatize verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈtrɔ·məˌtɑɪz, ˈtrɑʊ-/\nShe was traumatized by the car accident."}