{"id":368847,"name":"traumatically","type":"adverb","us_sound":"trɑːˈmæt̬.ɪ.kəl.i","us_link":"../audio/t/cus02109.mp3","uk_sound":"trɔːˈmæt.ɪ.kəl.i","uk_link":"../audio/t/cuk01164.mp3","content":"traumatically adverb\n(SHOCKINGLY)\nAdd to word list\nAdd to word list\nin a way that causes severe and lasting emotional shock and pain: The tragedy traumatically linked two neighbourhoods at opposite ends of a city. A 50-year marriage is traumatically dissolved by the onset of the wife's Alzheimer's.\nmainly UK informal in a way that upsets or worries someone: Two teenage girls will discover, traumatically, that they are not on the right bus. England, having gone two up against Germany, were traumatically defeated 3-2. See\ntraumatic\nMore examplesFewer examplesThe illness really knocked him down pretty quickly and traumatically.When things happen traumatically, it can sharpen the focus on how you deal with them.My mother's best friend was killed traumatically when she was struck by a drunk driver.At that point I traumatically found out that there was no coffee.\nSMART Vocabulary: related words and phrases\nSaddening, shocking and upsetting\naffecting\nagonizingly\narrogance\nbaleful\nbe cold comfort idiom\ndisrespect\ndistressful\ndistressfully\ndistressing\ndistressingly\nhubris\nhurtful\nhurtfully\nimpiously\nimpiousness\nsuperiority complex\nteary\ntouching\ntouchingly\ntragically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDescribing things that cause fear\ntraumatically adverb\n(INJURE)\nmedical\n&#160; specialized in a way that causes or relates to physical injury by violence or an accident: children traumatically injured by road vehicles repairs to a traumatically fractured bone\nMore examplesFewer examplesIntracranial injury occurs when an external force traumatically injures the brain.During this period, 383 children under 16 were traumatically injured by all-terrain or off-road vehicles.people who die traumatically"}