{"id":368879,"name":"travel","type":"verb","us_sound":"ˈtræv.əl","us_link":"../audio/t/travel.mp3","uk_sound":"ˈtræv.əl","uk_link":"../audio/t/uktrap_019.mp3","content":"travel verb\n(MAKE JOURNEY)\nAdd to word list\nAdd to word list\nA1 [ I or T ] to make a journey, usually over a long distance: Between school and university, she spent a year travelling, mostly in Africa and Asia.travel to something by something I travel to work by train. He travelled over 1,000 miles to be at the wedding.travel the world As a young man he had travelled (= been to many parts of) the world.\n[ I ] If something travels well/badly, it does/does not stay in good condition if it is moved long distances: Some wines don't travel well. travel light\nto make a journey without taking a lot of heavy things with you: I always try to travel light.\nSee more\nMore examplesFewer examplesI like to travel but, then again, I'm very fond of my home.It's often quicker to travel across country and avoid the major roads altogether.Passengers without proper documentation will not be allowed to travel.The elderly travel free on public transport.We like to travel in the autumn when there are fewer tourists.The tragedy is that cultures don't always travel well, and few immigrant groups can sustain their culture over the long term.\nSMART Vocabulary: related words and phrases\nTravelling\naround Robin Hood's barn idiom\nbackpack\nbag drop\nbourne\nbum\nbum around\ncommunication\ncommuting\nconnection\nhitch\nmove\nnegotiate\npublic transport\nRobin Hood\nshuttle\nsuper-commuting\ntaken\ntransoceanic\nvisa\nwell travelled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nVarious qualities of food\ntravel verb\n(MOVE)\nB1 [ I ] to move or go from one place to another: Supersonic planes can travel faster than the speed of sound. With wooden-bat baseball, the ball doesn't travel as far as it does with aluminium bats. Signals at this wavelength can travel easily through buildings. really travel mainly UK informal\nto move very fast: That bike can really travel!\nSee more\nMore examplesFewer examplesThe objects travel in elliptical orbits.In 1947, a pilot flying over the Cascades saw nine metallic flying objects traveling at an estimated 1,200 miles per hour.The elevator traveled smoothly upward.White light separates out into its component wavelengths when traveling through a prism.As the material travels through the winding machine, excess liquid is squeezed out by rollers. Lead dust travels easily from hands to mouth and can't be seen.\nSMART Vocabulary: related words and phrases\nGeneral words for movement\nbetake\nbudge\nbudge up\ncarry\ncirculate\ndad dancing\ngangway\ngone\nkinetic\nkinetic energy\nkinetically\nlibration\nlocomotion\nmotion\npass\nround\nscoot\nseethe\nshove\nslip\nSee more results »\ntravel verb\n(BREAK RULE)\n[ I ] in basketball, to move three or more steps with the ball without dribbling it (= hitting it against the floor repeatedly), which is against the rules: The coach argued to the referee that the player travelled before he took the shot.\nSMART Vocabulary: related words and phrases\nBasketball, netball & volleyball\nairball\nbackboard\nballer\nbasketball\nbeach volleyball\nbrick\ncatch and face idiom\ncharge\ncoast\ndunk\nelbow\nfoul\nfree throw\ninbounds pass\nkorfball\nlay someone up\nlay something in\nnetball\noutrebound\nsquare\nSee more results »\nIdiom\nhave something, will travel\ntravel noun\n(ACTIVITY)\nB1 [ U ] the activity of travelling: air/space travel business travel We share a love of literature, food and travel.travel news I heard on the travel news that there'd been an accident. travels C1 [ plural ]\njourneys: travels in/around a record of her travels in/around the Far East\nSee more\nMore examplesFewer examplesThey offer a 10 percent discount on rail travel for students.The price includes travel and accommodation but meals are extra .His work provided him with the opportunity for a lot of foreign travel.The popular myth is that air travel is more dangerous than travel by car or bus.Passes are available for one month's unlimited travel within Europe.\nSMART Vocabulary: related words and phrases\nJourneys\nadventure\nbreak-journey\ncarpool\ncarpooling\ncircumnavigation\ncommuting\nexpedition\nfield trip\ngrand tour\nhaul\njaunt\njourney\njunket\nlayover\nodyssey\nride\nsail\nseafaring\ntrip\nwanderings\nSee more results »\ntravel noun\n(MOVEMENT OF OBJECT)\n[ U ] the distance, speed, or direction that an object moves or is able to move: The calendar is based on the orbital travel of Earth around the Sun.direction of travel The arrows show the ball's direction of travel. The bicycle's fork has a total travel of about 4 inches.\nMore examplesFewer examplesIt can be difficult to predict the travel of smoke from smouldering fires.The travel of the bullets and blood spatter showed that he was lying on the ground on his side when he was shot.This seemed to prove that light has a finite speed of travel.Striking the ball when the clubhead is already past the lowest point of its travel gives a slight overspin.The actuator then rotates its output shaft to the extremes of its travel.\nSMART Vocabulary: related words and phrases\nGeneral words for movement\nbetake\nbudge\nbudge up\ncarry\ncirculate\ndad dancing\ngangway\ngone\nkinetic\nkinetic energy\nkinetically\nlibration\nlocomotion\nmotion\npass\nround\nscoot\nseethe\nshove\nslip\nSee more results »\nUS describing a sport that is played by organized teams of young people, often involving the best players who travel to play in different parts of the country: Hauptman played travel soccer when he was younger. Jake gave up playing travel baseball so he could play in his hometown with his friends. They're looking for coaches for their girls travel team.\nSMART Vocabulary: related words and phrases\nCompeting in sport\nbring\nbring someone on\nbye\nbye week\ncatchup\nclash\nduel\nexplosive\nfield\nflying start\ngo the distance idiom\nmatch\noutduel\npark the bus idiom\npartner\npartner up\nplay big idiom\nplay sb on idiom\nsquare\nweigh\nSee more results »\nAdd to word list\nAdd to word list\nto go from one place to another on a trip, usually over a long distance: [ I ] The train was traveling (at) about 100 miles an hour. [ T ] I travel long distances as part of my job, so on vacations I like to stay close to home. [ I ] infml We were doing 70 miles an hour, so the guy who whizzed past us must have really been traveling (= going very fast). traveler noun [ C ] (also traveller) us\nYour browser doesn't support HTML5 audio\n/ˈtræv·ə·lər/\nTravelers in a hurry like these self-service machines. Idiom\ntravel light\nthe activity of traveling, usually over a long distance: [ U ] A lot of my travel is business related. [ pl ] I’ve met some pretty interesting people in my travels (= trips).\nAdd to word list\nAdd to word list\nto go from one place to another, especially over a long distance, in a plane, train, car, etc.: The ability to travel easily in and out of the region is a significant factor for professionals doing business here. Due to the increasing costs of travelling abroad, more Americans are choosing to stay closer to home during their vacation. He travels around 200,000 miles a year on business. A delegation of officials will be traveling to New Orleans to lobby for the cash.travel around/across/through somewhere Riding a bike is often the most efficient way to travel around big citiestravel by air/train/car How long does it take to travel by train from Glasgow to London?travel the world/the country/the state She has travelled the world in her work as foreign correspondent.\nto move at a particular speed or over a particular distance: An electric motor powers the car at all speeds, and it can travel 40 miles on batteries alone.travel at 40mph/80kph, etc. A train travelling at 30 mph takes about a mile to bring to a stop.\nthe activity of going from one place to another, especially over a long distance, in a plane, train, car, etc.,: A survey revealed that federal employees were routinely abusing rules regarding business-class travel. He was reimbursed for the cost of travel between his home and workplace. The travel and tourism industry employs more than 187,000 people in North Carolina. Make copies of important travel documents like your passport and itinerary. air/rail/space travel overseas/international/foreign travel business/leisure/holiday travel free/cheap travel travel company/firm/industry travel arrangements/plans travel expenses/coststravel on/in sth Purchase of a smart card entitles you to three days' unlimited travel on the Metro, buses, and trams.travel to/from/between somewhere The Chairman has a constant round of meetings, involving travel to Western Europe and throughout the UK."}