{"id":368997,"name":"treasure","type":"noun","us_sound":"ˈtreʒ.ɚ","us_link":"../audio/t/treasure.mp3","uk_sound":"ˈtreʒ.ər","uk_link":"../audio/t/uktreac011.mp3","content":"treasure noun\n(VALUABLE THINGS)\nAdd to word list\nAdd to word list\nB2 [ U ] very valuable things, usually in the form of a store of precious metals, precious stones, or money: buried treasure Stories about pirates often include a search for buried treasure. When they opened up the tomb they found treasure beyond their wildest dreams. treasures C2 [ plural ]\nvery valuable things, especially pieces of art: art treasures At the time, the painting was considered one of the world's greatest art treasures.\nSee more\nMore examplesFewer examplesTalk of treasure and lost cities had fired their imaginations.X marks the spot where the treasure is buried.He goes round fields and beaches with his metal detector, hoping to find buried treasure.They're diving for sunken treasure.The three men went to the Bahamas, on the trail of a sunken 17th-century galleon full of treasure.\nSMART Vocabulary: related words and phrases\nJewelry\nankle bracelet\nbangle\nbauble\nbe dripping with something idiom\nbutterfly\ncirclet\nclip-on\ncuff\ndrip\nearring\nengagement ring\nfinery\njewelled\njewellery\njewellery box\npendant\nrhinestone\nsignet ring\nsleeper\nsparkler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLarge amounts of money\ntreasure noun\n(PERSON)\n[ C ] mainly UK informal someone who is very helpful and valuable to you: I don't know what I'd have done without Lizzie when I was ill - she was an absolute treasure.\n[ C ] mainly UK old-fashioned informal a friendly way of talking to someone, especially a child: Come on, treasure, let's go and see Granny.\nSMART Vocabulary: related words and phrases\nPeople having good qualities\nadvertisement\naltruist\nangel\nbeatify\nbrick\nbunch\ndear\nenchantress\ngem\njewel\nmensch\nnot be as black as you are painted idiom\nparagon\npoppet\nrough diamond\nsaint\nsalt\nsalt of the earth idiom\nsoftie\nsweetheart\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAffectionate terms of address\nC2 to take great care of something because you love it or consider it very valuable: treasure a memory I will always treasure those memories of my dad.treasured possession This pen that my grandfather gave me is one of my most treasured possessions.\nSMART Vocabulary: related words and phrases\nLoving and in love\nabsence\nabsence makes the heart grow fonder idiom\nadore\nadoring\nadoringly\nadorkable\ndotty\nendearment\never-loving\nfall for someone\nfall in love idiom\ngaga\nlurve\nmadly\nmoon\nmoon over someone/something\npash\nshine\nsteal\nworship\nSee more results »\nAdd to word list\nAdd to word list\ngreat wealth, esp. in the form of a store of gold, silver, precious stones, or money: [ U ] Pirates are said to have buried treasure there.\nA treasure is also anything of great value: [ C ] Jazz is America’s national treasure.\nto take good care of something because you value it highly: I treasure these old snapshots of my grandparents."}