{"id":368962,"name":"tread","type":"verb","us_sound":"tred","us_link":"../audio/t/tread.mp3","uk_sound":"tred","uk_link":"../audio/t/uktreac004.mp3","content":"Add to word list\nAdd to word list\nC2 mainly UK to put your foot on something or to press something down with your foot: tread on I kept treading on his toes when we were dancing.tread in Yuck! Look what I've just trodden in!be trodden into A load of food had been trodden into the carpet.tread grapes Before the days of automation, they used to tread grapes to make wine.\nliterary to walk: He trod heavily and reluctantly up the stairs.tread your weary way I sometimes see him flash past in his sports car as I tread my weary way (= walk in a tired way) to work. tread water\nto float vertically in the water by moving the legs and the arms up and down: I stopped swimming for a moment and trod water, looking back to the beach.\nSee more\nMore examplesFewer examples'Hey, mind!' he said when she trod on his foot.She got badly spiked when one of the runners trod on her heel.He trod heavily and reluctantly up the stairs.I accidentally trod on the dog's foot and it yelped.Mind you don't tread in the mud.\nSMART Vocabulary: related words and phrases\nWalking and walkers\nbring/call something/someone to heel idiom\ncavalcade\nconstitutional\nfoot traffic\nhiker\nhiking\nhoof it idiom\nrace walking\nrambler\nrambling\nretread\nshanks's pony\nsleepwalk\nsleepwalking\ntramp\ntrekking pole\nwalk\nwalkable\nwalkabout\nwalkies\nSee more results »\nIdioms\nbe treading water\ntread carefully/gently/lightly\ntread the boards\ntread noun\n(PATTERN ON TYRE)\n[ C or U ] the pattern of raised lines on a tyre that prevents a vehicle from sliding on the road: The tread on your tyres is very worn.\nyasinguneysu/E+/GettyImages\nSMART Vocabulary: related words and phrases\nThe exterior of vehicles\narticulated\ncab\ncoachwork\ncrumple zone\nfifth wheel\nfinny\nfog light\nfootboard\nfrunk\nhigh beams\nL-plate\nnearside\nrear light\nsidelight\nsunroof\ntailgate\ntire\ntow bar\nturn signal\nwing\nSee more results »\ntread noun\n(STEP)\n[ S ] the sound that your feet make on the ground as you walk: Then I heard someone's tread on the stairs.\n[ S ] the horizontal part of a step on which you put your foot\nSMART Vocabulary: related words and phrases\nSounds made by objects, movement or impact\nbang around\nbong\nburble\nchoo-choo\nchuff\nclick away\nclicker\nclinking\ncrunch\nplop\nresonance\nsplat\nsputter\nsqueak\nswoosh\ntinkly\ntintinnabulation\nunsounded\nwhirr\nwhite noise\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParts of buildings: stairs & lifts\ntread verb [I/T]\n(TAKE STEP)\nAdd to word list\nAdd to word list\nto put the foot down while stepping, or to step on something: [ I ] fig. I hope I haven’t trod on other people’s toes by saying this. Idiom\ntread water\ntread noun\n(PATTERN)\n[ C/U ] the raised pattern on a tire that holds the vehicle to the road as it moves: [ U ] fat tires with knobby tread\ntread noun\n(STEP)\n[ C ] the sound that someone’s feet make in walking: I heard the heavy tread of my father overhead.\n[ C ] A tread is also the horizontal surface on which you put your foot on a step."}