{"id":369020,"name":"treaty","type":"noun","us_sound":"ˈtriː.t̬i","us_link":"../audio/t/treaty.mp3","uk_sound":"ˈtriː.ti","uk_link":"../audio/t/uktreac018.mp3","content":"Add to word list\nAdd to word list\nC2 a written agreement between two or more countries, formally approved and signed by their leaders: a peace treaty the treaty on European union [ + to infinitive ] We've signed/concluded a treaty with neighbouring states to limit emissions of harmful gases. Synonyms\naccord\nagreement (SAME OPINION)\npact\nThesaurus: synonyms, antonyms, and examples\na decision or arrangement between groups or peopleagreementDo we have an agreement?understandingWe had an understanding that the businesses would merge, but never got that in writing.gentleman's agreementHe and his builder have a gentleman's agreement that if there are spare materials left after working on the flat, the builder can take them home.dealDo we have a deal?contractThe basketball player was signed to a multimillion-dollar contract with a new team this week.accordThe leaders of the four countries signed a peace accord.\nSee more results »\nMore examplesFewer examplesThe whole country celebrated the signing of the peace treaty.Both sides in the conflict have agreed to the terms of the peace treaty.The actual signing of the treaty was a downbeat affair without any ceremony.This treaty has been called the anchor of their foreign policy.The treaty was abrogated in 1929.\nSMART Vocabulary: related words and phrases\nInternational relations: international politics & government\naccession\nallied\nAnglo-American\nanti-Stalinist\nbipolar\nconfederacy\nG20\nG7\nGATT\nGeneva Convention\ninternationalism\ninternationalize\nNATO\noccupied\npariah\nthe G8\nthe new world order\nthe North-South divide\nthe World Trade Organization\nWTO\nSee more results »\nAdd to word list\nAdd to word list\npolitics &amp; government a written agreement between two or more countries that is formally approved and signed by their leaders: Under the treaty (= according to the agreement), inspections are required to see if any country is secretly developing nuclear arms.\nAdd to word list\nAdd to word list\nGOVERNMENT, LAW an agreement between two or more countries, formally approved by their governments: ratify/sign a treaty The latest nation to ratify the treaty is France.an air/trade treaty The US wants a new air treaty with the UK to lift barriers on the cities that each nations' carriers can serve.\nLAW a formal agreement between two people, companies, or organizations: Sales of partnership property should be conducted by private treaty or at auction. See also\ncontract noun See also\ncommercial treaty\nthe Maastricht Treaty\nprivate treaty"}