{"id":369029,"name":"treatment","type":"noun","us_sound":"ˈtriːt.mənt","us_link":"../audio/t/treatment.mp3","uk_sound":"ˈtriːt.mənt","uk_link":"../audio/t/uktreac017.mp3","content":"treatment noun\n(DEALING WITH)\nAdd to word list\nAdd to word list\nB2 [ U ] the way you deal with or behave towards someone or something: Peter gets special treatment because he knows the boss.\n[ C or U ] the way something is considered and examined: The same subject matter gets a very different treatment by Chris Wilson in his latest novel.\nMore examplesFewer examplesPrisoners of war were subjected to inhuman and degrading treatment.They were accused of inhumanity in their treatment of the hostages.She's had really unsympathetic treatment from the management.I don't expect special treatment - I just want to be treated fairly.We were given the full VIP treatment.\nSMART Vocabulary: related words and phrases\nBehaving, interacting and behaviour\nas ye sow, so shall ye reap idiom\natavism\nattachment disorder\nattitude\nbearing\nbehave\nconduct\nexample\nhumanization\nhumanize\ninteract\ninteraction\nism\nmake nice idiom\nphase\npresence\nprovincialism\nprovincialist\nprovinciality\nsauce\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnalysing and evaluating\ntreatment noun\n(MEDICAL CARE)\nB2 [ C or U ] the use of drugs, exercises, etc. to cure a person of an illness or injury: free dental treatment Perhaps it's time to try a new course of treatment. This disease doesn't generally respond to (= improve as a result of) treatment. There are various treatments for this complaint.\nMore examplesFewer examplesChemotherapy is often used in the treatment of cancer.Being unemployed entitles you to free medical treatment.He's been having treatment for two months now without any improvement.I had some very expensive dental treatment recently - but it was money well spent - it'll save me problems in the future.The disease has proved responsive to the new treatment.\nSMART Vocabulary: related words and phrases\nMedical treatment: treating & caring for people\naggressively\nbed blocker\nbed-blocking\nbring\nbring someone around\nclinic\nhealth tourism\nkeep your/an eye on something/someone idiom\nlogroll\nlogrolling\nlook after someone/something\nnurse\npatch\nprep\nrehospitalization\nrehospitalize\nrespite care\nself-care\nset something up\ntend\nSee more results »\ntreatment noun\n(WAY OF BEHAVING)\nAdd to word list\nAdd to word list\n[ U ] the way you deal with or behave toward someone or something: He accused the governor of giving rich people special treatment.\ntreatment noun\n(MEDICAL CARE)\n[ C/U ] the use of drugs, exercises, etc. to improve the condition of an ill or injured person, or to cure a disease: [ U ] Chronic back pain may not respond to treatment.\ntreatment noun\n(PROCESS )\n[ C/U ] the process of putting a special substance on something or putting it through a special process in order to change its condition: [ U ] The city is exploring other methods of water treatment.\nAdd to word list\nAdd to word list\n[ U ] a way of behaving towards someone or something: equal/fair treatment for sb/sth The court order required equal treatment for female police department employees.preferential/special treatment for sb/sth The tax reform will end three decades of preferential treatment for foreign companies.treatment of sb/sth Their ethical range of meat products ensures the humane treatment of their farm animals.\n[ C or U ] a way of dealing with something: Investors are refusing to sell in the face of punitive tax treatment. Changes in the treatment of capital gains are discussed in the report.\n[ C or U ]\n&#160; PRODUCTION a process by which something is protected from damage or decay, cleaned, or made safe: a treatment facility/plant/system The city's sewage treatment plant has been overwhelmed by recent rains. Treatment of agricultural runoff is largely voluntary."}