{"id":369010,"name":"treat","type":"verb","us_sound":"triːt","us_link":"../audio/t/treat.mp3","uk_sound":"triːt","uk_link":"../audio/t/uktreac015.mp3","content":"treat verb\n(DEAL WITH)\nAdd to word list\nAdd to word list\nB2 [ T usually + adv/prep ] to behave towards someone or deal with something in a particular way: My parents treated us all the same when we were kids. He treated his wife very badly.treat someone/something as if It's wrong to treat animals as if they had no feelings.treat something with something I treat remarks like that with the contempt that they deserve.\nThesaurus: synonyms, antonyms, and examples\nto be about somethingbe aboutWhat is the story about?have (got) to do withWhat's that got to do with it?relate toThat relates to what I was saying earlier about the need for reform.concernThe film concerns the complicated nature of marriage.coverWe will cover the passive voice later in the course.deal withWe will deal with the use of antidepressants in chapter three.\nSee more results »\nMore examplesFewer examplesMany companies still treat their management staff better than their workers.You really should treat your parents with more respect.These men's magazines just treat women as playthings.We try to treat our students as individuals.All information will be treated as strictly confidential.\nSMART Vocabulary: related words and phrases\nBehaving, interacting and behaviour\nas ye sow, so shall ye reap idiom\natavism\nattachment disorder\nattitude\nbearing\nbehave\nconduct\nexample\nhumanization\nhumanize\ninteract\ninteraction\nism\nmake nice idiom\nphase\npresence\nprovincialism\nprovincialist\nprovinciality\nsauce\nSee more results »\ntreat verb\n(GIVE MEDICAL CARE)\nB2 [ T ] to use drugs, exercises, etc. to cure a person of a disease or heal an injury: be treated for He is being treated for a rare skin disease.treat a symptom Western medicine tends to treat the symptoms and not the cause.\nMore examplesFewer examplesThe farmer called the vet out to treat a sick cow.Laboratory tests suggest that the new drug may be used to treat cancer.Two firefighters were treated for smoke inhalation.At that time I worked in a small hospital where I was treating shell-shocked soldiers.Antihistamine is often used to treat hay fever and insect bites.\nSMART Vocabulary: related words and phrases\nMedical treatment: treating & caring for people\naggressively\nbed blocker\nbed-blocking\nbring\nbring someone around\nclinic\nhealth tourism\nkeep your/an eye on something/someone idiom\nlogroll\nlogrolling\nlook after someone/something\nnurse\npatch\nprep\nrehospitalization\nrehospitalize\nrespite care\nself-care\nset something up\ntend\nSee more results »\ntreat verb\n(PAY FOR)\nB2 [ T ] to buy or pay for something for another person: treat someone (to something) Put your money away - I'm going to treat you (to this).treat yourself to something I'm going to treat myself to (= buy for myself) a new pair of sandals.\nThesaurus: synonyms, antonyms, and examples\nto buy somethingbuyI need to buy some new shoes.getI need to go to the supermarket and get some bread.purchaseShe purchased a new computer.pick something upCan you just pop in the shop and pick up some eggs?\nSee more results »\nSMART Vocabulary: related words and phrases\nBuying & selling - general words\nall-you-can-eat\nanti-consumer\nanti-dumping\nback order\nbarter\ndeal in something\ndealership\ndesk research\nebay\neconomic activity\nflood\nhammer\npre-emption\npre-order\nprocurement\nrewards card\nsanctions-busting\nshelf\nstretch\ntender\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPaying money\ntreat verb\n(PUT ON)\n[ T ] to put a special substance on material such as wood, cloth, metal, etc. or put it through a special process, in order to protect it from damage or decay: be treated with The material has been treated with resin to make it waterproof.\nSMART Vocabulary: related words and phrases\nCovering and adding layers\nadditive\nasphalt\nbestrew\nbind\nblanket\nblindfold\nbury\ngum\ninlaid\nlag\nlaminate\nlayer\nobliterate\nretread\nseasoned\nslap\nslap something on\nsmother something in/with something\nspeckle\ntent\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIndustrial processing\nIdioms\ntreat someone like dirt\ntreat someone like royalty\ntreat noun\n(SOMETHING SPECIAL)\nC2 [ C ] a special and enjoyable occasion or experience, often a reward or celebration: birthday treat We're going to Italy for the weekend - it's my birthday treat.special treat As a special treat, I'll take you to my favourite restaurant.\n[ C ] something special that you buy because it makes you feel happy or brings happiness to someone else: In an economic crisis, while sales of expensive luxuries decline, purchases of small treats - a new cosmetic, for example - increase. A little posy of flowers is a delightful treat to give a friend.\nSMART Vocabulary: related words and phrases\nPleasure and happiness\nabandon\nafterglow\nbeatitude\nbed\nbed of roses idiom\ndelirium\nexaltation\nexultation\nfeast\nfor fun phrase\nfulfilment\nfun\ngoody\njoy\njoyfulness\njoyousness\njubilation\nlike a dog with two tails idiom\nsavour\nstardust\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCelebrations, parties & special occasions\ntreat noun\n(TO EAT)\n[ C ] a type of food that is eaten in addition to your usual meals, usually something sweet: There is a lot of competition with the sugar-filled and artificially flavoured treats on the store shelves.snacks and treats Try to encourage children not to eat too many of those snacks and treats that tend to pile on the pounds without providing much nutrition.\n[ C ] a small piece of food, often specially produced, that is given to pets in addition to their usual food, for example as a reward: We offer a smart, healthy alternative to the highly processed, artificially flavoured treats currently on the market.dog treat The owner said the dog was dangerous, but when I fed it dog treats it would take them gently out of my hand.cat treat Our gourmet cat treats are made with the highest quality of protein and grains.\nSMART Vocabulary: related words and phrases\nFood - general words\naliment\nbed\nbowl of something\nbox scheme\ncarb\ndelicacy\nfarm box\nfast casual\nfast food\nfayre\nfood\ngrub\nmouthful\nnon-food\nnosh\nperishables\nportion\nproduce box\nsustenance\nwhole food\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSweets\nAnimal food\ntreat noun\n(PAY FOR)\nmy, your, etc. treat [ S ]\nan occasion when I, you, etc. buy or pay for something for another person: No, you paid for dinner last time - this is my treat.\nSee more Idiom\na treat\ntreat verb\n(DEAL WITH)\nAdd to word list\nAdd to word list\n[ T always + adv/prep ] to behave toward someone or deal with something in a particular way: He treated his children badly. She always tried to treat her students as/like adults.\ntreat verb\n(GIVE MEDICAL CARE)\n[ T ] to do something to improve the condition of an ill or injured person, or to try to cure a disease: The hospital treats hundreds of patients a day. The new drug may allow us to treat diabetes more effectively.\ntreat verb\n(PUT IN NEW CONDITION)\n[ T ] to change the condition of a substance by adding something to it or putting it through a special process: The sewage is treated with chemicals before being dumped.\ntreat verb\n(PAY FOR)\n[ I/T ] to buy or pay for something for someone: [ T ] I’m going to treat myself to a new pair of sunglasses. Idioms\ntreat someone like dirt\ntreat someone with kid gloves\ntreat noun\n(SPECIAL EXPERIENCE)\n[ C ] a special and enjoyable occasion or experience: It was a real treat seeing my old friends last weekend.\ntreat noun\n(PAYMENT)\n[ U ] an occasion on which you pay for someone's food or entertainment: You paid for the taxi, so lunch is my treat (= I will pay).\nAdd to word list\nAdd to word list\nto behave towards or think of someone or something in a particular way: treat sb/sth as sth We must treat employees as allies in achieving change.treat sb/sth equally/fairly/unfairly It very hard to prove that the company had been treated unfairly.treat sb/sth like sth The company treated their initial public offering more like a marketing opportunity than a capital-raising exercise.\nto deal with something in a particular way: Each Fund is treated as a single tax entity. The employment department said the unemployment figures should be treated with caution.\nPRODUCTION to put a special substance on something or put it through a special process, in order to protect it, clean it, or make it safe: treat sth with sth We treat the material with resin to make it waterproof."}