{"id":369161,"name":"trembling","type":"adjective","us_sound":"ˈtrem.blɪŋ","us_link":"../audio/t/cdo1121ustrem4308.mp3","uk_sound":"ˈtrem.blɪŋ","uk_link":"../audio/t/cdo1121uktrem4206.mp3","content":"Add to word list\nAdd to word list\nshaking slightly in a way that you cannot control, for example because you are frightened, angry, or excited, or because of illness: \"I was scared,\" she said in a trembling voice. He reached out for her with trembling hands.\nof the ground or an object, shaking slightly: Eyewitnesses to the explosion reported a fireball and trembling ground.\nMore examplesFewer examplesHe scooped up the trembling dog and dodged speeding vehicles until they both made it to safe ground.He was struggling with increasingly poor health, visibly suffering from the slurred speech and trembling hands of Parkinson's Disease.It's one of those horror movies you watch between trembling fingers.Only a trail of trembling leaves marked where they had passed.\nSMART Vocabulary: related words and phrases\nShaking, swinging and vibrating\nbrandish\nearth-shaking\nflap\nflappy\nflourish\nfluff\nfluff something up\nreverberative\nripple\nrock-a-bye\nshake out\nshakily\nshakiness\nsway\nthrash\nvibrate\nvibration\nvibratory\nwaggle\nwiggle\nSee more results »\nan act of shaking slightly in a way that you cannot control, for example because you are frightened, angry, or excited, or because of illness: As she spoke, Jo bent over the book to hide the trembling of her lips.\na slight shaking movement of the ground or an object: There came a trembling of the ground and a distant shriek.\nMore examplesFewer examplesI got an aching in my back and a trembling in my knees. He felt the first tremblings of real fear creeping into his own body.The left ring finger, placed on a fishing line, is the finger most attuned, Angolan fishermen believe, to the tremblings of the sea.\nSMART Vocabulary: related words and phrases\nShaking, swinging and vibrating\nbrandish\nearth-shaking\nflap\nflappy\nflourish\nfluff\nfluff something up\nreverberative\nripple\nrock-a-bye\nshake out\nshakily\nshakiness\nsway\nthrash\nvibrate\nvibration\nvibratory\nwaggle\nwiggle\nSee more results »"}