{"id":369238,"name":"trend","type":"noun","us_sound":"trend","us_link":"../audio/t/trend.mp3","uk_sound":"trend","uk_link":"../audio/t/uktremu008.mp3","content":"Add to word list\nAdd to word list\nB1 a general development or change in a situation or in the way that people are behaving: trend away from Surveys show a trend away from home-ownership and toward rented accommodation.downward/upward trend There's been a downward/upward trend in sales in the last few years. Synonyms\ncraze\nfad\nfashion (POPULAR STYLE)\nmode (FASHION)\nstyle (FASHION)\nvogueCompare\ncult noun\nmania (STRONG INTEREST) disapproving\na new development in clothing, make-up, etc.: fashion trend Whatever the latest fashion trend, you can be sure Nicki will be wearing it. The trend at the moment is for a more natural and less made-up look.\nThesaurus: synonyms, antonyms, and examples\nfashionfashionFashion trends for the season include light, cool fabrics.styleA crisp navy suit will always be in style.trendThe trend is now to wear skirts longer.fadLet's hope this obsession with celebrity lifestyles is just a fad.crazeCycling shorts were the latest craze that year.\nSee more results »\non trend\nfashionable: Her long skirt is right on trend this winter.\nSee more\nMore examplesFewer examplesThe trend towards downshifting, where employees swap the stress of corporate life for more quality time, tempted 6% of the UK workforce last year.You can't really extrapolate a trend from such a small sample.A worrying trend for insurers has been a rise in fraudulent claims.The trend towards home ownership has gone into reverse.With an upward trend in inflation, you expect prices to rise.\nSMART Vocabulary: related words and phrases\nLifestyles & their study\nanthropogenic\nanthropological\nanthropologically\nanthropologist\nanthropology\ndemographer\ndemographics\ndemography\ndownshifting\nethnographer\nhermetically\nintercultural\ninterculturally\ninterculture\nlifestyle\nvegetate\nway of life idiom\nwesternization\nwesternize\nwesternized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFashion\nto be one of the words, subjects, or names that is being mentioned most often on a social media website or a news website at a particular time: trend on Within minutes of the incident her name was trending on Twitter. Click here for a list of trending topics.\nSMART Vocabulary: related words and phrases\nLiked, or not liked, by many people\nacquire\nan acquired taste idiom\nanti-popular\nbe the new rock and roll idiom\nbe welcome to idiom\ncult\nhigh-traffic\nin someone's bad books idiom\nin someone's good books idiom\nkiller app\nlimb\nlose ground phrase\nlow-traffic\npopularize\nresurge\nrock and roll\nsought after\ntop-rated\nunappreciated\nviral\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternet terminology\nAdd to word list\nAdd to word list\nthe general direction of changes or developments: fashion trends The trend is toward working longer hours for less money.\nAdd to word list\nAdd to word list\na general development in a situation or in the way that people behave: consumer/industry/market trends Goods on the Retail Price Index have to be updated to accurately represent consumer trends.a downward/upward trend Borrowing is on a downward trend.a trend for sth They are profiting from a growing trend for eating out.a trend in sth Manufacturers are being buffeted by trends in the global economy.a trend of sth a trend of rising pricesa trend towards/toward sth The trend toward bigger cars is new this year. current/general/recent trends growing/long-term/underlying trends business/economic/global trends\na new development in clothing, make-up, etc.: Autumn fashion trends are expected to favour muted colours.\nabove/below trend\nmore or less than is usual: We will see GDP on a quarterly basis above rather than below trend.\nbuck the/a trend\nto be different from or not be affected by the way that other people or things are behaving: Although industry profits were down, MFG is expected to buck the trend and increase profits.\nreverse the/a trend\nto make a general development go in the opposite direction: Holding the rate of duty will do little to reverse the trend towards cross-border shopping.\nset the/a trend (for sb/sth)\nto start doing something that other people copy: Our employee focus could well set the trend for successful companies in the future."}