{"id":369311,"name":"trespasser","type":"noun","us_sound":"ˈtres.pæs.ɚ","us_link":"../audio/t/trespasser.mp3","uk_sound":"ˈtres.pə.sər","uk_link":"../audio/t/uktremu013.mp3","content":"trespasser noun [C]\n(CRIMINAL)\nAdd to word list\nAdd to word list\na person who goes onto someone's land or enters their building without permission: Can't you read the sign? It says \"Trespassers will be prosecuted!\" A sign warns trespassers they may be shot.\nMore examplesFewer examplesBurglars, trespassers, and even hardened criminals must be guaranteed basic rights.He and his colleagues are constantly frustrated by persistent vandals and trespassers.They're on special lookout for thieves and trespassers.\nSMART Vocabulary: related words and phrases\nMiscellaneous criminals\narsonist\nartifice burglar\nbigamist\nbioterrorist\nblack hat\ndistraction burglar\ndistraction thief\ndrug dealer\nembezzler\nexpropriator\nknock-knock burglar\nlaunderer\nlooter\nlowlife\nlynch mob\nsafecracker\nscofflaw\nshicer\nshoplifter\nsmall-timer\nSee more results »\ntrespasser noun [C]\n(IMMORAL PERSON)\na person who does something or acts in a way that is not morally acceptable: Forgiveness can only take place when the trespasser is repentant. They would stand on the pavements singing hymns, while the sinning trespasser was being verbally abused. See\ntrespass\nMore examplesFewer examplesThe man who steals is often less of a moral trespasser than the man who gives.The trespasser intended to end another's life, but he has only destroyed his own.\nSMART Vocabulary: related words and phrases\nReligious concepts: sin\ncommit\nimmortal\nmortal sin\noriginal sin\npenance\npurification\nsin\nsinful\nsinfully\nsinfulness\nsinless\nsinlessly\nsinner\nthe seven deadly sins\ntrespass\nvenial\nvenially\nAdd to word list\nAdd to word list\na person who goes onto land or enters a building without the owner's permission: Sophisticated software allows the cameras to detect trespassers in areas off limits to the public."}