{"id":369391,"name":"triage","type":"noun","us_sound":"ˈtriː.ɑːʒ","us_link":"../audio/t/eus27818.mp3","uk_sound":"ˈtriː.ɑːʒ","uk_link":"../audio/t/epd34807.mp3","content":"Add to word list\nAdd to word list\nthe process of quickly examining patients who are taken to a hospital in order to decide which ones are the most seriously ill and must be treated first: The team's main job is to treat trauma victims at the scene of a disaster and perform triage. The triage nurse told him he would have to wait.\nthe process of examining problems in order to decide which ones are the most serious and must be dealt with first: We are performing triage on funding requests. A healthy project is in a constant state of triage between bugs and feature development.\nSMART Vocabulary: related words and phrases\nMedical examination\n-scopy\nanechoic\naudiological\nbiopsic\nblood work\nCAT scan\nEKG\nendoscopy\nGillet test\nhistological\nhistologically\nhysteroscopy\nimmunohistochemical\nmammography\nradiography\nsigmoidoscopy\nsmear\nsonography\nSPECT\nstress test\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClassifying and creating order\n[ I or T ] to quickly examine patients who are taken to a hospital in order to decide which ones are the most seriously ill and must be treated first: The casualties were triaged. Patients are triaged so that those most in need get blood first. The hardest thing for me was having to start triaging and treating patients in a less than ideal environment.\n[ T ] to examine problems in order to decide which ones are the most serious and must be dealt with first: The job consisted of triaging stacks of burglary incident reports. The sheer number of claims has insurers triaging which policyholders get attention first.\nMore examplesFewer examplesThe patient has already been triaged by an experienced, qualified nurse.Part of my work involved triaging patients with knee problems.With two of us triaging as fast as we safely can, there is still a two-hour wait.These cases need to be triaged to prioritize those felony arrests where you really want to keep the suspect in custody.\nSMART Vocabulary: related words and phrases\nMedical examination\n-scopy\nanechoic\naudiological\nbiopsic\nblood work\nCAT scan\nEKG\nendoscopy\nGillet test\nhistological\nhistologically\nhysteroscopy\nimmunohistochemical\nmammography\nradiography\nsigmoidoscopy\nsmear\nsonography\nSPECT\nstress test\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClassifying and creating order"}