{"id":369402,"name":"trial","type":"noun","us_sound":"traɪəl","us_link":"../audio/t/trial.mp3","uk_sound":"traɪəl","uk_link":"../audio/t/uktremu018.mp3","content":"trial noun\n(LEGAL PROCESS)\nAdd to word list\nAdd to word list\nB2 [ C or U ] the hearing of statements and showing of objects, etc. in a law court to judge if a person is guilty of a crime or to decide a case or a legal matter: trial proceedings Trial by jury is a fundamental right. It was a very complicated trial that went on for months. She's going on/standing trial for fraud. See also\ntry verb (LAW)\nMore examplesFewer examplesTen witnesses are expected to testify at the trial today.The judge reacted angrily to the suggestion that it hadn't been a fair trial.The terrorists were put on trial six years after the bombing.After the trial, his family said they had lost all faith in the judicial system.He is fighting extradition to Hong Kong to face trial on fraud charges.\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\nextrajudicial\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\npleading\npower of attorney\nprecedent\npretrial\nprobate\nthe Webster ruling\nwardship\nwitness to something\nwobbler\nSee more results »\ntrial noun\n(TEST)\nC1 [ C or U ] a test, usually over a limited period of time, to discover how effective or suitable something or someone is: They're doing clinical trials on a new drug. They've employed her for a six-month trial (period). You can have the equipment on a trial basis (UK also on trial), and if you don't like it you can give it back.\nMore examplesFewer examplesClinical trials of the new drug may take five years.Preliminary results show that the vaccine is effective, but this has to be confirmed by further medical trials.We've got a lawnmower on trial.Preliminary trials show that the drug may be effective.\nSMART Vocabulary: related words and phrases\nTesting, checking and experimenting\nartefact\nassay\nbackground check\ncalibrate\ncalibration\nexperimentally\nexperimentation\nexperimenter\nfactorial\nfeeler\ninoculate\nput something to the test idiom\nrecheck\nreinspect\nreinspection\nresample\nuncheckable\nuntestable\nuntested\nwelfare check\nSee more results »\ntrial noun\n(PROBLEM)\n[ C ] a person or thing that is annoying and causes a lot of problems: She was a real trial to her parents when she was younger. The book is all about the trials of growing up.\nSMART Vocabulary: related words and phrases\nDifficult things and people\na (heavy) cross to bear idiom\nalbatross\nball and chain\nbane\nbe dead meat idiom\nbe in the clear idiom\nbump\nchill\nequation\nhindrance\nhot potato\nimpediment\nincubus\nmarathon\nnut\nstumbling block\nteaser\nteething troubles\nthorn in your flesh/side idiom\ntie someone up\nSee more results »\ntrial noun\n(EXAM)\n[ C ] Australian English an exam taken at school for practice before a real exam: Trials take place in July. Compare\nmock noun UK\nSMART Vocabulary: related words and phrases\nExams, tests & exercises\nachievement test\nAdvanced Placement\nAP\naptitude test\nassessment\ncan do phrase\ndictation\nexternal examination\nfail\nmoderate\npop quiz\npractical\nprobationary\nproctor\npsychometric\nquiz\nre-mark\nrubric\nsit\nviva\nSee more results »\nIdiom\ntrials and tribulations\nto test something in a formal way to discover how effective or suitable it is: We will trial the new drug in several hospitals.\nSMART Vocabulary: related words and phrases\nInventing, designing and innovation\nabsorptive capacity\narchitect\nartificer\nbionics\nblueprint\ndesign\ndesigner\ndevise\ndream something up\nergonomic\nlead time\nmodularization\nnanotechnology\nnon-imitative\noperational research\nthemed\nthink outside the box idiom\nthink something up\ntrailblaze\nwhole cloth\nSee more results »\ntrial noun\n(LEGAL PROCESS)\nAdd to word list\nAdd to word list\n[ C/U ] the examination in a court of law of the facts of a case to decide whether a person is guilty of a crime or responsible for an injury to another person: [ C ] a criminal/civil trial [ U ] The case will soon go to trial (= begin). [ U ] She must still stand trial (= be judged in a court of law). on trial\nIf someone is on trial, the case in which that person's guilt is being judged has begun: He was on trial for assault and robbery.\ntrial noun\n(TEST)\n[ C/U ] a test, usually over a limited period of time, to discover how effective or suitable something or someone is: [ C ] The agency plans to conduct clinical trials of the drug. [ U ] We have the videotapes on a trial basis for one week – if we don’t like them, we can send them back.\ntrial noun\n(PROBLEM)\n[ C ] something or someone that causes anxiety or problems: the trials of adolescence\nAdd to word list\nAdd to word list\n[ C ]\n&#160; PRODUCTION a test to discover how safe, effective, etc. a product is: a clinical/drug/field trial The company conducted three clinical trials to determine the drug's safety. conduct/run/undergo trials\n[ C or U ]\n&#160; PRODUCTION, HR the process of using a product or employing a person for a short period in order to decide how effective or suitable they are: Under the scheme, employers fill a vacancy with a long-term unemployed individual on a trial basis for up to 15 working days. You can buy the equipment on trial and take it back if you don't like it. Agents are usually appointed for a trial period.\n[ C or U ]\n&#160; LAW in a court of law, the process of judging whether a person is guilty of a crime or deciding a legal problem, which involves hearing statements, showing objects, etc.: await/face/stand trial He was ordered to stand trial on charges of unlawful computer use.be/go/be put on trial for sth The former chief executive is on trial for fraud. The company is scheduled to go to trial next year. get/be given a fair trial\ntrial and error\na way of achieving something or solving a problem by trying a number of different methods and learning from the mistakes you make: Although some products' quality can be verified through trial and error, this is not always practical. See also\nacceptance trial\nblind trial\nfree trial\nto test something in a formal way to discover how effective or suitable it is: The group is trialling internet ordering for its paper and plastic products. The system will be trialed in the third quarter of the year in both the U.S. and Japan."}