{"id":369848,"name":"trickle","type":"verb","us_sound":"ˈtrɪk.əl","us_link":"../audio/t/trickle.mp3","uk_sound":"ˈtrɪk.əl","uk_link":"../audio/t/uktribu007.mp3","content":"trickle verb [I]\n(LIQUID)\ntrickle down, from, out of, etc. something\nAdd to word list\nAdd to word list\nIf liquid trickles somewhere, it flows slowly and without force in a thin line: Blood trickled out of the corner of his mouth.\nSee more\ntrickle verb [I]\n(SMALL NUMBER)\ntrickle in, out, back, etc.\nto arrive or move somewhere slowly and gradually, in small numbers: Gradually people trickled back into the theatre for the second half.\nSee more\ntrickle noun\n(SMALL NUMBER)\n[ S ] a very small number of people or things arriving or leaving somewhere: We usually only get a trickle of customers in the mornings.\nSMART Vocabulary: related words and phrases\nWords meaning small pieces and amounts\nby a nose idiom\nclipping\ncrumb\ndab\ndash\ndollop\ngrain\nort\nparing\npeewee\npinch\npotsherd\nskinny\nspark\nswatch\ntad\nthimbleful\ntidbit\ntiddler\ntrace\nSee more results »\ntrickle noun\n(LIQUID)\n[ C ] a small amount of liquid that is flowing slowly in a thin line: A trickle of melted butter made its way down his chin. Synonyms\ndribble (SLOW FLOW)\ndrip (LIQUID)\nflow (MOVEMENT)\nrivulet literary\nstream (CONTINUOUS FLOW)\nSMART Vocabulary: related words and phrases\nMovement of liquids\nbacksplash\nbe dripping with something idiom\nbleed\ncounter-stream\ndecant\ndrainage\ndrip\nleakage\nreinjection\nrespray\nripple\nrun a bath phrase\nrun someone/something over\nrunnel\nspate\nswash\nswill\nswirl\nswirling\ntop something up\nSee more results »\nAdd to word list\nAdd to word list\n(of liquid) to flow slowly and without force: Blood trickled from a cut in his forehead.\nTo trickle is also to happen gradually and in small numbers: After the hurricane, all the telephones were out, and it was some time before reports of damage began to trickle in.\na slow flow of something, or a small number of people or things arriving or leaving somewhere: A trickle of sweat ran down his chest. Only a trickle (= small amount) of goods reached the village.\nAdd to word list\nAdd to word list\nto arrive or move somewhere slowly or gradually: trickle back Foreign capital has been trickling back, as investors seek higher returns than they can find at home.trickle in Customers trickled in throughout the afternoon.trickle out Details have begun to trickle out since the deal was struck Monday night. Phrasal verb\ntrickle down (to sb/sth)\na very small number of people or things: a slow/steady trickle of sth Throughout the day there was a steady trickle of customers.be reduced/dwindle/slow to a trickle Trading has slowed to a trickle."}