{"id":369837,"name":"tricky","type":"adjective","us_sound":"ˈtrɪk.i","us_link":"../audio/t/tricky.mp3","uk_sound":"ˈtrɪk.i","uk_link":"../audio/t/uktribu010.mp3","content":"tricky adjective\n(DIFFICULT)\nAdd to word list\nAdd to word list\nB2 If a piece of work or problem is tricky, it is difficult to deal with and needs careful attention or skill: It's tricky to learn to ride a skateboard, but you never forget how. I'm in a tricky situation - whatever I do I'll offend someone.\nThesaurus: synonyms, antonyms, and examples\nnot easy to deal with or understanddifficultIt's very difficult to find a job in this city. hardThe exam was really hard.complicatedThe instructions were so complicated I just couldn't follow them.complexDesigning a house is a complex process.trickyIt's quite tricky getting the puzzle pieces to fit together.\nSee more results »\nMore examplesFewer examplesThe company's had some tricky problems to negotiate in its first year in business.He asked a number of tricky questions that only a doctor could answer.He has a deft touch with tricky painting jobs.She's very easily offended, so working with her can be a bit tricky.The switch is a bit tricky to reach.\nSMART Vocabulary: related words and phrases\nComplicated and difficult to do\nadvanced\nambitious\nambitiously\nanother\narduous\nformidable\nformidably\nget blood out of/from a stone idiom\ngrail\ngruelling\nonerous\nonerously\noverdemanding\npainstaking\npicnic\ntrickily\ntuff\nultra-sensitive\nunintuitive\nunresolvable\nSee more results »\ntricky adjective\n(DISHONEST)\nold-fashioned likely to deceive people: He's a tricky one.\nSMART Vocabulary: related words and phrases\nSly & devious\nartful\nartfully\nartfulness\nbackdoor\ncalculating\ncunningly\ndevious\ndeviously\ndeviousness\ndisingenuous\nducking\nguile\nguileful\nguilefully\nlegerdemain\nMachiavellian\ntricksy\nunderhand\nweaselly\nwily\nSee more results »\ntricky adjective\n(DIFFICULT)\nAdd to word list\nAdd to word list\n(of a piece of work or a problem) difficult to deal with and needing careful attention or skill: Removing scar tissue can be a very tricky operation.\ntricky adjective\n(DECEIVING)\nlikely to deceive people: He’s a tricky fellow – you can’t always trust him."}