{"id":369830,"name":"trick","type":"noun","us_sound":"trɪk","us_link":"../audio/t/trick.mp3","uk_sound":"trɪk","uk_link":"../audio/t/uktribu005.mp3","content":"trick noun [C]\n(ACT OF DECEIVING)\nAdd to word list\nAdd to word list\nB1 an action that is intended to deceive, either as a way of cheating someone, or as a joke or form of entertainment: play a trick on She played a really nasty trick on me - she put syrup in my shampoo bottle!do a trick My niece was showing me all the tricks that she's learned to do with her new magic set.trick photography It's trick photography - she's supposed to look like she's walking on water. Synonym\ndeception be a trick of the light\nto be an effect caused by light, making something appear different: For a moment I thought you had a patch of grey hair, but it's just a trick of the light.\nSee more trick or treat\nwhat children say when they go\ntrick-or-treating at Halloween: I thought I heard kids shouting \"Trick or treat!\"\nSee more\nMore examplesFewer examplesShe played a dirty trick on me by telling me Diane was having a party when she wasn't.That was a pretty low trick to play.I'll show you a magic trick.They're plotting to play a trick on their brother.No one's gonna pull that kind of trick on me!\nSMART Vocabulary: related words and phrases\nCheating & tricking\nanti-fraud\nbad faith\nbamboozle\nbilk\nblackmail\ndeceive\ndiddle\nfeint\nflannel\ngrifter\ngull\nhave an eye to/for the main chance idiom\nhave someone on\nhoax\npretextual\npull\npull a fast one idiom\npull the wool over someone's eyes idiom\npunk\nracket\nSee more results »\ntrick noun [C]\n(METHOD)\nB2 an effective or quick way of doing something: trick to What's the trick to getting this chair to fold up? On page 21, some tricks to speed up your beauty routine. Synonym\nknack\nMore examplesFewer examplesThe trick to making custard is to keep stirring.He told me a few good tricks for controlling the class.In this article, she shares her beauty tricks with the nation.What's your trick for perfect pastry?\nSMART Vocabulary: related words and phrases\nWays of achieving things\nactively\nanother\napproach\navenue\nbases\nbasis\ndevice\nformula\nmedia\nmethod\nmethodological\nmethodologically\nmethodologist\nstandard operating procedure\nstrategy\nstyleless\nstylistic\nstylistically\nthus\nvehicle\nSee more results »\nIdioms\ndo the trick\nevery trick in the book\nhow's tricks?\ntrick of the trade\nB2 to deceive someone, often as a part of a plan: trick someone into doing something Dean tricked the old lady into giving him eight hundred dollars. Synonyms\ndeceive\nfox UK\nThesaurus: synonyms, antonyms, and examples\nto deceive someonedeceiveThe cigarette companies deceived the public about the health risks of cigarettes.deceive yourselfYou'd be deceiving yourself if you believed that.trickShe felt they had tricked her into saying more than she intended.foolYou don't fool me with your innocent act.take inThey claimed to be destitute, but we weren't taken in.pull the wool over someone's eyesI'm not stupid. You can't pull the wool over my eyes like that.\nSee more results »\nSMART Vocabulary: related words and phrases\nCheating & tricking\nanti-fraud\nbad faith\nbamboozle\nbilk\nblackmail\ndeceive\ndiddle\nfeint\nflannel\ngrifter\ngull\nhave an eye to/for the main chance idiom\nhave someone on\nhoax\npretextual\npull\npull a fast one idiom\npull the wool over someone's eyes idiom\npunk\nracket\nSee more results »\ntrick adjective [before noun]\n(DECEIVING)\nused to deceive someone, either as a joke or form of entertainment or so that they make a mistake: a trick question\nSMART Vocabulary: related words and phrases\nSly & devious\nartful\nartfully\nartfulness\nbackdoor\ncalculating\ncunningly\ndevious\ndeviously\ndeviousness\ndisingenuous\nguile\nguileful\nguilefully\nlegerdemain\nMachiavellian\ntricksy\ntricky\nunderhand\nweaselly\nwily\nSee more results »\ntrick adjective [before noun]\n(WEAK)\nUS A trick part of the body, especially a joint (= place where two bones are connected), sometimes feels weak suddenly and unexpectedly: I have a trick ankle that gives me problems if I run too much.\nSMART Vocabulary: related words and phrases\nProblems with bones, joints & teeth\nanti-plaque\nanti-rachitic\nanticaries\narthrosis\nbruxism\ncaries\ncarpal tunnel syndrome\ndislocate\nfissure\ngrowing pains\nhousemaid's knee\nkyphosis\nlordosis\nmaxillofacial\nmyelomeningocele\nossification\nossify\ntartar\ntennis elbow\ntrigger finger\nSee more results »\ntrick noun [C]\n(ACT OF DECEIVING)\nAdd to word list\nAdd to word list\nan action intended to deceive, either as a way of cheating someone or as a joke or form of entertainment: He showed us some card tricks. trick or treat\nTrick or treat is what children say on Halloween, when they dress to look frightening or amusing and visit people’s homes to ask for candy: Are your kids too old for trick or treating (= visiting people’s homes to ask for candy)?\ntrick noun [C]\n(METHOD)\na quick or effective way of doing something: What’s the trick to pulling out this sofa bed? Idiom\ntricks of the trade\ntrick adjective [not gradable]\n(WEAK)\n(of a part of the body, esp. a joint) sometimes feeling weak suddenly and unexpectedly: I’ve had a trick knee ever since I played football.\ntrick verb [T]\n(DECEIVE)\nto make someone believe something that is not true, or to persuade someone to do something based on a false understanding of the facts: She tricked me into telling her what I was up to."}