{"id":370094,"name":"trigger","type":"noun","us_sound":"ˈtrɪɡ.ɚ","us_link":"../audio/t/trigger.mp3","uk_sound":"ˈtrɪɡ.ər","uk_link":"../audio/t/uktribu020.mp3","content":"trigger noun\n(GUN PART)\nAdd to word list\nAdd to word list\n[ C ] a part of a gun that causes the gun to fire when pressed: It's not clear who actually pulled the trigger.\nCaspar Benson/GettyImages\nSMART Vocabulary: related words and phrases\nParts of guns\nbanana clip\nbarrel\nbore\nbump stock\nbusiness end\nbutt\nclip\nflint\nhammer\nholster\nmuffler\nmuzzle\nplier\nramrod\nsafety catch\nsight\nstock\ntampion\nturret\nSee more results »\ntrigger noun\n(START)\n[ C usually singular ] an event or situation, etc. that causes something to start: There are fears that the incident may be a trigger for more violence in the capital.\n[ C usually singular ]\n&#160; psychology\n&#160; specialized something that causes someone to feel upset and frightened because they are made to remember something bad that has happened in the past: A trigger is something that sets off a flashback, transporting the person back to the traumatic event.\nSMART Vocabulary: related words and phrases\nBeginnings and starts\na baptism of/by fire idiom\nadvent\nbaptism\nbeginning\nbirth\ncommencement\ninception\ninitiation\nintroduction\njumping-off point\nkick off\nonset\noutbreak\nsquare\nstarter\nstarting point\nstarting time\nthe thin end of the wedge idiom\nthin\nzero hour\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing anxiety and worry\nC1 to cause something to start: Some people find that certain foods trigger their headaches. Ultraviolet-B radiation triggers the skin to produce vitamin D. The racial killings at the weekend have triggered off a wave of protests.\nThesaurus: synonyms, antonyms, and examples\nto make something happencauseFirefighters determined that a campfire spark caused the wildfire.bring aboutMany illnesses are brought about by poor diet and lack of exercise.result inThe fire resulted in damage to their house.lead toReducing speed limits has led to fewer deaths on the motorways.makeThe heat is making me tired.arouseIt's a subject that has aroused a lot of interest.\nSee more results »\ninformal to cause a strong emotional reaction of fear, shock, anger, or worry in someone, especially because they are made to remember something bad that has happened in the past: Seeing him come towards me just triggered me and I screamed. He could be triggered by a loud noise.\nMore examplesFewer examplesOne type of diabetes is an auto-immune disease that may be triggered by a virus.The racial killings at the weekend have triggered off a wave of protests throughout the country.A vote of no confidence would trigger an election.The car crash triggered a lot of bad memories for me.We will never know what his motives were for the rampage and what triggered him.She can trigger you because she knows the right buttons to push.\nSMART Vocabulary: related words and phrases\nStarting and beginning\nbe in the first flush of idiom\nbe/get in on the ground floor idiom\nbecome\nbegin\nbranch out\ndevelop\ngrow\nhalf-cock\nhere\nhere goes! idiom\nhit the ground running idiom\nmotion\nsail in\nstart (something) off\nstart on something\nstart out\nstart/set/get the ball rolling idiom\nstarting\nthe ground floor\nwheel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking people sad, shocked and upset\nCausing feelings of anger and displeasure\ntrigger noun [C]\n(GUN PART)\nAdd to word list\nAdd to word list\na part of a gun that causes the gun to fire when pressed: to pull the trigger\ntrigger verb [T]\n(START)\nto cause something to start: I triggered the smoke alarm when I burned the potatoes. Eating chocolate can trigger a migraine headache in some people.\nAdd to word list\nAdd to word list\nan event, situation, etc. that causes the start of something, especially something bad: trigger for sth Inflation has been the trigger for nearly all post-war recessions.\nto cause something to happen, especially something bad: Central banks must raise interest rates without triggering a financial crisis for households with excessive debts.be triggered by sth The sell-off was triggered by a profits warning.\nto make a piece of equipment, etc. start working: Any attempt to jack the car off the ground triggers the alarm automatically."}