{"id":370312,"name":"trim","type":"verb","us_sound":"trɪm","us_link":"../audio/t/trim.mp3","uk_sound":"trɪm","uk_link":"../audio/t/uktribu030.mp3","content":"trim verb [T]\n(CUT)\nAdd to word list\nAdd to word list\nto make something tidier or more level by cutting a small amount off it: to trim the hedge My hair needs trimming.trim something off Trim off the leafy ends of the vegetable before cooking.\nThesaurus: synonyms, antonyms, and examples\nto cut somethingcutOuch, I've cut my finger!chopHe was chopping vegetables to make a stew.sliceSlice the mushrooms and fry them in butter.snipShe snipped the corner off the soup packet.slitHe slit open the envelope with a knife.carveHe carved her name on a tree.\nSee more results »\nSMART Vocabulary: related words and phrases\nCutting and stabbing\nabrasion\nbayonet\nbutcher\ncarve\ncarving\nchisel\nchop\nimpaler\nincise\njulienne\nlacerate\nlacerated\nshave\nshearing\nsheep shearing\nslash\nsliced\nslit\nsnip\nspike\nSee more results »\ntrim verb [T]\n(REDUCE)\nto reduce the amount or size of something: They're trying to trim their costs, so staff who leave are not being replaced.\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nabridgment\nattenuate\nattenuated\nattenuating\nattenuation\nboil\ncontraction\ndamp\nfall off\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nrightsizing\nroll back something\nrollback\nrun someone/something down\nrundown\ntelescope\ntumble\nSee more results »\ntrim verb [T]\n(DECORATE)\nto decorate something by adding objects, pieces of material, etc. that make it look attractive: The edges of the jacket had been trimmed with sequins. See also\ntrimmed\nMore examplesFewer examplesWe'll show you how to make cute ornaments to trim your Christmas tree.The bride was wearing a full-skirted Victorian dress made of ivory wild silk that had been trimmed with lace.The palm tree in front of the family's home has been trimmed with lights, and so has the evergreen in the living room.Get your gifts noticed with our trimming tips and tricks.\nSMART Vocabulary: related words and phrases\nDecorating or making something attractive\naccessorize\nadorn\nadornment\nbeautification\nbeautify\nflock\nfoliated\ngarland\ngewgaw\nglam\nornamentation\nornate\nover-glamorize\noverdecorate\noverdecoration\ntwiddly\nundecorated\nwindow dressing\nyarn bombing\nzhuzh\nSee more results »\ntrim adjective\n(THIN)\napproving thin in an attractive and healthy way: You're looking very trim - have you lost weight?\nSMART Vocabulary: related words and phrases\nAnimal physiology: thin or slender (of people)\nbe as thin as a rake phrase\nbe skin and bone(s) idiom\nectomorph\nemaciated\nemaciation\ngauntly\ngauntness\nhollow\nlithe\nraw-boned\nscrawny\nslender\nslight\nslimness\nsparely\nthinness\nultra-thin\nwasted\nwirily\nwiry\nSee more results »\ntrim adjective\n(TIDY)\ntidy and well ordered: trim lawns and neat flower beds\nSMART Vocabulary: related words and phrases\nClean & tidy\n(as) clean as a (new) pin idiom\napple pie\naseptic\nbe in apple-pie order idiom\ncleanliness\nclipped\nneatness\nnon-clogging\nnon-polluting\nordered\norderliness\norderly\nsprucely\nsqueaky-clean\nstainless\nsuper-clean\ntidily\nvirginal\nvirginally\nwell kept\nSee more results »\ntrim noun\n(CUT)\n[ S ] an act of making something, especially someone's hair, tidier or more level by cutting a small amount off it: a trim I asked the hairdresser for a trim.give someone/something a trim Just give the ends a trim, please.\nSMART Vocabulary: related words and phrases\nCutting and stabbing\nabrasion\nbayonet\nbutcher\ncarve\ncarving\nchisel\nchop\nimpaler\nincise\njulienne\nlacerate\nlacerated\nshave\nshearing\nsheep shearing\nslash\nsliced\nslit\nsnip\nspike\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHairdressing\ntrim noun\n(MATERIAL)\n[ C or U ] →\ntrimming\nThesaurus: synonyms, antonyms, and examples\ndecorations or a decorationdecorationIt's time to put away the Christmas decorations.ornamentationThe artifacts included a gold bracelet with beaded ornamentation.adornmentShe wore no adornments except for a small watch.embellishmentThe building is plain, avoiding all unnecessary embellishments.trimmingI want a plain black cardigan with no trimmings.trimI like that tan sofa with the bright blue trim.\nSee more results »\nSMART Vocabulary: related words and phrases\nDecorations for clothes\nbadged\nbadging\nbemedalled\nepaulette\neyelet\nflash\nfob\nfrill\nfringe\nfrou-frou\nnacre\npiping\npussy bow\nshoulder pad\nspangle\nstud\nstudded\ntassel\ntrain\ntrimming\nSee more results »\ntrim noun\n(OF VEHICLE)\n[ C or U ] the decorative features of a vehicle, for example the type and colour of the material that is used to cover the seats : The car has a plush interior with full leather trim. What is the difference between the various Volkswagen trims?trim level Many dealers have realized that small-car shoppers are willing to buy higher trim levels and optional features.\nMore examplesFewer examplesWith its dark grey trim, this car's cabin is very tasteful.Things like sun roofs and air conditioning, major trim packages, that sort of thing, have a substantial impact on the value of the vehicle.\nSMART Vocabulary: related words and phrases\nThe interior of vehicles\nback seat\nbrake\nbrake pedal\nclutch\ndashboard\ndemister\ndickey\ndimmer switch\ndip switch\nfootbrake\ngas pedal\nhorn\ninertia reel\nluggage rack\nspeedometer\nsteering column\nsteering wheel\nstick shift\ntachograph\nvisor\nSee more results »\ntrim noun\n(PREPARED)\nin trim UK informal\nphysically prepared and ready, or in good condition: in trim for Are you in trim for the run on Sunday?\nSee more\ntrim verb [T]\n(CUT)\nAdd to word list\nAdd to word list\nto make something neater or more even by cutting a small amount off: He had a neatly trimmed beard.\nTo trim is also to reduce: We have to trim costs by not making any unnecessary trips.\ntrim verb [T]\n(DECORATE)\nto add decoration to something: The robe was trimmed with fur.\ntrim noun [U]\n(DECORATION)\nmaterial used to add decoration to something: The team’s new uniforms are blue with black trim.\ntrim adjective [-er/-est only]\n(THIN)\nthin and appearing to be in good physical condition: He was a short, trim, wiry man.\nAdd to word list\nAdd to word list\nto reduce the amount or size of something: The bank will trim 850 workers as part of a cost-cutting program. Several programs were eliminated to trim $600,000 from the company's $6.7 million annual budget. trim costs/debt/growth\ntrim the fat informal\nFINANCE to reduce unnecessary spending: The company needs to trim the fat to make itself attractive to corporate investors. The article advises on how to trim the fat from your grocery bill."}