{"id":370564,"name":"trip","type":"noun","us_sound":"trɪp","us_link":"../audio/t/trip.mp3","uk_sound":"trɪp","uk_link":"../audio/t/uktrima013.mp3","content":"trip noun\n(JOURNEY)\nAdd to word list\nAdd to word list\nA2 [ C ] a journey in which you go somewhere, usually for a short time, and come back again: trip from somewhere to somewhere The trip from York to Newcastle takes about an hour by train.on a trip We're going on a trip to Norway this summer.trip round I thought we might hire a motorboat and take a trip round the bay.trip abroad mainly UK We can't afford another trip abroad this year. It's a ten-mile trip from the airport to the hotel.business trip She's away on a business trip and won't be back until next week.school trip Do you want to go on the school trip to France this year?shopping trip I was thinking we could go on a shopping trip to New York this weekend. Synonyms\nexcursion\nexpedition\njaunt\njourney (TRIP)\njunket disapproving\nouting\nMore examplesFewer examplesYou should always check your oil, water and tyres before taking your car on a long trip.How about a trip to the zoo this afternoon?She's going on a trip to New York, all expenses paid.The travel company has written giving information about the trip.He's always going off around the world on business trips, leaving his wife to cope with the babies by herself.\nSMART Vocabulary: related words and phrases\nJourneys\nadventure\nbreak-journey\ncarpool\ncarpooling\ncircumnavigation\ncommuting\nexpedition\nfield trip\ngrand tour\nhaul\njaunt\njourney\njunket\nlayover\nmove\nodyssey\nride\nsail\nseafaring\nwanderings\nSee more results »\ntrip noun\n(FALL)\n[ C usually singular ] an occasion when you knock your foot against something and fall or lose your balance, or someone causes you to do this, when you are walking or running: She broke her ankle when she had a nasty trip on the stairs.\nMario Lalich/The Image Bank/GettyImages\nSMART Vocabulary: related words and phrases\nFalling and dropping\nass\ncollapse/fall in a heap idiom\ncropper\ncrumple\ndrop\ndrop like flies idiom\ndrop off\nfaceplant\nfall away\nfly\nlet go idiom\nmic drop\nnosedive\noverbalance\nparachutist\nplunge\npratfall\nshower\nthump\nwayside\nSee more results »\ntrip noun\n(EXPERIENCE)\n[ C ] slang an experience in which someone sees, hears, or feels things that do not exist as a result of taking an illegal drug: have a bad trip If you take this stuff when you're depressed, you'll have a really bad trip.\n[ C usually singular ] mainly US informal a person or experience that is strange or entertaining and exciting: My science teacher is such a trip - he says the most bizarre things. guilt/power/ego trip disapproving\na period of time when you experience a particular feeling strongly: on a guilt/power/ego trip She's been on a real power trip since she became the office manager.\nSee more\nSMART Vocabulary: related words and phrases\nDrugs - general words\nabstinence\nabstinence-only\nbindle\nbiosimilar\nchase\nmultidrug\nnon-intoxicant\nnon-intoxicating\nnondrug\npeddler\nperformance-enhancing\npill-popping\nsolvent abuse\nspike\nspliff\nsubstance\nsubstance abuse\nwasted\nwhacked\nwiped out\nSee more results »\ntrip verb\n(LOSE BALANCE)\nB2 [ I or T ] to lose your balance after knocking your foot against something when you are walking or running, or to cause someone to do this: He tripped and fell down, grazing his knee.trip over That cable is dangerous. Someone might trip over it. He was sent off for deliberately tripping Robson when he was about to score.\nThesaurus: synonyms, antonyms, and examples\nto go down onto the ground suddenlyfallShe slipped and fell.dropSeveral apples dropped from the tree.collapseSeveral buildings collapsed in the earthquake.crumpleHe fainted and crumpled into a heap on the floor.tumbleA huge rock tumbled down the mountain.plungeFour of the mountaineers plunged to their deaths when their ropes broke.\nSee more results »\nMore examplesFewer examplesThe bowler tripped as he was delivering the ball .She tripped and fell over.I tripped as I got off the bus.She tripped over the rug.I tripped on a piece of wire that someone had stretched across the path.\nSMART Vocabulary: related words and phrases\nFalling and dropping\nass\ncollapse/fall in a heap idiom\ncropper\ncrumple\ndrop\ndrop like flies idiom\ndrop off\nfaceplant\nfall away\nfly\nlet go idiom\nmic drop\nnosedive\noverbalance\nparachutist\nplunge\npratfall\nshower\nthump\nwayside\nSee more results »\ntrip verb\n(MOVE)\n[ I usually + adv/prep ] to move with quick, gentle steps: trip down She looked stunning as she tripped down the stairs in her ball gown.\nSMART Vocabulary: related words and phrases\nMoving quickly\nagility\nbeetle\nbelt\nbob up\nbowl down/along something\ncareen\ngallop\ngun\nleg\noutrush\noutsail\npelt\nrush\nscamper\nscoot\nscorch\nscrabble\nscuttle\nshoot\ntrot\nSee more results »\ntrip verb\n(SWITCH)\n[ T ] to move a switch that operates an electrical system, or to cause such a system to start or stop working by moving a switch: A special system prevents the circuitry from being tripped accidentally by a power surge or lightning strike.\nSMART Vocabulary: related words and phrases\nElectricity & electronics\nanodize\nanti-static\narc\nbitstream\nbrownout\ncapacitance\nchargeable\nelectricity\nhigh-voltage\nhoming\ninduction\ninsulating tape\nlinesman\nmagnet\nmultimeter\nnegatively\nnon-electric\nnon-electrical\nnon-electronic\nsolid-state\nSee more results »\ntrip verb\n(EXPERIENCE)\n[ I ] slang to experience the effects of taking an illegal drug that causes the user to see, hear, or feel things that do not exist: trip out on As a student he spent a lot of time tripping out on LSD.\nSMART Vocabulary: related words and phrases\nDrugs - general words\nabstinence\nabstinence-only\nbindle\nbiosimilar\nchase\nmultidrug\nnon-intoxicant\nnon-intoxicating\nnondrug\npeddler\nperformance-enhancing\npill-popping\nsolvent abuse\nspike\nspliff\nsubstance\nsubstance abuse\nwasted\nwhacked\nwiped out\nSee more results »\nIdiom\ntrip off the tonguePhrasal verb\ntrip (someone) up\ntrip noun [C]\n(TRAVEL)\nAdd to word list\nAdd to word list\nan occasion on which someone goes to a place and returns from it, or the act of traveling from one place to another: a camping/shopping trip We plan to take a trip out west later this year. They went on a three-week trip to Europe. Alejandro had to make a number of business trips to New York.\ntrip noun [C]\n(EXPERIENCE)\nslang a strongly felt experience: What a trip this book is!\ntrip verb [I/T]\n(LOSE BALANCE)\nto lose your balance because your foot hits against something when you are walking or running, or to cause someone to lose his or her balance: [ I ] He injured his ankle when he tripped over a water sprinkler while jogging. [ I ] She nearly tripped on the rug.\nPhrasal verb\ntrip up (someone)\nAdd to word list\nAdd to word list\na journey to a place, where you stay for a short time, and then come back again: go on/make/take a trip She always flies business class when she goes on trips to the US.\na part of a journey to or back from a place: the outward/return trip The trucks are being loaded for the return trip. See also\nbusiness trip\nround trip"}