{"id":370679,"name":"triple","type":"adjective","us_sound":"ˈtrɪp.əl","us_link":"../audio/t/triple.mp3","uk_sound":"ˈtrɪp.əl","uk_link":"../audio/t/uktrima016.mp3","content":"Add to word list\nAdd to word list\nhaving three parts of the same type, or happening three times: Her trainer is a triple Olympic champion. There's a triple bill of Hitchcock films (= three films) on at the cinema next Sunday. triple something\nthree times as large as something: The number of one-parent households reached 10.1 million in 2011, nearly triple that of 1981.\nSMART Vocabulary: related words and phrases\nNumbers: single, double & multiple\nalone\nbilateral\nbilaterally\nbipartite\nbipolar\ndeca-\ndeka-\ndouble-action\ndual\nhimself\nmultiple\nplural\nquintuple\nsolitarily\nsolitary\ntrilateral\ntrilaterally\ntriply\nunilateral\nunit\nSee more results »\nto increase three times in size or amount, or to make something do this: We have tripled our output over the past two years. The workforce has tripled in size since the new factory opened.\nSMART Vocabulary: related words and phrases\nAddition, subtraction, multiplication & division\nadd\nadd (something) up\naddition sign\nadditive\narithmetical\ndeduction\nhalf\nhalve\nhighest common factor\nlong division\npower\nquadruply\nquintuple\nquotient\nrecursion\nround something down\nsubtraction sign\ntable\ntimes\ntreble\nSee more results »\nAdd to word list\nAdd to word list\nconsisting of three parts, or three times in number or amount: If he loses the case, the defendant can be required to pay triple damages. triple verb [ I/T ] us\nYour browser doesn't support HTML5 audio\n/ˈtrɪp·əl/\n[ T ] We’ve tripled our output over the past two years.\nAdd to word list\nAdd to word list\nhaving three parts of the same type, or happening three times: a triple blow/threat The triple threat of late planting, a cool summer, and disease in September has annihilated much of the sunflower acreage.\nthree times bigger in size or amount: Property purchases leapt to $464 million - nearly triple the amount for the previous year.\nto increase to three times the size or amount, or to make something do this: profits/sales triple First-half pretax profit more than tripled to a record £550 million. The company aims to triple its international sales within five years. sales/prices/staff triple See also\ntreble"}