{"id":371081,"name":"triumph","type":"noun","us_sound":"ˈtraɪ.əmf","us_link":"../audio/t/eus74630.mp3","uk_sound":"ˈtraɪ.əmf","uk_link":"../audio/t/uktrima027.mp3","content":"Add to word list\nAdd to word list\nC1 a very great success, achievement, or victory (= when you win a war, fight, or competition), or a feeling of great satisfaction or pleasure caused by this: The book celebrates the hostages' remarkable triumph over appalling adversity. The signing of the agreement was a personal triumph for the prime minister. It was the Republican Party's third election triumph in a row. The eradication of smallpox by vaccination was one of medicine's greatest triumphs. The constitutional changes have been hailed as a triumph for democracy. The game ended in triumph for the home team. He returned in triumph from the sales with a half-price TV.\nThesaurus: synonyms, antonyms, and examples\nto achieve something aimed forsucceedIf you work hard, you'll succeed.thriveUniversity is a place where she will thrive.flourishHe tried journalism, but flourished as a novelist. triumphThe Labour Party triumphed in the election.bring something offShe's one of the few singers who can bring off such a difficult piece of music.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nsomeone or something that becomes popular, wealthy, or has achieved a lotsuccessThe new TV series was a wild success. a roaring successHer third album was a roaring success and went platinum.hitDinner was a hit with the kids.triumphThe court verdict was a triumph for all abuse victims.winWhat can we do to get a win out of this situation?\nSee more results »\nMore examplesFewer examplesHe's always crowing about his latest triumph.Saint Augustine's 'City of God' is an allegory of the triumph of Good over Evil.His tumultuous triumph 5 years ago now seems a mere footnote in history.His eyes gleamed in triumph.The victory over the French at Waterloo was Wellington's greatest triumph.\nSMART Vocabulary: related words and phrases\nSuccess and achievements\na feather in your cap idiom\na roaring success idiom\naccomplishment\nachievement\nachievement test\nascension\nascent\nbelt\nboom\nevery dog has its day idiom\nfeat\nfruition\nhave something under your belt idiom\nlaugh\nprospect\nquantum leap\nsecret sauce\nsellout\nsense of achievement\ntear\nSee more results »\nto have a very great success or victory: I believe that sooner or later good must triumph over evil. The Democrats once again triumphed in recent elections.\nSMART Vocabulary: related words and phrases\nWinning and defeating\nannihilate\nannihilation\nbank\nbe gunning for someone idiom\nbe one in the eye for someone idiom\nconvincing\nmoral victory\nmove/go in for the kill idiom\nnear thing\noutclass\noutcompete\nsew\nslaughter\nstomp on someone/something\nsweep\nsweep the board idiom\ntake someone down\ntake someone to the cleaner's idiom\ntake something apart\nthrash\nSee more results »\nAdd to word list\nAdd to word list\na complete victory or success achieved esp. after great difficulties, making the result particularly satisfying: [ C ] The elimination of smallpox was one of medicine’s greatest triumphs. triumph verb [ I ] us\nYour browser doesn't support HTML5 audio\n/ˈtrɑɪ·əmf/\nWe visited Yorktown Battlefield on the York River, where in 1781 George Washington’s forces triumphed over the English army. triumphant adjective us\nYour browser doesn't support HTML5 audio\n/trɑɪˈʌm·fənt/\nHe made a triumphant return to the stage after several years working in television.\nAdd to word list\nAdd to word list\na very great success or achievement, or a feeling of great satisfaction or pleasure caused by this: business/economic triumphstriumph for sb/sth The deal is a triumph for the company.triumph of sb/sth over sb/sth They see the free trade proposals as the triumph of corporate profits over individual and global well-being.\nto have a very great success or achievement: No model triumphed in all tests, but our top pick performed consistently well.triumph over sb/sth Here, central planners and power monopolies have triumphed over market economics."}