{"id":371459,"name":"trophy","type":"noun","us_sound":"ˈtroʊ.fi","us_link":"../audio/t/trophy.mp3","uk_sound":"ˈtrəʊ.fi","uk_link":"../audio/t/uktrium029.mp3","content":"Add to word list\nAdd to word list\nB2 a prize, such as a gold or silver cup, that is given to the winner of a competition or race, and often returned after a year to be given to the winner of the competition in the following year: He's an excellent rider, but he's never won a major trophy. The Duchess of Cambridge will be presenting the trophies.\nzentilia/iStock/Getty Images Plus/GettyImages\nsomething used as a symbol of success from hunting or war: The animal heads on the wall were trophies of his hunting trips.\nMore examplesFewer examplesThe cup holders began their defence of the trophy in fine style.He proudly held out his trophy for us to admire.He basked in his moment of glory, holding the trophy up to the crowd.They won the trophy for the third year running.All his trophies are on a shelf in his sitting room.\nSMART Vocabulary: related words and phrases\nPrizes, rewards and medals\n(the/a pot of gold at) the end of the rainbow idiom\nAcademy Award\naward\nbemedalled\nblue ribbon\nbooby prize\nbronze\ngong\ngrab bag\nGrammy\nhand something out\nhonour\nOscar\nplatinum disc\nprize\nPulitzer Prize\nrainbow\nstake\nthe golden boot\nthe wooden spoon\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHunting & fishing\nRemembering, reminding and reminders\nused to describe something such as a partner or a possession that is a symbol of someone's success or social position: These women are older well-off professionals who married a good-looking younger trophy husband. This Victorian house going for eight million could be the trophy estate that City buyers have been waiting for. See also\ntrophy wife\ntrophy girlfriend\nMore examplesFewer examples\"Sometimes I wanted to tell everyone - this is my trophy boyfriend,\" she confessed. If he's serious about the relationship, and not just using you as a trophy partner, then he'll make the effort.They've got the vacation house, the expensive sports car, the trophy spouse.Instead of trophy assets such as Rockefeller Center or Pebble Beach golf course, the targets are companies that fit strategically with their acquirers.\nSMART Vocabulary: related words and phrases\nSuccess and achievements\na feather in your cap idiom\na roaring success idiom\naccomplishment\nachievement\nachievement test\nascension\nascent\nbelt\nboom\nevery dog has its day idiom\nfeat\nfruition\nhave something under your belt idiom\nlaugh\nprospect\nquantum leap\nsecret sauce\nsellout\nsense of achievement\ntear\nSee more results »\nAdd to word list\nAdd to word list\na prize, such as a large silver cup or bowl, given to the one who wins a competition or race\nA trophy is also something used as a symbol of success: Under the long high-beamed ceiling, affixed to stone walls, were the trophies – heads of a rhinoceros and an African buffalo with huge horns."}