{"id":371607,"name":"trouble","type":"noun","us_sound":"ˈtrʌb.əl","us_link":"../audio/t/trouble.mp3","uk_sound":"ˈtrʌb.əl","uk_link":"../audio/t/uktropi009.mp3","content":"trouble noun\n(DIFFICULTIES)\nAdd to word list\nAdd to word list\nB1 [ C or U ] problems or difficulties: The tax forms were complicated and I had a lot of trouble with them. Their problems seem to be over for the moment, but there could be more trouble ahead. The trouble started/began when my father came to live with us. [ + -ing verb ] Parents often have trouble finding good carers for their children. We started holding meetings by phone, as travelling in and out of the city became too much trouble. I should get it finished over the weekend without too much trouble. You'll only be storing up trouble for the future if you don't go to the dentist now. She thought her troubles would be over once she'd got divorced. His birthday is the least of my troubles at the moment - I don't even have enough money to pay the rent. Most of the current troubles stem from (= are caused by) our new computer system.\nThesaurus: synonyms, antonyms, and examples\na problemproblemWhat's the problem here?difficultyThe company is having some financial difficulties at the moment.troubleWe've had a lot of trouble with the new computer system.hitchThe ceremony went without a hitch.glitchWe've had a few technical glitches, but I'm confident we'll be ready on time.hurdleGetting a work permit is only the first hurdle.\nSee more results »\nB1 [ U ] a situation in which you experience problems, usually because of something you have done wrong or badly: He's never been in trouble with his teachers before. She'll be in big trouble if she scratches Sam's car. He got into financial trouble after his divorce. I hope you won't get into trouble because of what I said to your dad. The camp is a great way of getting kids off the street and keeping them out of trouble. I hope I haven't landed you in trouble with your boss. The marriage ran into trouble because of her husband's heavy drinking. The company will be in serious/real trouble if we lose this contract. He's stayed out of trouble since he was released from jail last year.\nB2 [ U ] mainly UK a characteristic of someone or something that is considered a disadvantage or problem: The trouble with this carpet is that it gets dirty very easily. It's a brilliant idea. The only trouble is that we don't know how much it will cost. Ron's trouble is that he's too impatient.\nC2 [ U ] problems or difficulties caused by something failing to operate as it should: The plane developed engine trouble shortly after take-off. They have a good reputation for building reliable trouble-free cars. Her knee trouble is expected to keep her out of the game for the rest of the season.\nB2 [ U ] problems in the form of arguments, fighting, or violence: Listen, I don't want any trouble in here, so please just finish your drink and leave. My parents said we had to leave at the first sign of trouble. My little brother's always trying to stir up (= create) trouble between me and my boyfriend.\nMore examplesFewer examplesA woman in the street saw that he was in trouble and came to his aid.You wouldn't believe the amount of trouble I've had with this car.She got through her exams without too much trouble.I was always getting in trouble for misbehaving at school.The only trouble with this café is that the service is so slow.\nSMART Vocabulary: related words and phrases\nDifficult things and people\na (heavy) cross to bear idiom\nalbatross\nball and chain\nbane\nbe dead meat idiom\nbe in the clear idiom\nbump\nchill\nequation\nhindrance\nhot potato\nimpediment\nincubus\nmarathon\nnut\nstumbling block\nteaser\nteething troubles\nthorn in your flesh/side idiom\ntie someone up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDifficult situations and unpleasant experiences\nAdvantage and disadvantage\nViolent or aggressive\nArguments & disagreements\ntrouble noun\n(INCONVENIENCE)\nB2 [ U ] slight problems or effort: I didn't mean to cause you any trouble. \"I'd love some more coffee, if it isn't too much trouble.\" \"Oh, it's no trouble at all.\" I don't want to put you to any trouble (= create any work for you). [ + to infinitive ] If you took the trouble to listen to what I was saying, you'd know what I was talking about. They went to a lot of trouble (= made a lot of effort) for their dinner party, but half the guests didn't bother to turn up. It's annoying, but I don't think I'll go to the trouble of making an official complaint.\nMore examplesFewer examplesHe knew damn well how much trouble it would cause.After all the trouble she put me to, I didn't feel disposed to help her.Great trouble is taken to keep our database up-to-date.If you'd say yes to the request you'd save a lot of trouble.I hope the children haven't caused you too much trouble.\nSMART Vocabulary: related words and phrases\nInconvenience\naggravation\naggro\nawkward\nbore\nbother\nbulky\ndisturbance\nfag\nhave fun and games idiom\nimposition\ninconvenience\ninconvenient\ninconveniently\npalaver\npinprick\npisser\nput something out\nrigamarole\nrigmarole\ntempest\nSee more results »\nIdioms\nbe asking for trouble\nget someone into trouble\nmore trouble than it's worth\nspell trouble\ntrouble and strife\ntrouble verb\n(WORRY)\n[ T ] to cause someone to be worried or nervous: I asked her what was troubling her, but she didn't want to talk. Many of us are deeply troubled by the chairman's decision. [ + (that) ] It troubles me (that) you didn't discuss your problems with me earlier.\nMore examplesFewer examplesMy conscience would really trouble me if I wore a fur coat.She was troubled by the conflicting interests of a career and a family.Several well-known women have been troubled by stalkers recently.My eyes have been troubling me recently.They were greatly troubled by rumours that he was to lose his job.\nSMART Vocabulary: related words and phrases\nCausing anxiety and worry\nagitate\nalarming\nalarmingly\nbite\ncatch up with someone\ncome back to bite someone idiom\ndisturb\nfrighten\nfrighten someone/something away/off\nget/go beyond a joke idiom\ngive someone the jimjams idiom\ngive someone the jitters idiom\noppressive\nrattle\nroost\nstressful\nstressfully\nsuspenseful\nsuspensefully\nsuspensive\nSee more results »\ntrouble verb\n(CAUSE DIFFICULTIES)\n[ T often passive ] to cause someone to have a problem or difficulties: He has been troubled by a knee injury for most of the season.\nSMART Vocabulary: related words and phrases\nCausing feelings of anger and displeasure\naggravate\naggrieve\nalienate\nanger\nannoy\nbend\ngive someone the shits idiom\ngo too far idiom\ngoat\ngrate\nhack someone off\nnark\nrile\nrub\nrub someone up the wrong way idiom\nruffle\nruffle someone's feathers idiom\ntit\ntooth\ntroll\nSee more results »\ntrouble verb\n(CAUSE EFFORT)\n[ T ] to cause someone a small amount of effort: May I trouble you for (= please give me) some more wine, please? [ + obj + to infinitive ] Could I trouble you to open that window? I can't reach it. Let's not trouble ourselves (= make the effort to think) about the details at the moment.\nSMART Vocabulary: related words and phrases\nInconvenience\naggravation\naggro\nawkward\nbore\nbother\nbulky\ndisturbance\nfag\nhave fun and games idiom\nimposition\ninconvenience\ninconvenient\ninconveniently\npalaver\npinprick\npisser\nput something out\nrigamarole\nrigmarole\ntempest\nSee more results »\ntrouble noun\n(DIFFICULTIES)\nAdd to word list\nAdd to word list\n[ C/U ] a problem, or difficulties: [ U ] Trouble began when he came to live with us. [ C ] She thought her troubles would be over when she got a job. [ U ] The patient is having trouble breathing.\n[ C/U ] Trouble can also be a characteristic that is a problem or disadvantage: [ C ] His trouble is that he’s too impatient.\n[ C/U ] Sometimes trouble is a problem or difficulty caused when a machine or system does not work as it should: [ U ] I’m having trouble with my new computer.\n[ C/U ] Trouble can be a cause of arguments or fights: [ U ] Our brother is the source of trouble between my sister and me. in trouble\nSomeone who is in trouble is in a situation that is a problem or difficulty, esp. with the law: He would have been in real trouble if he had been caught.\ntrouble noun\n(INCONVENIENCE)\n[ U ] inconvenience or effort: \"I’d love some coffee, if it isn’t too much trouble.\" \"Oh, it’s no trouble at all.\" The sweater is a bit large, but I’m keeping it because it’s too much trouble to return it. Idioms\ngo to the trouble to do something\nthe trouble with someone/something\ntrouble verb [T]\n(WORRY)\nto cause someone worry or anxiety: What’s troubling you? You seem upset. It troubles me that she didn’t tell me this sooner.\ntrouble verb [T]\n(HAVE DIFFICULTIES)\nto cause someone to have problems or difficulties: He has been troubled by a knee injury for most of the season.\ntrouble verb [T]\n(CAUSE INCONVENIENCE)\nto cause someone a small amount of inconvenience or effort: Could I trouble you to open that window? You don’t need to trouble yourself with all the details."}