{"id":371608,"name":"troubled","type":"adjective","us_sound":"ˈtrʌb.əld","us_link":"../audio/t/troubled.mp3","uk_sound":"ˈtrʌb.əld","uk_link":"../audio/t/uktropi010.mp3","content":"troubled adjective\n(HAVING DIFFICULTIES)\nAdd to word list\nAdd to word list\nC1 having problems or difficulties: The survival package involves selling off the unprofitable parts of the troubled company. This troubled region has had more than its fair share of wars over the centuries. In these troubled times, it's nice to hear some good news.\nMore examplesFewer examplesHaving a baby can be kill or cure for a troubled marriage.My husband's always arguing with my father, and I'm the one who has to pour oil on troubled waters.She was a beacon of hope in troubled times.Your father was a very troubled man, but he's at rest now.The new public relations manager has the difficult task of shoring up the company's troubled image.\nSMART Vocabulary: related words and phrases\nExperiencing difficulties\nbe\nbe (caught) between a rock and a hard place idiom\nbe climbing the walls idiom\nbe for the high jump idiom\nbe/come up against a brick wall idiom\nembattled\nfall into something\nflounder\nfrying pan\nfumble\njungle\nleg\nnot have a leg to stand on idiom\non a razor edge idiom\nout of the frying pan into the fire idiom\npickle\npressed\nrocky\nsticky\nweed\nSee more results »\ntroubled adjective\n(WORRIED)\nworried or nervous: He is clearly a very troubled man.\nSMART Vocabulary: related words and phrases\nAnxious and worried\n(all) hot and bothered idiom\naflutter\nagitated\nangsty\nanxious\nfrightened\nfuss\nget in a sweat idiom\ngoosey\ngrim\npreoccupied\nprey\nprey on sb's mind idiom\nprey on something\nqueasily\nworried\nworriedly\nworrier\nworrywart\nwound up\nSee more results »\ntroubled adjective\n(HAVING PROBLEMS)\nAdd to word list\nAdd to word list\nhaving problems or difficulties: Peace has finally come to this troubled region after many years.\ntroubled adjective\n(WORRIED)\nworried or anxious: The children were not troubled when the dinosaurs in the movie ate up some unlucky humans.\nAdd to word list\nAdd to word list\nexperiencing problems or difficulties, especially financial ones: a troubled bank/homeowner/retailer The company is a decent bet for your money in these troubled times. a troubled business/company/economy"}