{"id":371762,"name":"truck","type":"noun","us_sound":"trʌk","us_link":"../audio/t/truck.mp3","uk_sound":"trʌk","uk_link":"../audio/t/uktruam003.mp3","content":"truck noun\n(VEHICLE)\nAdd to word list\nAdd to word list\nB1 [ C ] (UK also lorry) a large road vehicle that is used for transporting large amounts of goods: The road was completely blocked by an overturned truck. a truck driver See also\ndumper truck UK\nforklift truck\npickup truck\nMonty Rakusen/Cultura/GettyImages\n[ C ] UK (US car) a part of a train that is used for carrying goods or animals: Hundreds of refugees were herded into cattle trucks for the gruelling ten-hour journey.\nAlex_Schmidt/iStock Editorial/Getty Image Plus/GettyImages\nMore examplesFewer examplesEvery few kilometres we passed a burned-out jeep or truck at the side of the road.Long-distance truck drivers often use CB radio to talk to each other.Hundreds of trucks full of fruit and vegetables trundle across the border each day.The sheep were loaded onto trucks.The car skidded and went out of control, crashing into an oncoming truck.\nSMART Vocabulary: related words and phrases\nTrucks, vans & caravans\narmoured car\narticulated lorry\nbakkie\nbin lorry\nbowser\ncamper\ncaravan\nCaterpillar track\ndumper\nJCB\nrig\ntipper\ntravel trailer\ntrucking\nute\nutility truck\nutility vehicle\nUTV\nWinnebago\nwrecker\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRailways: trains & parts of trains\ntruck noun\n(INVOLVEMENT)\nhave no truck with something/someone\nto refuse to become involved with something or someone because you do not approve of it, him, or her\nSMART Vocabulary: related words and phrases\nAbstaining and refraining\nabstain\nabstain from something\nabstainer\nabstemious\nabstemiously\ncut\ndesist\ndisengagement\nfast\nforbear\nforbearance\ngive\ngive up\npull\npull back\nstep\nstep back\nstop\nstop short of something idiom\ntouch\nSee more results »\nto transport something somewhere in a truck: Most of the aid is being trucked into the city, although some is arriving by boat.\nSMART Vocabulary: related words and phrases\nDelivering and despatching\nair bridge\nair corridor\nair drop\nair-dash\nbox scheme\nconsign\ncourier\ndispatch\ndrop off\nmisaddress\nmisdirect\nmisdirection\nmisroute\nnon-delivery\nsend something out\nship\nshipment\nshipper\nshoot\nshoot something off\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTransferring and transporting objects\nRelated word\ntruckingIdiom\nkeep on trucking\nAdd to word list\nAdd to word list\na large vehicle with an open or covered space in the back to hold a load of goods truck verb [ T always + adv/prep ] us\nYour browser doesn't support HTML5 audio\n/trʌk/\nMost supplies are trucked into the city, although some come by rail or plane. trucker noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈtrʌk·ər/\nTruckers spend long periods away from home. trucking noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈtrʌk·ɪŋ/\nRailroads have lost business to trucking companies.\nAdd to word list\nAdd to word list\n( UK also lorry) a large road vehicle that is used for transporting goods: The union represents truck drivers.a commercial/delivery/tanker truck He drives a delivery truck for the furniture store. a heavy/light/pick-up truck Car and truck sales plunged 8% last month .\nUK ( US car) a part of a train that is used for carrying goods or animals: a cattle/coal truck\na road vehicle that is open at the back, used for carrying goods or animals: a cattle/horse truck\na small vehicle on wheels that you push or pull, used for carrying things: Bring a hand truck to help unload boxes. See also\nforklift truck\npanel truck\nto transport something in a truck: The wild, rod-caught salmon is trucked down from Loch Lomond. Massive roof trusses were manufactured off site, trucked in, and placed by crane. The soda pop is trucked 1,500 miles twice a month from bottling plants in Mexico."}