{"id":371809,"name":"true","type":"adjective","us_sound":"truː","us_link":"../audio/t/true.mp3","uk_sound":"truː","uk_link":"../audio/t/uktruam012.mp3","content":"true adjective\n(NOT FALSE)\nAdd to word list\nAdd to word list\nA2 (especially of facts or statements) right and not wrong; correct: [ + that ] Is it true that Mariana and Mark are getting married?if true The allegations, if true, could lead to her resignation.partly true Her story is only partly true.it is true to say Would it be true to say that you've never liked Jim?true picture I suspect she gave a true picture (= accurate description) of what had happened.true reflection I don't believe these exam results are a true reflection of your abilities.true story The movie is based on the true story of a London gangster.strictly true She has since admitted that her earlier statement was not strictly (= completely) true. It used to be very cheap but that's no longer true (= that situation does not now exist).true for Alcohol should be consumed in moderation, and this is particularly true for pregnant women.this is true of Parents of young children often become depressed, and this is especially true of single parents. See also\ntruth\nThesaurus: synonyms, antonyms, and examples\nagreeing with factscorrectThat answer is correct.rightAll his answers were right.trueIs it true that you were born in Sweden?faithfulThis is a faithful account of what happened on the night of 30 May.\nSee more results »\ntrue enough\ncorrect or accurate but not completely explaining something: It's true enough that he had doubts about the project, but we have to look further to understand why he resigned.\nSee more\nMore examplesFewer examplesBut I didn't invent the story - everything I told you is true.Do you think it's true that teenage girls are less self-confident than their male peers?I didn't know whether his story was true or not, but I decided to give him the benefit of the doubt.Is it true (that) she's gone back to teaching?I hereby certify (that) the above information is true and accurate.\nSMART Vocabulary: related words and phrases\nTrue, real, false, and unreal\nactual\nactuality\nactually\nall that glitters is not gold idiom\nanger\nfalse flag\nfalsely\nfantastical\nfever dream\nfictional\nnon-material\nnon-realistic\nnot so much idiom\nnothing could be further from the truth idiom\nnothing could have been further from my mind/thoughts idiom\nuntrue\nuntruly\nunverifiable\nurban myth\nvalidity\nSee more results »\ntrue adjective\n(REAL)\nB1 [ before noun ] being what exists, rather than what was thought, intended, or stated: true love In his seventh decade he has finally found true love. a true friend There cannot be true democracy without reform of the electoral system.true horror The true horror of the accident did not become clear until the morning.\nThesaurus: synonyms, antonyms, and examples\nexisting in factrealHe doesn't think climate change is real.trueHe had finally found true love.actualWe had 500 people register for the conference, but we won't have the actual number of attendees until afterwards.factualThere's no factual information at all in that email.\nSee more results »\ncome true\nB1 If a hope, wish, or dream comes true, it happens although it was unlikely that it would: I'd always dreamed of owning my own house, but I never thought it would come true.\nSee more\nMore examplesFewer examplesThis scandal raises new questions about the president's true character.It's when something really bad like this happens that you find out who your true friends are.We each give you a definition of the word printed on the card, and you have to say which you think is the true definition.I feel I've found my true vocation.The hero of the film finally finds his true self.\nSMART Vocabulary: related words and phrases\nTrue, real, false, and unreal\nactual\nactuality\nactually\nall that glitters is not gold idiom\nanger\nfalse flag\nfalsely\nfantastical\nfever dream\nfictional\nnon-material\nnon-realistic\nnot so much idiom\nnothing could be further from the truth idiom\nnothing could have been further from my mind/thoughts idiom\nuntrue\nuntruly\nunverifiable\nurban myth\nvalidity\nSee more results »\ntrue adjective\n(SINCERE)\nC2 sincere or loyal, and likely to continue to be so in difficult situations: There are few true believers in communism left in the party.true to She has vowed to remain true to the president whatever happens.true to your word He said he'd repay the money the next day, and true to his word (= as he had promised), he gave it all back to me the following morning. Synonyms\ncommitted\ndedicated\ndevoted\nfaithful (LOYAL)\nfirm (CERTAIN)\nloyal\nstalwart (LOYAL)\nstaunch\nsteadfast approving\nsteady\nunfaltering\nunshakeable mainlyUK\nunswerving\nunwavering be true to yourself\nto behave according to your beliefs and do what you think is right: I mean in the end, you have to be true to yourself.\nSee more true to form/type\nSomeone who does something true to form or type behaves as other people would have expected from previous experience: True to form, when it came to his turn to buy the drinks, he said he'd left his wallet at home.\nSee more\nMore examplesFewer examplesShe was a true patriot to the last.He'll be remembered both as a brilliant footballer and as a true sportsman.He has been a true friend to me.She said she would stand by me, and she has been true to her word.His ministers remained true to him throughout the crisis.\nSMART Vocabulary: related words and phrases\nHonesty, openness & sincerity\nabove board\nanti-corruption\nartless\nartlessly\nartlessness\nhonestly\nhonourably\nin\nin all honesty/seriousness/truthfulness idiom\nin good faith idiom\nintegrity\nsincerely\nsincerity\nskinny\nspotless\nsqueaky-clean\nstainless\nthe straight and narrow idiom\ntransparency\nupright\nSee more results »\ntrue adjective\n(HAVING NECESSARY QUALITIES)\n[ before noun ] having all the characteristics necessary to be accurately described as something: Only true deer have antlers.true likeness formal It was said that the portrait was a very true likeness of her (= looked very much like her).true style In true Hollywood style (= in a way that is typical of Hollywood), she's had four marriages and three facelifts.\nSMART Vocabulary: related words and phrases\nTrue, real, false, and unreal\nactual\nactuality\nactually\nall that glitters is not gold idiom\nanger\nfalse flag\nfalsely\nfantastical\nfever dream\nfictional\nnon-material\nnon-realistic\nnot so much idiom\nnothing could be further from the truth idiom\nnothing could have been further from my mind/thoughts idiom\nuntrue\nuntruly\nunverifiable\nurban myth\nvalidity\nSee more results »\ntrue adjective\n(ACCURATE)\n[ after verb ] fitted or positioned accurately: None of the drawers were true.\nSMART Vocabulary: related words and phrases\nStraight, even and level\nbe (as) flat as a pancake idiom\nclean\nclean-cut\ncleanly\nconsistency\nflat\nflatness\nplane\nrelax\nrhythm\nseamless\nsleek\nsleekly\nsmooth\nsteady\nstraight\nstraight edge\nstraightness\nsuper-smooth\nultra-smooth\nSee more results »\nIdioms\nring true\nso ... it's not true\nbe out of true\nto not be in the correct position or to be slightly bent out of the correct shape: This door won't shut. I think the frame must be out of true.\nSee more\nstraight and without moving to either side: Make sure you hit the nails in true.\nSMART Vocabulary: related words and phrases\nStraight, even and level\nbe (as) flat as a pancake idiom\nclean\nclean-cut\ncleanly\nconsistency\nflat\nflatness\nplane\nrelax\nrhythm\nseamless\nsleek\nsleekly\nsmooth\nsteady\nstraight\nstraight edge\nstraightness\nsuper-smooth\nultra-smooth\nSee more results »\ntrue adjective [-er/-est only]\n(CORRECT)\nAdd to word list\nAdd to word list\nagreeing with fact; not false or wrong: The story is actually true. [ + that clause ] It is true that the risk of breaking your hip increases with age.\ntrue adjective [-er/-est only]\n(REAL)\nbased on what is real, or actual, not imaginary: His staff tried to keep the true nature of his illness a secret. true love\nYour true love is someone or something you love more than all others: Her true love is music.\ntrue adjective [-er/-est only]\n(SINCERE)\nsincere and loyal: I am lucky to have true friends. She is one politician who remains true to her principles.\ntrue adjective [-er/-est only]\n(HAVING NECESSARY QUALITIES)\nhaving all the characteristics necessary to be an example of a particular thing: Only true deer have antlers. This portrait is supposed to be a true likeness of Washington. Idioms\nsomeone's true colors\ntrue enough\ntrue to form\ntrue to yourself\ntrue to your word\nAdd to word list\nAdd to word list\nused to describe the final total amount of something after extra costs or payments have been added or taken away: You will need to convert the prices into dollars to see the true cost. It is illegal to hide transactions or to otherwise misrepresent the true value of a business. They bought in haste and without calculating the true cost of purchase."}