{"id":371864,"name":"trump","type":"noun","us_sound":"trʌmp","us_link":"../audio/t/trumps.mp3","uk_sound":"trʌmp","uk_link":"../audio/t/uktruam020.mp3","content":"Add to word list\nAdd to word list\n[ C ] a card that belongs to the group of cards that has been chosen to have the highest value in a particular game: I played a trump.draw a trump Luckily, I drew a trump. trumps [ plural ]\none of the four groups in a set of playing cards that has been chosen to have the highest value during a particular game or part of a game: Diamonds are trumps.\nSee more no trump(s)\na situation in which all four groups of cards have equal value in a game of bridge: The bid is for 2 No trumps.\nSee more\nSMART Vocabulary: related words and phrases\nCard games\nall in\nbidding\nbridge\nbusted flush\ncanasta\ncard sharp\ndeal\ndiamond\nflush\nhonour\njack\npool\nqueen\nre-raise\nrebid\nrecut\nrookie card\nsolitaire\nspade\nstraight\nSee more results »\nIdiom\nturn/come up trumps\nIf you trump another player's card, you beat it with a card that belongs to the group of cards that has been chosen to have the highest value in the game you are playing.\nto beat someone or something by doing or producing something better: Their $60 million bid for the company was trumped at the last moment by an offer for almost twice as much from their main competitor.\nSMART Vocabulary: related words and phrases\nCard games\nall in\nbidding\nbridge\nbusted flush\ncanasta\ncard sharp\ndeal\ndiamond\nflush\nhonour\njack\npool\nqueen\nre-raise\nrebid\nrecut\nrookie card\nsolitaire\nspade\nstraight\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWinning and defeating\nPhrasal verb\ntrump something up\nAdd to word list\nAdd to word list\nto be better than, or have more importance or power than another person or thing: They operated on the assumption that money trumped everything.\nAdd to word list\nAdd to word list\nto beat another person or organization by doing or producing something even better: The French share offer trumps the offer from the American company. Their bid to take over the company was trumped by a US private equity firm.\nif something trumps something else, it is considered to be more important: Financial pressures trumped HR concerns and led to the dismissal of 200 staff.\ncome up/turn up trumps\nto produce a good result, especially when this is not expected: They finally came up trumps with a new product line and some healthy profits. The bank came up trumps and he got his loan.\nPhrasal verb\ntrump up sth/trump sth up"}