{"id":371963,"name":"trust","type":"verb","us_sound":"trʌst","us_link":"../audio/t/trust.mp3","uk_sound":"trʌst","uk_link":"../audio/t/uktruam029.mp3","content":"trust verb\n(BELIEVE)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to believe that someone is good and honest and will not harm you, or that something is safe and reliable: My sister warned me not to trust him. Trust me - I know about these things. Trust your instincts, and do what you think is right. I don't trust air travel - it's unnatural. [ + obj + to infinitive ] I trust him to make the right decision. That man is not to be trusted. I wouldn't trust him with my car. Sometimes you have to trust in the goodness of human nature. However much you plan an expedition like this, you still have to trust to luck to a certain extent.\nMore examplesFewer examplesHe's such a liar - you can't trust a word he says.I can't employ him in the shop unless I can trust him.After what she did to me, I'll never trust her again.You can trust Ruth because she always does things by the rules.He's a sly old devil - I wouldn't trust him with my money.\nSMART Vocabulary: related words and phrases\nTrusting and not trusting\naccept/take something on faith idiom\nbank\nbank on someone/something\nbelieve\nbelieve in something\ndistrustful\ndistrustfully\nhave faith! idiom\nI wouldn't trust someone as far as I could throw them idiom\nkeep faith with something/someone idiom\nmistrustfully\nnon-confidence\nnot trust someone an/one inch idiom\nput/place your faith in something/someone idiom\nreliance\ntrustable\nturn to someone/something\nuntrusting\nuntrustworthiness\nuntrustworthy\nSee more results »\ntrust verb\n(HOPE)\nC1 [ I ] formal to hope and expect that something is true: [ + (that) ] I trust (that) you slept well? The meeting went well, I trust.\nSMART Vocabulary: related words and phrases\nHoping and hopefulness\nappealingly\nboosterish\nboosterism\ncautious\ncautiously\nfancy\nglass\nhopeful\nhopefully\nhopefulness\nill\nit's an ill wind (that blows nobody any good) idiom\nla-la land\npin your hopes on something/someone idiom\npipe dream\nplease God idiom\nPollyanna\npositive\npositiveness\nwing\nSee more results »\nIdioms\nI wouldn't trust someone as far as I could throw them\nnot trust someone an/one inch\ntrust someone (to do something)!\ntrust noun\n(BELIEF)\nB2 [ U ] the belief that you can trust someone or something: a relationship based on trust and understanding We were obviously wrong to put our trust in her. He's in a position of trust (= a position with responsibilities, especially to the public). take something on trust\nto believe that something is true although you have no proof\nMore examplesFewer examplesLack of trust is very destructive in a relationship.Theirs was a partnership based on mutual respect, trust and understanding.A good relationship is built on trust.All her life she had a childlike trust in other people.We place our trust in doctors, but even they are fallible.\nSMART Vocabulary: related words and phrases\nTrusting and not trusting\naccept/take something on faith idiom\nbank\nbank on someone/something\nbelieve\nbelieve in something\ndistrustful\ndistrustfully\nhave faith! idiom\nI wouldn't trust someone as far as I could throw them idiom\nkeep faith with something/someone idiom\nmistrustfully\nnon-confidence\nnot trust someone an/one inch idiom\nput/place your faith in something/someone idiom\nreliance\ntrustable\nturn to someone/something\nuntrusting\nuntrustworthiness\nuntrustworthy\nSee more results »\ntrust noun\n(LEGAL ARRANGEMENT)\n[ C ] a legal arrangement in which a person or organization controls property and/or money for another person or organization: Under the terms of the trust he receives interest on the money, but he cannot get at the money itself. The money that her father left her is being held/kept in trust (= being controlled) for her until she's 30.\nSMART Vocabulary: related words and phrases\nTrusts & funds\nannuity\nblind trust\nescrow\nfiduciary\nfund\nholding company\ninheritance\nkitty\nmutual fund\nnon-discretionary\npension fund\npension plan\nslush fund\nsuper\nsyndic\nthe Consolidated Fund\ntrust fund\ntrustee\ntrusteeship\nunit trust\nSee more results »\ntrust noun\n(ORGANIZATION)\n[ C ] an organization that controls property and/or money for another person: He works for a charitable trust. Housing trusts help to provide houses for people who are not well off.\n[ C ] US used in the name of some banks: Morgan Guaranty Trust\nSMART Vocabulary: related words and phrases\nOrganizations, Societies & clubs\nAssn\nAssoc.\nco-op\ncollegium\ncooperative\nestablishment\nfellowship\nguild\nhost\nlodge\nmembership\nmission\norganization\nsecretary\nsemi-public\nshuffle\nsuperclub\nthird party\nyouth academy\nyouth club\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTrusts & funds\nBanks\ntrust verb [I/T]\n(BELIEVE)\nAdd to word list\nAdd to word list\nto have confidence in something, or to believe in someone: [ T ] Trust me – I would never lie to you. [ T ] I was tested, but I’m not sure I trust the results. [ I ] I have finally learned to trust in my own abilities.\ntrust verb [I/T]\n(HOPE)\nto hope and expect that something is true: [ T ] I trust (that) you slept well?\ntrust noun\n(ARRANGEMENT)\n[ C/U ]\n&#160; social studies a legal arrangement in which a person or organization controls property or money for the benefit of another person or organization: [ U ] The money is being held in trust for her until she turns 21.\n[ C/U ]\n&#160; social studies A trust is also a group of people or organizations that controls property or money for its own benefit, or the property or money controlled by the group: [ C ] The danger of trusts is that they can become very powerful.\ntrust noun\n(BELIEF)\n[ U ] the belief that you can trust someone or something: Their relationship is based on trust and understanding. We were obviously wrong to put our trust in her.\nAdd to word list\nAdd to word list\n[ U ] belief that you can depend on someone or something: Following the recent scandals the industry has to rebuild public trust. Any good business relationship is built on mutual trust. He was elected as a public official in a position of trust.\n[ C or U ]\n&#160; LAW, FINANCE a legal arrangement in which you give a person or organization the right to manage money or property for a particular person or group of people that you have chosen to receive the money: In her will she set up a trust to provide scholarships for young musicians. His inheritance was held in trust until he reached 18. They consulted a solicitor on how to move the controlled trust money.\n[ C ]\n&#160; LAW, FINANCE an organization that manages money or property for another person or group: set up/establish a trust The company is owned by a trust on behalf of staff. She is director of the not-for-profit trust that runs the parks.\n[ C ]\n&#160; LAW, FINANCE an arrangement between two or more companies to work together illegally, for example to control prices: There are difficulties with the laws relating to illegal trusts. The agreement was found to have breached US anti trust laws. See also\nactive trust\nblind trust\nbrains trust\nbreach of trust\nbusiness trust\ncharitable trust\nconstructive trust\ndeed of trust\ndiscretionary trust\nexecuted trust\nView all\nexecutory trust\nexpress trust\nfixed trust\nflexible trust\nimplied trust\ninvestment trust\nliving trust\nprivate trust\npublic trust\nunit trust"}