{"id":372015,"name":"truth","type":"noun","us_sound":"truːθ","us_link":"../audio/t/truth.mp3","uk_sound":"truːθ","uk_link":"../audio/t/uktrust010.mp3","content":"Add to word list\nAdd to word list\nB2 [ U ] the quality of being true: truth in There would seem to be some truth in what she says. There is no truth in the reports of his resignation.truth of You cannot question the truth of his alibi.a grain of truth And yet what he says contains at least a grain of (= a small amount of) truth. Synonyms\ntruthfulness\nveracity formal\nverity formalOpposites\nfalsehood formal\nmendacity formal the truth B1 [ S ]\nthe real facts about a situation, event, or person: tell the truth But was he telling the truth?the truth about I don't suppose we'll ever know the truth about what happened that day.to tell (you) the truth To tell (you) the truth (= speaking honestly) I'm happy he's not coming. in truth formal\nused to show or emphasize that something is true: In truth we feared for her safety, although we didn't let it be known.\nSee more\nC2 [ C ] formal a fact or principle that is thought to be true by most people: It would seem to be a general truth that nothing is as straightforward as it at first seems. The entire system of belief is based on a few simple truths.\nMore examplesFewer examplesThe judge was satisfied that she was telling the truth.There was certainly an element of truth in what she said.He's dying but he refuses to face the truth.It's difficult to disentangle hard fact from myth, or truth from lies.The truth about the accident may never be known.\nSMART Vocabulary: related words and phrases\nReality and truth\nactuality\napothegm\nauthenticity\naxiomatically\nfact\ngospel\nhome truth\nimmediacy\nimpostor syndrome\nit is what it is idiom\nreal life\nrealia\nslice\nthe real McCoy\nthe real thing\nthe real world phrase\ntruth will out idiom\nveracity\nverisimilitude\nverity\nSee more results »\nIdioms\ntruth be told\ntruth is stranger than fiction\ntruth will out\ntruth noun\n(FACT)\nAdd to word list\nAdd to word list\n[ U ] the actual fact or facts about a matter: Tell the truth, now, how did the chair get broken? We may never know the truth about what happened.\ntruth noun\n(QUALITY)\n[ U ] the quality of being true: I can see some truth in what she said.\ntruth noun\n(PRINCIPLE)\n[ C ] plural truths us/truðz, truθs/ a statement or principle that is generally considered to be true: a scientific truth Our system of belief is based on a few simple truths.\nIdioms\nin truth\ntruth is stranger than fiction"}