{"id":372682,"name":"tune","type":"noun","us_sound":"tuːn","us_link":"../audio/t/tune.mp3","uk_sound":"tʃuːn","uk_link":"../audio/t/cdo0123uktune2737.mp3","content":"tune noun\n(MUSICAL NOTES)\nAdd to word list\nAdd to word list\nA2 [ C ] a series of musical notes, especially one that is pleasant and easy to remember: He was humming a tune as he dried the dishes. a theme tunecatchy tune That's a very catchy tune (= easy to remember and pleasant). Synonym\nmelody in tune\nC1 singing or playing notes that are at the right pitch (= level) or that agree with others being sung or played: She can't even sing in tune.\nSee more out of tune\nC1 singing or playing notes that are at the wrong pitch (= level) or that do not agree with others being sung or played: The piano is out of tune.\nSee more\nMore examplesFewer examplesThe band played a familiar tune that had everyone clapping along.As a songwriter, he combined great linguistic felicity with an ear for a tune.I've forgotten how that tune goes - could you hum it for me?That tune really brings back memories .Hearing that tune again filled him with nostalgia.\nSMART Vocabulary: related words and phrases\nMusical pieces\narrangement\nballade\nbolero\nbossa nova\nBritannia\nchorus\nfantasia\nmambo\nmedley\nmelody\nmulti-part\nnocturne\noctet\nreel\nserenade\nsextet\nsignature tune\nsolo\nsonata\nsong form\nSee more results »\ntune noun\n(UNDERSTANDING)\nbe in/out of tune with someone/something\nC2 If you are in tune with people or ideas, you understand or agree with them, and if you are out of tune with them, you do not: Much of his success comes from being in tune with what his customers want.\nSee more\ntune noun\n(AMOUNT)\nto the tune of\nto the stated amount: The City Council had financed the new building to the tune of over four million pounds.\nSee more\ntune noun\n(ENGINE)\n[ C usually singular ] UK a\ntune-up\nSMART Vocabulary: related words and phrases\nEngineering - mechanical\n-engined\nair-cooled\nartificer\nautomative\nbionics\ndolly\ndrive shaft\nengage\ngasman\ngo on\nhorsepower\nmechanical\nmechanize\nneutral\noilcan\noverride\ntick over\ntune (something) up\nunmechanized\nvalve\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCorrecting and mending\ntune verb [T]\n(INSTRUMENT)\nto change a part of a musical instrument so that the instrument produces the correct sounds when played: Get into the habit of tuning your guitar every day before you practise.tune something (up) She tuned (up) her violin before the concert.\nSMART Vocabulary: related words and phrases\nPlaying music\naccompaniment\naccompany\nair guitar\nbeat something out\nbeatbox\nblow\npick\npick someone/something out\npitch\nplay (something) by ear idiom\nplayability\nplayable\npump\ntap\nthrow\ntickle the ivories idiom\ntranspose\ntransposition\nultra-smooth\nvibe\nSee more results »\ntune verb [T]\n(RADIO)\nto move the controls on a radio, television, etc. so that it receives programmes broadcast from a particular station: tune itself to something Press this button and the video will automatically tune itself to the next channel.be tuned to His radio is constantly tuned to KROQ-FM, the local rock station.\nSMART Vocabulary: related words and phrases\nBroadcasting in general\nairplay\nairtime\nairwaves\naudio described\naudio description\ncarry\ncommentary box\nheadline\nhost\ninterchannel\nlive stream\nlocation\nmistune\nproduce\nserialize\nshowrunner\nslow motion\nstation\nstation break\nsubtitled\nSee more results »\ntune verb [T]\n(ENGINE)\nto make slight changes to an engine so that it works as well as possible: tune (up) an engine The engine needs tuning, but there's nothing wrong with the car. Could you tune (up) the engine for me, please?\nSMART Vocabulary: related words and phrases\nEngineering - mechanical\n-engined\nair-cooled\nartificer\nautomative\nbionics\ndolly\ndrive shaft\nengage\ngasman\ngo on\nhorsepower\nmechanical\nmechanize\nneutral\noilcan\noverride\ntick over\ntune (something) up\nunmechanized\nvalve\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCorrecting and mending\nPhrasal verbs\ntune in\ntune (someone/something) out\ntune (something) up\ntune noun\n(MUSICAL NOTES)\nAdd to word list\nAdd to word list\n[ C ] a series of musical notes, esp. one that is pleasant and easy to remember; a melody: That’s a very pretty tune.\ntune noun\n(CORRECT MUSICAL NOTES)\n[ U ] the state of being adjusted to the correct pitch (= degree to which a musical note is high or low) : This piano is out of tune (= the notes are too high or low). Paul just can’t sing in tune (= with correctly produced notes). Idioms\nin tune with someone/something\nto the tune of\ntune verb [T]\n(ADJUST INSTRUMENT)\nto adjust a musical instrument so the sounds produced are the correct pitch (= degree to which the sound is high or low): Tune your guitar before you practice.\ntune verb [T]\n(ADJUST SIGNAL)\nto move the controls on a radio or television set so that it receives programs broadcast from a particular station: Tune your radio to 88.3 FM.\ntune verb [T]\n(ADJUST ENGINE)\nto change the setting of particular parts of an engine so that it works as well as possible: The engine needs tuning. Idiom\ntuned in (to someone/something)Phrasal verbs\ntune in (something)\ntune out (something/someone)\ntune up something\ntune up (something)\nin tune with\nAdd to word list\nAdd to word list\nif a person or organization is in tune with people or ideas, they are able to understand them: These new products are in tune with the requirements of a younger market. His approach to HR is in tune with the new management policies.\nto the tune of\ninformal used to talk about how much something costs: The organization is funded by the UN to the tune of $30 million. The company is in debt to the tune of several million Euros.\nto make small improvements to something so that it is as good as possible for a particular purpose: The project deals with tuning and optimising database performance for a leading UK charity. They need time to tune the launch of this product. They provide finely tuned teaching support appropriate to pupils' individual needs. See also\nfine-tune\nPhrasal verb\ntune sth up"}