{"id":372909,"name":"turbo","type":"noun","us_sound":"ˈtɝː.boʊ","us_link":"../audio/t/cdo0123usturb2397.mp3","uk_sound":"ˈtɜː.bəʊ","uk_link":"../audio/t/cdo0123ukturb2738.mp3","content":"Add to word list\nAdd to word list\nshort for\nturbocharger : a small turbine turned by the waste gases from an engine that pushes the fuel and air mixture into the engine at a higher pressure, increasing the power produced by the engine: The newer model has more power, but without a turbo.\na vehicle that has an engine with a turbocharger: This latest model is a turbo. Related word\nturbocharge\nMore examplesFewer examplesThe performance is improved dramatically by the addition of a turbo on the GXP model. The two of them were talking about turbos and cams and horsepower. This news is like a booster in our back, a big turbo, that I think can help what we're doing.\nSMART Vocabulary: related words and phrases\nMachines - Engines & motors\nclockwork\nelectromotive\nengine\nexhaust\nmotor\nmulti-engine\npower-assisted\nservomechanism\nservomotor\nsprocket\nstarter motor\nsteam engine\ntraction engine\ntreadle\nwork\nworkings\nYou can also find related words, phrases, and synonyms in the topics:\nThe engine & engine parts\nCars\nusing a turbocharger (= a small turbine turned by the waste gases from an engine that pushes the fuel and air mixture into the engine at a higher pressure, increasing the power produced by the engine): It is a 72-ton vehicle with a 1,500-horsepower turbo engine. With the Audi 1.8 turbo I got 23 miles per gallon in the city.\nMore examplesFewer examplesThey own a 1985 Mercedes turbo diesel that can get as much as 35 miles per gallon.Three dials give you information on the turbo boost, water temperature and fuel.With this new form of direct fuel injection, the theory is you get the power and torque for which turbo motors are famous without the drawbacks.\nSMART Vocabulary: related words and phrases\nMachines - Engines & motors\nclockwork\nelectromotive\nengine\nexhaust\nmotor\nmulti-engine\npower-assisted\nservomechanism\nservomotor\nsprocket\nstarter motor\nsteam engine\ntraction engine\ntreadle\nwork\nworkings\nAdd to word list\nAdd to word list\nused to describe an engine or machine in which power is produced by a turbine: It was a very efficient turbo diesel engine. The company owns a fleet of 10 turbo jets. They used turbo heaters on the building site.\ninformal very big, powerful, etc.: He's gone out to a turbo lunch. I call them turbo beauty products because they transform the surface of your skin."}