{"id":373002,"name":"turgidity","type":"noun","us_sound":"tɝːˈdʒɪd.ə.t̬i","us_link":"../audio/t/eus74654.mp3","uk_sound":"tɜːˈdʒɪd.ə.ti","uk_link":"../audio/t/ukturbo015.mp3","content":"turgidity noun [U]\n(BORING QUALITY)\nAdd to word list\nAdd to word list\nformal the fact of being boring and too serious: The prose occasionally lapses into turgidity. Reviews in this journal often comment on the turgidity of the writing of most linguists.\nThesaurus: synonyms, antonyms, and examples\nthe state of being unhappy and uninterestedboredomThere's nothing to do at the cabin - I might die of boredom.tediumFilming a televison show involves a fair bit of waiting and tedium behind the scenes. tediousnessI can't imagine the tediousness of cataloguing every single piece of writing in the archive. wearinessShe listened to his complaining with a growing sense of weariness.ennuiHis latest book was about suburban ennui and the middle-aged desire for something new. drearinessShe wanted to go to the big city and escape the dreariness of her rural, small-town life.\nSee more results »\nMore examplesFewer examplesThis chapter may owe its comparative turgidity to the necessity of dealing with a large subject in a small space.His writing is not plagued by the turgidity that so often seems to be the norm in scholarly papers.\nSMART Vocabulary: related words and phrases\nBoredom, tedium and boring things\nbanality\nblandness\nboredom\nbromide\ncabin fever\ncommonplace\ndullsville\nennui\nflatness\nfrustration\ninsipidness\nploddingly\nrestlessness\nsame\nscreed\nsnooze\nsterility\nthe same old thing idiom\ntorpor\nturgid\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLacking humour\nturgidity noun [U]\n(SWOLLEN QUALITY)\nmedical\n&#160; specialized the fact of being swollen or firm, usually because of being full of liquid: Water is essential to maintain the turgidity of cells.\nMore examplesFewer examplesResin or sap contributes to the turgidity of trees.There is a loss of skin turgidity.The cells lose their turgidity and the pore closes.\nSMART Vocabulary: related words and phrases\nSwellings & lumps\nacoustic neuroma\nadenoma hyperplastic nodules\nangioma\nangrily\nanti-tumour\nbloated\nexcrescence\nfibroid\ngranuloma\nhaematoma\ninflame\ninflammatory\nleiomyoma\nlump\nprotuberance\npuffy\ntumescence\ntumid\ntumour\nwen\nSee more results »"}