{"id":373107,"name":"turned","type":"verb","us_sound":"tɝːn","us_link":"../audio/t/turn.mp3","uk_sound":"tɜːn","uk_link":"../audio/t/uktermi004.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nturn\nturn verb\n(GO ROUND)\nB2 [ I or T ] to (cause to) move in a circle around a fixed point or line: The earth turns on its axis once every 24 hours. She turned on her toes, holding out her skirt. The wheels started to turn (around). Turn the steering wheel as quickly as you can. She turned the doorknob and quietly opened the door. Slowly, I turned the door handle.\nMore examplesFewer examplesThere was no air conditioning, just a ceiling fan turning slowly.I heard someone turn a key in the lock.She turned the handle and slowly opened the door.We watched as the sails of the windmill slowly started to turn.When this wheel turns, it makes those big stones turn which grind the grain into flour.\nSMART Vocabulary: related words and phrases\nRevolving, rotating and spinning\naround\naround and around idiom\nbackspin\nbirl\ncentrifugal\nreel\nrevolving\nrotary\nrotate\nrotation\nrotative\nspan\nspin\nswim\nswing\nswizzle\ntwirl\ntwirling\ntwirly\nunderspin\nSee more results »\nturn verb\n(CHANGE DIRECTION)\nA2 [ I or T ] to (cause to) change the direction in which you are facing or moving: Turn right at the traffic lights. The path twists and turns for the next half mile. We have to turn down/into/up the next road on the right. Plants tend to turn towards the source of light. She turned to face him. He turned round and waved to us. He turned on his heel (= turned quickly to face the opposite direction) and left the room. The person on my left turned to me and whispered \"Not another speech!\" His wife tried to speak to him, but he turned his back (on her)/turned away (from her) (= moved so that his back, not his face, was towards her to show his anger). At about three o'clock, the tide started to turn (= the sea started to come closer to or move away from the beach). He turned his head to me to listen. I'll just turn the car round and go back the way we came. We watched until the car had turned (= gone around) the corner. The army turned their guns on (= pointed them at and started to shoot at) the protesters. She can turn (= perform) a somersault.\nMore examplesFewer examplesFollow the road for two kilometres, then turn left.The sight was so horrible that I had to turn away.He would always turn and wave at the end of the street.The intruders turned and ran as the police shone their torches full on them.The plane turned northwards.\nSMART Vocabulary: related words and phrases\nChanging direction\nabout-face\nabout-turn\nbear\nbranch off\nbreak\ncut\ndecoy\ndo an about-turn\nexcursive\nexcursively\nflippy\nglance off (something)\nreverse\nslew\nsomeone's back is turned idiom\nswerve\nturn\nturn around\nturn off (something)\nU-ie\nSee more results »\nturn verb\n(CHANGE POSITION)\nB1 [ I or T ] to move, or to move an object or page, so that a different side or surface is on the top: Now turn the page, please, and start work on Exercise 2. She turned the vase over to look for the price. He turned over two or three pages. She put out the light, turned over (= rolled in order to face in another direction) and went to sleep. Now turn to (= open the book at) page 23 and look at the first paragraph.\nMore examplesFewer examplesThe car spun off the road, turned over twice and came to rest in a field.That painting is upside-down - turn it the other way, quick!It's time to turn the cassette over - that side's finished.Turn the cushion the other way up, so that the stain doesn't show.He keeps turning the pages, but I don't think he can actually be reading it that quickly.\nSMART Vocabulary: related words and phrases\nChanging direction\nabout-face\nabout-turn\nbear\nbranch off\nbreak\ncut\ndecoy\ndo an about-turn\nexcursive\nexcursively\nflippy\nglance off (something)\nreverse\nslew\nsomeone's back is turned idiom\nswerve\nturn\nturn around\nturn off (something)\nU-ie\nSee more results »\nturn verb\n(BECOME)\nB2 [ L, I or T usually + adv/prep ] to (cause to) become, change into, or come to be something: The weather has suddenly turned cold. When I refused to pay, he turned nasty. She turned pale and started to shiver. The mood of the meeting turned solemn when the extent of the problem became known. The companies worked well together for a while, but eventually the relationship turned sour (= became bad). Keele, pop star turned business tycoon, has launched a new range of cosmetics. The dry weather turned the soil into/to concrete. By the end of September, the leaves have started to turn (= become brown). Her attitude turned from politely interested to enthusiastic during the course of our conversation.\nThesaurus: synonyms, antonyms, and examples\nto becomebecomeMy arm was becoming more and more painful.getIt’s getting dark now.growTempers had been growing more and more frayed during the evening.goMy hair is going white.turnThe sky turned black.\nSee more results »\nturn 16, nine o'clock, etc.\nC1 to become a particular age or time: She turned 18 last year. It's just turned ten o'clock.\nMore examplesFewer examplesHe started to turn grey in his mid-forties.We're planning to turn the smallest bedroom into an office.The situation could turn nasty at any moment.He was an amateur singer until the age of 40, when he turned professional.You make wine by leaving grape juice to ferment until all the sugar has turned to alcohol.\nSMART Vocabulary: related words and phrases\nChanging\nabout-face\nabout-turn\nalterable\naltered\nalternate\nchurn\ndisturb\ndrip\nmeta\nmetamorphose\nmodulate\nmodulation\nmorph\nmove on\npervert\nsanitization\nsemi-domesticated\nshake someone out of something\nshake someone up\nstead\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDescribing age & birthdays\nturn verb\n(SWITCH)\nA2 [ I or T, usually + adv/prep ] to use a control to switch a piece of equipment or a power or water supply on or off, or to increase or reduce what it is producing: Turn off/out the light. Who turned the TV on? I asked him to turn down the heating. Turn the sound up - I can't hear what they're saying. The heater turns off (= can be switched off) using this switch.\nMore examplesFewer examplesCould you turn the light off, please?To turn the television on, you just push this button.The bath is running over - quick, turn the taps off.Are you comfortable or shall I turn the heat down?The electricity has been turned off.\nSMART Vocabulary: related words and phrases\nElectricity & electronics\nanodize\nanti-static\narc\nbitstream\nbrownout\ncapacitance\nchargeable\nelectricity\nhigh-voltage\nhoming\ninduction\ninsulating tape\nlinesman\nmagnet\nmultimeter\nnegatively\nnon-electric\nnon-electrical\nnon-electronic\nsolid-state\nSee more results »\nturn verb\n(TWIST)\nturn your ankle old-fashioned\nto damage the muscles in the foot by suddenly twisting it too strongly: She turned her ankle on the rocks and had to hobble back to camp.\nSMART Vocabulary: related words and phrases\nInjuring and injuries\nat-risk\nbe in the wars idiom\nbite\nboo-boo\nbrain damage\ndisable\nharm\ninjure\ninjury\nlesion\nlesional\nreinjure\nreinjury\nscarred\nscathe\nsprain\nstrain\ntrauma\nvictim\nwounded\nSee more results »\nturn verb\n(WOOD)\n[ T ]\n&#160; engineering\n&#160; specialized to shape a piece of wood while it is attached to a machine that spins it: a turned bowl\nSMART Vocabulary: related words and phrases\nBuilding: carpentry & joinery\nbeading\nbevel\nbevelled\ncabinetmaker\ncarpenter\nfretsaw\ngimlet\nintarsia\njigsaw\njoiner\njoinery\nmitre\nplane\nprime\nsand\nsandpaper\nsawdust\nseasoned\nshelve\nwoodwork\nSee more results »\nIdioms\nnot turn a hair\nturn a blind eye\nturn a deaf ear\nturn your back on something\nturn your back on someone\nturn your hand to something\nturn someone's head\nturn your nose up\nturn something on its head\nturn over a new leaf\nMore idioms\nturn someone's stomach\nturn (something) upside down\nturn tail\nturn the clock back\nturn the corner\nturn the other cheek\nturn the spotlight on something\nturn the tables on someone\nPhrasal verbs\nturn (someone) against someone/something\nturn around\nturn something around\nturn away\nturn someone away\nturn (someone) back\nturn something/someone down\nturn in\nturn someone in\nturn something in\nMore phrasal verbs\nturn (someone/something) into someone/something\nturn off (something)\nturn someone off\nturn something on\nturn on someone\nturn on something\nturn someone on\nturn someone on to something\nturn out\nturn something out\nturn someone out\nturn over\nturn (something) over\nturn over something\nturn something over\nturn somewhere/something over\nturn something over to someone\nturn someone over to someone\nturn round\nturn something round\nturn to someone/something\nturn to something\nturn (something) to something\nturn up (somewhere)\nturn up\nturn something up"}