{"id":373091,"name":"turnaround","type":"noun","us_sound":"ˈtɝːn.ə.raʊnd","us_link":"../audio/t/turnaround.mp3","uk_sound":"ˈtɜːn.ə.raʊnd","uk_link":"../audio/t/ukturbo027.mp3","content":"turnaround noun\n(TIME TAKEN)\nAdd to word list\nAdd to word list\n[ U ] (UK usually turnround) the amount of time taken for something to happen after a vehicle, an instruction, or an order for goods arrives at a place: We'll have to improve the turnaround - three days is too long. Turnaround time for each order is, on average, four days. See also\nturn something around\nSMART Vocabulary: related words and phrases\nTransferring and transporting objects\nbear\nbearer\nbike\nbike rack\nborne\nbring\nbudge\ncall for someone\nchauffeur\nconvey\nhump\nimport\npickup\nportable\nportage\npost-delivery\nput something/someone down\ntransplant\ntransportation\ntruck\nSee more results »\nturnaround noun\n(BIG CHANGE)\n[ S ] (UK also turnround) an occasion when a business, plan, or system suddenly becomes successful: The CEO was responsible for the turnaround in the company's fortunes.\n[ S ] (UK also turnround) any change from one thing to its opposite: What a turnaround - they were losing 3–0, they came back to win 4–3.\nSMART Vocabulary: related words and phrases\nSuccess and achievements\na feather in your cap idiom\na roaring success idiom\naccomplishment\nachievement\nachievement test\nascension\nascent\nbelt\nboom\nevery dog has its day idiom\nfeat\nfruition\nhave something under your belt idiom\nlaugh\nprospect\nquantum leap\nsecret sauce\nsellout\nsense of achievement\ntear\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSuccess & failure in business\nChange and changes\nAdd to word list\nAdd to word list\na positive change; improvement: Business was up over 40% in a dramatic turnaround from last year.\nAdd to word list\nAdd to word list\nCOMMERCE, PRODUCTION the amount of time that it takes for a piece of work to be done, a product to be supplied, etc.: Management examined ways to speed up turnaround.\na big change that turns a bad situation into a good one: The insurance group's focus on new products played a big part in its turnaround.a turnaround in sth The greatest turnaround in market conditions has been seen in the South East.a turnaround plan/programme/strategy The troubled insurer announced a turnaround plan to rescue the business.\nTRANSPORT the amount of time it takes for a truck, plane, etc. to get ready for a return trip: The airline's 25-minute turnaround time does not provide sufficient time for basic security checks."}