{"id":373086,"name":"turn","type":"verb","us_sound":"tɝːn","us_link":"../audio/t/turn.mp3","uk_sound":"tɜːn","uk_link":"../audio/t/uktermi004.mp3","content":"turn verb\n(GO ROUND)\nAdd to word list\nAdd to word list\nB2 [ I or T ] to (cause to) move in a circle around a fixed point or line: turn on The earth turns on its axis once every 24 hours. She turned on her toes, holding out her skirt.turn (around) The wheels started to turn (around). Turn the steering wheel as quickly as you can. She turned the doorknob and quietly opened the door. Slowly, I turned the door handle.\n[ T ] to perform a movement in which your body moves around in a circle: turn a somersault She turned a full somersault in the air. turn cartwheels They turned cartwheels down the catwalk.\nMore examplesFewer examplesThere was no air conditioning, just a ceiling fan turning slowly.I heard someone turn a key in the lock.She turned the handle and slowly opened the door.We watched as the sails of the windmill slowly started to turn.When this wheel turns, it makes those big stones turn which grind the grain into flour.\nSMART Vocabulary: related words and phrases\nRevolving, rotating and spinning\naround\naround and around idiom\nbackspin\nbirl\ncentrifugal\nreel\nrevolving\nrotary\nrotate\nrotation\nrotative\nspan\nspin\nswim\nswing\nswizzle\ntwirl\ntwirling\ntwirly\nunderspin\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGymnastics\nturn verb\n(CHANGE DIRECTION)\nA2 [ I or T ] to (cause to) change the direction in which you are facing or moving: Turn right at the traffic lights.twist and turn The path twists and turns for the next half mile. We have to turn down/into/up the next road on the right. Plants tend to turn towards the source of light. She turned to face him.turn on your heel He turned on his heel (= turned quickly to face the opposite direction) and left the room.turn to The person on my left turned to me and whispered \"Not another speech!\"turn your back (on) His wife tried to speak to him, but he turned his back (on her)/ (= moved so that his back, not his face, was towards her to show his anger).turn away (from) She turned away (from him) to hide her tears. the tide turns At about three o'clock, the tide started to turn (= the sea started to come closer to or move away from the beach). He turned his head to me to listen.turn something round I'll just turn the car round and go back the way we came. We watched until the car had turned (= gone around) the corner.turn something on someone The army turned their guns on (= pointed them at and started to shoot at) the protesters.\n[ I, I or T ] In cricket, if a ball turns, it changes direction suddenly when it hits the ground: On this pitch, the ball turns and our batsmen have had to learn a new technique The totals became lower as the day wore on, and the ball turned more.\nMore examplesFewer examplesFollow the road for two kilometres, then turn left.The sight was so horrible that I had to turn away.He would always turn and wave at the end of the street.The intruders turned and ran as the police shone their torches full on them.The plane turned northwards.\nSMART Vocabulary: related words and phrases\nChanging direction\nabout-face\nabout-turn\nbear\nbranch\nbranch off\ndecoy\ndo an about-face\ndo an about-turn\nexcursive\nexcursively\nflippy\nping-pong\nregear\nreverse\nsheer\nslew\nsomeone's back is turned idiom\nswerve\nturn around\nwheel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCricket\nturn verb\n(CHANGE POSITION)\nB1 [ I or T ] to move, or to move an object or page, so that a different side or surface is on the top: Now turn the page, please, and start work on Exercise 2.turn something over She turned the vase over to look for the price. He turned over two or three pages.turn over She put out the light, turned over (= rolled in order to face in another direction) and went to sleep.turn to Now turn to (= open the book at) page 23 and look at the first paragraph.\nMore examplesFewer examplesThe car spun off the road, turned over twice and came to rest in a field.That painting is upside-down - turn it the other way, quick!It's time to turn the cassette over - that side's finished.Turn the cushion the other way up, so that the stain doesn't show.He keeps turning the pages, but I don't think he can actually be reading it that quickly.\nSMART Vocabulary: related words and phrases\nChanging direction\nabout-face\nabout-turn\nbear\nbranch\nbranch off\ndecoy\ndo an about-face\ndo an about-turn\nexcursive\nexcursively\nflippy\nping-pong\nregear\nreverse\nsheer\nslew\nsomeone's back is turned idiom\nswerve\nturn around\nwheel\nSee more results »\nturn verb\n(BECOME)\nB2 [ L, I or T usually + adv/prep ] to (cause to) become, change into, or come to be something: The weather has suddenly turned cold. When I refused to pay, he turned nasty. She turned pale and started to shiver. The mood of the meeting turned solemn when the extent of the problem became known. The companies worked well together for a while, but eventually the relationship turned sour (= became bad). Keele, pop star turned business tycoon, has launched a new range of cosmetics.turn something into/to something The dry weather turned the soil into/to concrete. By the end of September, the leaves have started to turn (= become brown).turn from something to something Her attitude turned from politely interested to enthusiastic during the course of our conversation.\nThesaurus: synonyms, antonyms, and examples\nto becomebecomeMy arm was becoming more and more painful.getIt’s getting dark now.growTempers had been growing more and more frayed during the evening.goMy hair is going white.turnThe sky turned black.\nSee more results »\nturn 16, 50, etc.\nC1 to become a particular age: She turned 18 last year.\nSee more turn ten o'clock, nine o'clock, etc. UK\nC1 to become a particular time: It's just turned ten o'clock.\nSee more\nMore examplesFewer examplesHe started to turn grey in his mid-forties.We're planning to turn the smallest bedroom into an office.The situation could turn nasty at any moment.He was an amateur singer until the age of 40, when he turned professional.You make wine by leaving grape juice to ferment until all the sugar has turned to alcohol.\nSMART Vocabulary: related words and phrases\nChanging\nabout-face\nabout-turn\nalterable\naltered\nalternate\nchurn\ndisturb\ndrip\nmeta\nmetamorphose\nmodulate\nmodulation\nmorph\nmove on\npervert\nsanitization\nsemi-domesticated\nshake someone out of something\nshake someone up\nstead\nSee more results »\nturn verb\n(SWITCH)\nA2 [ I or T, usually + adv/prep ] to use a control to switch a piece of equipment or a power or water supply on or off, or to increase or reduce what it is producing: turn something off/out I got into bed, turned off/out the light, and fell asleep.turn something on Who turned the TV on?turn something down I asked him to turn down the heating.turn something up Turn the sound up - I can't hear what they're saying.turn off The heater turns off (= can be switched off) using this switch.\nMore examplesFewer examplesCould you turn the light off, please?To turn the television on, you just push this button.The bath is running over - quick, turn the taps off.Are you comfortable or shall I turn the heat down?The electricity has been turned off.\nSMART Vocabulary: related words and phrases\nElectricity & electronics\nanodize\nanti-static\narc\nbitstream\nbrownout\ncapacitance\nchargeable\nelectricity\nhigh-voltage\nhoming\ninduction\ninsulating tape\nlinesman\nmagnet\nmultimeter\nnegatively\nnon-electric\nnon-electrical\nnon-electronic\nsolid-state\nSee more results »\nturn verb\n(TWIST)\nturn your ankle old-fashioned\nto damage the muscles in the foot by suddenly twisting it too strongly: She turned her ankle on the rocks and had to hobble back to camp.\nSee more\nturn verb\n(WOOD)\n[ T ]\n&#160; engineering\n&#160; specialized to shape a piece of wood while it is attached to a machine that spins it: a turned bowl\nSMART Vocabulary: related words and phrases\nBuilding: carpentry & joinery\nbeading\nbevel\nbevelled\ncabinetmaker\ncarpenter\nfretsaw\ngimlet\nintarsia\njigsaw\njoiner\njoinery\nmitre\nplane\nprime\nsand\nsandpaper\nsawdust\nseasoned\nshelve\nwoodwork\nSee more results »\nIdioms\nnot turn a hair\nthere's no turning back\nturn a blind eye\nturn a deaf ear\nturn your back on something\nturn your back on someone\nturn your hand to something\nturn someone's head\nturn your nose up\nturn something on its head\nMore idioms\nturn over a new leaf\nturn someone's stomach\nturn (something) upside down\nturn tail\nturn the corner\nturn the other cheek\nturn the spotlight on something\nturn the tables on someone\nPhrasal verbs\nturn (someone) against someone/something\nturn around\nturn something around\nturn away\nturn someone away\nturn (someone) back\nturn something/someone down\nturn in\nturn someone in\nturn something in\nMore phrasal verbs\nturn (someone/something) into someone/something\nturn off (something)\nturn someone off\nturn something on\nturn on someone\nturn on something\nturn someone on\nturn someone on to something\nturn out\nturn something out\nturn someone out\nturn over\nturn (something) over\nturn over something\nturn something over\nturn somewhere/something over\nturn something over to someone\nturn someone over to someone\nturn round\nturn something round\nturn to someone/something\nturn to something\nturn (something) to something\nturn up (somewhere)\nturn up\nturn something up\nturn noun\n(TIME TO DO STH)\nB1 [ C ] an opportunity or a duty to do something at a particular time or in a particular order, before or after other people: Is it my turn yet? [ + to infinitive ] I waited so long for my turn to see the careers adviser that I missed my bus.turn to It's your turn to do the dishes!miss a turn In this game if you give the wrong answer you have to miss a turn. Compare\ngo noun (OPPORTUNITY) take turns B2 (UK also take it in turn(s))\nWhen a number of people take turns, they do the same thing one after the other: We take turns answering the phone.\nSee more in turn C1 (also by turns)\none after the other in an agreed order: Each of us takes a break in turn.\nSee more out of turn\nnot following the agreed order: You are not allowed to play a card out of turn.\nSee more\nMore examplesFewer examplesWhose turn is it to buy the drinks?I'm sorry, but you'll just have to wait your turn like everybody else.Get to the end of the queue and wait your turn like everyone else.Come on, it's my turn. Fair's fair!Fair go mate, let the others have a turn!\nSMART Vocabulary: related words and phrases\nOpportunity\nanother/a second bite at/of the cherry idiom\nbe in with a shout idiom\nbest bet idiom\nbig break\nfish\nfoot\nhave a few, several, etc. irons in the fire idiom\nhave a field day idiom\nhay\nheadroom\niron\nit's now or never idiom\npass\nplatform\nroom for manoeuvre idiom\nscope\nshop window\nsmell blood idiom\nthe American dream\nthe run of something idiom\nSee more results »\nturn noun\n(GO ROUND)\n[ C ] an action that causes something to move in a circle round a fixed point: Give the screw a couple of turns to make sure it's tight.\nMore examplesFewer examplesI gave the knob a couple of turns.One turn is enough to get the heating going.It took several violent turns of the handle to set the tractor in motion.\nSMART Vocabulary: related words and phrases\nRevolving, rotating and spinning\naround\naround and around idiom\nbackspin\nbirl\ncentrifugal\nreel\nrevolving\nrotary\nrotate\nrotation\nrotative\nspan\nspin\nswim\nswing\nswizzle\ntwirl\ntwirling\ntwirly\nunderspin\nSee more results »\nturn noun\n(CHANGE IN DIRECTION)\nB2 [ C ] a change in the direction in which you are moving or facing: make a turn When you see the school on the left, make a right turn.twists and turns The path was full of twists and turns. on the turn UK\nstarting to change direction: The tide is on the turn.\nstarting to become better or worse: There are fears that the housing market is on the turn. The world economy would appear to be on the turn. Some say the club's fortunes might be on the turn. I had a feeling my luck was on the turn.\n(of food or drink) starting to decay: This milk smells funny – I think it's on the turn. Often the fruit is so ripe that it is on the turn. the turn of something\nC2 the point at which something changes or moves in a different direction: the turn of the tide\nSee more the turn\nthe middle point in a round of golf, usually after the ninth hole: at the turn He was six under at the turn.reach the turn She reached the turn in 39.\nMore examplesFewer examplesTake a right turn by the station.Just take three left turns and you will reach the school.I remembered to get to your house it was a left turn after the traffic lights.He tried to take the turn too quickly and veered off the road.\nSMART Vocabulary: related words and phrases\nChanging direction\nabout-face\nabout-turn\nbear\nbranch\nbranch off\ndecoy\ndo an about-face\ndo an about-turn\nexcursive\nexcursively\nflippy\nping-pong\nregear\nreverse\nsheer\nslew\nsomeone's back is turned idiom\nswerve\nturn around\nwheel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChanging\nBecoming better\nDeteriorating and making worse\nDecaying and staying fresh\nGolf\nturn noun\n(DEVELOPMENT)\ntake a ... turn\nto develop in a particular way: The battle for control of the company took an interesting turn today.\nSee more take a turn for the better/worse\nC2 to suddenly become better or worse: Their relationship took a turn for the worse when he lost his job.\nSee more\nturn noun\n(PERFORMANCE)\n[ C ] UK a stage act or performance: The first couple of turns were children singing and dancing.\nSMART Vocabulary: related words and phrases\nSpectacles & performances\naerobatic\namateur theater\nbalancing act\nbravura performance\nbullfight\ndouble-header\nminstrel show\nmusic hall\nnon-musical\none-night stand\none-person\nroutine\nspectacular\nstrip\nstripping\nstriptease\nsuper-spectacle\nsupershow\nswansong\ntattoo\nSee more results »\nturn noun\n(ILLNESS)\n[ C ] old-fashioned informal a slight illness, a strange feeling, or a nervous shock: After the accident I started having funny turns.give someone a turn It gave me quite a turn to see him after all these years.\nSMART Vocabulary: related words and phrases\nDisease & illness - general words\naggressiveness\nautoimmune disease\nbilharzia\nbluetongue\ncalculus\nCFS\ncomplication\niatrogenic\nill health\nimpairment\nincurably\nindustrial disease\ninfantile\nseizure\nserial interval\nsubvariant\nsystemically\nteratoma\nterminally\nuntreated\nSee more results »\nturn noun\n(MUSIC)\nmusic\n&#160; specialized a sign above a note in a piece of written music that means four notes, including the note written and notes above and below this note, should be played: Ornamental turns are a common feature of baroque music.\nSMART Vocabulary: related words and phrases\nTechnical music terms\naccidental\nadagio\naleatory\nandante\nantiphonal\narpeggio\narr.\ncadence\ngiusto\ngroove\nharmonic\nharmonic progression\nharmony\nlegato\nsyncopated\nsyncopation\ntempered\ntempo\ntimbre\ntime signature\nSee more results »\nIdioms\na good/bad turn\nat every turn\na turn of the screw\ncooked/done to a turn\none good turn deserves another\nspeak/talk out of turn\nturn verb\n(GO AROUND)\nAdd to word list\nAdd to word list\n[ I/T ] to move or cause something to move in a circle around a central point or line: [ I ] The earth turns on its axis once every 24 hours. [ T ] She turned the doorknob and opened the door.\nturn verb\n(CHANGE DIRECTION)\n[ I/T ] to change the direction in which you are facing or moving, or to cause someone or something to face or move in a different direction: [ I ] They told us to turn right at the first traffic light. [ T ] Turn your head this way so that you’re looking right at the camera. [ I ] I turned to the person next to me and asked her what time it was. [ T ] The car turned (= went around) the corner. [ I ] fig. He felt desperate and didn’t know where to turn for help. [ I ] I turned over (= changed how I was lying) and tried to sleep, but quickly gave up.\n[ I/T ] If you turn something or turn something over, you place the surface that was on top on the bottom: [ T ] He turned the pages of a magazine. [ M ] She turned the baby over onto his stomach.\nturn verb\n(BECOME)\nto become or cause to become, change, or come to be: [ L ] The weather suddenly turned colder, and it started to rain. [ I ] By mid-September, the leaves are starting to turn (= change color).\nYou say that someone turns a particular color when strong emotion or illness causes that person’s face to appear red, gray, yellow, etc: [ L ] He turned red with embarrassment.\nTurn is used with times and ages to show that a particular point has been reached or passed: [ L ] My little girl just turned six in February.\nturn verb\n(SWITCH)\n[ always + adv/prep ] to use a control to switch a piece of equipment on or off, or to adjust it to change the amount of what it is producing: [ M ] Please turn off/out the lights when you leave. [ M ] Who turned my computer on/off? [ M ] Turn the TV down (= make the sound quieter) – it’s too loud. [ M ] Turn up the volume – I can’t hear what they’re saying.\nturn verb\n(TWIST)\n[ T ] to damage the muscles in the foot by suddenly bending it too strongly: to turn your ankle\nturn verb\n(MAKE ILL)\n[ I/T ] to feel that you are going to vomit, or to cause your stomach to feel this way: [ I/T ] The stench made my stomach turn.\nIdioms\nturn a profit\nturn your back on someone/something\nturn back the clock (on something)\nturn someone/something loose\nturn your nose up at something\nturn over a new leaf\nturn over in your grave\nturn the other cheek\nturn the tablesPhrasal verbs\nturn something around\nturn someone away\nturn someone off\nturn someone on\nturn someone on to something\nturn against someone/something\nturn down something\nturn in\nturn in something/someone\nturn into something\nMore phrasal verbs\nturn on something\nturn on someone\nturn out\nturn out\nturn out something\nturn out someone\nturn over something/someone\nturn to someone\nturn to something\nturn to something\nturn up (something)\nturn noun [C]\n(OPPORTUNITY)\nan opportunity or a duty to do something at a particular time or in a particular order, before or after other people: [ + to infinitive ] It’s your turn to do the grocery shopping.\nturn noun [C]\n(CHANGING DIRECTION)\na change in the direction in which you are moving or facing: Make a left turn at the next traffic light.\nturn noun [C]\n(GOING AROUND)\nthe act of causing something to move in a circle around a fixed point: This little wheel will shut off the water if you give it several turns.\nIdioms\nin turn\nthe turn of the century\nturn of events\nAdd to word list\nAdd to word list\nto change into something or make something change into something: turn sth into sth These machines can turn a computer design into a 3-D prototype in minutes. With some wise internet trading, he managed to turn $68,000 into $100,000 in three years.\nto change direction, or to make something change direction: The first quarter could see a further decline in retail customers, though executives said they were confident the trend will turn.turn negative/positive Sales are expected to turn positive in the first quarter of next year. turn higher/lower\nturn sth on its head\nto make something the opposite of what it was previously: The internet turned the world of flight booking on its head.\nturn a profit\nFINANCE to make a profit: The business was set up five years ago but is still struggling to turn a profit.\nturn sth to your advantage\nto find a way of getting something positive out of a bad situation: Experienced long-term investors can turn an economic downturn to their advantage.\nturn your back on sth\nto refuse to be involved in something that you were previously involved in: He said the country could not turn its back on globalization. Phrasal verbs\nturn around\nturn down\nturn sb/sth down\nturn in sth\nturn sth out\nturn over\nturn over sth\nturn sth over to sb/sth\nturn to sb/sth\n[ S ]\n&#160; FINANCE, ECONOMICS a change in the way something such as prices, rates, or the economy is behaving: It is too early to know whether the economy has reached a turn in the cycle.take a turn for the better/worse Media stocks took a turn for the better.bad/downward/upward turn The figures have taken a downward turn.\n[ C ]\n&#160; FINANCE, STOCK MARKET the profit from an investment: The shares were picked up by investors looking to make a quick turn on their money.\n[ C ]\n&#160; STOCK MARKET, FINANCE the difference between a trader’s buying price and selling price for particular shares, currencies, etc. See also\nspread noun"}