{"id":373141,"name":"turnkey","type":"adjective","us_sound":"ˈtɝːn.kiː","us_link":"../audio/t/usturk_009.mp3","uk_sound":"ˈtɜːŋ.kiː","uk_link":"../audio/t/ukturnk001.mp3","content":"Add to word list\nAdd to word list\n(of a property or a piece of equipment) ready to be used immediately by the person who is buying or renting it, or relating to this arrangement: Some people hire a contractor to build turnkey houses - ready to move into with no renovations or repairs required. We have developed turnkey solutions designed specifically for small business owners.\nMore examplesFewer examplesSoft-top kit cars were available either as a turnkey vehicle or a car that you put together yourself.Museums may select a \"turnkey\" exhibition curated by the bank or they can put together shows themselves by selecting offerings in the collection.More and more manufacturers are offering to tailor-make a turnkey system from their own components.It is often the case that construction projects involve turnkey contracts under which a builder or developer provides land, construction, and materials.\nSMART Vocabulary: related words and phrases\nAvailable and accessible\naccessibility\naccessible\naccessibly\nat your command idiom\navailability\ndrop\nnon-restricted\nnothing\nobtainable\noffer\non call idiom\non demand idiom\non/about your person idiom\nrelease\nseason\nunfrozen\nunlock\nunobtainable\nup for grabs idiom\nvacant\nSee more results »\na person who is in charge of people in prison: The city has approved the use of 18-year-old turnkeys because of its inability to adequately staff the jails. As soon as we had entered the turnkey locked the door. Synonym\njailer\nMore examplesFewer examplesCertain civilian support staff are to be employed by the police (for example, turnkeys, prisoner escorts and court custody officers).He managed to get the turnkey gagged and bound while they made their escape. He smiled at me and slipped some coins to the turnkey for food and wine.\nSMART Vocabulary: related words and phrases\nPrisons & parts of prisons\napproved school\nBastille\nboot camp\nborstal\nbrig\nclink\ngaol\ngaoler\nhalfway house\nHMP\nmatron\nopen prison\npanopticon\npenal colony\npenitentiary\nprison\nstraightjacket\nstraitjacket\nthe gulag\nyoung offender institution\nSee more results »\nAdd to word list\nAdd to word list\nready to be used immediately: a turnkey operation/solution/system Implementing a turnkey solution for a dot.com takes around 12 weeks."}