{"id":373246,"name":"turtle","type":"noun","us_sound":"ˈtɝː.t̬əl","us_link":"../audio/t/turtle.mp3","uk_sound":"ˈtɜː.təl","uk_link":"../audio/t/ukturnk015.mp3","content":"Add to word list\nAdd to word list\n(also sea turtle) a reptile that lives in the sea and has a thick shell covering its body into which it can move its head and legs for protection. Turtles come onto land in order to lay their eggs: Thousands of turtles emerged from the waves and crawled across the sand on unsteady flippers. The world's population of sea turtles has now become dangerously small. See also\nleatherback turtle\nPaul Souders/DigitalVision/GettyImages\n(also freshwater turtle) a reptile that lives in rivers and lakes and has a thick shell covering its body into which it can move its head and legs for protection. Turtles come onto land in order to lay their eggs: Large portions of the river are disappearing, leaving dry gravel beds where mud turtles and minnows once swam. The snapping turtle is the world's biggest freshwater turtle, and can grow to nearly 100kg. Compare\nterrapin\nUS any reptile of the group that includes turtles, terrapins, and tortoises (= reptiles with thick shells that live on land): The state is moving to stop a recent increase in the illegal sale of pet turtles. In some North American regions, the word turtle is used for all three of these reptiles (turtles, terrapins, and tortoises).\nSMART Vocabulary: related words and phrases\nReptile & amphibian names\nadder\nalligator\namphibia\namphibian\nanaconda\nchameleon\ncobra\nconstrictor\ncrocodile\nfrog\nlizard\nloggerhead\nmamba\nmonitor lizard\nnewt\nskink\nslowworm\nsnake\nsnakily\nspring peeper\nSee more results »\nto turn and hide one's face and body when fighting instead of making a lot of punches: He had been taunting the defender for the whole game, and then when the guy went to fight him, he turtled. If you turtle during a fight, you'll be viewed as a coward and lose the respect of other players.\nSMART Vocabulary: related words and phrases\nFighting\narray\nbellicosity\nblood diamond\nbloodlessly\nblow\nboots on the ground idiom\ncall to arms\ncombat\ncome close to blows idiom\nfracas\nknock-down-drag-out\nlock horns idiom\nsend something in\nshadowbox\nshadowboxing\nshoot it out\nshootout\nskirmish\ntoe\nturf war\nSee more results »\nAdd to word list\nAdd to word list\nan animal that lives in or near water, having a thick, outer shell that covers and protects its body"}