{"id":373380,"name":"tutor","type":"noun","us_sound":"ˈtuː.t̬ɚ","us_link":"../audio/t/eus74660.mp3","uk_sound":"ˈtʃuː.tər","uk_link":"../audio/t/ukturnk025.mp3","content":"Add to word list\nAdd to word list\na teacher who teaches a child outside of school, especially in order to give the child extra help with a subject he or she finds difficult: His parents got him a tutor to help with his maths. During my illness I was taught by a series of home tutors.\nB2 UK a teacher at a British college or university who teaches one student or a small group : His tutor encouraged him to use flashcards to help him study new vocabulary.\nSMART Vocabulary: related words and phrases\nTeachers\nacademician\nALNCo\nassociate professor\nboard of education\nco-principal\nhandler\nhomeschooler\nhousemaster\nhousemistress\ninstructor\nlecturer\nmentor\nrector\nresidence\nschoolie\nschoolmarm\nschoolmaster\nscribe\nsubstitute\ntrainer\nSee more results »\nto teach a child outside of school, especially in order to give the child extra help with a subject he or she finds difficult: Oscar tutors our son in maths.\nThesaurus: synonyms, antonyms, and examples\nto teach someoneteachShe is teaching me French.instructHis job is to instruct people in the use of the gym equipment.trainShe trains new hairdressers.coachHe coaches young football players.tutorShe tutors students in French.educateHow much does it cost to educate a child privately?\nSee more results »\nMore examplesFewer examplesHer parents decided to have her tutored.His maths skills were weak, so she tutored him over the summer.Eventually his parents removed him from school and tutored him at home.He was born into a wealthy Hungarian family and was tutored privately.\nSMART Vocabulary: related words and phrases\nTeaching in general\nasynchronous\nchief academic officer\nCLIL\nclue\nclue in\ncommunicative\ndidactic\ninstruct\nmiseducation\nMoodle\nmulti-course\nnon-conditioned\nnon-didactic\nsocialization\nsocialize\nsocializing\nspecial education\nSRE\nsynchronous\ntutelage\nSee more results »\nAdd to word list\nAdd to word list\na teacher paid to work privately with one student or a small group\nto teach by working with one student or a small group, esp. one which needs special help: Volunteers from the college tutor elementary school children in reading, mathematics, and science."}