{"id":373645,"name":"twin","type":"noun","us_sound":"twɪn","us_link":"../audio/t/twin.mp3","uk_sound":"twɪn","uk_link":"../audio/t/uktuxed030.mp3","content":"Add to word list\nAdd to word list\nB1 either of two children born to the same mother on the same occasion: My sister has twin sons. a twin sister\nHelen King/Corbis/GettyImages\none of two very similar things: The two countries are often regarded as economic twins.\nMore examplesFewer examplesMy twin sister and I have got the same nose.Meeting a twin brother I didn't know I had was an unnerving experience.A special closeness is supposed to exist between twins.The youngest boys are so close in age they look like twins.To avoid confusion, the twins never wore the same clothes.\nSMART Vocabulary: related words and phrases\nParents & children\nbabyhood\nbabymoon\nbastard\nbrat\nchild abuse\nfraternal twin\nguardianship\nidentical twin\nillegitimacy\noffspring\norphan\nparent\nparentage\nparental\nsingle parent\nsingleton\nsoccer mom\nstep-parent\nthe generation gap\ntriplet\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSimilar and the same\nused to describe two similar things that are a pair: twin towers a car with twin exhausts\nexisting at the same time: He has managed to combine his twin obsessions of detective stories and rock music in his new radio programme.\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\nadjacent\naffinity\nakin\nalike\nallied\nballpark\nditto\nequivalent\nequivalently\nevenly\nevery inch idiom\nnon-distinctive\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\nrespecter\nsnap\nsynonymous\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRelating to time\nto put something together with something else, especially because they work well as a pair: She twins a shimmering silk blouse with a dark wool skirt. Try twinning chores with pleasant rewards - for example, walking the dog to the pub. The cover of the book shows twinned images of Piccadilly Circus and the New York skyline.\n[ usually passive ] mainly UK If two towns, organizations, etc. are twinned, or one is twinned with the other, a connection or special relationship is established between them: Cambridge is twinned with Heidelberg. The two cities have been twinned since 1966. Elite universities were twinned with inner city schools in an effort to increase their intake of students from less privileged backgrounds.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconverge\nconvergence\ncor\ncross-Channel\ncumulate\njointed\njunction\nkludge\nknit\nknock\nunify\nunion\nunseparated\nwad\nweave\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nActing, being or existing together\nTowns & regions: towns, cities & villages (general)\nAdd to word list\nAdd to word list\neither of two children born to the same mother on the same occasion\nTwin is used of two things that are the same or similar: twin engines/towers"}