{"id":373723,"name":"twist","type":"verb","us_sound":"twɪst","us_link":"../audio/t/twist.mp3","uk_sound":"twɪst","uk_link":"../audio/t/uktwine010.mp3","content":"twist verb\n(TURN)\nAdd to word list\nAdd to word list\nC2 [ I or T ] to turn something, especially repeatedly, or to turn or wrap one thing around another: twist and turn The path twists and turns for over a mile. She sat there nervously twisting the ring around on her finger. She twisted her head (round) so she could see what was happening. Twist the rope tightly round that post over there.\nC1 [ T ] If you twist a part of your body, such as your ankle, you injure it by suddenly turning it: She slipped on the ice and twisted her knee.\nThesaurus: synonyms, antonyms, and examples\nto hurt someone physicallyhurtI hurt my arm climbing over the fence.injureThe bomb killed ten people and injured many more.woundHe was wounded so badly in the attack that doctors said he might never walk again.maimThe atrocities have killed or maimed thousands of people.tortureThe guards were accused of torturing prisoners.stabHe was fatally stabbed with a kitchen knife.\nSee more results »\nMore examplesFewer examples\"How do I get the top off this bottle?\" \"Push it down and twist it anti-clockwise.\"She fell awkwardly when she was skiing and twisted her ankle.After twisting and turning for a while, he managed to wriggle free.We twisted the pieces of wire together.He used supernatural powers to twist metal.\nSMART Vocabulary: related words and phrases\nBending, twisting and curving\narch your back\nball up\nbendy\nbent\nbowed\ndescribe\nentwine\nflex\nflexion\nflexure\nfluted\nrewind\nswirlingly\nswoopy\ntangle\ntangled\ntangly\nwristy\nwrithe\nzigzag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInjuring and injuries\ntwist verb\n(CHANGE)\nC2 [ T ] disapproving to change information so that it gives the message you want it to give, especially in a way that is dishonest: This report shows how she twisted the truth to claim successes where none, in fact, existed. You're twisting my words - that's not what I said at all.\nThesaurus: synonyms, antonyms, and examples\nto say something not true in order to deceivelieAll she does is lie - you can't believe a word she says.tell a lieI cannot tell a lie: I chopped down the cherry tree.lie through your teethHe lied through his teeth that he didn't go to the cinema, though he was still holding the ticket stub in his hand as he said it.fibI don't like fibbing, but I didn't want to hurt his feelings by saying his gift was awful.misleadI'm afraid you've been misled. She is, in fact, married.deludeHe's deluding himself if he thinks that he's getting that promotion.\nSee more results »\nSMART Vocabulary: related words and phrases\nAdapting and modifying\nacclimate\nacclimation\nacclimatization\nacclimatize\nacclimatize to something\nambidextrous\namendment\nchameleon\nchange with/keep up with/move with the times idiom\nconfigure\ncounter-adaptation\npliantly\npreadaptation\npreadaptive\nput something back\nput something/someone forward\nunadapted\nunamended\nwrite someone out of something\nZelig\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLies, lying & hypocrisy\nIdioms\ntwist someone's arm\ntwist someone around your little finger\ntwist noun\n(TURN)\n[ C ] an act of twisting something: She gave the cap another twist to make sure it was tight. an Elvis-style twist of the hips\n[ C ] the shape of or a piece of something that has been twisted: twist of hair Long twists of grey hair fell over her face. a twist of lemon\n[ C ] a tight bend: twists and turns a path with many twists and turns\n[ C ] in sports such as diving and gymnastics, a movement in which a person turns their whole body while in the air : The dive includes two-and-a-half somersaults with two-and-a-half twists. Gymnasts perform a series of turns, twists, and somersaults on the trampoline.\nMore examplesFewer examplesHave you heard the latest twist in the saga of Gary's divorce?All his stories have an unexpected twist at the end.By a strange twist of fate, were both in New York on that day.\nSMART Vocabulary: related words and phrases\nBending, twisting and curving\narch your back\nball up\nbendy\nbent\nbowed\ndescribe\nentwine\nflex\nflexion\nflexure\nfluted\nrewind\nswirlingly\nswoopy\ntangle\ntangled\ntangly\nwristy\nwrithe\nzigzag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeometry: bends, loops & curves\nRoad surfaces & features\nSwimming\nGymnastics\ntwist noun\n(CHANGE)\n[ C ] a change in the way in which something happens: take a twist The story took a surprise twist today with media reports that the doctor had resigned.latest twist The incident was the latest twist in the continuing saga of fraud and high scandal in banks and stock brokerages.twist of fate/fortune But for a cruel twist of fate/fortune, he could now be running his own business.twist in/to There's an unexpected twist in/to the plot towards the end of the film.\n[ C ] a complicated situation or plan of action: twists and turns the twists and turns of fate It has proved very difficult to unravel the twists and turns and contradictions of the evidence.\nSMART Vocabulary: related words and phrases\nChange and changes\nadjustment\nalteration\nanti-evolutionism\nbe ahead of the curve idiom\nblip\nevolutionism\nflatten\nflip-flop\nfluctuation\ngyrate\nreinterpretation\nretransformation\nreversal\nreversion\nrevolution\nunsteady\nuntick\nvariation\nvicissitudes\nyouthquake\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDifficult things and people\ntwist noun\n(DANCE)\nthe twist [ S ]\na dance in which people stay in one place and twist their bodies from side to side to music\nSMART Vocabulary: related words and phrases\nDance & choreography\narabesque\nbacking dancer\nbackspin\nbackup dancer\nballerina\ncountry dancing\ncut a rug idiom\ndabbing\ndance\ndance studio\nmodern dance\nmoonwalk\nmoonwalking\nmorris dance\nmorris dancer\ntap dancing\ntarantella\nTerpsichore\nterpsichorean\nthrow shapes idiom\nSee more results »\ntwist noun\n(HAIR)\ntwists\n[ plural ] a hairstyle in which the hair is divided into many sections, then each section divided into two parts that are twisted around each other to form a type of braid: She went to the salon and had her hair done up in twists.\nSee more\nIdiom\nbe/go round the twist\ntwist verb\n(TURN)\nAdd to word list\nAdd to word list\n[ I/T ] to turn repeatedly, or to combine thin lengths of a material by turning or wrapping: [ I ] A river twists through the valley. [ I ] Vines twisted around the trunk of the old tree.\n[ I/T ] If you twist a part of your body, you hurt it by turning it awkwardly: [ T ] He twisted his knee in the game on Saturday.\ntwist verb\n(CHANGE)\n[ T ] to change the meaning of facts or a statement; distort: You’re twisting my words – that’s not what I meant at all. During the trial, lawyers twisted the truth to gain the jury’s sympathy. Idiom\ntwist someone’s arm\ntwist noun [C]\n(TURN)\nthe act of twisting or turning repeatedly: The path wound its way down the hill in a series of twists. One more twist should tighten the cover.\nA twist can also be something that has been twisted: She added a twist of lemon to her cola.\ntwist noun [C]\n(CHANGE)\nan unexpected change: The incident was the latest twist in the story of the robbery. Walnuts give a new twist to regular banana bread."}