{"id":373775,"name":"twittering","type":"noun","us_sound":"ˈtwɪt̬.ɚ.ɪŋ","us_link":"../audio/t/cdo1121ustwit4343.mp3","uk_sound":"ˈtwɪt.ər.ɪŋ","uk_link":"../audio/t/cdo1121uktwit4232.mp3","content":"twittering noun [C or U]\n(BIRD)\nAdd to word list\nAdd to word list\na series of short, high sounds made by a bird: They were soothed by the gentle rush of wind, the lapping of water and the twittering of birds. The chatter rose like the twitterings of starlings.\nMore examplesFewer examplesThe only noise is the twittering of larks high above us, and the wind whistling across the wild, majestic moor.We were woken at 4am each day by the twittering of hungry chicks.\nSMART Vocabulary: related words and phrases\nAnimal (non-human) sounds\nbarky\nbleat\nbray\nbuzzy\ncaterwauling\nchatter\ncheep\ncockcrow\ncoo\nhonk\nmiaow\nmoo\npurr\nroar\nsqueal\ntrill\ntrumpet\ntu-whit tu-whoo\nwarble\nwhinny\nSee more results »\ntwittering noun [C or U]\n(PERSON)\nthe act of talking quickly and nervously, saying things of very little importance or interest, or something that is said in this way: The chief executive bursts into the room and the twittering stops. I'll just ignore his ridiculous twitterings about me.\nMore examplesFewer examplesHer endless twittering about guest lists and salad is very irritating.For me the show is spoiled by the host's constant twittering while the studio guest is trying to answer a question.\nSMART Vocabulary: related words and phrases\nWays of talking\n-tongued\natonally\nbeg the question idiom\nblah\nblither\nchirp\ncoo\ncrap\nhalting\nslur\nsweet nothings\ntalk through your hat idiom\ntelegrammatic\nthrow your voice idiom\ntrash\nturn of phrase\nwang\nwhang\nwhang on\nyammer\nSee more results »\ntwittering noun [C or U]\n(SOCIAL MEDIA)\n(also Twittering) the activity of publishing something on the social media service Twitter, or something that is published: Don't forget that in this age of texting, twittering, and blogs, there still are small companies that don't offer their wares online. Many people follow his twitterings.\nMore examplesFewer examplesWhen did people start shifting away from e-mail to texting and twittering instead? This download will give you a faster twittering experience.Chatting, Twittering, Facebooking - these are the things that people are integrating deeper into their lives.\nSMART Vocabulary: related words and phrases\nInternet terminology\n2FA\n2SV\nabove/below the fold idiom\naddress bar\naffiliate link\nhybrid\ninternet café\ninternet-enabled\ninterweb\nIP\nkeyboard warrior\nlanding page\nping\npodcast\nservice provider\ntweeter\ntweetstorm\ntwitterati\nTwitterer\ntwitterstorm\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWriting & typing\nInformation and messages\ntwittering adjective [before noun]\n(BIRD)\nof a bird or a musical instrument, making a series of short, high sounds: We fell asleep to the muted sounds of twittering birds and the soft rustle of the leaves. the sound of the twittering flutes\nMore examplesFewer examplesThe idyll of twittering birds, buzzing bees and butterflies drifting on summer breezes is being shattered by thundering traffic clogging up minor rural roads.The concourse is crammed with palms, twittering birds and terrapins.If your idea of flute sound is that of a twittering canary, you haven't heard Galway.September brings twittering flocks of swallows to the fen.\nSMART Vocabulary: related words and phrases\nAnimal (non-human) sounds\nbarky\nbleat\nbray\nbuzzy\ncaterwauling\nchatter\ncheep\ncockcrow\ncoo\nhonk\nmiaow\nmoo\npurr\nroar\nsqueal\ntrill\ntrumpet\ntu-whit tu-whoo\nwarble\nwhinny\nSee more results »\ntwittering adjective [before noun]\n(PERSON)\ntalking quickly and nervously, saying things of very little importance or interest: She admitted she was only too keen to leave behind the twittering gossips of Oxford.\nMore examplesFewer examplesLynn Redgrave plays Wendy's tiresomely twittering Aunt Millicent.The failed actress Susan is a twittering mass of insecurities.Monica has a far more dubious taste in men - she fancies twittering toff Hugh Grant. The mwaa, mwaa, twittering boho-chic of London's Clerkenwell, Hoxton and Shoreditch has yet to invade Moscow.\nSMART Vocabulary: related words and phrases\nWays of talking\n-tongued\natonally\nbeg the question idiom\nblah\nblither\nchirp\ncoo\ncrap\nhalting\nslur\nsweet nothings\ntalk through your hat idiom\ntelegrammatic\nthrow your voice idiom\ntrash\nturn of phrase\nwang\nwhang\nwhang on\nyammer\nSee more results »\ntwittering adjective [before noun]\n(SOCIAL MEDIA)\n(also Twittering) using the social media service Twitter: Once the weekend had passed, the Twittering Mums were moving on to new tweets. You need to get off Twitter. Your twittering days are done.\nMore examplesFewer examplesA member of the Twittering classes, the MP used the microblogging tool in his campaign to be Labour deputy leader.He provides twittering services for clients who want to outsource their Twitter writing.So glad to have you both here at my blog, and as Twittering friends too!\nSMART Vocabulary: related words and phrases\nInternet terminology\n2FA\n2SV\nabove/below the fold idiom\naddress bar\naffiliate link\nhybrid\ninternet café\ninternet-enabled\ninterweb\nIP\nkeyboard warrior\nlanding page\nping\npodcast\nservice provider\ntweeter\ntweetstorm\ntwitterati\nTwitterer\ntwitterstorm\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWriting & typing"}