{"id":373769,"name":"twitter","type":"verb","us_sound":"ˈtwɪt̬.ɚ","us_link":"../audio/t/ustwick011.mp3","uk_sound":"ˈtwɪt.ər","uk_link":"../audio/t/uktwine018.mp3","content":"twitter verb\n(BIRD)\nAdd to word list\nAdd to word list\n[ I ] (of a bird) to make a series of short, high sounds: I was woken up by a bird twittering just outside my window. The only sounds were the birds twittering and chirping in the trees.\nSMART Vocabulary: related words and phrases\nAnimal (non-human) sounds\nbarky\nbray\nbuzzy\ncaterwauling\nchatter\ncheep\nchirp\nclip-clop\ncockcrow\ncoo\nhonk\nmew\nmiaow\nmoo\npurr\nroar\nsqueal\ntu-whit tu-whoo\nwarble\nwhinny\nSee more results »\ntwitter verb\n(PERSON)\n[ I ] to talk quickly and nervously in a high voice, saying very little of importance or interest: She comes in here when I'm trying to work and just twitters on about nothing. The old ladies were twittering in the reception area.\nSMART Vocabulary: related words and phrases\nWays of talking\n-tongued\natonally\nbeg the question idiom\nblah\nblither\nchirp\ncoo\ncrap\nslur\nsweet nothings\ntalk nonsense idiom\ntalk through your hat idiom\ntelegrammatic\ntrash\nturn of phrase\ntwittering\nwang\nwhang\nwitter\nyammer\nSee more results »\ntwitter verb\n(SOCIAL MEDIA)\n[ I or T ] (also Twitter) to publish a short remark or piece of information on the social media service Twitter: I twittered during the race so that my girlfriend knew where I was and so that people at home could follow me. People have Twittered the birth of their children, getting into college and have even proposed marriage. Synonym\ntweet\nMore examplesFewer examplesHe says he had an ugly run-in with a racist at the airport and twittered that he would die if he had to live in the city. They began discussing something that one of the friends Twittered that afternoon, as if picking up a conversation in the middle.We're all Twittering the same thing, trying to get as much information out there as possible.Since the show finished recording, she has been twittering on-line but makes no mention of her former beau.\nSMART Vocabulary: related words and phrases\nInternet terminology\n.plc.uk\n2FA\n2SV\nabove/below the fold idiom\naddress bar\naffiliate link\nhybrid\ninternet-enabled\ninterweb\nIP\nkeyboard warrior\nlanding page\nping\npodcast\nservice provider\ntweeter\ntweetstorm\ntwitterati\nTwitterer\ntwittering\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWriting & typing\na series of short, high sounds made by a bird: We heard the faint twitter of birds. The twitters and chirps from the treetops grew louder.\nMore examplesFewer examplesI was woken by the twitter of birds.She played me the tape-recorded twitter of a warbler.\nSMART Vocabulary: related words and phrases\nAnimal (non-human) sounds\nbarky\nbray\nbuzzy\ncaterwauling\nchatter\ncheep\nchirp\nclip-clop\ncockcrow\ncoo\nhonk\nmew\nmiaow\nmoo\npurr\nroar\nsqueal\ntu-whit tu-whoo\nwarble\nwhinny\nSee more results »\nthe name of a social media service where people or organizations can publish short remarks or pieces of information, and where you can see information published by people or organizations that you choose: I always read her column, and I follow her on Twitter.\nSMART Vocabulary: related words and phrases\nInternet terminology\n.plc.uk\n2FA\n2SV\nabove/below the fold idiom\naddress bar\naffiliate link\nhybrid\ninternet-enabled\ninterweb\nIP\nkeyboard warrior\nlanding page\nping\npodcast\nservice provider\ntweeter\ntweetstorm\ntwitterati\nTwitterer\ntwittering\nSee more results »\nAdd to word list\nAdd to word list\nthe name of a social networking site on the internet for communicating with people quickly See also\nTweet"}