{"id":363815,"name":"tyke","type":"noun","us_sound":"taɪk","us_link":"../audio/t/tyke.mp3","uk_sound":"taɪk","uk_link":"../audio/t/uktight003.mp3","content":"tyke noun [C]\n(CHILD)\nAdd to word list\nAdd to word list\ninformal a young child: These new toys aim to engage tykes' brains.\nUK informal a child who behaves badly in a way that is funny rather than serious: Come here, you cheeky little tyke!\nThesaurus: synonyms, antonyms, and examples\na childchildWhen I was a child the summers seemed to go on for ever.boyThere's a new boy in my class. girlThe girl's name is Sally.kidI'm off to pick up the kids from school.kiddieI saw her with a little kiddie in a pushchair.little oneThe little ones must be hungry by now.\nSee more results »\nMore examplesFewer examplesThe father of four recalls leaving a toyshop because two of his tykes threw temper tantrums.Researchers at Tufts University in Boston say these TV-watching tykes are more likely to eat pizza, salty snacks and soda than more healthful fare. When Nobel was a tyke, his father went to Finland and Russia to make land and sea mines.\nSMART Vocabulary: related words and phrases\nChildren & babies\nankle-biter\narrival\nbabe\nbabe in arms\nbaby\ncomfort blanket\ncrawler\ndesigner baby\ndevil\ndiddums\nnipper\nonly child\noops-a-daisy\npacifier\npapoose\ntike\ntoddler\ntoilet-trained\ntomboy\ntot\nSee more results »\ntyke noun [C]\n(RUDE MAN)\nUK old-fashioned informal a rude man who does not behave in a way that is generally acceptable: What would she do with a great, coarse tyke like me!\na person from the English county of Yorkshire: He wasn't born a Tyke, but he lived in Yorkshire most of his life.\nSMART Vocabulary: related words and phrases\nTowns & regions: city names & their inhabitants\nAberdeen\nAberdonian\nAbidjan\nAbu Dhabi\nAbuja\nBratislava\nBrazzaville\nBridgetown\nBrisbane\nBristol\nDushanbe\nEdinburgh\nEl Paso\nEton\nFaisalabad\nMbabane\nMelbourne\nMemphis\nMiami\nMontreal\nSee more results »\nAdd to word list\nAdd to word list\na small child"}