{"id":364458,"name":"type","type":"noun","us_sound":"taɪp","us_link":"../audio/t/type.mp3","uk_sound":"taɪp","uk_link":"../audio/t/uktwine024.mp3","content":"type noun\n(GROUP)\nAdd to word list\nAdd to word list\nA2 [ C ] a particular group of people or things that share similar characteristics and form a smaller division of a larger set: type of There were so many different types of bread that I didn't know which to buy. What type of clothes does she wear? It was dark so I didn't notice what type of car it was. He's the type of man you could take home to your mother. He's very attractive, if you like the blond, athletic type.type of thing They sell dried flowers and baskets and that type of thing. We have a range of moisturizers for all different skin types. She was young and she was wearing student-type clothes, so I assumed she was studying here. He took me to a bar full of actor types trying to get noticed.\nThesaurus: synonyms, antonyms, and examples\na group of people or things that share similar qualitiessortWhat sort of clothes do you like to wear?kindWhat kind of job are you looking for?typeHe's the type of man who never listens to what you're saying.formSwimming is the best form of exercise.varietyThe article was about the different varieties of Spanish spoken in South America.categoryThere are three categories of hotel room - standard, executive, and deluxe.\nSee more results »\nC1 [ C ]\n&#160; literature\n&#160; specialized a person who seems to represent a particular group of people, having all the qualities that you usually connect with that group: He doesn't use fully rounded characters in his plays - he uses types. be someone's type\nC2 to be the type of person that someone thinks is attractive: He's a nice enough guy - he's just not my type.\nSee more\nMore examplesFewer examplesThis type of account offers you instant access to your money.Vodka is a type of spirit.Oranges, apples, pears and bananas are all types of fruit.Some types of jellyfish have a powerful sting.Guy wasn't really the sporty type.\nSMART Vocabulary: related words and phrases\nCategories and varieties\nbad/big boy idiom\nbrand\nbreed\ncategoric\ncategorical\ncategory\nclassification\nderivative\nhue\nmark\nmisclassification\nmodel\npolymorphism\nrun\nshade\nsort\nstratification\nsubcategory\nsubstance\nupdate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople in general\ntype noun\n(PRINTED LETTERS)\n[ C or U ]\n&#160; publishing\n&#160; specialized (also typeface) the style and size of printed letters used in a piece of printed writing such as in a newspaper, book, or article: Use bold type for your headings. The software allows you to choose from over 20 styles of typeface.\nSMART Vocabulary: related words and phrases\nPublishing: printing & word processing\n3-D printing\nbackspace\nbed\nboldface\nboldfaced\nbolding\nimpression\nimprint\nindent\nindentation\ninline\nprint on demand\nprint run\nprint something out\nprinted\nprinting\ntypographical\ntypography\nunpublished\nxerography\nSee more results »\nGrammar\nSort, type and kindSort, type and kind all generally mean the same thing. They are words we use to refer to a group of people or things which share the same characteristics. We use these words very often when we describe things and we often find them in dictionary definitions: …\ntype verb [I or T]\n(WRITE)\nB1 to write using a machine, either a computer keyboard or a typewriter: She asked me to type a couple of letters. He can type very quickly.type away I was typing away into the early hours of the morning just to get it done.\nMore examplesFewer examplesHer typewriter clacked noisily as she typed out the letter.Oops! I've typed two L's by mistake.It would look more professional if the letter was typed.By typing in simple commands you could pick up objects and talk to other avatars, with your words displayed in a cartoon bubble above your head.He had injured his left hand and was typing one-handed.\nSMART Vocabulary: related words and phrases\nWriting & typing\nannotate\nasemic\nbang\nbang something out\nbash something out\nborrow\nborrow something from something\nchart\ndot\ninscribe\nkeyboard\nre-registration\nreadability\nrecompose\nreformulate\nrekey\nsemiotics\nspeller\ntab\ntranscribe\nSee more results »\nPhrasal verbs\ntype something in\ntype something out/up\ntype noun\n(CHARACTERISTICS)\nAdd to word list\nAdd to word list\n[ C ] the characteristics of a group of people or things that set them apart from other people or things, or people, things, or groups that share particular characteristics: I’m more comfortable in jeans and T-shirts, and that type of thing. We have makeup for all different types of skin. Grant’s my type of guy – strong and cool – but Willie’s not my type at all.\ntype noun\n(PRINTED LETTERS)\n[ U ] printed letters and symbols, or small pieces of metal with the shapes of letters and symbols on them that were used in the past in printing: In big bold type, the headline announced the winner of the election.\ntype verb [I/T]\n(WRITE)\nto write using a keyboard: [ I ] I never learned how to type. [ T ] He typed the report yesterday.\ntyping noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈtɑɪ·pɪŋ/\nHer typing is very accurate most of the time. typist noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈtɑɪ·pəst/\nTypists don’t use typewriters any more, they use keyboards. Phrasal verbs\ntype in something\ntype out/up something\nAdd to word list\nAdd to word list\nto write using a computer keyboard or a typewriter: How fast can you type?type sth into sth Typing a word into the search box will bring up a number of related results. I need you to type a letter for me. See also\ntouch-type Phrasal verbs\ntype sth in\ntype sth up\n→\ntypeface See also\ndisplay type"}