{"id":364580,"name":"typical","type":"adjective","us_sound":"ˈtɪp.ɪ.kəl","us_link":"../audio/t/typical.mp3","uk_sound":"ˈtɪp.ɪ.kəl","uk_link":"../audio/t/uktypho003.mp3","content":"Add to word list\nAdd to word list\nB1 showing all the characteristics that you would usually expect from a particular group of things: I must look like the typical tourist with my shorts and my camera. This kind of hot and spicy food is very typical of the food in the south of the country. Typical symptoms would include severe headaches, vomiting and dizziness.\nThesaurus: synonyms, antonyms, and examples\nnormalnormalTemperatures are well above normal today.usualI went to bed at my usual time.ordinaryThe magazine has stories about ordinary people rather than celebrities.standardIt's standard practice for surgeons to wear gloves.naturalIt's completely natural to feel anxious on your first day at a new school.typicalHe was a typical teenager - arguing with his parents and staying out late.\nSee more results »\ndisapproving showing all the bad characteristics that you expect from someone or something, often in a way that is annoying: It's just typical of Dan to spend all that money on the equipment and then lose interest two months later. \"He called at the last minute to say he wasn't coming.\" \"Typical!\"\nMore examplesFewer examplesThe typical lawn mower makes about 90 decibels of noise.It's typical of the boss to kick someone when they're down.It's a typical country estate with a large house for the owner, farm buildings and estate workers' houses.I was your typical lanky teenager.She's a typical teenager, coming home late at night and mouthing off to her parents.\nSMART Vocabulary: related words and phrases\nTypifying, illustrating and exemplifying\nanalogy\narchetypal\narchetypically\nbe someone all over idiom\nbetoken\ninstance\ninstantiate\nmirror\nMr\nMrs\nstereotype\nsum\nsum (something/someone) up\nsummation\nsymbolic\nsymbolization\nsymptom\nterritory\ntoken\ntranslate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSerious and unpleasant\nAdd to word list\nAdd to word list\nshowing the characteristics of a particular kind of person or thing: He looked like the typical tourist with his camera and baseball cap. This dish is typical of Southern cooking.\ndisapproving Typical also means behaving as you would expect: \"He called to say he wasn’t coming.\" \"Typical! You can’t rely on Michael for anything!\""}