{"id":373959,"name":"ugliness","type":"noun","us_sound":"ˈʌɡ.li.nəs","us_link":"../audio/u/usa30139.mp3","uk_sound":"ˈʌɡ.li.nəs","uk_link":"../audio/u/ukuglin001.mp3","content":"ugliness noun [U]\n(UNATTRACTIVENESS)\nAdd to word list\nAdd to word list\nthe quality of being unpleasant to look at, or not attractive: the ugliness of the buildings He makes comedy out of his ugliness.\nMore examplesFewer examplesThe captain's wife, a woman of the most extreme ugliness, smiled toothlessly at me.There is a campaign to cleanse the campus of architectural ugliness by tearing down buildings.Whoever built the houses had insisted on uniformity, if not downright ugliness.\nSMART Vocabulary: related words and phrases\nNot attractive to look at\nback end\nbe no oil painting idiom\nbe not much to look at idiom\nbleakly\nbleakness\nexcrescence\ngopping\ngracelessly\nhatchet-faced\nhave a face like the back end of a bus idiom\nhideous\nhideousness\npretty\npretty-pretty\nputridly\nreptilian\nscrappily\nunsightly\nvulgarity\nvulgarly\nSee more results »\nugliness noun [U]\n(VIOLENCE)\nthe quality of being unpleasant and threatening or violent: Some activists are dismayed by the occasional ugliness of the debate. The revelation of abuse of prisoners displayed an ugliness to the war that shook even those who supported it. See\nugly\nMore examplesFewer examplesAre we trying to hide the ugliness of the world from our children?The ugliness of the sentiments expressed by local people has taken some outsiders aback.There was no fight, there was no ugliness; he simply resigned.\nSMART Vocabulary: related words and phrases\nViolent or aggressive\nabusively\naggressive\naggressively\naggressiveness\naggro\nferociously\nferocity\nfierce\nfierceness\nfighting words\noffensively\noutrage\nproactive aggression\npugnacious\npugnaciously\nuntameable\nvicious\nviciously\nviciousness\nviolence\nSee more results »\nugliness noun [U]\n(UNATTRACTIVE APPEARANCE)\nAdd to word list\nAdd to word list\nthe quality or state of being extremely unattractive in appearance: The city’s ugliness struck me.\nugliness noun [U]\n(UNPLEASANTNESS)\nsomething that is unpleasant and threatening or violent: He has ugliness in his heart."}