{"id":374134,"name":"ultimate","type":"adjective","us_sound":"ˈʌl.tə.mət","us_link":"../audio/u/eus74683.mp3","uk_sound":"ˈʌl.tɪ.mət","uk_link":"../audio/u/ukuglin019.mp3","content":"Add to word list\nAdd to word list\nB2 most extreme or important because either the original or final, or the best or worst: Of course the ultimate responsibility for the present conflict without doubt lies with the aggressor. My manager will make the ultimate decision about who to employ. Infidelity is the ultimate betrayal. the ultimate luxury cruiser\nMore examplesFewer examplesHe announced what he called 'the ultimate test of mind over matter' - a woman walking over hot coals.This is his centennial year and he's been granted the ultimate accolade - his face on a set of three postage stamps.If our soldiers have to pay the ultimate price for defending their country, then so be it.Among young people, this brand of designer clothing is the ultimate status symbol.Hairy backs are for me the ultimate turn-off.\nSMART Vocabulary: related words and phrases\nFinal and finally\nantepenultimate\nas a last resort idiom\nat the end of the day idiom\nback end\nclosing\nconclusion\neventual\neventually\nfinal\nfinally\nhear/see the last of something idiom\nlast\nlast chance saloon\nlast-ditch\nlastly\nlatest\nnext to last\nnon-final\nthe last someone heard/saw of someone/something idiom\nultimately\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nVery important or urgent\nthe ultimate in something\nthe best or most extreme example of something: The hotel is described as \"the ultimate in luxury\".\nSee more\nultimate noun\n(GAME)\n[ U ] another word for\nUltimate Frisbee\nAdd to word list\nAdd to word list\nmost important, highest, last, or final: Your ultimate goal is to play the game as well as you can.\nUltimate also means the best, most, or greatest of its kind: Some people believe that he is the ultimate painter of this century. ultimate noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈʌl·tə·mət/\nWinning was the ultimate, because our team had never won before.\nAdd to word list\nAdd to word list\nlast in a series: The CEO is responsible for making the ultimate decision. We are stopping off in Brussels and Cairo, but our ultimate destination is Chennai.\nhaving more importance or more influence over what happens than all others: ultimate goal/aim Only one in 100 workers will achieve the ultimate goal and retire on two-thirds of final salary. The manager has ultimate responsibility for all investment advisory services. The corporate HQ in the UK has ultimate authority over all our overseas operations."}