{"id":374153,"name":"ultra","type":"noun","us_sound":"ˈʌl.trə","us_link":"../audio/u/cdo0318usultr5270.mp3","uk_sound":"ˈʌl.trə","uk_link":"../audio/u/cdo0318ukultr1477.mp3","content":"ultra noun [C]\n(PERSON)\nAdd to word list\nAdd to word list\nusually disapproving a person who has extreme political or religious opinions, or opinions that are more extreme than others in the same political party, etc.: Soon the ultras on the right of the party will resume their criticism of the prime minister.\n(also Ultra) an extreme supporter of a football club, often one who is part of an organized group that may also have extreme political opinions: The only sign of tension came when several hundred Napoli ultras protested against the closure of their clubs's ground.\nMore examplesFewer examplesThe ultras were mounting their own campaign to unseat the senator.As did the McCarthyites of the previous decade, the ultras argued vehemently that the real threat to the nation's security resided in communist subversion at home.Banners for the Ultras of the Curva Nord (of Rome's Olympic stadium) were flying high.From the central lower section of the north end the ultras fired flares and bellowed their anthem.\nSMART Vocabulary: related words and phrases\nPolitical movements & groups\nalt-right\nANC\nanti-Bolshevik\nanti-Bolshevism\nanti-capitalism\nbig tent\nblack bloc\nBlairite\nBlue Dog\nleft-winger\nleftism\nleftist\nleftward\nlefty\nsectarian\nsectarianism\nsegregationist\nSinn Fein\nthe awkward gang idiom\nthe SDLP\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnsuitable and unacceptable\nEnthusiasts\nultra noun [C]\n(RACE)\na running race that is longer than a marathon (= a race that is approximately 26 miles): This six-day ultra, the US's version of the Marathon des Sables, covers 148 miles. Synonym\nultramarathon\nMore examplesFewer examplesHe needs to compete and win a lot of normal ultras before he could be classified as the best ever in that arena.Ultrarunners are comfortable with extremes, and today the race has become one of the preeminent ultras in the country.\nSMART Vocabulary: related words and phrases\nAthletics\nathletically\nblade\ndecathlon\ndiscus\nDNF\nendurance\nfaller\ngun\nhigh jumper\nhurdle\njavelin\nobstacle course\nsplit\nstarter\ntape\ntriple jump\ntriple jumper\nultra-runner\nultra-running\nultramarathon\nSee more results »\nextreme or extremely: ultra-expensive ultra-modern architecture ultra-sensitive an ultra-short haircut\nsports\n&#160; specialized involving longer distances than is usual: He was famous as a runner of ultramarathons. ultra-cycling/ultra-running events\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabundantly\nabundantly clear\nbeyond\nbiblical\ndearly\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nserious\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nwhatever\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDistant in space and time\nCompetitions, & parts of competitions\nAdd to word list\nAdd to word list\nextreme or extremely: ultraconservative ultramodern\nAdd to word list\nAdd to word list\nused with adjectives to mean 'extremely': These ultra-thin loudspeakers can be hidden as paintings on a wall. an ultra-conservative political group The network uses ultra-fast fiber-optic cable."}