{"id":374524,"name":"umbrella","type":"noun","us_sound":"ʌmˈbrel.ə","us_link":"../audio/u/umbrella.mp3","uk_sound":"ʌmˈbrel.ə","uk_link":"../audio/u/ukuglin029.mp3","content":"umbrella noun [C]\n(DEVICE)\nAdd to word list\nAdd to word list\nA2 a device for protection against the rain, consisting of a stick with a folding frame covered in material at one end and usually a handle at the other, or a similar, often larger, device used for protection against the sun: I felt a few drops of rain, so I put my umbrella up. I left my umbrella on the bus yesterday. a folding umbrella\nPeter Dazeley/Photographer's Choice/GettyImages\nMore examplesFewer examplesDamn! I've left my umbrella in the office.\"You've got my umbrella!\" he ejaculated.She absent-mindedly left her umbrella on the bus.I'll have to go back for my umbrella.The umbrella was ingeniously devised to fold up into your pocket.\nSMART Vocabulary: related words and phrases\nGloves & accessories\naviator glasses\nbandeau\nbell\nboutonniere\nbrolly\nbuttonhole\neyewear\nfascinator\nfingerless\nglove\ngloved\nhandkerchief\nmitten\nmuff\nparasol\npashmina\npocket handkerchief\ntie clip\ntiepin\nutility belt\nSee more results »\numbrella noun [C]\n(GROUP)\nsomething that includes or represents a group or range of similar things: He runs a group of companies under the umbrella of Universal Foods. The Organization of Islamic Conference is an umbrella organization representing 57 Muslim nations. Existentialism was really an umbrella term to lump together the works of several philosophers and writers.\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nbracket\nconcordance\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nset something up\nshake someone down\nshort-list\nshortlist\nsort\ntick\nSee more results »\nAdd to word list\nAdd to word list\na cover that protects from rain or sun, esp. waterproof material fitted on a folding frame with a handle at one end: A figure carrying an open umbrella walked slowly through the rain.\nAn umbrella is also something that includes a number of similar things: an umbrella term an umbrella organization\nAdd to word list\nAdd to word list\nsomething that includes or represents a group or range of similar things: They provide an umbrella of work force development services. An awful lot of damage is done under the umbrella of ecotourism."}