{"id":374741,"name":"unaccompanied","type":"adjective","us_sound":"ˌʌn.əˈkʌm.pən.id","us_link":"../audio/u/unaccompanied.mp3","uk_sound":"ˌʌn.əˈkʌm.pən.id","uk_link":"../audio/u/ukumpir012.mp3","content":"Add to word list\nAdd to word list\nnot having anyone with you when you go somewhere: The airline's policy on unaccompanied minors states that children aged 5 to 7 can fly only on direct and nonstop flights. An estimated 30 unaccompanied children arrive at the city's train stations every day. To everyone's great surprise, the princess arrived at the ball unaccompanied.\nThesaurus: synonyms, antonyms, and examples\nnot with othersaloneYou can tell me your secret - I think we're alone. (all) on your ownI like living on my own. on your lonesomeUK Sure, you can play the game on your lonesome, but it's more fun with friends.on your todUK Ah, your family's gone and left you on your tod, have they?unaccompaniedTo everyone's great surprise, she arrived at the ball unaccompanied.solitaryHe was a solitary child who preferred reading a book to football.\nSee more results »\nnot having the owner present: Unaccompanied baggage is a possible vehicle for a bomb.\nnot having something else happen or be present at the same time: These accusations are unaccompanied by any real proof. A fever unaccompanied by any other symptoms of being sick may not need treatment.\nUnaccompanied music is produced by a singer or by someone playing a musical instrument without anyone else singing or playing at the same time: People are often more capable of good unaccompanied singing than they realize. She sang the first three verses with a piano and the last verse unaccompanied.\nMore examplesFewer examplesShe is part of a growing group of passengers known as unaccompanied minors - airline language for children flying solo.They toured two Texas facilities where unaccompanied illegal immigrant children are held.Airline employees improperly transported unaccompanied bags on five flights.Permanent memory disorder can follow thiamine deficiency unaccompanied by alcohol abuse.\nSMART Vocabulary: related words and phrases\nAlone\nabandoned\nalienate\nalienated\napart\nbe cast away idiom\nherself\nhimself\nlone wolf\nlonely\nloner\nlonesome\nminority\nshag\nshut\nshut someone away\nsole\nsolely\nsolitarily\nsolitary\nsolitude\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLacking things\nTypes of music\nAdd to word list\nAdd to word list\nwithout anyone with you, or (of the voice or an instrument) sung or played without other musical instruments: Unaccompanied teens were banned from the mall. The kids sang an unaccompanied version of \"Skylark.\""}