{"id":374902,"name":"unadjusted","type":"adjective","us_sound":"ˌʌn.əˈdʒʌs.tɪd","us_link":"../audio/u/cdo0123usunad2513.mp3","uk_sound":"ˌʌn.əˈdʒʌs.tɪd","uk_link":"../audio/u/cdo0123ukunad2853.mp3","content":"Add to word list\nAdd to word list\nnot having changed or been changed for a particular situation or use: I was still jetlagged and unadjusted to the time change even after a week in Australia. Unadjusted, a detergent would be an unattractive, thin, colourless liquid with little or no smell.\nUnadjusted figures (= numbers) have not been changed slightly to become more correct or useful: The figures are unadjusted for inflation. The firm recorded an unadjusted operating loss of a million pounds. Related word\nadjust\nMore examplesFewer examplesI forced myself to go back to sleep when my unadjusted body told me to get up and start my day.Seasonally unadjusted figures show an unemployment rate of 5.3 percent in January.They promised to publish both the adjusted and unadjusted statistics.\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\nadjacent\naffinity\nakin\nalike\nallied\nballpark\nditto\nequivalent\nequivalently\nevenly\nevery inch idiom\nnon-distinctive\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\nrespecter\nsnap\nsynonymous\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStatistics\nAdd to word list\nAdd to word list\nunadjusted figures do not consider particular things such as inflation, which would make the figures easier to compare with others: unadjusted for sth Retail sales will grow at a 1.4% annual rate, unadjusted for inflation. In data unadjusted for service quality improvements, productivity declined by an average of 2% per year for the past five years. On an unadjusted basis, a 0.7% rise in overall output prices in October was the biggest month-on-month gain since March of last year. At an unadjusted rate of 7.3%, Janesville had the 33rd highest unemployment in February."}