{"id":374931,"name":"unadopted","type":"adjective","us_sound":"ˌʌn.əˈdɑːp.tɪd","us_link":"../audio/u/cdo1119usunad1215.mp3","uk_sound":"ˌʌn.əˈdɒp.tɪd","uk_link":"../audio/u/cdo1119ukunad1134.mp3","content":"unadopted adjective\n(CHILD/ANIMAL)\nAdd to word list\nAdd to word list\n(of a child) not having been adopted (= taken legally into another person's family and taken care of as their own child): She said the proposal might block grandparents from purchasing health insurance for unadopted grandchildren in their custody.\n(of an animal) not having been taken from a place such as a rescue centre to become someone's pet: He helped create Best Friends as an alternative to shelters killing unadopted animals to make space.\nMore examplesFewer examplesSeeing the condition of unadopted children made her cry; she felt for them.So many babies go unadopted here. She refused to participate in a new programme that requires rescue organizations to return unadopted kittens and puppies to the shelter when they are 8 weeks old.\nSMART Vocabulary: related words and phrases\nParenting & caring for children\nadopt\nadoptable\nadopted\nadoptee\nadoption\ncared-for\ncaretaking\nchild-rearing\nchildless\nchildlessness\nkinship carer\nlawnmower parent\nlooked-after\nmothering\nnanny\nsnowploughing\nstay-at-home\nswaddle\nunadoptable\nunweaned\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPreserving and saving\nunadopted adjective\n(ROAD)\nUK (of a road, etc.) private rather than owned and maintained (= kept in good condition) by a local government: Unadopted roads normally have to be maintained by residents, although the local authority may provide street lighting. Opposite\nadopted\nMore examplesFewer examplesThe private road remained unadopted and people living in the street could not afford resurfacing work. There are many rights of way that are over unadopted or private roads.It is essential that the developer obtains the necessary rights of way from the respective owners, when access roads are to remain unadopted.They used to recharge residents for unadopted sewers.\nSMART Vocabulary: related words and phrases\nRoads & routes in general\nadopt\nadopted\napproach\nascent\nbicycle lane/path\nbike lane\ncommunication\ndead end\ndetour\nexit\nimpassable\nlane\nmilk round\nmulti-lane\nroadway\nroadworks\nroute\nRR\nskid marks\ntoll road\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRoads: urban & residential streets"}