{"id":376197,"name":"unbilled","type":"adjective","us_sound":"ˌʌnˈbɪld","us_link":"../audio/u/cdo0622usunbi1971.mp3","uk_sound":"ˌʌnˈbɪld","uk_link":"../audio/u/cdo0622ukunbi2105.mp3","content":"unbilled adjective\n(NOT LISTED)\nAdd to word list\nAdd to word list\nnot mentioned in a list of performers: The priest is played by an unbilled Patrick Walsh, whose unexpected appearance is guaranteed to provoke a laugh. One of his first movie appearances was a small unbilled dance role in \"White Christmas\".\nMore examplesFewer examplesThe group began the tour unbilled, performing with Brenda Holloway, among others.This movie doesn't contain enough surprises to keep things interesting - apart from an unbilled David Schwimmer cameo.The set design is the unbilled star of this production; it's amazing.\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ncustomer relationship management\ndetoxify\ndifferentiator\ndogfooding\nflyer\no.n.o.\noff-brand\non-brand\noverexpose\noverexposure\ntie (something) in\ntout\nunadvertised\nunbranded\nunmarketable\nSee more results »\nunbilled adjective\n(NOT CHARGED FOR)\nnot charged for, or relating to products or services that have not been charged for : A combination of falling income and unbilled work led to the company's financial problems. Unbilled revenue refers to a situation where the bill is yet to be issued to clients for work that is already completed.\nMore examplesFewer examplesFirms must consider the effect of this unbilled time in their internal financial results.Unbilled amounts relate to arrangements where revenue has been recognized but billings have not been presented to customers.\nSMART Vocabulary: related words and phrases\nBills & invoices\nbilling\nbond\ncharge\nchit\nclaim form\ncounterfoil\ncredit note\nmischarge\npassbook\npayslip\npro forma\nsales slip\nsavings bond\ntab\nticket\ntill roll\ntoll\ntolled\nTreasury bond\nwater bill\nSee more results »\nRelated word\nbill"}