{"id":376246,"name":"unblemished","type":"adjective","us_sound":"ʌnˈblem.ɪʃt","us_link":"../audio/u/usunapp019.mp3","uk_sound":"ʌnˈblem.ɪʃt","uk_link":"../audio/u/ukunben007.mp3","content":"Add to word list\nAdd to word list\nAn unblemished reputation, character, etc. has no faults and is not spoiled in any way: For six years his championship record was unblemished. But the commission does not have an unblemished reputation. Synonyms\nfaultless approving\nflawless\nimmaculate approving\nimpeccable\nperfect (WITHOUT FAULT)\nuntarnished (REPUTATION)Opposite\nflawed\nThesaurus: synonyms, antonyms, and examples\nmorally rightgoodShe is a good woman who goes out of her way to help others.virtuousI believe that humans are, despite their flaws, capable of virtuous conduct.righteousHe refused to stray from the righteous path.honestHe was a hardworking, honest family man who was only trying to do his duty.upstandingI’m sure most of them are honest, upstanding members of society.\nSee more results »\n(of skin) without any marks that spoil its appearance: Her complexion is flawless, her skin unblemished. You'd never guess that boyish, unblemished face spent so much time outdoors.\nMore examplesFewer examplesHis reputation was unblemished in 1996, when he was simply the best high school player in the nation.She retired some years later with an unblemished record of service. What I’m after is smooth, unblemished skin.It is difficult not to look at their tiny, unblemished faces, smeared in makeup, and ask why, at so young an age, this is already part of their life.\nSMART Vocabulary: related words and phrases\nPerfect and faultless\nArcadia\nArcadian\nbat a thousand idiom\nblamelessly\nbow\nidyllic\nidyllically\nimmaculacy\nimmaculate\nimmaculately\nnon-utopian\non point idiom\nperfectible\nperfection\nperfective\nthe cherry on (top of) the cake idiom\nutopia\nutopian\nwhiter than white idiom\nXanadu\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnspoilt"}