{"id":376495,"name":"unbridged","type":"adjective","us_sound":"ˌʌnˈbrɪdʒd","us_link":"","uk_sound":"ˌʌnˈbrɪdʒd","uk_link":"","content":"unbridged adjective\n(RIVER)\nAdd to word list\nAdd to word list\nAn unbridged river, stream, etc. does not have a bridge over a particular part of it: In order to get to church, we had to cross an unbridged river. The route took us over seven, as yet unbridged, canals.\nMore examplesFewer examplesThe route takes you miles from any habitation, and across several unbridged streams and rivers.The village is surrounded on three sides by unbridged water, and there's just one road in and out.Very few new bridges were built at previously unbridged sites between 1250 and 1550.\nSMART Vocabulary: related words and phrases\nBridges\nabutment\nairbridge\naqueduct\nbridge\ncofferdam\ndrawbridge\nflyover\nfootbridge\ngrade separation\nhumpback bridge\njetty\noverpass\npier\npontoon\nrope bridge\nspan\nsuspension bridge\nswing bridge\ntoll bridge\nviaduct\nunbridged adjective\n(DIFFERENCE)\nIf there is an unbridged difference between two people, groups, or things, it has not been possible to make them understand each other or agree: She worried about the unbridged chasm between Lucy and herself. The climate conference closed with many gaps still unbridged. Related word\nbridge\nMore examplesFewer examplesThe gulf of misunderstanding between the West and the East cannot be left unbridged.All over the world, two classes were forming, with an unbridged chasm between them: the capitalist class, with its enormous fortunes, and the proletariat.There had always been a divide between the former and current members, but it was fast becoming an unbridged gulf.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanother\nanything\ndisparity\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\nnon-comparability\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nvariant\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArguments & disagreements"}