{"id":376581,"name":"unbuffered","type":"adjective","us_sound":"ˌʌnˈbʌf.ɚd","us_link":"../audio/u/cdo0623usunbu4179.mp3","uk_sound":"ˌʌnˈbʌf.əd","uk_link":"../audio/u/cdo0623ukunbu4210.mp3","content":"unbuffered adjective\n(COMPUTING)\nAdd to word list\nAdd to word list\ncomputing\n&#160; specialized Unbuffered information, or an unbuffered part of a computer system, does not use a buffer (= a temporary memory store for information while it is being dealt with or sent): Channels are message queues which can be buffered or unbuffered.\nMore examplesFewer examplesThe unbuffered solid state memory block holds a capacity of 4096 bytes.Access location will either be unbuffered on-disc or cached. They require registered modules that are both slower and more expensive than unbuffered types.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\nmeg\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nSee more results »\nunbuffered adjective\n(CHEMICAL SUBSTANCE)\nchemistry\n&#160; specialized An unbuffered substance is not mixed with another substance to make it neutral (= neither an acid nor an alkali): An unbuffered pocket of highly acidic juice is observed in the stomach after a meal in healthy subjects.\nMore examplesFewer examplesThe samples were dissolved in unbuffered dilute acetic acid. For each subject, the unbuffered local anaesthetic was used in one eye, while the buffered solution was used in the other eye. There were no significant differences between the buffered and unbuffered lidocaine.\nSMART Vocabulary: related words and phrases\nChemistry: types of chemical\nacid salt\naerogel\nalkali metal\nalkaline\nalkalinity\nantioxidant\ncarbohydrate\ninorganic\nketone\nlectin\nmelamine\nmethyl orange\nmonomer\nmonosaccharide\nmothball\npropellant\nreactant\nsaline\nsoluble\nsulphide\nSee more results »"}