{"id":378232,"name":"unconverted","type":"adjective","us_sound":"ˌʌn.kənˈvɝː.t̬ɪd","us_link":"../audio/u/cdo1119usunco1218.mp3","uk_sound":"ˌʌn.kənˈvɜː.tɪd","uk_link":"../audio/u/cdo1119ukunco1136.mp3","content":"unconverted adjective\n(BELIEF/OPINION)\nAdd to word list\nAdd to word list\nnot having changed to a new religion, belief, or opinion: We are asked to pray for our unconverted friends. I love their new album but my wife remains resolutely unconverted. the unconverted\npeople who have not changed their religion, belief, or opinion: These days I don't feel the need to preach to the unconverted; I just quietly think them fools.\nMore examplesFewer examplesHe interprets the world as a fight between good and evil in which his role is zealously to \"spread the word\" of Western democracy among the unconverted masses.Granada was taken from the Moors, unconverted Jews were expelled from the country and Spain became a zealously Christian land. The number of new religious songs has grown in the past five years as churches try to reach out to the unconverted.Websites among the bug-eating fraternity, such as Eatbug, carry favourite recipes which are designed to tempt the unconverted.\nSMART Vocabulary: related words and phrases\nKeeping and staying the same\nanti-progressive\ncalcification\ncalcify\nconsistency\nconsistent\ncontinuum\ninvariant\ninveteracy\nkept\nleave well alone idiom\nleft\npeg\nstability\nstabilization\nstabilize\nstably\nstay\nwallow\nwallow in something\nwouldn't have it any other way idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOpinions, beliefs and points of view\nReligious people: believers & non-believers\nunconverted adjective\n(NOT CHANGED)\nnot changed in form or character; not made suitable for a different use: For sale: Two unconverted barns in a courtyard setting on a five-acre plot. If there were a few red blood cells that were left unconverted, that really wouldn't do any harm.\nMore examplesFewer examplesCells that absorb all four genes are somehow converted to stem cells. Researchers kill any unconverted cells, leaving behind viable stem cells.Last July, we sold a stunning Sussex barn with outbuildings - unconverted but with planning for a 4,500 sq ft home.The website lists barns - converted and unconverted - plus other agricultural buildings with domestic potential.\nSMART Vocabulary: related words and phrases\nKeeping and staying the same\nanti-progressive\ncalcification\ncalcify\nconsistency\nconsistent\ncontinuum\ninvariant\ninveteracy\nkept\nleave well alone idiom\nleft\npeg\nstability\nstabilization\nstabilize\nstably\nstay\nwallow\nwallow in something\nwouldn't have it any other way idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHouses & homes\nunconverted adjective\n(IN SPORTS)\nIn some sports, when a try, free throw, or penalty shot is unconverted, no extra points are scored after it: He sprinted over for an unconverted try to take Bristol to a deserved 5 point lead. Three Portrush penalty corners went unconverted in the first half.\nMore examplesFewer examplesThe try was unconverted and the lead a mere two points.Winger Ben Breeze promptly grabbed Newport's fourth try in the 34th minute, this time unconverted.At the end of each half they pressurised Northern with a succession of unconverted short corners.\nSMART Vocabulary: related words and phrases\nRugby\nbomb\ncharge something down\nconverted\ncooler\ndrop kick\nfield of play\nflank\nflanker\nheel\nmatch fitness\nmisfield\noutcome variable\noutkick\nplace-kick\nsquad rotation\nsteal\ntest match\nthrow something in\nwing back\nwork rate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWinning, losing & scoring in sport"}