{"id":378409,"name":"uncover","type":"verb","us_sound":"ʌnˈkʌv.ɚ","us_link":"../audio/u/uncover.mp3","uk_sound":"ʌnˈkʌv.ər","uk_link":"../audio/u/ukuncon021.mp3","content":"Add to word list\nAdd to word list\nC1 to discover something secret or hidden : The investigation uncovered evidence of a large-scale illegal trade in wild birds. The biography is an attempt to uncover the inner man.\nThesaurus: synonyms, antonyms, and examples\nto find someone or somethingfindI've looked everywhere for my keys but can't find them.discoverThe missing wallet was discovered under the chair.locatePolice are still trying to locate the suspect.uncoverReporters uncovered evidence of corruption.unearthOur investigation unearthed mountains of evidence that implicated the city.come acrossWe came across a lovely little restaurant in the village.\nSee more results »\nto take a cover or covering off something: Cover the dish and bake for 15 minutes, then uncover it and bake for another 10 minutes. The masked men were ordered to uncover their faces.\nto find something buried under the ground by removing the earth on top of it: Digging in her garden, she uncovered a hoard of gold dating back to the ninth century. Related words\ncover\nuncovered\nMore examplesFewer examplesThey uncovered a plot to destabilize the government.The investigation uncovered some interesting information on Mr Parkinson.Police officers uncovered an intricate web of deceit.While digging the foundations builders uncovered some important archaeological remains.It will be interesting to see what this investigation uncovers.\nSMART Vocabulary: related words and phrases\nRevealing secrets & becoming known\nanti-secrecy\nbackchannel\nbare\nbare your heart/soul idiom\nblow someone's cover idiom\nblow/take the lid off something idiom\nbreak\ndeclassify\nhold\nhuddle\nkiss\nrat\nrat on someone/something\nreintroduce\nrevealingly\nrevelatory\nstate's evidence\ntip\ntranspire\nunravel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFinding and discovering\nCoverings and layers\nArchaeology\nDigging\nAdd to word list\nAdd to word list\nto remove what is covering something, or to discover what was hidden: uncover the pot It’s the press’s responsibility to uncover the truth."}