{"id":378185,"name":"uncontrolled","type":"adjective","us_sound":"ˌʌn.kənˈtroʊld","us_link":"../audio/u/eus74700.mp3","uk_sound":"ˌʌn.kənˈtrəʊld","uk_link":"../audio/u/ukuncon008.mp3","content":"Add to word list\nAdd to word list\n(of an emotion, vehicle, etc.) not under a person's control: uncontrolled aggression It was said that he often erupted into fits of uncontrolled rage. Compare\ncontrolled\nwithout anything having been done to stop a problem from increasing, or a disease, etc. from getting worse; not limited in any way: The urbanization of the countryside was largely uncontrolled. Uncontrolled hypertension is one of the main preventable causes of death or disability due to stroke or heart attack. If left uncontrolled, the disease can cause a number of serious complications. Synonym\nnon-controlled\nscience\n&#160; specialized not using a control (= an object or system that is not changed so that you can compare it with similar objects or systems that are intentionally changed): The number of patients is relatively small and the study is uncontrolled. Opposite\ncontrolledSynonym\nnon-controlled\nMore examplesFewer examplesThe plane then glided into the field, uncontrolled.Cancer is a term for more than 100 diseases characterized by the uncontrolled, abnormal growth of cells. Many people said they were worried about uncontrolled immigration.There is now little question that uncontrolled stress can kill.\nSMART Vocabulary: related words and phrases\nUncontrolled\nall hell breaks loose idiom\namok\namuck\ncorybantic\ncrazily\nextravagance\nmadding\nmaniacal\nmaniacally\nnon-regulated\nout of hand idiom\nspread like wildfire idiom\nsquirrelly\ntearaway\nunbridled\nuncheckable\nwaywardly\nwaywardness\nwig out\nwigged out\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical studies & the people who study them\nAdd to word list\nAdd to word list\nexisting or happening with nothing able to stop it: uncontrolled shivering the uncontrolled spread of urban sprawl"}