{"id":378590,"name":"uncultivated","type":"adjective","us_sound":"ʌnˈkʌl.tə.veɪ.t̬ɪd","us_link":"../audio/u/cdo1119usuncu1219.mp3","uk_sound":"ʌnˈkʌl.tɪ.veɪ.tɪd","uk_link":"../audio/u/cdo1119ukuncu1137.mp3","content":"uncultivated adjective\n(LAND)\nAdd to word list\nAdd to word list\nUncultivated land is not used to grow crops: The agency has preserved wetland habitat and encouraged farmers to leave some fields uncultivated.\nMore examplesFewer examplesThe uncultivated border regions on farms also provide a refuge for helpful beetle species.Farmers were lured to Australia and Argentina to develop their vast, uncultivated prairies.The ants are present on every square metre of uncultivated soil.These meadowlands have lain uncultivated for centuries.\nSMART Vocabulary: related words and phrases\nAreas of land where crops are grown\ncorn circle\ncornfield\ncrop circle\ncultivated\nfield\nmonoculture\nnon-cultivation\nnon-irrigated\norchard\npaddock\npaddy field\nplough\npolyculture\nrice paddy\nset something aside\nterrace\nunder\nunirrigated\nunworked\nvineyard\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFertile or infertile land\nuncultivated adjective\n(PERSON)\nSomeone who is uncultivated has not had a good education and may not know a lot about art, music, painting, etc.: We must always remember that he was not an ignorant or uncultivated soldier. Compare\ncultivated\nMore examplesFewer examplesSomeone who swears a lot might seem like an uncultivated person incapable of finding better words.She had hurt her cousin's sensitive though uncultivated feelings.It is not very pleasing to observe uncultivated ignorance.I expected to meet with a rough, hard-handed, and uncultivated population, living in the most Spartan-like simplicity.\nSMART Vocabulary: related words and phrases\nUnaware\nbe in the dark idiom\nbe on another planet idiom\nbenighted\nbenightedly\nblind spot\nblindly\nfoggy\nGoodness/God/Heaven/Christ knows idiom\nilliterate\nimperceptive\nin blissful ignorance idiom\ninnumeracy\ninsensate\ntin-eared\nunacquainted\nunattuned\nunawakened\nunaware\nwouldn't know something if you fell over one/it idiom\nyour guess is as good as mine idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLearning & knowing"}