{"id":378985,"name":"undeliverable","type":"adjective","us_sound":"ˌʌn.dɪˈlɪv.ɚ.ə.bəl","us_link":"../audio/u/cdo0623usunde4261.mp3","uk_sound":"ˌʌn.dɪˈlɪv.ər.ə.bəl","uk_link":"../audio/u/cdo0623ukunde4292.mp3","content":"undeliverable adjective\n(LETTER)\nAdd to word list\nAdd to word list\nA letter, parcel, or message that is undeliverable cannot be delivered: There were thousands of undeliverable packages piling up in the sorting office. Emails sent to addresses at these domains were returned as undeliverable.\nMore examplesFewer examplesIf the postal authorities alert us that your magazine is undeliverable, we have no further obligation unless we receive a corrected address within two years.One reason for the high percentage of undeliverable summonses is that invalid names and addresses have not been removed from the database.I sent the email again and it came back as undeliverable.\nSMART Vocabulary: related words and phrases\nDelivering and despatching\nair bridge\nair corridor\nair drop\nair-dash\nbox scheme\nconsign\ncourier\ndrop off\nmisaddress\nmisdirect\nmisdirection\nmisroute\nnon-delivery\nsend something out\nship\nshipment\nshipper\nshoot\nshoot something off\ntruck\nSee more results »\nundeliverable adjective\n(PROMISE)\nIf something that was promised or planned is undeliverable, it cannot be done: We are stupid, and elect people who make the most undeliverable promises. Several proposals have been put to customers offering undeliverable discounts on call rates, even though the customer is on the best possible rate.\nMore examplesFewer examplesLabour claimed that the Tory defence plans were undeliverable.Their plans were ruled out as politically undeliverable.The tax guarantee was undeliverable and went to the heart of the contradictions in the government position.\nSMART Vocabulary: related words and phrases\nFailing and doing badly\nabjectly\nat-risk\nbackbencher\nballs (something) up\nbe on your beam ends idiom\nblow (someone/something) up\nbomb\negg\nflog\nflog a dead horse idiom\nflop\nflub\nflunk out\nfounder\nrot\nrunning on empty idiom\nsclerotic\nscrew\nsmoke\nthe rot sets in idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking & breaking promises & commitments"}