{"id":379095,"name":"under","type":"preposition","us_sound":"ˈʌn.dɚ","us_link":"../audio/u/under.mp3","uk_sound":"ˈʌn.dər","uk_link":"../audio/u/ukundef004.mp3","content":"under preposition\n(LOWER POSITION)\nAdd to word list\nAdd to word list\nA1 in or to a position below or lower than something else, often so that one thing covers the other: He hid under the bed. In AD 79 the city of Pompei was buried under a layer of ash seven metres deep. She put the thermometer under my tongue. She was holding a folder under her arm (= between her upper arm and the side of her body). They stood under a tree (= below its branches) to avoid getting wet.\ngeography\n&#160; specialized If a piece of land is under a particular type of plant, that plant is growing on the whole of that area: The main fields are under wheat.\nIf a book, article, or piece of information is under a particular title, you can find it below or following that title in a list, book, library, etc.: Books on Ansel Adams will probably be under Art or Photography. Custard? That comes under Desserts.\nMore examplesFewer examplesThe children squealed in delight when they saw all the presents under the Christmas tree.I bent down to look under the bed.A dog lay under the table, gnawing on a bone.She used to hide her diary under her pillow.There was no soap, so I just quickly rinsed my hands under the tap.\nSMART Vocabulary: related words and phrases\nUnder & below\nbelow\nbeneath\nlow\nlower\nneath\nnether\nsub\nsubjacent\nultra-low\nunderfoot\nunderlying\nunderneath\nYou can also find related words, phrases, and synonyms in the topics:\nAreas of land where crops are grown\nLists and catalogues\nunder preposition\n(LESS THAN)\nA2 less than: All items cost/are under a pound. The discount applies only to children under (the age of) ten (= younger than ten). If you get under 50 percent, you fail the exam. Opposite\nover\nMore examplesFewer examplesYou can get travel concessions if you are under 26.It's against the law to leave children under a certain age alone in the house.I managed to get all three suitcases for under $200.She ran her first marathon in just under three hours.You can walk from here to the station in under ten minutes.\nSMART Vocabulary: related words and phrases\nSmall in number and quantity\nbeggarly\nbelow\nbupkis\ncertain\ncould count something on (the fingers of) one hand idiom\nlimitedness\nmeasly\nmild\nmildness\nmingy\nminimal\nmodest\nonly so much/many idiom\npiffling\nremote\nscantly\nslenderly\nstrength\nsuggestion\nthin\nSee more results »\nunder preposition\n(EXPERIENCING)\nB2 happening during, as a result of, or according to a particular situation, event, rule, etc.: The work was completed under very difficult conditions. Now that the deadline is approaching we all feel under pressure. The chair broke under his weight (= because he was too heavy for it). Under the current rules, you need the agreement of at least 6 out of 10 committee members. under attack, consideration, discussion, etc.\nB2 in the process of being attacked, considered, discussed, etc.: The town is under fire (= is being attacked) from the air. The proposals are now under consideration by the Board of Governors. The situation is still not under control. under sedation, anaesthetic, etc. UK\ntreated in the way mentioned: The patient is being kept under heavy sedation. She'll have to go under anaesthetic for the operation.old-fashioned She's been under the doctor for a viral infection. be under an impression/belief\nB2 to believe something, often wrongly: He was under the mistaken belief that I was in charge.\nMore examplesFewer examplesAn adult under British law is someone over 18 years old.He was under attack for daring to criticize the prime minister.The procedure is carried out under local anaesthetic.I imagine he's under a lot of pressure at the moment.Except under clearly defined circumstances, it is illegal in Britain for a company to purchase its own shares.\nSMART Vocabulary: related words and phrases\nSimultaneous and consecutive\naccompanied by someone/something\naccompaniment\naccompany\nall the while idiom\nalong\nfly\ngo along\nheavy rotation\nin parallel idiom\nin rotation idiom\nin tandem idiom\nminute\nprocess\nsimultaneously\nsimultaneousness\nsoon\nstep\nstraight\nsuccessive\nturn\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExperiencing and suffering\nMedical treatment: treating & caring for people\nMedical treatment: doctors & health workers generally\nMedical treatment: people who receive medical treatment\nBelieving\nunder preposition\n(CONTROL)\ncontrolled or governed by a particular person, organization, or force: He's a Colonel, with hundreds of soldiers under him (= obeying his orders). I wonder what Britain was like under the Romans (= during the time when the Romans controlled Britain). People born under (= during the period of) the zodiac sign Pisces are supposed to be dreamy and artistic. be under orders\nto have been ordered to do something: They're under strict orders not to discuss the situation. He's under doctor's orders (= has been told by a doctor) to cut down on fatty food and to drink no alcohol for at least six months.\nMore examplesFewer examplesThe group flourished under her firm leadership.He served under Harold Wilson as Transport Minister.Sleeping Beauty lay under the wicked fairy's spell until the prince woke her with a kiss.As a young painter, he studied under Picasso.Eastern Slavonia is to revert to Croatian government rule next year after a transitional period under U.N. administration.\nSMART Vocabulary: related words and phrases\nRuling & governing\nadministration\naffairs of state\nascend\nascend the throne idiom\nbipartisanship\ngovernment-sponsored\ngovernmental\ngovernmentally\ngovernorate\nhard Brexit idiom\noppress\noppression\noppressively\noppressiveness\novergovern\nstatesmanship\nsubjection\nsubjugate\nsubjugation\nsuper-government\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGiving orders & commands\nunder preposition\n(NAME)\nusing a particular name, especially one that is not your real name: He writes under the name (of) John le Carré. For his own safety, he has to operate under a false name/an alias.\nSMART Vocabulary: related words and phrases\nNames and titles\nA.N. Other\nage\naka\nalias\nappellation\nform of address\ngiven name\ngood name\nidentity\nilk\npet name\nplace name\npseudonym\npseudonymity\npseudonymous\ntrademark\nunchristened\nunder the name of idiom\nunidentified\nunnamed\nSee more results »\nGrammar\nBeneath, under or below?Beneath has a meaning similar to under and below but we do not use it with numbers: …\nUnderUnder is a preposition. When we use under as a preposition, it is similar to below. We use under to talk about something that is below or lower than something else: …\nIdiom\nbe/fall under someone's influence/spell\nbelow the surface of something: Because I'm a bad swimmer, I often go under and swallow a lot of water.\nMore examplesFewer examplesThe waves came crashing over my head and I could feel myself being sucked under by the currents.I like swimming but I don't like putting my head under.A big piece of rope netting was laid on the ground and we had to crawl under as quickly as we could.\"Oh no, it's starting to rain.\" \"I've got my umbrella - quick, get under.\"She was stuck on the other side of a locked door, but I got the key and slid it under to her.\nSMART Vocabulary: related words and phrases\nUnder & below\nbelow\nbeneath\nlow\nlower\nneath\nnether\nsub\nsubjacent\nultra-low\nunderfoot\nunderlying\nunderneath\nGrammar\nUnderUnder is a preposition. When we use under as a preposition, it is similar to below. We use under to talk about something that is below or lower than something else: …\nIdiom\ngo under\nnot enough or not done as well or as much as is necessary: undercooked potatoes underprivileged children We're all overworked and underpaid. His boss says he's under-performing (= not doing as well as he should) at work. Compare\nover- (MORE THAN)\nbelow: underwear an underpass\nSMART Vocabulary: related words and phrases\nScarce, inadequate and not enough\nbe at a premium idiom\nbe thin on the ground idiom\ndearth\ndeficiency\ndeficient\ngold dust\nlike gold dust idiom\nlong on something and short on something idiom\nlousy\nmeagre\nmeagrely\nmeasly\nscrubby\nshortage\nshortfall\nshortness\nshy\nskimpily\nskinny\nthin\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnder & below\nunder preposition\n(LOWER POSITION)\nAdd to word list\nAdd to word list\nin or to a position below or lower than (something else), often so that one thing covers the other: Our dog hides under the bed whenever we have a lightning storm. She was holding the umbrella under her arm (= between her upper arm and the side of her chest).\nunder preposition\n(LESS THAN)\nless than: The price is still under a dollar. Scholarship candidates must be under 21 and plan to attend college in the fall.\nunder preposition\n(EXPERIENCING)\nin the process of, influenced or controlled by, or according to: Construction had to be done under difficult conditions. Under current law, stores in this town can’t do business on Sunday. We liked working under her because she made us feel appreciated. \"Where can I find books on swimming?\" \"Look under sports (= within the subject of sports).\" We seemed to be under attack (= in the process of being attacked) by a swarm of bees. Your request for a transfer to our Denver office is under consideration (= being considered). I was under the impression (= I believed) that she was married. I find it difficult to work under pressure (= with this influence).\nIdioms\nunder your belt\nunder your breath\nunder fire\nunder guard\nunder your nose\nunder oath\nunder the influence\nunder the sun\nunder the table\nunder the weather\nMore idioms\nunder wraps\nunder adverb [not gradable]\n(LESS THAN)\nless than something else: There is no admission charge for children six and under.\nunder adverb [not gradable]\n(LOWER POSITION)\nbelow or lower than something else: Several lifeguards tried desperately to reach him before he went under (= sank below the surface of the water).\nnot enough: The potatoes were undercooked. Classes were too large because the school was understaffed."}