{"id":379723,"name":"underlying","type":"adjective","us_sound":"ˌʌn.dɚˈlaɪ.ɪŋ","us_link":"../audio/u/eus74719.mp3","uk_sound":"ˌʌn.dəˈlaɪ.ɪŋ","uk_link":"../audio/u/ukunder016.mp3","content":"underlying adjective [before noun]\n(NOT OBVIOUS)\nAdd to word list\nAdd to word list\nC2 real but not immediately obvious: And what might be the underlying significance of these supposedly random acts?\nMore examplesFewer examplesOn the surface it's a very funny novel but it does have a more serious underlying theme.The underlying message of the film is that love transcends everything else.We need to tackle the underlying causes of poverty and suffering.It is important to look at all the underlying causes of the conflict.An underlying pessimism infuses all her novels.\nSMART Vocabulary: related words and phrases\nDigressing and being indirect or evasive\nbury the lede idiom\ncandy coat\ncandy coating\ncandy-coated\ncircumlocution\ncircumlocutory\nequivocate\nglancingly\ngloss over something\ngo off on a tangent idiom\nhedging\nimplicit\nimplicitly\nmealy-mouthed\nobfuscate\nobscure\nparry\nprevaricate\nstray\nveil\nSee more results »\nunderlying adjective [before noun]\n(BASED ON)\nused to describe something on which something else is based: The price of the investment fell below the value of the underlying assets.\nThesaurus: synonyms, antonyms, and examples\nbasic knowledge, understanding, etc.basicI just need some basic information.elementaryI started an elementary-level art history course.fundamentalOne of the most fundamental principles of the rule of law is that one person cannot be punished for the actions of another.rudimentaryThey have only the most rudimentary grasp of the language.essentialWe have been able to determine the essential nature of a healthy diet.underlyingThe underlying idea is that having freedom is valuable.\nSee more results »\nSMART Vocabulary: related words and phrases\nEssential or necessary\nbasically\nbasis\nbe a question of doing something idiom\nbox ticking\nbusiness-critical\ndependence\nelemental\nif need be idiom\nif/when push comes to shove idiom\nincumbent\nindispensable\nindispensably\nnecessary evil\nnecessitate\nnecessity\nneed\nneeded\nowe\nsymbiotic\nsymbiotically\nSee more results »\nunderlying adjective [before noun]\n(UNDER)\npositioned under the surface of something: The currents are affected by the shape of the underlying rocks.\nSMART Vocabulary: related words and phrases\nUnder & below\nbelow\nbeneath\nlow\nlower\nneath\nnether\nsub\nsubjacent\nultra-low\nunder\nunderfoot\nunderneath\nAdd to word list\nAdd to word list\nreal but not immediately obvious: The investigation focused on the underlying causes of the fire.\nAdd to word list\nAdd to word list\nFINANCE, STOCK MARKET used to describe the shares, etc. to which something such as an option (= the right to buy or sell something in the future) relates: The option was sold requiring payment against delivery of the underlying security.\nACCOUNTING, FINANCE used to describe the basic level or amount of something before anything else is added or taken away: Underlying conditions are favourable. They underestimated their underlying costs and ended up losing a lot of money. Last year the company had underlying earnings of $10.6m on $34m sales."}