{"id":380237,"name":"understudy","type":"noun","us_sound":"ˈʌn.dɚˌstʌd.i","us_link":"../audio/u/understudy.mp3","uk_sound":"ˈʌn.dəˌstʌd.i","uk_link":"../audio/u/ukunder120.mp3","content":"Add to word list\nAdd to word list\nan actor who learns the parts of other actors in a play, so that he or she can replace them if necessary, for example if they are ill: An understudy took over for the rest of the performance and the evening show. Understudies never know when they might have to go on. Compare\nstandby\nstand-in\nsubstitute noun\nMore examplesFewer examplesThe play starts with the Director announcing that one actor has been replaced by an understudy.Sometimes the understudy really does get a big break.She tells me she is indisposed, and her understudy is to play the part tonight.\nSMART Vocabulary: related words and phrases\nCinema & theatre: casting, roles & scripts\nbilling\nbit part\ncallback\ncast list\ncasting couch\nchorus\ndialogue\nexit\nHarlequin\nmiscast\noff script\non script\nopposite\nscript\ntable read\ntapescript\nteleplay\ntheatre\ntitle role\ntypecast\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema & theatre: actors & performers\nto learn the lines of other actors in a play, so that you can replace them if necessary, for example if they are ill: He understudied the title role in Broadway's \"Tarzan\". Big roles are always given to big stars, so understudying is the only way in the beginning. Compare\nstand in\nsubstitute for someone/something\nMore examplesFewer examplesHe was with the national tour of \"The Lion King\", understudying the roles of Scar and Pumbaa.She essentially understudies eleven characters in the musical.Lisa Fennell, in addition to her role in the chorus, was to understudy Désirée.\nSMART Vocabulary: related words and phrases\nCinema & theatre: acting, rehearsing & performing\nact out\namateur theater\nappear\nappearance\nblocking\ncamp\nchew\nchew the scenery idiom\nimprovisation\ninterpreter\nre-enact\nre-enactment\nrecreation\nrep\nstage business\ntread\nvoice acting\nwalk\nwalk through something\nwalkthrough\nSee more results »\nAdd to word list\nAdd to word list\nan actor or other performer who learns the parts of others in a play, opera, etc., so that he or she can replace them if necessary"}