{"id":380060,"name":"undersell","type":"verb","us_sound":"ˌʌn.dɚˈsel","us_link":"../audio/u/usuncro028.mp3","uk_sound":"ˌʌn.dəˈsel","uk_link":"../audio/u/ukunder104.mp3","content":"undersell verb [T]\n(SELL CHEAPLY)\nAdd to word list\nAdd to word list\nto sell goods at a price lower than a competitor: A big supermarket can usually undersell a small local store.\nSMART Vocabulary: related words and phrases\nSelling\nauction\nBlack Friday\nbundle\nbundling\nchain of production\nconcession\noversell\npanic selling\npeddle\npile\npile it high and sell it cheap idiom\npoint of sale\nsell out\nsell something off\nsellout\nshift\nsoft sell\nsold\nspecial offer\nsting\nSee more results »\nundersell verb [T]\n(BE MODEST)\nto not give something or someone, especially yourself, the praise that is deserved: Don't undersell yourself - you have a lot to offer a company.\nSMART Vocabulary: related words and phrases\nExaggerating & playing down\nbloviate\nblow something out of proportion idiom\ncartoonish\ncartoonishly\ncatastrophize\nfulsome\ngo overboard idiom\ninflated\nmake a mountain out of a molehill idiom\nmake a song and dance about something idiom\nmake little of something idiom\nmake much of something idiom\nmake something of something/someone\nmeal\nmildly\nOTT\nprotest too much idiom\nromanticize\ntrivialize\nunderplay\nSee more results »\nAdd to word list\nAdd to word list\n[ T ]\n&#160; COMMERCE to sell goods for less than someone else or for less than they are really worth: The big chains undersell new releases at first, and then as customers continue to come, they raise the price. The lender got the valuation wrong and undersold the flat.\n[ T ]\n&#160; MARKETING to make an idea, product, opportunity, etc., seem less attractive than it really is: undersell yourself Many candidates undersell themselves when applying for jobs. Our research is of good quality but a little undersold. I don't want to undersell how difficult this is. Compare\noversell\n[ I or T ]\n&#160; MARKETING to sell less of something than is available, or less than the real demand for it: I believe this is a market that is seriously undervalued and undersold. They offer a 5% reduction if undersold. Compare\noversell"}