{"id":379360,"name":"undercut","type":"verb","us_sound":"ˌʌn.dɚˈkʌt","us_link":"../audio/u/eus74710.mp3","uk_sound":"ˌʌn.dəˈkʌt","uk_link":"../audio/u/ukundef018.mp3","content":"undercut verb [T]\n(CHARGE LESS THAN)\nAdd to word list\nAdd to word list\nto charge less than a competitor: Big supermarkets can undercut all rivals, especially small family-owned shops. They claim to undercut their competitors by at least five percent.\nSMART Vocabulary: related words and phrases\nPrice decreases\nbargain\nbearish\nbearishly\ncloseout\nconcessional\ncouponer\ncouponing\ndeflate\ndeflation\ndepreciate\ndevalue\ndiscount\ndrop off\nfreeze\nknock off (something)\nmark something down\noverdiscount\npost-devaluation\nprojected value\nspiral\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSelling\nundercut verb [T]\n(DAMAGE)\nto damage something or to make it fail: He suspected it was an attempt to undercut his authority. Synonym\nundermine\nSMART Vocabulary: related words and phrases\nUpsetting and destabilizing\nbring\nbring someone down\ndelegitimize\ndestabilization\ndestabilize\ndisruptive\ndisruptively\ndiversionist\nknock/throw someone for a loop idiom\nloop\nmake waves idiom\nskid\nstir\nturn\nundermine\nunsettle\nunsettling\nunspool\nunspooling\nwave\nSee more results »\nundercut noun [C]\n(HAIR)\na hairstyle in which the hair is shaved or cut very short at the sides and back of the head and left longer on the top: When asking for an undercut, you must say how long you want the scissor-cut hair on top to be. an undercut style\nMore examplesFewer examplesThe hair on the top of the head in an undercut is left long enough to be styled in many different ways.Even if you have curly hair you can still look great in an undercut.If you have thin hair, you should select a layered undercut to add volume.The undercut is a cool way to switch up any hairstyle.\nSMART Vocabulary: related words and phrases\nHairstyles\nAfro\nAfro puff\nbandeau\nBantu knots\nbarnet\nblow-dry\nbowl cut\nchignon\nfade\nhair extension\nhairdo\nkiss curl\nplait\npompadour\npony\npudding basin\nrelaxed\nshake out\nsidelock\nskinhead\nSee more results »\nundercut noun [C]\n(TREE)\na cut shaped like a V that is made at the bottom of the trunk (= thick main stem) of a tree before it is cut down, to control the direction in which it falls : The undercut is a V-shaped notch cut into the side of the tree in the direction of falling.\nMore examplesFewer examplesThe illustration shows loggers putting the undercut in a tree before felling. Here you can see a logger using a chainsaw to cut out an undercut wedge that will serve to direct the tree's fall.In this type of undercut a portion of the front face of the stump is also removed.\nSMART Vocabulary: related words and phrases\nForestry\nafforestation\nagroforestry\narborist\nbrush\ncut down\ndeforest\ndeforestation\ndisafforest\njungle\nlogging\nlumberjack\nold growth\nranger\nreafforest\nslash-and-burn\nthe treeline\ntree-lined\nunderstorey\nwoodcutter\nwoodsy\nSee more results »\nAdd to word list\nAdd to word list\nto weaken, damage, or cause the failure of something; undermine: He's got a plan, so I don't want to undercut the effort that he has underway.\nTo undercut is also to charge less than a competitor: Large supermarkets can undercut their smaller rivals.\nAdd to word list\nAdd to word list\nto sell goods or provide a service for a lower price than someone else: Large supermarkets undercut corner shops and put them out of business."}