{"id":380189,"name":"understanding","type":"noun","us_sound":"ˌʌn.dɚˈstæn.dɪŋ","us_link":"../audio/u/understanding.mp3","uk_sound":"ˌʌn.dəˈstæn.dɪŋ","uk_link":"../audio/u/ukunder115.mp3","content":"understanding noun\n(KNOWLEDGE)\nAdd to word list\nAdd to word list\nB2 [ U ] knowledge about a subject, situation, etc. or about how something works: understanding of She doesn't have any understanding of politics/human nature/what it takes to be a good manager. My understanding of the agreement (= what I think it means) is that they will pay $50,000 over two years.\nMore examplesFewer examplesIt certainly helped to deepen my understanding of the situation.His answer demonstrated a complete lack of understanding of the question.Some understanding of grammar is fundamental to learning a language.You need to demonstrate to the examiners that you have more than a literal understanding of the text.Academics sitting in ivory towers have no understanding of what is important for ordinary people.\nSMART Vocabulary: related words and phrases\nUnderstanding and comprehending\nappreciation for something\napprehend\napprehensible\napprehension\nastutely\nbear\ncatch\ncolour\nhandle\nkeep someone up\nknow a hawk from a handsaw idiom\nknow the score idiom\nknow/see where someone is coming from idiom\nlatch\nscale\ntease something apart\nto get a handle on something idiom\nto have a handle on something idiom\ntumble to something\ntune in\nSee more results »\nunderstanding noun\n(SYMPATHY)\nB2 [ S or U ] a positive relationship between two people or groups in which they feel sympathy for each other: understanding between For peace to exist in the region there needs to be a much improved understanding between all the parties concerned.\nSMART Vocabulary: related words and phrases\nFriendly\naffability\naffable\naffably\naffiliative\nagreeableness\nconversable\nconvivial\nconviviality\nconvivially\ncordial\nhospitable\nhospitably\nhospitality\ninseparable\nsocially\nsugar and spice idiom\nsweet-natured\nsweet-tempered\nsweetness\nthe human touch\nSee more results »\nunderstanding noun\n(AGREEMENT)\nC1 [ C ] an informal agreement between people: come to/reach an understanding It took several hours of discussion before they could come to/reach an understanding.\nThesaurus: synonyms, antonyms, and examples\na decision or arrangement between groups or peopleagreementDo we have an agreement?understandingWe had an understanding that the businesses would merge, but never got that in writing.gentleman's agreementHe and his builder have a gentleman's agreement that if there are spare materials left after working on the flat, the builder can take them home.dealDo we have a deal?contractThe basketball player was signed to a multimillion-dollar contract with a new team this week.accordThe leaders of the four countries signed a peace accord.\nSee more results »\non the understanding (that)\nIf you do something on the understanding that something else can or will happen, you do it because someone else has promised that it can or will: We bought the sofa on the understanding that we could return it if it didn't fit in the room.\nSee more\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconclusion\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nwithout a murmur idiom\nSee more results »\nB2 An understanding person who has the ability to know how other people are feeling, and can forgive them if they do something wrong: He had expected her to be horrified, but she was actually very understanding.\nMore examplesFewer examplesShe's very understanding - you feel you can really open your heart to her.Look, it's not Tom's fault - you could be a little more understanding!I hadn't expected her to be so understanding.I try very hard to be understanding.Fortunately, my girlfriend is very understanding.\nSMART Vocabulary: related words and phrases\nSympathy & compassion\naw\nbad/hard/tough luck! idiom\nbetter luck next time idiom\nbleeding heart\ncheese\nheart-wrenching\nheart-wrenchingly\nheartrending\npitiful\npitifully\npitifulness\npity\npityingly\nsensitivity\nsympathetic\nsympathize\nsympathy\ntoo bad idiom\nyour heart aches idiom\nyour heart goes out to someone idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEmpathy and sensitivity\nunderstanding noun\n(BELIEF)\nAdd to word list\nAdd to word list\n[ C usually sing ] something that you have reason to believe: [ + that clause ] Ours was a generation brought up with the understanding (= belief) that science meant progress.\n[ C usually sing ] An understanding is also an informal agreement between people: The two sides have come to/reached an understanding about the sale of the house.\nunderstanding noun\n(KNOWLEDGE)\n[ U ] knowledge of a particular thing: He doesn’t have any real understanding of mathematics.\n[ U ] Understanding is also a feeling of kindness and caring based on knowledge, esp. of the causes of behavior: The values he had in mind were simply family love and understanding. Idiom\non the understanding\nunderstanding adjective\n(CARING)\nsympathetic and caring: an understanding friend\nAdd to word list\nAdd to word list\nan informal agreement: Taiwan and Hong Kong reached an understanding for a five-year commercial air agreement."}