{"id":380262,"name":"undertake","type":"verb","us_sound":"ˌʌn.dɚˈteɪk","us_link":"../audio/u/undertake.mp3","uk_sound":"ˌʌn.dəˈteɪk","uk_link":"../audio/u/ukunder121.mp3","content":"undertake verb [T]\n(DO)\nAdd to word list\nAdd to word list\nC1 [ T ] formal to do or begin to do something, especially something that will take a long time or be difficult: Students are required to undertake simple experiments.\nMore examplesFewer examplesThe bill requires owners to undertake remedial work on dilapidated buildings.This is one of the largest aid projects ever undertaken.Successful candidates will be required to undertake an induction programme.I'm just beginning to realize the enormity of what I have undertaken.The agency undertook the survey in January 2004.\nSMART Vocabulary: related words and phrases\nActing and acts\n(your) every move idiom\n-ence\nact\nact for someone\nact/do something on your own responsibility idiom\nactivity\nADL\nagency\nant\ner\nexecution\nexploit\nmove\nput your money where your mouth is idiom\nresponsibility\nrole-play\nrot\nstep\nstuff\ntalk\nSee more results »\nundertake verb [T]\n(PROMISE)\nC2 [ T ] formal to promise that you will do something: [ + to infinitive ] She undertook not to publish the names of the people involved. [ + that ] The government undertook that the buildings would not be redeveloped.\nSMART Vocabulary: related words and phrases\nMaking & breaking promises & commitments\nbe on your honour idiom\nbond\nbreach\nbreach of contract\ncovenant\ncross my heart (and hope to die) idiom\ndeliver\nfink\ngo back on something\nHippocratic oath\npromise\nrepledge\nswear someone in\nundeliverable\nundelivered\nundertaking\nunkept\nvow\nwarranty\nwelch\nSee more results »\nundertake verb [T]\n(IN VEHICLE)\n[ I or T ] UK to pass another vehicle that is going in the same direction as you by driving past it on the left side: The Highway Code advises drivers not to undertake. The driver claims the vehicle undertook him while he was turning left. Compare\novertake\nMore examplesFewer examplesI have had a lot experience of driving in America. After my initial fear of cars undertaking on the right, it soon becomes a normal part of driving.While it’s not strictly illegal to undertake on a motorway or dual carriageway in the UK, it can be extremely dangerous.\nSMART Vocabulary: related words and phrases\nOn the road: driving & operating road vehicles\naquaplaning\nback someone up\nbiting point\nboxed in\nbranch off\nchauffeur\ngun\nhandle\njam\nplatooning\npull\npull someone up\npush start\nrange anxiety\nreverse\nroad rage\nskid\nspeeding\nthe RAC\nton\nSee more results »\nAdd to word list\nAdd to word list\nto take responsibility for and begin doing something: [ T ] The president directed the Department of Justice to undertake an investigation of the allegations. [ + to infinitive ] I undertook to help him learn English.\nAdd to word list\nAdd to word list\n[ T ] to do or begin to do something, especially something that will take a long time or be difficult: He needs to undertake a proper cashflow and budgeting exercise. Some companies have undertaken a thorough transformation of their production methods.\n[ I ] formal to promise or agree that you will do something: undertake to do sth All banks have undertaken to give printouts on request of standing orders and direct debits."}