{"id":380940,"name":"undistorted","type":"adjective","us_sound":"ˌʌn.dɪˈstɔːr.t̬ɪd","us_link":"../audio/u/cdo0623usundi4292.mp3","uk_sound":"ˌʌn.dɪˈstɔː.tɪd","uk_link":"../audio/u/cdo0623ukundi4324.mp3","content":"undistorted adjective\n(NOT FALSE)\nAdd to word list\nAdd to word list\nnot false or wrong: These days science is usually regarded as providing the undistorted view of reality. Events must be presented in a fair, accurate and undistorted way.\nMore examplesFewer examplesIt may be genuinely difficult for a parent to provide undistorted information about their feelings as they relate to their child.How can we be sure that we are getting objective and undistorted evidence?\nSMART Vocabulary: related words and phrases\nTrue, real, false, and unreal\nactual\nactuality\nactually\nall that glitters is not gold idiom\nanger\nfalse flag\nfalsely\nfantastical\nfever dream\nfictional\nnon-material\nnon-realistic\nnot so much idiom\nnothing could be further from the truth idiom\nnothing could have been further from my mind/thoughts idiom\nuntrue\nuntruly\nunverifiable\nurban myth\nvalidity\nSee more results »\nundistorted adjective\n(NOT CHANGED)\nnot changed in a way that makes something worse than it was before: undistorted by Curling remains a pure sport, undistorted by relentless advertising. What ordinary people need is lower rents undistorted by tax and housing benefit subsidies to landlords.\nMore examplesFewer examplesThe report was about ordinary people and their present, real life experiences, undistorted by ideology.They campaigned for a free market undistorted by government intervention.Undistorted by city lights, the sky above the village was a beautiful canopy of stars.The government will create a regulatory framework for energy markets and promote undistorted competition in these markets.\nSMART Vocabulary: related words and phrases\nKeeping and staying the same\nanti-progressive\ncalcification\ncalcify\nconsistency\nconsistent\ncontinuum\ninvariant\ninveteracy\nkept\nleave well alone idiom\nleft\npeg\nstability\nstabilization\nstabilize\nstably\nstay\nwallow\nwallow in something\nwouldn't have it any other way idiom\nSee more results »\nundistorted adjective\n(SOUND)\nIf a sound produced on electrical equipment is undistorted, it does not sound strange or unpleasant because of changes in the shape of the sound wave: If you do a direct digital transfer of an undistorted recording, its maximum volume is determined by the loudest sounds on the tape. Dynamic range is the difference between the quietest audible sound and the loudest undistorted sound.\nMore examplesFewer examplesThe speakers provide rich, undistorted sound when set at a moderate volume.The sound of this year's concert was a much more natural sound, with clear and undistorted vocals, and a wider dynamic range.\nSMART Vocabulary: related words and phrases\nPerfect and faultless\nArcadia\nArcadian\nbat a thousand idiom\nblamelessly\nbow\nidyllic\nidyllically\nimmaculacy\nimmaculate\nimmaculately\nnon-utopian\non point idiom\nperfectible\nperfection\nperfective\nthe cherry on (top of) the cake idiom\nutopia\nutopian\nwhiter than white idiom\nXanadu\nSee more results »\nundistorted adjective\n(SHAPE)\nnot pulled into a strange or unnatural shape: The machine produced a clean, undistorted image which looked like it had come out of a laser printer. As monitors go, it's excellent, with a clear, undistorted, and flicker-free display.\nMore examplesFewer examplesWe must find another site where rocks have survived in a relatively undistorted condition.This mirror has reliable, undistorted optics.\nSMART Vocabulary: related words and phrases\nPerfect and faultless\nArcadia\nArcadian\nbat a thousand idiom\nblamelessly\nbow\nidyllic\nidyllically\nimmaculacy\nimmaculate\nimmaculately\nnon-utopian\non point idiom\nperfectible\nperfection\nperfective\nthe cherry on (top of) the cake idiom\nutopia\nutopian\nwhiter than white idiom\nXanadu\nSee more results »\nAdd to word list\nAdd to word list\nused to describe something that has not been changed from its usual or original form: undistorted by sth Truly competitive markets are undistorted by government controls."}