{"id":381507,"name":"unemployment","type":"noun","us_sound":"ˌʌn.ɪmˈplɔɪ.mənt","us_link":"../audio/u/unemployment.mp3","uk_sound":"ˌʌn.ɪmˈplɔɪ.mənt","uk_link":"../audio/u/ukunear012.mp3","content":"Add to word list\nAdd to word list\nB1 the number of people who do not have a job that provides money: Unemployment has fallen/risen again for the third consecutive month.\nthe state of being unemployed\nUS →\nunemployment benefit\nMore examplesFewer examplesOver half his speech was devoted to the issue of unemployment.The problems of poverty, homelessness and unemployment are all interconnected.We are firmly committed to reducing unemployment.long-term unemploymentThese decisions have had to be taken against a background of high unemployment.\nSMART Vocabulary: related words and phrases\nUnemployment\nanti-unemployment\nbe between jobs/marriages/boyfriends, girlfriends, etc. idiom\nbetween\ndisability living allowance\ndisplaced\nexecutive session\nfrictional unemployment\nidle\nidleness\njob\njob centre\njobseeker's allowance\nJSA\nNEET\npip\nprecarity\nsign\nsign on\nunemployed\nwelfare\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of employment\nSocial security & state benefits\nGrants & allowances\nAdd to word list\nAdd to word list\nsocial studies the situation of not having a job that provides money, or the number of people in this situation at any time: high/low unemployment The unemployment rate was 4 percent in October.\nAdd to word list\nAdd to word list\nECONOMICS, WORKPLACE the number or percentage of people in a country or area who do not have jobs: In the hardest hit areas, unemployment stands at around 14%. Youth unemployment among those between 16 and 19 remains high. The Office for National Statistics said the \"claimant count\" measure of unemployment dropped by 5,500 last month. an area of low/high unemployment unemployment figures/levels/statistics widespread/rising/growing unemploymentunemployment rises/soars/climbs In Arkansas, the state's unemployment rose from 4.1% in December to 4.3% in January.unemployment falls/drops/decreases Unemployment is dropping fastest in the north of the country.level/rate of unemployment Unofficial estimates put the level of unemployment in the region at around 10%.rise/increase/decline in unemployment Further increases in unemployment are expected.reduce/cut/tackle unemployment Helping people out of poverty involves ensuring they have the right skills to compete in the labour market, as well as tackling unemployment.unemployment remains low/high/steady Fed forecasts are that unemployment will remain low at about 4.75%.\na situation in which someone does not have a job: Fear of unemployment is driving homeowners to trade down as a safety measure against the chance of tough times ahead.a period/spell of unemployment Periods of unemployment are an inevitable feature of modern working life. Welfare discrimination plunges thousands of young people into a cycle of homelessness, unemployment and poverty.\nUS informal money that the government pays regularly to unemployed people who are looking for jobs: If your contract is terminated, insist that your bosses give you a letter confirming that you can claim unemployment.\nSee also\nfrictional unemployment\nhidden unemployment\nlong-term unemployment\nseasonal unemployment\nstructural unemployment"}