{"id":381506,"name":"unemployed","type":"adjective","us_sound":"ˌʌn.ɪmˈplɔɪd","us_link":"../audio/u/unemployed.mp3","uk_sound":"ˌʌn.ɪmˈplɔɪd","uk_link":"../audio/u/ukunear011.mp3","content":"Add to word list\nAdd to word list\nB1 not having a job that provides money: He's been unemployed for over a year.\nMore examplesFewer examplesBeing unemployed entitles you to free medical treatment.With Dave unemployed, we haven't got much money coming in at the moment.His financial problems escalated after he became unemployed.The gunman in Wednesday's attack has been identified as Lee Giggs, an unemployed truck driver.The government publishes figures every six months showing how many people are unemployed.\nSMART Vocabulary: related words and phrases\nUnemployment\nanti-unemployment\nbe between jobs/marriages/boyfriends, girlfriends, etc. idiom\nbetween\ndisability living allowance\ndisplaced\nexecutive session\nfrictional unemployment\nidleness\njob\njob centre\njobseeker's allowance\nJSA\nNEET\npip\nprecarity\nsign\nsign on\nunemployment\nunwaged\nwelfare\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of employment\nC1 people who do not have a job that provides money: There are now over four million unemployed in this country. Our department provides services for the unemployed.\nSMART Vocabulary: related words and phrases\nUnemployment\nanti-unemployment\nbe between jobs/marriages/boyfriends, girlfriends, etc. idiom\nbetween\ndisability living allowance\ndisplaced\nexecutive session\nfrictional unemployment\nidleness\njob\njob centre\njobseeker's allowance\nJSA\nNEET\npip\nprecarity\nsign\nsign on\nunemployment\nunwaged\nwelfare\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of employment\nAdd to word list\nAdd to word list\nnot having a job that provides money: an unemployed actor unemployed plural noun us\nYour browser doesn't support HTML5 audio\n/ˌʌn·ɪmˈplɔɪd/\nAt that time, the unemployed numbered over two million people.\nAdd to word list\nAdd to word list\nsomeone who is unemployed does not have a job: Only 2.3% of the survey sample were unemployed and seeking work. Unemployment figures include only those who are officially registered as unemployed. The portion of the jobless who had been unemployed for more than six months was 21.6% in June, not much changed from June last year.unemployed people/workers We should be focussing more efforts on labour-market issues such as getting unemployed people back to work.\npeople who do not have jobs, considered as a group: Government programs for the unemployed will place new emphasis on training, education, and relocation assistance. According to Labor Department statistics, nearly a half million people joined the ranks of the unemployed in November. See also\nthe long-term unemployed"}