{"id":381715,"name":"unequal","type":"adjective","us_sound":"ʌnˈiː.kwəl","us_link":"../audio/u/unequal.mp3","uk_sound":"ʌnˈiː.kwəl","uk_link":"../audio/u/ukunear018.mp3","content":"unequal adjective\n(NOT THE SAME)\nAdd to word list\nAdd to word list\nformal different in size, level, amount, etc.: unequal in The slices were unequal in size.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanother\nanything\ndisparity\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\nnon-comparability\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nvariant\nSee more results »\nunequal adjective\n(NOT FAIR)\nnot treating everyone the same; unfair: Until women are paid as much as men, they will be competing on unequal terms. They have an unequal relationship.\nSMART Vocabulary: related words and phrases\nUnfairness and favouring someone unfairly\nableism\nableist\nagism\nagist\nAnglocentric\ndiscrimination\ndiscriminative\ndiscriminatorily\ndiscriminatory\ndrumhead\none-sided\none-sidedly\none-sidedness\nthe old school tie\nthe old-boy network idiom\ntokenize\ntwo-tier\nunbalance\nunequally\nuneven\nSee more results »\nunequal adjective\n(NOT ABLE)\nbe unequal to something formal\nto not have the necessary ability, power, or qualities to achieve something: be unequal to the task He tried to cheer her up but found himself unequal to the task.\nSee more\nRelated word\nunequally\nunequal adjective\n(NOT THE SAME)\nAdd to word list\nAdd to word list\nnot the same: The unequal status of parent and child is recognized in law.\nunequal adjective\n(UNFAIR)\nnot treating everyone the same; unfair: In 1954, the Supreme Court declared that racial segregation in the public schools was unequal.\nAdd to word list\nAdd to word list\nnot divided or given in the same amounts to all the people or organizations in a group, so that some people or organizations have more money, resources, etc. than others: Pension provision is becoming increasingly unequal, with around a third of the workforce facing inadequate pensions. The government faces renewed pressure to tackle unequal pay.an unequal distribution of wealth/power/land Experts say the country has one of the most unequal distributions of wealth in the developing world.\nunfair in a way that is harmful or dishonest: A new study by the Law Society indicated that unequal treatment for women solicitors was still continuing. According to a recent survey, Britain is the most unequal society in western Europe.\nused to describe a situation in which a person or organization cannot succeed, for example, because the competition is too strong: an unequal contest/struggle/battle Food prices are increasingly dictated by the large supermarkets, and many farmers are giving up the unequal struggle and leaving the land.\nbe unequal to sth\nto not have the skills, money, or resources that are necessary to do or achieve something: Ultimately, the management team was unequal to the task of paying off the mountain of debt it had taken on."}