{"id":381867,"name":"uneven","type":"adjective","us_sound":"ʌnˈiː.vən","us_link":"../audio/u/uneven.mp3","uk_sound":"ʌnˈiː.vən","uk_link":"../audio/u/ukunear027.mp3","content":"uneven adjective\n(NOT EVEN)\nAdd to word list\nAdd to word list\nC2 not level, equal, flat, or continuous: Be careful on that path - the paving stones are uneven. There is an uneven distribution of wealth across the country from the north to the south. The contest was very uneven - the other team was much stronger than us.\nMore examplesFewer examplesThe patient's breathing was quick and uneven.The uneven floorboards creaked when you walked across them.His teeth were yellow and uneven.an uneven distribution of financial resourcesTheir rates of development are uneven.\nSMART Vocabulary: related words and phrases\nRough, irregular and uneven\nabrasion\nabrasive\nabrasiveness\nbumpy\ncoarsely\njagged\njaggedly\njaggy\njerky\nknobbly\npockmarked\nragged\nraggedly\nraggedness\nraggedy\nroughness\nunsteadily\nunsteady\nwonkiness\nwonky\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnfairness and favouring someone unfairly\nDifferent and difference\nuneven adjective\n(NOT GOOD)\ndifferent in quality; often used to avoid saying bad: Your work has been a little uneven this term, Matthew.\nSMART Vocabulary: related words and phrases\nQuite good, or not very good\nacceptable\nacceptably\nadequacy\nadequate\nadequately\nhalf decent\niffy\nimpure\nindifferent\nindifferently\npassably\npatchily\npatchiness\npatchy\npresentably\nscratch\nspotty\nthe/your average bear idiom\nup to scratch idiom\nweedy\nSee more results »\nRelated words\nunevenly\nunevenness\nuneven adjective\n(NOT EQUAL)\nAdd to word list\nAdd to word list\nnot even : The contest was uneven because one team was much stronger than the other.\nuneven adjective\n(NOT FLAT)\nnot even : an uneven surface\nuneven adjective\n(NOT GOOD)\nvarying in quality; not always good: It’s an uneven movie, but some of the scenes are hilariously funny.\nAdd to word list\nAdd to word list\nnot following a regular or steady pattern, or not the same in every part: The regional impact of the fall in house prices is uneven, with modest declines predicted in the south-east, while values are set to fall much more sharply in the south-west. Politicians should be trying to tackle issues of economic fairness, such as the uneven distribution of benefits in the global financial system. uneven progress/recovery/expansion\nan uneven playing field\na situation that is unfair because not everyone has the same chance of succeeding: Union officials are worried that negotiating separate deals with each site will create an uneven playing field. unevenness noun [ U ] /ʌnˈIːvənnəs/\nThe unevenness in licensing standards shows the value of having the state interpret a single set of regulations."}