{"id":382246,"name":"unfair","type":"adjective","us_sound":"ʌnˈfer","us_link":"../audio/u/unfair.mp3","uk_sound":"ʌnˈfeər","uk_link":"../audio/u/ukuneve012.mp3","content":"Add to word list\nAdd to word list\nB1 not treating people in an equal way, or not morally right: an unfair system [ + to infinitive ] It's unfair to blame Robert. Synonym\nunjust disapprovingOpposites\nfair\njust\nThesaurus: synonyms, antonyms, and examples\nunfairunfairThey objected to the state's unfair treatment of dissenters. unjustThey protested unjust laws.biasedThe newspaper gave a very biased report of the meeting.slantedThe report was slanted in favour of the developers.discriminatoryThe company has a zero-tolerance policy toward discriminatory practices.prejudicedIt is well known that the company is prejudiced against older workers and refuses to hire anyone over the age of 50.\nSee more results »\nMore examplesFewer examplesan unfair distribution of wealthShe is suing the company on grounds of unfair dismissal.It's unfair to take advantage of other people's misfortunes.The inquiry found that they had been subjected to unfair treatment.The teams change ends at half-time so that neither side has an unfair advantage.\nSMART Vocabulary: related words and phrases\nUnfairness and favouring someone unfairly\nableism\nableist\nagism\nagist\nAnglocentric\ndiscrimination\ndiscriminative\ndiscriminatorily\ndiscriminatory\ndrumhead\none-sided\none-sidedly\none-sidedness\nthe old school tie\nthe old-boy network idiom\ntokenize\ntwo-tier\nunbalance\nunequal\nunequally\nSee more results »\nRelated words\nunfairly\nunfairness\nAdd to word list\nAdd to word list\nnot fair : It seems unfair to tax you both where you work and where you live. unfairly adverb us\nYour browser doesn't support HTML5 audio\n/ʌnˈfer·li, -ˈfær-/\nThe company unfairly denied her medical benefits. unfairness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ʌnˈfer·nəs, -ˈfær-/\nAdd to word list\nAdd to word list\nnot morally right, or not treating people in an equal way: Businesses argue that the tax idea is unfair because it is based on revenue, rather than profit. We will not accept unfair treatment of individuals whether it be because of race, sex, age or religion. Critics of the bill think that new service providers will be given an unfair advantage over cable companies with existing franchise agreements. unfair competition/practices/subsidiesbe/seem unfair to do sth It is unfair to judge infrastructure services on the basis of return on investment.be/seem unfair that It seems unfair that the Scottish and Irish fishing industries should be hardest hit when other EU countries have also contributed to the over-fishing problem. grossly/really unfair unfairly adverb\nSome departments claim that they were treated unfairly in the reorganization."}