{"id":382906,"name":"unfortunate","type":"adjective","us_sound":"ʌnˈfɔːr.tʃən.ət","us_link":"../audio/u/unfortunate.mp3","uk_sound":"ʌnˈfɔː.tʃən.ət","uk_link":"../audio/u/ukunfit009.mp3","content":"unfortunate adjective\n(UNLUCKY)\nAdd to word list\nAdd to word list\nB2 unlucky or having bad effects: She has inherited her father's large nose, which is very unfortunate. [ + (that) ] It was unfortunate (that) he called at the exact moment when our guests were arriving.\nThesaurus: synonyms, antonyms, and examples\nhaving bad things happen by chanceunluckyShe is one of the unluckiest people I've ever met.unfortunateThe unfortunate souls who were lost during the voyage were commemorated once the ship reached port. haplessHe's always been a hapless, helpless bumbler. star-crossedBehold the tale of two star-crossed lovers, doomed to spend their lives apart.lucklessThe luckless council member was caught in the middle of three major ethics investigations of her colleagues.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nresulting in bad things happening by chanceunluckyAn unlucky bounce led to the winning goal against the home team.unfortunateNo one was to blame - it was just an unfortunate accident.ill-fatedSeven crew members were killed on the ill-fated voyage.ill-starredHis ill-starred reign began with a famine and ended with civil war.\nSee more results »\nMore examplesFewer examplesThere's nothing anybody can do about it, it's just unfortunate that this had to happen now.It was a very unfortunate accident/incident.It's unfortunate that his parents can't be there to see him perform.She has a very unfortunate resemblance to her rather unattractive mother.It's unfortunate that he seems to have inherited his father's poor vision.\nSMART Vocabulary: related words and phrases\nGood luck and bad luck\nalign\nbad/hard/tough luck! idiom\nbe bad luck on someone idiom\nbe down on your luck idiom\nbe in/out of luck idiom\nblessing\nfortune cookie\nfortune smiles on someone idiom\nget the short end of the stick idiom\ngodsend\ngrace\nmerciful\nmercifully\nmercy\nmiracle\nmisadventure\nstreak\nvoodoo\nwith any luck idiom\nyour luck's in! idiom\nSee more results »\nunfortunate adjective\n(NOT SUITABLE)\nformal (of remarks or behaviour) not suitable in a way that could cause embarrassment or offence: The housing director's comment that \"the homeless could do more to help themselves\" was unfortunate.\nSMART Vocabulary: related words and phrases\nUnsuitable and unacceptable\namiss\nbe in bad, poor, the worst possible, etc. taste idiom\nbeneath your dignity idiom\nbeyond\nbeyond the pale idiom\nincorrect\nincorrectly\nindecent\nineligibility\nineligible\nover-extravagant\nraffish\nraffishly\nraffishness\nroom\nunsuitably\nunsuited\nunsupportable\nunwarrantable\nunwarrantably\nSee more results »\nan unlucky person who is in a bad situation: He was one of the poor unfortunates who invested in the company and now finds himself a few thousand pounds poorer.\nSMART Vocabulary: related words and phrases\nGood luck and bad luck\nalign\nbad/hard/tough luck! idiom\nbe bad luck on someone idiom\nbe down on your luck idiom\nbe in/out of luck idiom\nblessing\nfortune cookie\nfortune smiles on someone idiom\nget the short end of the stick idiom\ngodsend\ngrace\nmerciful\nmercifully\nmercy\nmiracle\nmisadventure\nstreak\nvoodoo\nwith any luck idiom\nyour luck's in! idiom\nSee more results »\nunfortunate adjective\n(UNLUCKY)\nAdd to word list\nAdd to word list\nunlucky or having bad effects: What happened to Monica was just a freak accident – it was very unfortunate.\nunfortunate adjective\n(UNSUITABLE)\n(of remarks or behavior) unsuitable in a way that could cause offense: It was an unfortunate remark that he later regretted. unfortunately adverb us\nYour browser doesn't support HTML5 audio\n/ʌnˈfɔr·tʃə·nət·li/\nUnfortunately, by the time we got there the party was almost over."}