{"id":383068,"name":"unfrozen","type":"adjective","us_sound":"ʌnˈfroʊ.zən","us_link":"../audio/u/cdo0319usunfr1834.mp3","uk_sound":"ʌnˈfrəʊ.zən","uk_link":"../audio/u/cdo0319ukunfr1648.mp3","content":"unfrozen adjective\n(WITHOUT ICE)\nAdd to word list\nAdd to word list\nnot having been frozen, or no longer frozen: If you have fresh (unfrozen) turkeys available at your market, buy one of those. Check that your animals always have access to clean, unfrozen water.\nMore examplesFewer examplesRiders who drive fast enough and smooth enough have been known to steer their snowmobiles across an unfrozen lake in the summer.They say women now have a better chance of having a baby with eggs they froze in their 30s than with their own unfrozen eggs in their 40s.Waterlilies can be extremely hardy and spend the winter in unfrozen soil at the bottom of a pond.Lake Baikal holds a fifth of the world's unfrozen fresh water.\nSMART Vocabulary: related words and phrases\nPrecipitation: snow & ice\nanti-icing\navalanche\nbe snowed in idiom\nbe snowed up idiom\ndrifting\nfreezing\nglacially\nglacier\nhail\niceberg\nicicle\npermafrost\nsleet\nslushy\nsnow line\nsnowfall\nsnowflake generation\nsnowpack\nsnowstorm\nspindrift\nSee more results »\nunfrozen adjective\n(MONEY)\n(of money, bank accounts, etc.) available for use again after previously not being allowed or able to be used: According to records of his assets, only about £200m remains unfrozen. Her family collected $26 million from unfrozen assets.\n(of pay or prices) no longer fixed at a particular level and allowed to increase: Salaries are now unfrozen after many years of no pay increases at all.\nMore examplesFewer examplesSome US$40,000,000 of the unfrozen aid was used to replenish foreign exchange reserves, pay for oil imports and pay off arrears to international organizations.The respondent must show that such expenses cannot be met from unfrozen assets.The ex-First Lady was still prevented from accessing her newly unfrozen account.\nSMART Vocabulary: related words and phrases\nAvailable and accessible\naccessibility\naccessible\naccessibly\nat your command idiom\navailability\ndrop\nnon-restricted\nnothing\nobtainable\noffer\non call idiom\non demand idiom\non/about your person idiom\nrelease\nseason\nunfreeze\nunlock\nunobtainable\nup for grabs idiom\nvacant\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrice increases"}