{"id":383078,"name":"unfruitful","type":"adjective","us_sound":"ʌnˈfruːt.fəl","us_link":"../audio/u/cdo1121usunfr4391.mp3","uk_sound":"ʌnˈfruːt.fəl","uk_link":"../audio/u/cdo1121ukunfr4270.mp3","content":"Add to word list\nAdd to word list\nnot producing any good or valuable result: The two sides have been involved in lengthy - but so far unfruitful - negotiations. Synonyms\nfruitless\nunproductive\nThesaurus: synonyms, antonyms, and examples\nnot producing a desired resultunsuccessfulOur attempts to change the law were unsuccessful.failedThe company went bankrupt pouring money into yet another failed product.badSales have been really bad this quarter.fruitlessAll our pleas that she remain in university were fruitless - she left anyway.unfruitfulThe negotiations were unfruitful.\nSee more results »\nnot producing fruit or crops: If allowed to spread too quickly, the vine will end up with a lot of bare, unfruitful wood. In the new colony the soil was unfruitful and the settlers knew nothing of farming. Synonym\nbarren\nnot producing children: They had both agreed to adopt after two years of unfruitful marriage. Synonym\nbarren\nMore examplesFewer examplesOur appeals to the council enforcement officers have been unfruitful. The search warrant was very unfruitful because we got there too late.Although now 78 years old, he has not given up his unfruitful political struggle.The decision can be appealed, but typically such appeals are long and unfruitful endeavours. I see little benefit in expending our resources and energies in unfruitful expeditions.\nSMART Vocabulary: related words and phrases\nUseless and futile\na mug's game idiom\nadrift\naimless\naimlessly\naimlessness\nairy-fairy\nfruitless\nfruitlessly\nfruitlessness\nfutile\nfutilely\nmotiveless\nnegate\nnegation\nno good idiom\nunseriousness\nuntil you are blue in the face idiom\nunviability\nunviable\nunwieldily\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlant reproduction\nFertile or infertile land\nAnimal reproduction"}