{"id":383893,"name":"unhealthy","type":"adjective","us_sound":"ʌnˈhel.θi","us_link":"../audio/u/unhealthy.mp3","uk_sound":"ʌnˈhel.θi","uk_link":"../audio/u/ukunfit029.mp3","content":"Add to word list\nAdd to word list\nB1 not good for your health: an unhealthy diet The consequences of an unhealthy lifestyle include a higher risk of diabetes, heart diseases, stroke, and cancer. Synonyms\ninsalubrious formal\nsickly (ILL)\nunsanitaryOpposites\nhealthful US\nhealthy (HEALTH)\nsalubrious formal\nsanitary\n(of a person, animal, or part of the body) not strong or well: I had smoked for over 20 years and was very unhealthy.\nnot good for someone or not acceptable because it does not seem normal: Parents should be aware if young people develop an unhealthy interest in death and begin to appear depressed. There are healthy and unhealthy ways to express angry feelings.\nMore examplesFewer examplesWe worked very hard under unhealthy and harsh conditions and without any support from outside.Too many people are forced to eat cheap, unhealthy food.They had eating habits that should have made them obese or unhealthy but somehow did not.Your gums are fine, your tongue's fine, but your tonsils look very unhealthy.Police said the man had an unhealthy obsession with weapons such as knives and bayonets.They aren't on the same wavelength and this disconnect is unhealthy for their relationship.\nSMART Vocabulary: related words and phrases\nNot fit & healthy\nbe a shadow/shell of your former self idiom\nbe at death's door idiom\nbed\nclinically obese\ncomplain of something\ncritical list\nfrailty\ngaunt\nhollow\nhollow-eyed\ninfirm\nrough\nsick\nsickly\ntake to your bed idiom\nundernourishment\nunhealthily\nunthrifty\nunwholesomeness\nwan\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStrange, suspicious and unnatural\nRelated word\nunhealthily\nunhealthy adjective\n(ILL)\nAdd to word list\nAdd to word list\nill or appearing to be ill\nunhealthy adjective\n(HARMFUL)\nharmful to your health: It’s unhealthy to eat fatty foods all the time."}