{"id":384427,"name":"uniform","type":"noun","us_sound":"ˈjuː.nə.fɔːrm","us_link":"../audio/u/uniform.mp3","uk_sound":"ˈjuː.nɪ.fɔːm","uk_link":"../audio/u/ukunhea012.mp3","content":"Add to word list\nAdd to word list\nA2 a particular set of clothes that has to be worn by the members of the same organization or group of people: military/school uniform a nurse's uniform I love a man in uniform! Compare\nmufti (CLOTHES)\n[ C ] a type of clothes that is connected with a particular group of people: Photographs show him wearing the T-shirt and ripped jeans that were the student's uniform of the time.\nMore examplesFewer examplesHe was pictured as a soldier in full uniform.She recalled the humiliation of exchanging her clothes for the prison uniform.I never wear grey because it reminds me of my school uniform.He thinks that wearing school uniform depersonalizes children.I feel so drab in this grey uniform.\nSMART Vocabulary: related words and phrases\nClothing - general words\nall-in-one\nanti-fur\napparel\nargyle\narticle of clothing\ncast-offs\nfinery\nfitter\nfloordrobe\nfurrier\ngarb\ngarment\nget up\nmothball\nschmutter\nsensible\nseparates\nshapewear\nshorty\nyour best bib and tucker idiom\nSee more results »\nRelated word\nuniformed\nthe same; not changing or different in any way: The office walls and furniture are a uniform grey. Small businesses are demanding that they receive uniform treatment from the banks.\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\nadjacent\naffinity\nakin\nalike\nallied\nballpark\nditto\nequivalent\nequivalently\nevenly\nevery inch idiom\nnon-distinctive\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\nrespecter\nsnap\nsynonymous\nSee more results »\nRelated words\nuniformity\nuniformly\nuniform noun [C/U]\n(CLOTHES)\nAdd to word list\nAdd to word list\na special set of clothes worn by people belonging to an organization to show others that they are members of it: [ U ] soldiers in uniform uniformed adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈju·nəˌfɔrmd/\nOnly uniformed personnel are permitted to enter this building.\nuniform adjective\n(SAME)\nthe same; not varying or different in any way: The laws for adopting a child are not uniform among the states.\nphysics Uniform means not changing in speed or power; constant. uniformity noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌju·nəˈfɔr·mɪ·t̬i/uniformly adverb us\nYour browser doesn't support HTML5 audio\n/ˈju·nəˌfɔrm·li/\nCritics were uniformly enthusiastic.\nAdd to word list\nAdd to word list\nnot changing or different in any way: Making the rules more uniform should reduce the number of cases taken before district law courts. A proposed new framework has been widely praised for providing a uniform approach to the problem of waste disposal. Trying to impose a uniform system in all the countries affected has proved very problematic. uniform policies/procedures/standards uniformly adverb\nuniformly imposed taxes"}