{"id":384490,"name":"unilateralist","type":"noun","us_sound":"ˌjuː.nəˈlæt̬.ɚ.əl.ɪst","us_link":"../audio/u/usunhea009.mp3","uk_sound":"ˌjuː.nɪˈlæt.ər.əl.ɪst","uk_link":"../audio/u/ukunhea019.mp3","content":"Add to word list\nAdd to word list\na person who believes in acting independently, without involving another group or country: They are both, in different ways, outspoken unilateralists. See\nunilateral\na person who believes in getting rid of your country's nuclear weapons without first waiting for other countries to do the same: He is a left-winger and apparently still a committed unilateralist.\nMore examplesFewer examplesWe're accused of not consulting, of being unilateralists.He's a unilateralist; he thinks he knows all the answers. Unilateralists don't ask opinions of world leaders. the recent defeat of the unilateralists on nuclear disarmament\nSMART Vocabulary: related words and phrases\nPolitics - general words\nanti-capitalism\nanti-capitalist\nanti-communism\nanti-communist\nanti-fascism\ninterparty\ninterpellate\ninterpellation\ninterventionist\nlab\non message\nOrwellian\noverstep\nparliament\nparty politics\nstatesman\nstatesmanlike\nstateswoman\nsubsidiarity\nsuper-conservative\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBombs & missiles\nof or relating to unilateralism (= the process or fact of deciding a policy or action without involving another group or country): There's a return to a more unilateralist worldview. He has aggressively criticized the president for his unilateralist approach to the world. See\nunilateral\nMore examplesFewer examplesThe foreign policy became outspokenly unilateralist.The US was more unilateralist in its approach than Europe.We are working closely with our allies so we are not perceived as unilateralist cowboys.\nSMART Vocabulary: related words and phrases\nPolitics - general words\nanti-capitalism\nanti-capitalist\nanti-communism\nanti-communist\nanti-fascism\ninterparty\ninterpellate\ninterpellation\ninterventionist\nlab\non message\nOrwellian\noverstep\nparliament\nparty politics\nstatesman\nstatesmanlike\nstateswoman\nsubsidiarity\nsuper-conservative\nSee more results »"}