{"id":384981,"name":"uninsured","type":"adjective","us_sound":"ˌʌn.ɪnˈʃʊrd","us_link":"../audio/u/usb01927.mp3","uk_sound":"ˌʌn.ɪnˈʃɔːd","uk_link":"../audio/u/ukb01927.mp3","content":"Add to word list\nAdd to word list\nnot having or not protected by insurance (= an agreement in which you pay a company money and they pay your costs if you become ill or have an accident or injury, or if something is damaged): The plan has provided health insurance for many Americans who were previously uninsured. In court, he admitted driving an uninsured, untaxed car. uninsured drivers Related word\ninsure\nMore examplesFewer examplesMany of the 1.6 million children under 18 in the state are currently uninsured, he said.We spoke to Maria, an undocumented, uninsured immigrant who declined to give her last name.The court ruled that damages for uninsured claims should be consistent with those for insured claims.\nSMART Vocabulary: related words and phrases\nInsurance\nactuarial\nactuary\nassessor\nbroking\nclaim\ncomprehensive\ncopay\nguarantee\nindemnify\nlife assurance\nloss adjuster\nmature\nnon-network\nnoncoverage\nObamacare\npi\npolicy\nprotect\nthird-party insurance\nunderwrite\nSee more results »\nthe uninsured\npeople who do not have insurance, especially those who do not have health insurance: Among people aged 51 to 61, the uninsured are much more likely to suffer declining health, over a four-year period, than the insured.\nMore examplesFewer examplesUnless there is a better system for the uninsured to get care, nothing is going to change.He said that private hospitals would transfer all of the uninsured to the two hospitals that receive federal funds.Most of the uninsured are in working families.After the recent flooding it is not clear if the uninsured will be compensated.\nSMART Vocabulary: related words and phrases\nInsurance\nactuarial\nactuary\nassessor\nbroking\nclaim\ncomprehensive\ncopay\nguarantee\nindemnify\nlife assurance\nloss adjuster\nmature\nnon-network\nnoncoverage\nObamacare\npi\npolicy\nprotect\nthird-party insurance\nunderwrite\nSee more results »\nAdd to word list\nAdd to word list\nnot having any insurance to pay for medical expenses or for damage or injury while driving a car: The plan would provide health insurance for most Americans who now are uninsured. uninsured motorists\nAdd to word list\nAdd to word list\nnot having or not covered by insurance: The organization provides help to uninsured families who have to pay large medical expenses. an uninsured driver The property was uninsured."}