{"id":385195,"name":"union","type":"noun","us_sound":"ˈjuː.njən","us_link":"../audio/u/union.mp3","uk_sound":"ˈjuː.njən","uk_link":"../audio/u/ukunins008.mp3","content":"union noun\n(JOINING)\nAdd to word list\nAdd to word list\nB2 [ S or U ] the act or the state of being joined together: Meanwhile the debate on European political and monetary union continues.formal She believes that the union (= marriage) of man and woman in holy matrimony is for ever. the Union\n[ S ] (in the American Civil War) the states that did not separate from the United States\nMore examplesFewer examplesThe signing of the treaty marked a major milestone on the road to European union.The two countries are holding a summit to discuss economic and monetary union.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconverge\nconvergence\ncor\ncross-Channel\ncumulate\njointed\njunction\nkludge\nknit\nknock\nunified\nunify\nunseparated\nwad\nweave\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternational relations: United States politics & government\nunion noun\n(WORKERS)\nB1 [ C, + sing/pl verb ] a\ntrade union UK : the electricians' union\nMore examplesFewer examplesManagement are having discussions with the union about possible redundancies.The car workers' union is demanding a 7% pay rise this year.Her debating skills were honed in the students' union.The union decided to ballot its members on the issue .The union safeguards the interests of all its members.\nSMART Vocabulary: related words and phrases\nIndustrial relations\nanti-union\narbitrate\narbitration\narbitrator\nbargaining power\nclosed shop\ncollective bargaining\nfree collective bargaining\nguild\nindustrial relations\ninter-union\nlabor union\nlabour relations\nmulti-union\nshop steward\nstudent union\ntrade union\ntrade unionism\ntrade unionist\nunionize\nSee more results »\nunion noun [C/U]\n(THINGS JOINED)\nAdd to word list\nAdd to word list\nthe act or the state of being joined together\nThe union of two people refers to marriage.\nunion noun [C/U]\n(POLITICAL UNIT)\nsocial studies a political unit made up of two or more separate units such as states the Union US history\nIn the American Civil War, the Union refers to the states that did not separate from the United States.\nunion noun [C/U]\n(ORGANIZATION)\n[ C ]\n&#160; social studies a labor union\nAdd to word list\nAdd to word list\n[ C ]\n&#160; HR, WORKPLACE\n&#160; ( UK also trade union); ( US also labor union) an organization that represents the people who work in a particular industry, protects their rights and may agree pay, working conditions, etc. with their employers: \"No date has yet been set for a strike, the union said in a statement to the press this morning. The unions are on strike over wage concerns. The political activity of each affiliated union is highly regulated by statute. a union spokesman/delegate/negotiator public-sector/public-employee/state-worker unions civil-service/white-collar/blue-collar unionsjoin/belong to a union The new generation of workers is less likely to join a union.\n[ C ] a group of two or more countries that work together or that have the same government: the European Union\n[ S or U ] the act of joining two or more things together, or the state of being joined together: Both bosses had a financial interest in making the merger work, as the success of the union of their two companies showed. economic/political/monetary union\nSee also\ncompany union\ncraft union\ncredit union\ncustoms union\nenterprise union\nEuropean Monetary Union\nthe European Union\ngeneral union\nhorizontal union\nlabor union\nView all\nnon-union\ntrade union"}