{"id":385206,"name":"unionism","type":"noun","us_sound":"ˈjuː.njə.nɪ.zəm","us_link":"../audio/u/cdo0123usunio2578.mp3","uk_sound":"ˈjuː.njə.nɪ.zəm","uk_link":"../audio/u/cdo0123ukunio2916.mp3","content":"unionism noun [U]\n(POLITICS)\nAdd to word list\nAdd to word list\n(also Unionism) support for the policy that the countries of the UK should remain united, especially that Northern Ireland should remain part of the United Kingdom of Great Britain and Northern Ireland: He saw himself as the unrivalled defender of unionism. the progressive wing of Ulster Unionism This was a period that marked the decline of Scottish unionism and a rise in Scottish nationalism.\n(also Unionism) at the time of the American Civil War, support for the Union (= the states that did not separate from the United States): See the documents listed below for examples of antislavery unionism in the border states. He came from East Tennessee, that bastion of Unionism from the days of Andrew Johnson.\n(also Unionism) the general political principle that a country or state should remain united with others in a larger union: She was one of the leading figures of Catalan unionism. Spanish unionism opposed independence for the Basque and Catalan regions.\nMore examplesFewer examplesIrish nationalism’s premise is that the link to Britain is not permanent, whereas unionism contends that it will endure.\nSMART Vocabulary: related words and phrases\nPolitical movements & groups\nalt-right\nANC\nanti-Bolshevik\nanti-Bolshevism\nanti-capitalism\nbig tent\nblack bloc\nBlairite\nBlue Dog\nleft-winger\nleftism\nleftist\nleftward\nlefty\nsectarian\nsectarianism\nsegregationist\nSinn Fein\nthe awkward gang idiom\nthe SDLP\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternational relations: United States politics & government\nunionism noun [U]\n(WORK)\nthe beliefs, policies, and practices of trade unions (= workers' organizations that represent the people who work in a particular industry): The city, whose economy depended on tourism rather than manufacturing and mining, was never a hotbed of unionism. Synonym\ntrade unionism\nMore examplesFewer examplesIn the 1930s, radical unionism was exemplified by the Industrial Workers of the World.They note that a major feature of the new unionism is cooperation between \"blue-collar\" unions and \"green\" environmentalists.\nSMART Vocabulary: related words and phrases\nIndustrial relations\nanti-union\narbitrate\narbitration\narbitrator\nbargaining power\nclosed shop\ncollective bargaining\nfree collective bargaining\nguild\nindustrial relations\ninter-union\nlabor union\nlabour relations\nmulti-union\nshop steward\nstudent union\ntrade union\ntrade unionism\ntrade unionist\nunionize\nSee more results »"}