{"id":385249,"name":"unipolar","type":"adjective","us_sound":"ˈjuː.nɪˌpoʊ.lɚ","us_link":"../audio/u/cdo1121usunip4395.mp3","uk_sound":"ˈjuː.nɪˌpəʊ.lər","uk_link":"../audio/u/cdo1121ukunip4274.mp3","content":"unipolar adjective\n(MENTAL HEALTH)\nAdd to word list\nAdd to word list\nmedical relating to or experiencing periods of either depression or mania but not both: Unipolar depression can involve anxiety and other symptoms - but no manic episodes.\nMore examplesFewer examplesNo difference in treatment response was seen between patients with unipolar vs bipolar depression.If the predominant feature is a depressed mood, it is called unipolar depression.The chance of a bipolar individual's marrying someone with either unipolar or bipolar illness is not unsubstantial.\nSMART Vocabulary: related words and phrases\nMental illnesses\nad\nadjustment disorder\nage-associated memory impairment\nanhedonia\nanorexia nervosa\nanorexic\nattention deficit hyperactivity disorder\ngeneralized anxiety disorder\nhealth anxiety\nhoard\nhoarder\nhoarding\nhysterical\nobsessive-compulsive disorder\npsychosis\nsad\nscarred\nself-alienation\nsenility\nsociopathic\nSee more results »\nunipolar adjective\n(POWER)\npolitics in which only one country or area has power: He argued against a \"unipolar\" world in which the United States is the only superpower.\nMore examplesFewer examplesHe stated that they would reap a whirlwind if they pushed the United States into a unilateralist position in which they are the centre of a unipolar world.Even Europeans who do not share the Gaullist horror of a \"unipolar\" world think differently nowadays about the alliance with America.\"The United States thought we could do things alone, but the unipolar moment is over and the administration has learned that we need allies,\" he says.\nSMART Vocabulary: related words and phrases\nInternational relations: international politics & government\naccession\nallied\nAnglo-American\nanti-Stalinist\nbipolar\nconfederacy\nG20\nG7\nGATT\nGeneva Convention\ninternationalism\ninternationalize\nNATO\noccupied\npariah\nthe G8\nthe new world order\nthe North-South divide\nthe World Trade Organization\nWTO\nSee more results »\nunipolar adjective\n(CELL)\nanatomy, biology of a nerve cell, having only one structure projecting (= sticking out) from it: Unipolar neurons have only a single extension from the cell body.\nMore examplesFewer examplesUnipolar neurons have only one structure extending from the soma; bipolar neurons have one axon and one dendrite extending from the soma.Unipolar neurons are typically sensory neurons with receptors located within the skin, joints, muscles, and internal organs.Neurons are divided into four major types: unipolar, bipolar, multipolar, and pseudounipolar.\nSMART Vocabulary: related words and phrases\nCells\nanaphase\nanti-platelet\nassort\nbiotech\nbipolar\ncovalent bond\ndiploid\neukaryotic\nextracellular\nflagellum\ngap junction\ngermline\nhaemoglobin\nmeiosis\nmulticellular\nnucleate\nnucleated\npluripotent\nprokaryote\nprokaryotic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe brain & nervous system\nunipolar adjective\n(ONE POLE)\nphysics relating to only one pole (= one of two ends where the force is strongest) of a magnet (= an object that attracts and pushes away iron and steel): The system contains both bipolar and unipolar technologies in one device. Compare\nbipolar\nMore examplesFewer examplesThere are wide zones of the Sun where the magnetic field is unipolar and opens towards the interplanetary space. MOSFETs are unipolar devices characterized by extremely high input resistance.\nSMART Vocabulary: related words and phrases\nPhysics: energy, force & power\nanimal magnetism\nanti-gravity\natmospheric pressure\nattract\nattraction\nballistic\nerg\nexcited\nfrictional\nfrictionless\nfundamental force\ngeothermal\ninertia\nradiant energy\nself-propulsion\nsine curve\nsinusoid\nsolarize\nthe sound barrier\nthermodynamics\nSee more results »"}