{"id":385348,"name":"unitarian","type":"noun","us_sound":"ˌjuː.nɪˈter.i.ən","us_link":"../audio/u/usunhea026.mp3","uk_sound":"ˌjuː.nɪˈteə.ri.ən","uk_link":"../audio/u/ukunins017.mp3","content":"Add to word list\nAdd to word list\na member of a Christian Church that does not believe in the Trinity (= the existence of one God in three forms, the Father, the Son, and the Holy Spirit): Unitarians and Methodists rejected the Anglican doctrine. The conference was a great opportunity to get together with other Unitarians.\nMore examplesFewer examplesHolt comes from five generations of Unitarians.Jefferson thought most Americans would become rationalist Unitarians within a generation or two.His detractors labelled Lindsey and his followers Unitarians because the Trinity was nowhere to be found in the Christian religion they distilled from the Bible.\nSMART Vocabulary: related words and phrases\nChristian denominations\nAnglican\nAnglo-Catholic\nbyzantine\nC of E\nCalvinism\nCoptic\ndenominational\ndenominationally\necclesiastical\necumenical\nLatinization\nLatinize\nLatinized\nLow Church\nLutheran\nPentecostalism\nPentecostalist\nPresbyterian\nProddie\nProtestantism\nSee more results »\nbelonging or relating to a Christian Church that does not believe in the Trinity (= the existence of one God in three forms, the Father, the Son, and the Holy Spirit ): a Unitarian church/minister She came from a strict Unitarian home.\nMore examplesFewer examplesThe meeting took place in Des Moines's First Unitarian Church.Their progressive Unitarian beliefs kept them from being fully assimilated within their genteel London circle.Swanwick was a Manchester merchant from a Unitarian family.\nSMART Vocabulary: related words and phrases\nChristian denominations\nAnglican\nAnglo-Catholic\nbyzantine\nC of E\nCalvinism\nCoptic\ndenominational\ndenominationally\necclesiastical\necumenical\nLatinization\nLatinize\nLatinized\nLow Church\nLutheran\nPentecostalism\nPentecostalist\nPresbyterian\nProddie\nProtestantism\nSee more results »"}