{"id":385341,"name":"unit","type":"noun","us_sound":"ˈjuː.nɪt","us_link":"../audio/u/unit.mp3","uk_sound":"ˈjuː.nɪt","uk_link":"../audio/u/ukunins016.mp3","content":"unit noun\n(SEPARATE PART)\nAdd to word list\nAdd to word list\nB1 [ C ] a single thing or a separate part of something larger: Each unit of the text book focuses on a different grammar point. The first year of the course is divided into four units. The company plans to split into two or three units.\n[ C ] a piece of furniture or equipment that is intended to be fitted as a part of a set of similar or matching pieces: kitchen/shelf/sink units\n[ C ] a small machine or part of a machine that has a particular purpose: the central processing unit of a computer a waste-disposal unit\n[ C ]\n&#160; business\n&#160; specialized a single complete product of the type that a business sells\n[ C ] US a single apartment in a bigger building: The old house has been divided up into three rental units. a public housing unit\n[ S ] UK informal a person or thing that is very large and impressive: I'm delighted he's playing. He's definitely a unit. Look at the size of that cow! It's an absolute unit. A new phone that promises 50 days of battery life with just one charge has been hailed as an “absolute unit” by tech fans.\nMore examplesFewer examplesThe company announced plans to increase production to 10 000 units per month.The coursework is divided into three units, and you are expected to complete Unit 1 this term.I'd love to replace my old kitchen units - can you tell me the price of this particular drawer unit?It would be better if products like crisps showed how much salt they contain per unit, not per 100 g.If one carton contains 12 units, then you'd better order 10 cartons.\nSMART Vocabulary: related words and phrases\nWords meaning parts of things\nback end\nbifurcation\nbiomarker\nbranch\ncartridge\nchunk\nelement\nmodularity\nmodularized\nmodularly\nmodule\nmoiety\nmulti-branched\npanel\npiece\nsnatch\nsub-sector\nsubscale\nsubscience\nsubsection\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFurniture & fittings - general words\nMachines - general words\nMachines - parts\nNumbers: single, double & multiple\nProducts & producers\nHouses & homes\nEnormous\nShowing respect and admiration\nunit noun\n(PEOPLE)\nC1 [ C, + sing/pl verb ] a group of people living or working together, especially for a particular purpose: the traditional family unit Both soldiers spent two weeks in training before being allowed to rejoin their unit (= the particular part of the army to which they belonged). Dr Nussbaum is director of the Civil Liberties Research Unit at King's College, London.\nMore examplesFewer examplesa light/heavy infantry unitThe march will be heavily policed by an anti-riot unit.In most countries, the family unit is still the cornerstone of society.\nSMART Vocabulary: related words and phrases\nGroups of people\nalliance\nan\nanti-gang\nassemblage\nbaby boomer\nfirst people\nflashmob\nflock\nfocus group\nfoursome\nline (someone) up\nmafia\nmob\nposse\npublic\nquaternity\nrabble\nretinue\nscratch\nsyndicate\nSee more results »\nunit noun\n(MEASUREMENT)\n[ C ] a standard measure that is used to express amounts: A centimetre is a unit of length. The standard unit of currency in the US is the dollar.\n[ C ] UK a standard measure of alcohol: Experts say that women should not drink more than 14 units of alcohol a week.\nSMART Vocabulary: related words and phrases\nMeasurements in general\naltitude\nbathymetric\nbathymetrically\nbathymetry\nbe running at something idiom\ncalibrate\ndrop\nelevation\nfactor\nknee-length\nmetric\nmetrication\nmicro\nmilli-\nscale\nsetting\ntera-\nuncalibrated\nunmeasurable\nunsized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSpirits & distilling\nMeasuring & weighing\nunit noun\n(HOSPITAL DEPARTMENT)\n[ C ] a department in a hospital for the treatment of people with similar illnesses or conditions: She's in the burns/paediatric/psychiatric unit.\nSMART Vocabulary: related words and phrases\nMedical places & organizations\nA &amp; E\naccident and emergency\naid station\nbiotech\nbirth centre\nblood bank\nclinic\nconsulting room\ndispensary\ninstitutional\nmadhouse\nmaternity ward\nNICU\nNIH\nnon-hospital\nout of hours idiom\noutpatients\nPICU\nsocialized medicine\nward\nSee more results »\nunit noun\n(SINGLE NUMBER)\n[ C ] any whole number less than ten: Tens go in the left-hand column and units in the right.\n[ C ]\n&#160; mathematics\n&#160; specialized the number 1\nSMART Vocabulary: related words and phrases\nNumbers generally\nbinary number\nC, c\ncardinal\ncontextual variable\ncontinuous variable\ncontrol variable\ncrore\nD, d\ndigit\nlakh\nlog\nmode\nnos.\nnumber\nordinate\noutcome variable\nplace value\nprimality\nquantitatively\nwhole number\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNumbers: cardinal, including nought & zero\nunit noun [C]\n(SEPARATE PART)\nAdd to word list\nAdd to word list\na single item or a separate part of something larger: The first year of the course is divided into four units. This apartment building has 60 units (= separate apartments).\nA unit is also a small machine or part of a machine that has a particular purpose: the central processing unit of a computer\nA unit is also a piece of furniture or equipment used as part of a set of similar or matching pieces: a unit of a bookcase\nunit noun [C]\n(PEOPLE)\na group of people living or working together, esp. for a particular purpose: a military unit He’s the surgeon in charge of the burn unit at the hospital.\nunit noun [C]\n(MEASUREMENT)\na standard measure used to express amounts: An inch is a unit of length. The dollar is the standard unit of currency in the US.\nAdd to word list\nAdd to word list\na single thing or separate part of something larger: The training course is divided into five units, and takes place over five days.\nWORKPLACE a particular type of business or department within a larger organization: Shares in the pharmaceutical company shot up to 2575p after the sale of its chemicals unit. Cellphone companies are still on the rise, but most of them are units of the traditional telcos. a business/operating unit\nFINANCE a single share or bond in a unit trust or mutual fund: Your investment purchases units that are linked to the Performance Fund.\nPROPERTY an individual building or house: industrial/office units a housing/residential unit\na piece of machinery or equipment designed to be used for a particular purpose: an air-conditioning unit kitchen/shelving/wall-mounted units\nPRODUCTION a single product considered as part of the total number of products that a company manufactures or sells: Last year the company cut domestic production to 3.1 million units.\nMEASURES a measurement that is used as a standard to express amounts: Women are advised not to consume more than 14 units of alcohol a week. a unit of energy/measurement See also\naccumulation unit\nbargaining unit\ncentral processing unit\ndecision-making unit\nmonetary unit\nmultiunit\nstock-keeping unit\nstorage unit\nstrategic business unit"}