{"id":385356,"name":"unite","type":"verb","us_sound":"juːˈnaɪt","us_link":"../audio/u/unite.mp3","uk_sound":"juːˈnaɪt","uk_link":"../audio/u/ukunins019.mp3","content":"Add to word list\nAdd to word list\nC1 to join together as a group, or to make people join together as a group; to combine: If the opposition groups unite, they may will command over 55 percent of the vote. If ever a dance company could unite the differing worlds of rock and ballet, the Joffrey Ballet is it. See also\nreunite\nMore examplesFewer examplesEast and West Germany united under article 23 of the Bonn constitution.The two countries have united against their common enemy.Conservation groups have united in protest against the planned new road.The opposition parties are uniting in an attempt to overthrow the government.The prime minister's supporters united behind their party leader.\nSMART Vocabulary: related words and phrases\nActing, being or existing together\naccompanying\nallied\nalong\nalongside\namong\ncooperative\ncooperatively\ndistributively\ndouble act\nen bloc\njointly\nmisery\nmisery loves company idiom\nnon-compatible\nnon-conflicting\ntogether\ntow\ntwin\ntwo-way\nunison\nSee more results »\nAdd to word list\nAdd to word list\nto bring different groups or things together to become one, or to join together to become one: [ I ] The thirteen American colonies united to form a new nation. united adjective us\nYour browser doesn't support HTML5 audio\n/jʊˈnɑɪ·t̬ɪd/\nAdd to word list\nAdd to word list\n[ I or T ] to join together with other people or groups, or to make this happen: Governments are calling on national business communities to unite in the current crisis. The proposed deal would unite the stock markets of Paris, Brussels, Amsterdam, and Lisbon with Wall Street.unite to do sth San Francisco's mayor and the Board of Supervisors united to back the redevelopment effort.unite against sth/sb Transport firms united against rivals in order to block access to international operators.unite behind sb/sth Lawmakers on Tuesday appeared to unite behind a bill for voluntary human vaccination programs.be united by sth The U.S. is the largest single market in the world and is united by common laws, a common language, and a common currency.\n[ T ] to combine two things: unite sth and sth Marketing is an organizational function which unites both consumer need and company innovation.\nbe united in sth\nif a group of people are united in something, they all agree or all work together to achieve something: Economists worldwide are united in the view that the fragile nature of the economic recovery will keep rate rises at bay for months to come."}