{"id":385407,"name":"universal","type":"adjective","us_sound":"ˌjuː.nəˈvɝː.səl","us_link":"../audio/u/universal.mp3","uk_sound":"ˌjuː.nɪˈvɜː.səl","uk_link":"../audio/u/ukunins022.mp3","content":"Add to word list\nAdd to word list\nB2 existing everywhere or involving everyone: a universal truth Food, like sex, is a subject of almost universal interest. The new reforms have not met with universal approval within the party.\nMore examplesFewer examplesOver the years her work has compelled universal admiration and trust.The shooting of the policeman has received universal condemnation.One reason for the author's success is that her novels have a universal appeal.Love and relationships will always be a topic of universal interest.Music is often thought of as a universal language.\nSMART Vocabulary: related words and phrases\nSomewhere, anywhere, nowhere, or everywhere\nacross\nall over\nanyplace\nanywhere\nat every turn idiom\ncoast\nevery\nfrom top to bottom idiom\nfrom top to toe idiom\nhunt/search high and low idiom\nlength\nnon-universal\nround\nsomeplace\nsomewhere\nthe length and breadth of somewhere idiom\nthroughout\nturn\nubiquitous\nubiquitously\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSomeone, anyone, no one or everyone\nRelated words\nuniversality\nuniversally\nAdd to word list\nAdd to word list\nexisting everywhere or involving everyone: Congress rejected the proposal for universal health insurance. universally adverb us\nYour browser doesn't support HTML5 audio\n/ˌju·nəˈvɜr·sə·li/\nWater is one of the most common and universally known substances, but researchers are still learning more about it.\nAdd to word list\nAdd to word list\nexisting everywhere or involving everyone: universal access/service/standards The wireless infrastructure provides universal access to the internet for all residents. universal agreement/appeal/approval All of the candidates agreed on the need for some form of universal health care."}