{"id":385432,"name":"universe","type":"noun","us_sound":"ˈjuː.nə.vɝːs","us_link":"../audio/u/universe.mp3","uk_sound":"ˈjuː.nɪ.vɜːs","uk_link":"../audio/u/ukunins025.mp3","content":"Add to word list\nAdd to word list\nB1 [ S ] everything that exists, especially all physical matter, including all the stars, planets, galaxies, etc. in space: Is there intelligent life elsewhere in the universe?\n[ C ] a universe that could be imagined to exist outside our own: Scientists have speculated about the possibility of parallel universes.\n[ S ] the world, or the world that you are familiar with: The characters in his novels inhabit a bleak and hopeless universe. His family is his whole universe (= everything that is important to him).\nMore examplesFewer examplesWe have advanced greatly in our knowledge of the universe.This book finally explodes some of the myths about the origin of the universe.The universe is theoretically infinite.There are several schools of thought about how the universe began.Throughout history, people have been intrigued by the question of whether there is intelligent life elsewhere in the universe.\nSMART Vocabulary: related words and phrases\nThe Earth & outer space - general words\nablate\nanti-gravity\natmosphere\natmospherically\nauroral\ncosmic\ngravity\nhorizon\nhydrosphere\nionospheric\nlithosphere\nlithospheric\nmacrocosm\nmesosphere\nmesospheric\nMother Nature\nthe Big Bang\nunconformity\nweightlessness\nzero gravity\nSee more results »\nAdd to word list\nAdd to word list\neverything that exists, esp. all physical matter, including all the stars and planets in space\nAdd to word list\nAdd to word list\nMARKETING a collection of people, things, or companies that have similar characteristics or features: We rank a broad universe of stocks using both value characteristics and growth characteristics. Salesmen seeking business leads pay extra for the service to be able to contact a broader universe of people.\na particular activity, or the people and companies involved in a particular activity: the business/corporate/online universe The online universe is brimming with dozens of virtual worlds vying to build sustainable life. They chose a fund with a global rather than a limited investment universe. The company claimed 7,500 accounts nationwide - a small but not insignificant piece of a universe of 750,000 U.S. food-service operators."}