{"id":385663,"name":"unknown","type":"adjective","us_sound":"ʌnˈnoʊn","us_link":"../audio/u/unknown.mp3","uk_sound":"ʌnˈnəʊn","uk_link":"../audio/u/ukunjus008.mp3","content":"Add to word list\nAdd to word list\nB1 not known or familiar: The exact number of people carrying the virus is unknown. As recently as six months ago her name was almost unknown in this country. Unknown to me, she'd organized a party for my birthday.\nMore examplesFewer examplesAn unknown terrorist group has claimed responsibility for this morning's bomb attack.A generation ago, home computers were virtually unknown.The article is of unknown authorship .The director took a calculated risk in giving the film's main role to an unknown actor.The very concept of free speech is unknown to them.\nSMART Vocabulary: related words and phrases\nUnknown and unfamiliar\nalien\nalienly\nalienness\nanti-foreign\nanti-foreigner\nmurky/uncharted waters idiom\nnot be in someone's vocabulary idiom\nobscure\nobscurely\nobscurity\nshadowy\nTBD\nterra incognita\nthe outside world idiom\nuncharted\nunchartered\nuncommon\nunsung\nuntried\nunused\nSee more results »\nC1 [ S ] what is not familiar or known: Racism is in some ways just a fear of the unknown.\n[ C ] a person, especially a performer or sports player, who is not famous: For her latest film she deliberately chose a cast of unknowns.\n[ C ] mainly US something that cannot be guessed at or calculated because so little is known about it: It's the big unknowns that make insurance companies uneasy.\nSMART Vocabulary: related words and phrases\nUnknown and unfamiliar\nalien\nalienly\nalienness\nanti-foreign\nanti-foreigner\nmurky/uncharted waters idiom\nnot be in someone's vocabulary idiom\nobscure\nobscurely\nobscurity\nshadowy\nTBD\nterra incognita\nthe outside world idiom\nuncharted\nunchartered\nuncommon\nunsung\nuntried\nunused\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople of little importance\nAdd to word list\nAdd to word list\nnot known, or not known to many people: His whereabouts are still unknown.\na person who is not known to many people: A year ago she was a virtual unknown on the figure-skating scene."}