{"id":385842,"name":"unless","type":"conjunction","us_sound":"ənˈles","us_link":"../audio/u/unless.mp3","uk_sound":"ənˈles","uk_link":"../audio/u/ukunjus015.mp3","content":"Add to word list\nAdd to word list\nB1 except if: You can't get a job unless you have experience (= you can only get a job if you have experience). Unless you call me to say you're not coming, I'll see you at the theatre (= I will see you there if you do not call to say you are not coming).\nMore examplesFewer examplesThey threatened to kill him unless he did as they asked.Most wild animals won't attack unless they are provoked.I can't let you in unless you give the password.Students are not allowed to handle these chemicals unless they are under the supervision of a teacher.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a condition\nassuming (that)\nat\nat the risk of doing something idiom\nby\nceteris paribus\neven\ngranted\nif\nlest\nlong\nprovided (that)\nrisk\nsuppose\nwhether\nGrammar\nShould you (Should with inversion)In formal situations, we can use should + subject (s) + verb (v) instead of if: …\nHad you (Had with inversion)In formal situations, we can use had + subject + verb instead of if in third conditional sentences: …\nIf + were toIn formal situations, we can use if + were to when we talk about things that might happen but which we think are unlikely: …\nAs long as, so long as, providing, etc.Sometimes we need to impose specific conditions or set limits on a situation. In these cases, conditional clauses can begin with phrases such as as long as, so long as, only if, on condition that, providing (that), provided (that). …\nOr and otherwiseWe often use or and otherwise with conditional meanings: …\nSupposingSupposing may be used with a conditional meaning. It can be used in first, second or third conditional sentences. The speaker invites the listener to imagine a situation: …\nConditionals: other expressions (unless, should, as long as)Conditional clauses can begin with unless. Unless means something similar to ‘if … not’ or ‘except if’. …\nUnlessConditional clauses can begin with unless. Unless means something similar to ‘if … not’ or ‘except if’. …\nUnlessWe use the conjunction unless to mean ‘except if’. The clause which follows unless is a subordinate clause (sc): it needs a main clause (mc) to make a complete sentence. …\nAdd to word list\nAdd to word list\nused to say what will or will not happen if something else does not happen or is not true; except if: She won’t go unless you go (= If you do not go, she will not go either, but if you go, she will go). You can’t get a job unless you’ve got the experience (= You can only get a job if you have experience)."}