{"id":385947,"name":"unlined","type":"adjective","us_sound":"ˌʌnˈlaɪnd","us_link":"../audio/u/cdo0622usunli2011.mp3","uk_sound":"ˌʌnˈlaɪnd","uk_link":"../audio/u/cdo0622ukunli2145.mp3","content":"unlined adjective\n(PAPER)\nAdd to word list\nAdd to word list\n(of paper) not having any lines printed across it: I couldn't find any unlined paper to use for my drawing. Start by taking a large sheet of unlined paper and folding it in half. Opposite\nlined\nMore examplesFewer examplesI prefer to use an unlined notebook, as I like to make sketches and diagrams as well as taking notes.She bought a journal with unlined paper in it.Handwriting analysis is best done on writing on unlined paper.\nSMART Vocabulary: related words and phrases\nPublishing: paper & stationery\nA3\nA5\nacid-free\nassembler\nbackspace\nballpoint pen\nchalk\nfoolscap\nfountain pen\ngift wrap\ngrammage\nhanging chad\nnotepad\npropelling pencil\npulp\nquill\nquire\nqwerty\nream\nslate\nSee more results »\nunlined adjective\n(SKIN)\n(of the skin on the face) not having any lines because of age: She had an elegant, luminous, unlined face. Despite being over 60, his face was almost completely unlined. Opposite\nlined\nMore examplesFewer examplesLooking at the smooth, unlined faces of the young soldiers going off to war made me feel very sad. She reacted calmly but I could see the ghost of a furrowed brow on her unlined face.Research has shown that if you protect your skin from birth, it is possible to have relatively unlined skin even at the age of 80.\nSMART Vocabulary: related words and phrases\nThe skin, & skin colour\n-skinned\nalbino\nanti-wrinkle\nashy\nbloodless\nblush\ncolouring\ncraggily\ncraggy\ncrimson\ncutaneous\nmole\npallor\npore\nsanguine\nskin tone\nsubcutanea\nsunbath\nsunbathe\nsunbed\nSee more results »\nunlined adjective\n(COVERING)\nthat does not have a lining (= a material or substance that covers the inside surface): The jacket was unlined and not suitable for cold weather. Polluted groundwater occurs because of toxic materials that are placed in unlined landfill sites. Opposite\nlined\nMore examplesFewer examplesDon't make the mistake of trying to create a pond in an unlined hole.The soft, unlined fabrics (wool, cashmere, felt) made for some gorgeous garments.\nSMART Vocabulary: related words and phrases\nCoverings and layers\na blanket of something idiom\nbeeswax wrap\nblanket\nbrazen\ncasing\ndiaphragm\ninterstratification\ninterstratify\nlagging\nlayer\nlayered\nseam\nsheath\nstrata\nstratum\nsubstratum\nsuperstratum\ntar paper\nuncover\nvein\nSee more results »"}