{"id":386011,"name":"unload","type":"verb","us_sound":"ʌnˈloʊd","us_link":"../audio/u/unload.mp3","uk_sound":"ʌnˈləʊd","uk_link":"../audio/u/ukunjus020.mp3","content":"unload verb\n(REMOVE)\nAdd to word list\nAdd to word list\nC1 [ I or T ] to remove the contents of something, especially a load of goods from a vehicle, the bullets from a gun or the film from a camera: We watched a ship unloading (sacks of flour).\nSMART Vocabulary: related words and phrases\nEmptying\nclear\ndrain\nempty\nevacuate\nevacuation\ngut\nhollow\nhollow something out\nland\nlet\nlet someone/something out\nturn\nturn out\nunbox\nunpack\nvacate\nYou can also find related words, phrases, and synonyms in the topics:\nRemoving and extracting\nunload verb\n(TELL)\n[ I or T ] informal to tell someone about your problems, the things that worry you, etc.: I've been unloading my worries on poor Ann here.\n[ I ] US informal to express strong emotions such as anger freely to another person: I was so stressed out, I just needed to unload.\nSMART Vocabulary: related words and phrases\nRevealing secrets & becoming known\nanti-secrecy\nbackchannel\nbare\nbare your heart/soul idiom\nblow someone's cover idiom\nblow/take the lid off something idiom\nbreak\ndeclassify\nhold\nhuddle\nkiss\nrat\nrat on someone/something\nreintroduce\nrevealingly\nrevelatory\nstate's evidence\ntip\ntranspire\nunravel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExpressing and showing feelings\nAdd to word list\nAdd to word list\nto remove the contents of something such as goods from a vehicle, the bullets from a gun, or the film from a camera: [ T ] She unloaded her grocery bags from the back of the minivan.\ninfml If you unload something that you no longer want, you get rid of it: [ T ] Monaghan has said he is ready to unload his pizza business and retire to Florida.\nAdd to word list\nAdd to word list\n[ I or T ]\n&#160; TRANSPORT to remove goods from a vehicle or ship: Trucking companies are trying to cut the time drivers spend waiting in line to load or unload. The port will spend $300 million to build a new container terminal, where ships load and unload cargo.\n[ T ]\n&#160; FINANCE to get rid of or sell something, because it has gone down in value, is illegal, or is of poor quality: The bank asked them to unload $1 billion of Treasury bonds. With markets slipping, insurers have been unloading shares to maintain the cushion between their assets and liabilities."}