{"id":386127,"name":"unlucky","type":"adjective","us_sound":"ʌnˈlʌk.i","us_link":"../audio/u/unlucky.mp3","uk_sound":"ʌnˈlʌk.i","uk_link":"../audio/u/ukunjus024.mp3","content":"Add to word list\nAdd to word list\nB1 not lucky: The couple were unlucky enough to be in the hotel when the terrorist group struck. Synonyms\nill-fated\nill-starred literary\nluckless literary\nunfortunate (UNLUCKY)Opposites\nfortunate approving\nlucky\nThesaurus: synonyms, antonyms, and examples\nhaving bad things happen by chanceunluckyShe is one of the unluckiest people I've ever met.unfortunateThe unfortunate souls who were lost during the voyage were commemorated once the ship reached port. haplessHe's always been a hapless, helpless bumbler. star-crossedBehold the tale of two star-crossed lovers, doomed to spend their lives apart.lucklessThe luckless council member was caught in the middle of three major ethics investigations of her colleagues.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nresulting in bad things happening by chanceunluckyAn unlucky bounce led to the winning goal against the home team.unfortunateNo one was to blame - it was just an unfortunate accident.ill-fatedSeven crew members were killed on the ill-fated voyage.ill-starredHis ill-starred reign began with a famine and ended with civil war.\nSee more results »\nMore examplesFewer examplesI don't believe in the old superstition that the number 13 is unlucky.We had a lovely time in Scotland, but we were a bit unlucky with the weather.We got a parking ticket but Pat and Keith didn't, we were just unlucky.They were unlucky enough to be at the top of the mountain when the storm came over.Henman played well and he was unlucky to lose the match.\nSMART Vocabulary: related words and phrases\nGood luck and bad luck\nalign\nbad/hard/tough luck! idiom\nbe bad luck on someone idiom\nbe down on your luck idiom\nbe in/out of luck idiom\nblessing\nfortune cookie\nfortune smiles on someone idiom\nget the short end of the stick idiom\ngodsend\ngrace\nmerciful\nmercifully\nmercy\nmiracle\nmisadventure\nstreak\nvoodoo\nwith any luck idiom\nyour luck's in! idiom\nSee more results »\nRelated word\nunluckily\nAdd to word list\nAdd to word list\nhaving or bringing bad luck: For the unlucky people who get the flu, the health department advises: Stay home!"}