{"id":386858,"name":"unmoor","type":"verb","us_sound":"ʌnˈmʊr","us_link":"../audio/u/cdo0319usunmo1844.mp3","uk_sound":"ʌnˈmɔːr","uk_link":"../audio/u/cdo0319ukunmo1657.mp3","content":"unmoor verb\n(UNTIE BOAT)\nAdd to word list\nAdd to word list\n[ I or T ] to unfasten a boat from something connecting it to land or to the bottom of the sea, a lake, a river, etc.: He had attempted to steal a 45ft yacht, without first unmooring it. On the 23d of October I unmoored and made ready for sea.\nMore examplesFewer examplesA boatman is responsible for mooring and unmooring vessels.Laughing, he unmoored the Orlouge and cast off.His servant negligently, carelessly and wrongfully unmoored the sloop.\nSMART Vocabulary: related words and phrases\nFastening and tying\nanchor\nbale\nbe locked together idiom\nbelay\nboard something up\nbolt\nbound\nbowline\nhalf hitch\nharness\nhobble\nhogtie\nknotted\nstake\nstrap someone in\nstrap something up\nstrop\ntack\ntape something up\ntether\nSee more results »\nunmoor verb\n(SEPARATE)\n[ T ] to become less involved with, connected with or influenced by something, or to make someone or something do this: J. K. Rowling has succeeded in unmooring the boarding school story from wealth, class and snobbery. The institution needs to grow, even if that means unmooring itself from its founder's educational ideals. See also\nunmoored\nMore examplesFewer examplesHe embraced an activism that unmoored his party from its libertarian preference for small government.Change does not mean that we must dump our friends, shift our tested relationships or unmoor our entire identities. A linguistic mistake can be telling because it unmoors us from the subject about which we're trying to write.Every now and then something comes along which is so bonkers and so unhinged that it unmoors itself from all cultural anchoring points.\nSMART Vocabulary: related words and phrases\nCutting off and disconnecting\namputate\namputation\namputee\nBrexit\ncastration\nchop\nchop something off\ncrop\ncut back\ndisconnect\ndisconnected\ndisconnection\ndismember\ndismemberment\ndock\nlop something off\nnonconnection\npost-amputation\nsaw something off\nsever\nSee more results »"}