{"id":388622,"name":"unpredictable","type":"adjective","us_sound":"ˌʌn.prɪˈdɪk.tə.bəl","us_link":"../audio/u/unpredictable.mp3","uk_sound":"ˌʌn.prɪˈdɪk.tə.bəl","uk_link":"../audio/u/ukunpre003.mp3","content":"Add to word list\nAdd to word list\nB2 likely to change suddenly and without reason and therefore not able to be predicted (= expected before it happens) or depended on: The weather there can be unpredictable - one minute it's blue skies and the next minute it's pouring rain. The hours in this job are very unpredictable - you sometimes have to work late at very short notice.\nMore examplesFewer examplesShe's very unpredictable so there's no knowing how she'll react to the news.Unfortunately the outcome of this kind of treatment can be rather unpredictable.He's fun to be with but can be a bit unpredictable at times, you never know what kind of mood he's going to be in.I really enjoy having a holiday in the UK, if only the weather weren't so unpredictable.The finishing time is a bit unpredictable, it depends how things go.\nSMART Vocabulary: related words and phrases\nChanging frequently\ncapricious\ncapriciously\ncapriciousness\nchangeable\nchangeful\ninconsistency\ninconsistent\ninconsistently\ninconstant\ninconstantly\ninflammable\npatchiness\npatchy\nping-pong\nprotean\nraggedly\nvariability\nvolatility\nyo-yoing\nzigzag\nSee more results »\nRelated words\nunpredictability\nunpredictably\nAdd to word list\nAdd to word list\ntending to change suddenly and without reason or warning, and therefore not able to be depended on: unpredictable weather The world is pretty unpredictable. unpredictability noun [ U ] us/ˌʌn·prɪˌdɪk·təˈbɪl·ət̬·i/\nAdd to word list\nAdd to word list\nif something is unpredictable, it is likely to change suddenly and unexpectedly, so cannot be planned for: To protect it from the unpredictable nature of software sales, the company has adopted a new business model.unpredictable effects/events/factors Unpredictable events can have a huge impact on bond values. It is a very unpredictable market. The turmoil on Wall Street is emblematic of how the credit mess is spreading in unpredictable ways. an unpredictable outcome/result Compare\npredictable unpredictability noun [ U ]\nStocks carry more risks than bonds because of the unpredictability of corporate profits. unpredictably adverb\nWhen share prices go up and down unpredictably, investors tend to sit on their hands."}