{"id":388853,"name":"unprofessional","type":"adjective","us_sound":"ˌʌn.prəˈfeʃ.ən.əl","us_link":"../audio/u/unprofessional.mp3","uk_sound":"ˌʌn.prəˈfeʃ.ən.əl","uk_link":"../audio/u/ukunpre009.mp3","content":"Add to word list\nAdd to word list\nC1 not showing the standard of behaviour or skill that is expected of a person in a skilled job: Doctor Rivers was charged with unprofessional conduct and improper use of dangerous drugs. Compare\nimproper (WRONG) formal\ninappropriate\nirregular adjective (RULE) formal\nunacceptable\nunbecoming\nunsuitableOpposite\nprofessional\nMore examplesFewer examplesShe was doing her best to help, but her manner was a bit unprofessional.I know she felt annoyed, but that angry outburst was totally unprofessional.It's a bit unprofessional to talk about other members of staff like that.I hope she didn't think I was being unprofessional.It's very unprofessional to let your private life spill over into your working life.\nSMART Vocabulary: related words and phrases\nTypes of employment\nadmin\nadministrative\nadministrative assistant\nadministratively\nat the coalface idiom\njobbing\njobless\njoblessness\njobseeker\nlabour-intensive\nqualified\nrecertify\nredundancy\nredundant\nretcon\nwhite-collar\nwho's who idiom\nwilderness years idiom\nwork experience\nwork placement\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBad and wrong behaviour\nRelated word\nunprofessionally\nAdd to word list\nAdd to word list\nnot showing the standard of behavior or skills that are expected of a person in a skilled job: Dressing like that was very unprofessional of him.\nAdd to word list\nAdd to word list\nnot showing the standard of behaviour or work that is expected of a person doing their job: unprofessional behaviour/conduct Two employees have been suspended after allegations of unprofessional behaviour. The tribunal upheld her complaint that he had treated her in an unprofessional manner. Compare\nnon-professional\nprofessional adjective"}