{"id":388817,"name":"unprocessed","type":"adjective","us_sound":"ˌʌnˈprɑː.sest","us_link":"../audio/u/cdo0318usunpr5352.mp3","uk_sound":"ˌʌnˈprəʊ.sest","uk_link":"../audio/u/cdo0317unpruk4332.mp3","content":"unprocessed adjective\n(FOOD/NATURAL PRODUCTS)\nAdd to word list\nAdd to word list\nnot having had any sort of chemical or industrial treatment in order to preserve it, or improve its taste or appearance: There are ways to eat healthy, unprocessed food on a budget. Alien species often arrive in unprocessed wood. Opposite\nprocessed\nMore examplesFewer examplesEat a healthy diet. Unprocessed foods, such as fresh fruits and vegetables, are the best foods you can eat.Eat high-fibre cereal or add unprocessed bran to your regular breakfast cereal.Humans can contract anthrax by coming in close contact with B. anthracis spores from infected animal products, such as unprocessed hides and bones.Haiti has begun importing unprocessed wood directly from Delaware because extreme deforestation has eliminated 95 percent of its trees.\nSMART Vocabulary: related words and phrases\nNatural and artificial\nanti-natural\nartificial\nartificiality\nartificially\nbiodynamic\ndollishly\nfake\nfalse\nfreshness\nGod-given\nnon-natural\nnon-toxic\norganically\npure\nrawness\nunaffectedly\nunbleached\nunnatural\nunnaturally\nuntamed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nVarious qualities of food\nunprocessed adjective\n(NOT DEALT WITH)\n(of documents) not having been dealt with in an official way: They made efforts to deal with the backlog of unprocessed applications. There is a mounting pile of unprocessed claims for unemployment benefits.\n(of information) not having had a series of operations performed on it by computer: All unprocessed data is stored locally. In order to create useful information, data (unprocessed facts and figures) must be collected and organized in some meaningful pattern.\n(of difficult or sad feelings) not thought about so that they can be accepted: Unprocessed grief can affect your daily life for many years. It used to be believed that depression, anger and unprocessed emotions are what cause cancer.\nSMART Vocabulary: related words and phrases\nDealing with things or people\naddressable\napproach\nattend to someone/something\nbe all over it idiom\nbeard the lion (in his/her den) idiom\nbed\ncut\ngrip\nhave it out with someone idiom\nhold\nhold on idiom\nI/I've got this idiom\nill-prepared\nsquare\ntend to someone/something\nto get a handle on something idiom\nto have a handle on something idiom\ntough\ntough something out\nweather\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer concepts\nNot showing or feeling emotions"}