{"id":389500,"name":"unrecognized","type":"adjective","us_sound":"ʌnˈrek.əɡ.naɪzd","us_link":"../audio/u/cdo0623usunre4350.mp3","uk_sound":"ʌnˈrek.əɡ.naɪzd","uk_link":"../audio/u/cdo0623ukunre4382.mp3","content":"unrecognized adjective\n(NOT KNOWN)\nAdd to word list\nAdd to word list\nIf something is unrecognized, people do know what it is, especially because they have not seen, heard, or experienced it before: The illness often goes unrecognised and untreated.\nIf someone is unrecognized, people do not realize who they are even though they may have seen them before: She sat unrecognised in the crowded cafeteria.\nMore examplesFewer examplesBecause the symptoms are so varied, the disorder may go unrecognized for weeks or even months. These studies have also uncovered previously unrecognized cases of ulcerative colitis. He passes through the airport virtually unrecognized.\nSMART Vocabulary: related words and phrases\nUnknown and unfamiliar\nalien\nalienly\nalienness\nanti-foreign\nanti-foreigner\nmurky/uncharted waters idiom\nnot be in someone's vocabulary idiom\nobscure\nobscurely\nobscurity\nshadowy\nTBD\nterra incognita\nthe outside world idiom\nuncharted\nunchartered\nuncommon\nunsung\nuntried\nunused\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnaware\nunrecognized adjective\n(NOT ACCEPTED)\nnot generally accepted as legal, true, or important, and if someone's achievements are unrecognized, they are not shown official approval: It is a minority political party that is unrecognised by the authorities.go unrecognized Their work goes largely unrecognized.\n(of someone's achievements) not shown official approval: His contributions as a political reformer still remain largely unrecognised.\nMore examplesFewer examplesHe believes older generations offer valuable time and insights that are often unrecognized by society. During the Civil War, women played an important, but mostly unrecognized, role.\nSMART Vocabulary: related words and phrases\nTreating as unimportant\nblow\nblow something/someone off\nbrush\nbrush someone/something aside\nchopped liver\ndamn\ndenigrate\ndenigration\nlaugh\nlaugh something off\nleave something at the door idiom\nlook down on someone\nminoritize\nnever\nshrug\nshrug away\nshrug something off\nskate\nskate over/around something\nsniff at something\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNeglecting and ignoring"}