{"id":389410,"name":"unrealized","type":"adjective","us_sound":"ʌnˈriː.ə.laɪzd","us_link":"../audio/u/cdo0623usunre4346.mp3","uk_sound":"ʌnˈrɪə.laɪzd","uk_link":"../audio/u/cdo0623ukunre4378.mp3","content":"unrealized adjective\n(NOT HAPPENED)\nAdd to word list\nAdd to word list\nIf a plan or a hope is unrealized, it has not been achieved or has not happened: Her promises for sweeping reforms remain unrealized. He left dozens of plans for unrealised projects.\nMore examplesFewer examplesI see a lot of players with unrealized potential. But all her fears were mercifully unrealized. It makes you think how many dreams are going to go unrealized.\nSMART Vocabulary: related words and phrases\nFailing and doing badly\nabjectly\nat-risk\nbackbencher\nballs (something) up\nbe on your beam ends idiom\nblow (someone/something) up\nbomb\negg\nflog\nflog a dead horse idiom\nflop\nflub\nflunk out\nfounder\nrot\nrunning on empty idiom\nsclerotic\nscrew\nsmoke\nthe rot sets in idiom\nSee more results »\nunrealized adjective\n(MONEY)\nfinance &amp; economics\n&#160; specialized An unrealized profit or loss exists when you own something that will create a future profit or loss when you sell it: unrealized gains The bank is sitting on unrealized gains on its holdings worth billions. unrealized losses The company also has roughly 100 billion yen of unrealised losses from falling property prices.\nMore examplesFewer examplesAs a result, the company recorded an unrealized foreign exchange loss of £3.1 million. Such a loss may be wholly or partially offset by unrealized appreciation in the market value of the underlying security.They had relied on unrealised gains from their stock holdings for a large portion of their capital.\nSMART Vocabulary: related words and phrases\nInterest & capital\nannualized\nAPR\nbank rate\ncapital intensive\nconcessional\nfinance\ninterest\ninterest rate\ninterest-bearing\nlending rate\nnest egg\nnon-derivative\nPremium Bond\nreserve\nsimple interest\nsinking fund\nstock\nthe purse strings idiom\nvested interest\nworking capital\nSee more results »\nAdd to word list\nAdd to word list\nnot yet done or achieved: unrealized ambition/goal/project The group's big unrealized ambition is to offer a single trading system for American and European derivatives. The company has considerable but thus far unrealised potential.\nFINANCE used to describe an amount of profit or loss from an investment, where the investment has not been sold so that, in the case of a profit, there is no real gain, because it has not been turned into cash, and in the case of a loss, it is not a real loss: unrealized depreciation/lossunrealized appreciation/gain/profit When an investment increases or decreases in value but we do not sell it, we record an unrealized gain or loss."}