{"id":389561,"name":"unredeemed","type":"adjective","us_sound":"ˌʌn.rɪˈdiːmd","us_link":"../audio/u/cdo0623usunre4356.mp3","uk_sound":"ˌʌn.rɪˈdiːmd","uk_link":"../audio/u/cdo0623ukunre4388.mp3","content":"unredeemed adjective\n(MONEY)\nAdd to word list\nAdd to word list\nIf something representing a particular amount of money is unredeemed, it has not been exchanged for that amount of money or for goods to that value: Most unredeemed gift cards are simply misplaced or go unused by recipients.\nformal An unredeemed debt has not been paid back: The unredeemed debt puts massive pressure on banks' balance sheets.\nMore examplesFewer examplesFifty-eight percent of those with unredeemed cards said they didn't have enough time to use them.After six months, unredeemed items worth less than £75 become the property of the pawnbroker.That's a lot of money sitting on the government's books as unredeemed debt.\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\nmake up for something\nname\nnovate\npart exchange\npinch-hit\nrefresh\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitutable\nsubstitution\nsubstitutive\nsucceed\nsuccession\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBorrowing & lending\nunredeemed adjective\n(NOT IMPROVED)\nformal If someone or something is unredeemed, they have not done anything to improve or for people to forgive them for something bad: The character is a wholly unredeemed villain, and the primary antagonist of the story.\nMore examplesFewer examplesMost of the time I was an unredeemed failure.The tedium is unredeemed by anything attentive or dramatic in the writing.\nSMART Vocabulary: related words and phrases\nMorally wrong and evil\nabhorrent\nabhorrently\namoral\namorality\nanomie\ndissipated\ndissolute\ndissolutely\ndissoluteness\nenormity\nnefariousness\nno good idiom\nno more Mr Nice Guy idiom\nnon-ethical\nobscene\ntrespass\nturpitude\nunconscionable\nunconscionably\nunethical\nSee more results »\nAdd to word list\nAdd to word list\nFINANCE used to describe something that has been given as security on a loan, and which the lender keeps because the borrower has not paid back the loan: Unredeemed articles become the property of the pawnbroker at the end of the period and may be sold in order to repay the loan.\nnot exchanged for money or goods: Retailers gain a huge amount of revenue through unredeemed gift cards."}