{"id":390604,"name":"unsanctioned","type":"adjective","us_sound":"ʌnˈsæŋk.ʃənd","us_link":"../audio/u/cdo0623usunsa4407.mp3","uk_sound":"ʌnˈsæŋk.ʃənd","uk_link":"../audio/u/cdo0623ukunsa4438.mp3","content":"unsanctioned adjective\n(NOT APPROVED)\nAdd to word list\nAdd to word list\nnot officially allowed or approved: Police detained several opposition leaders after an unsanctioned rally in the capital. These players have taken part in an unsanctioned competition. Related word\nsanction verb\nMore examplesFewer examplesThe authorities employed riot police to break up the group's unsanctioned marches. The government arrested scores of activists, signalling that it would no longer tolerate unsanctioned protest.They called on supporters to hold an unsanctioned meeting.Concerns about unsanctioned military action were reinforced.He was accused of lying about making an unsanctioned trip.Although the match was unsanctioned, a banner proclaimed it to be the world championship.\nSMART Vocabulary: related words and phrases\nForbidding and banning things\nabolish\nabolition\nabolitionist\nanti-censorship\nban\ndebar\ndecertification\ndecertify\ndisallow\ndisqualification\nnon-valid\noff-limits\nout of bounds idiom\noutlaw\nprohibit\ntravel ban\nunapproved\nunauthorized\nunkosher\nverboten\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLegal & illegal\nunsanctioned adjective\n(NOT PUNISHED)\nnot given a punishment, especially an official punishment: go unsanctioned This does not mean that hate speech goes unsanctioned. Drug use in sport can go unrecognized and unsanctioned over a long period. Related word\nsanction noun (ORDER)\nMore examplesFewer examplesThis behaviour should not be allowed to go unsanctioned.He argues that when deviant behaviour remains unsanctioned, social norms are weakened.\nSMART Vocabulary: related words and phrases\nNot punishing & reducing punishment\nabsolve\namnesty\nclemency\ncommutation\ndiplomatic immunity\ndischarge\ndiversion\nget away with murder idiom\nget off\nget off lightly phrase\nhook\nimpunity\nlet someone off\noff the hook idiom\nprivilege\nreprieve\nroyal pardon\nscot-free\nspare\nunpunished\nSee more results »"}