{"id":391143,"name":"unsettle","type":"verb","us_sound":"ʌnˈset̬.əl","us_link":"../audio/u/eus74752.mp3","uk_sound":"ʌnˈset.əl","uk_link":"../audio/u/ukunsci017.mp3","content":"unsettle verb [T]\n(WORRY)\nAdd to word list\nAdd to word list\nto make someone feel anxious or slightly worried : Even the most experienced batsmen were unsettled by the speed of this bowler.\nMore examplesFewer examplesThese efforts unsettled nationalists in all camps. The spread of the disease has unsettled the country.Many people have complained they are unsettled by automated calls.Here are a set of changes that have made Britain richer but which have deeply unsettled many people.\nSMART Vocabulary: related words and phrases\nUpsetting and destabilizing\nbring\nbring someone down\ndelegitimize\ndestabilization\ndestabilize\ndisruptive\ndisruptively\ndiversionist\nknock/throw someone for a loop idiom\nloop\nmake waves idiom\nskid\nstir\nturn\nundermine\nunsettling\nunspool\nunspooling\nupset\nwave\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing anxiety and worry\nunsettle verb [T]\n(CHANGE)\nto make something change, in a way that makes it more difficult to know what will happen: The legislation doesn't appear to have unsettled daily life in Santa Fe. The airline's decision to cut air fares is likely to unsettle the market.\nMore examplesFewer examplesThis so unsettles the view of America that it's doubly effective. The crisis has unsettled financial markets and brought dire predictions of revolution or civil war from some politicians.Mr Bernanke highlighted the importance of inflation expectations and said sustained high headline inflation - pushed up by energy prices - could unsettle those expectations.And this week's primaries may further unsettle the race.\nSMART Vocabulary: related words and phrases\nUpsetting and destabilizing\nbring\nbring someone down\ndelegitimize\ndestabilization\ndestabilize\ndisruptive\ndisruptively\ndiversionist\nknock/throw someone for a loop idiom\nloop\nmake waves idiom\nskid\nstir\nturn\nundermine\nunsettling\nunspool\nunspooling\nupset\nwave\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChange and changes\nSee\nunsettling"}