{"id":391535,"name":"unsinkable","type":"adjective","us_sound":"ʌnˈsɪŋ.kə.bəl","us_link":"../audio/u/cdo0318usunsi5367.mp3","uk_sound":"ʌnˈsɪŋ.kə.bəl","uk_link":"../audio/u/cdo0318ukunsi1508.mp3","content":"unsinkable adjective\n(SHIP)\nAdd to word list\nAdd to word list\nIf a ship or a boat is unsinkable, it cannot be sunk: An iceberg sank the \"Titanic\" - a ship they claimed was unsinkable.\nMore examplesFewer examplesMore than 1,500 lives were lost in the accident, which occurred when the supposedly unsinkable ship hit an iceberg. Proclaimed to be unsinkable, the battleship was destroyed after the Reconnaissance Unit spotted her at sea.the role of USS Great Britain as Nato's unsinkable aircraft carrierThey hoped to gain some 'secret' military information about the fleet, such as how it was possible to sink a supposedly unsinkable ship.\nSMART Vocabulary: related words and phrases\nStaying afloat, capsizing & sinking\nbail out\nbuoy\nbuoyancy\nbuoyantly\ncapsize\nducking\nfloatation\nflotation\nground\nkeel\nkeel over\nkickboard\noutrigger\nrefloat\nresurface\nride\nright\nrun\nsunken\nwaterlogged\nSee more results »\nunsinkable adjective\n(PERSON)\nfull of energy and enthusiasm, and not able to be defeated or to fail: She was staying with her grandmother, the unsinkable Olga.\nMore examplesFewer examplesIt is a powerful coming-of-age tale in which tragedy is trumped by an unsinkable faith in human nature.Among the fine crop of guest stars are Denis Lawson, Reece Dinsdale and the unsinkable Sylvia Sims. the unsinkable Dolly Parton, who has a big brain under that big yellow wigIt has become clear that she follows in the great British tradition of unsinkable good-time girls best exemplified by Lily Savage\nSMART Vocabulary: related words and phrases\nEnergetic and lively\nalive\nastir\nbarnstorming\nbe alive and well/kicking idiom\nbe as fresh as a daisy idiom\nbe full of beans idiom\nboisterous\ncrackling\nfreshness\nfriskily\nfrisky\nfrolicsome\nfury\nrambunctiously\nre-energize\nrefreshed\nrefreshingly\nrejuvenate\nzestily\nzesty\nSee more results »"}