{"id":391990,"name":"unspecialized","type":"adjective","us_sound":"ʌnˈspeʃ.ə.laɪzd","us_link":"../audio/u/cdo0623usunsp4468.mp3","uk_sound":"ʌnˈspeʃ.ə.laɪzd","uk_link":"../audio/u/cdo0623ukunsp4499.mp3","content":"unspecialized adjective\n(BIOLOGY)\nAdd to word list\nAdd to word list\nbiology\n&#160; specialized not having developed particular characteristics: Stem cells are immature, unspecialized cells that can be manipulated to grow into any number of specialized cells. Many rainforest plants have retained relatively unspecialized pollination mechanisms.\nMore examplesFewer examplesThe predominance of similar unspecialized flowers has been partly attributed to the scarcity of larger pollinating insects.People often dismiss lizards as relatively simple and unspecialized creatures.Primates are endlessly adaptable - they have four unspecialised and dexterous limbs, and comparatively unspecialised digestive systems.\nSMART Vocabulary: related words and phrases\nGeneral\nabstract\nabstraction\nabstractly\nacross-the-board\nall-purpose\nbroad\nby and large idiom\nchiefly\nessence\ngeneral\ngeneralist\ngenerally\nnon-personal\non the whole idiom\noverall\nportmanteau\nprimarily\nsense\nstuff\nwhole\nSee more results »\nunspecialized adjective\n(NOT EXPERT)\nnot being an expert in one particular area of work or knowledge: Most of the workers are relatively unspecialized labourers.\nnot relating to or involving one particular subject, skill, service, etc.: These publications are unspecialized. The firm needed workers who would be ready to undertake any kind of unspecialized work. Compare\ngeneralist\nMore examplesFewer examplesHe joined the company as an unspecialized executive trainee.They accounted for over 50% of the unspecialized work force.Unspecialised judges are asked to make decisions about complex issues for which neither their personal nor their professional lives have prepared them.\nSMART Vocabulary: related words and phrases\nGeneral\nabstract\nabstraction\nabstractly\nacross-the-board\nall-purpose\nbroad\nby and large idiom\nchiefly\nessence\ngeneral\ngeneralist\ngenerally\nnon-personal\non the whole idiom\noverall\nportmanteau\nprimarily\nsense\nstuff\nwhole\nSee more results »"}