{"id":392608,"name":"unsuccessful","type":"adjective","us_sound":"ˌʌn.səkˈses.fəl","us_link":"../audio/u/unsuccessful.mp3","uk_sound":"ˌʌn.səkˈses.fəl","uk_link":"../audio/u/ukunspe011.mp3","content":"Add to word list\nAdd to word list\nB2 not achieving the hoped for result; not successful: They made several unsuccessful attempts to reach the men. His application was unsuccessful. Synonyms\nabortive formal\nfailedOpposite\nsuccessful\nThesaurus: synonyms, antonyms, and examples\nnot achieving wealth, popularity, or successunsuccessfulHe tried for years to get his work published before accepting he was a commercially unsuccessful writer.failedShe was a failed singer.frustratedHe was a legendary actor, but a frustrated director.strugglingThe struggling actor was cut from yet another film.on the ropesAfter that scandal, the MP is really on the ropes.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nnot producing a desired resultunsuccessfulOur attempts to change the law were unsuccessful.failedThe company went bankrupt pouring money into yet another failed product.badSales have been really bad this quarter.fruitlessAll our pleas that she remain in university were fruitless - she left anyway.unfruitfulThe negotiations were unfruitful.\nSee more results »\nMore examplesFewer examplesHer bid for re-election was unsuccessful.Attempts to trace the whereabouts of a man seen leaving the scene of the crime have so far been unsuccessful.Our firm stands to lose a lot of money if the deal is unsuccessful.We are sorry to inform you that your application has been unsuccessful.We have been unsuccessful in finding a replacement.\nSMART Vocabulary: related words and phrases\nUnsuccessful (people and things)\nabortive\nabortively\nachiever\nbe dead in the water idiom\nbootless\nflatline\nfruitlessness\nfrustrated\nfutile\nfutilely\ngo/get/head nowhere idiom\non the ropes idiom\nredemption\nrope\nsmall-time\nsmall-timer\nstillborn\nvainly\nwashed up\nyou and whose army? idiom\nSee more results »\nRelated word\nunsuccessfully\nAdd to word list\nAdd to word list\nnot ending in success, or not achieving success: After writing three unsuccessful plays, Miller finally had a hit. unsuccessfully adverb us\nYour browser doesn't support HTML5 audio\n/ˌʌn·səkˈses·fə·li/\nHoward’s been unsuccessfully looking for an affordable apartment."}