{"id":392993,"name":"untarnished","type":"adjective","us_sound":"ʌnˈtɑːr.nɪʃd","us_link":"../audio/u/cdo0318usunta5375.mp3","uk_sound":"ʌnˈtɑː.nɪʃd","uk_link":"../audio/u/cdo0318ukunta1510.mp3","content":"untarnished adjective\n(REPUTATION)\nAdd to word list\nAdd to word list\nIf someone has an untarnished reputation, etc., it has not been spoiled or damaged, and people's opinion of the person continues to be good: From the very beginning, she has been an aloof, mysterious figure, untarnished by scandal. Synonyms\nfaultless approving\nflawless\nimmaculate approving\nimpeccable\nperfect (WITHOUT FAULT)\nunblemished\nMore examplesFewer examplesShe has many critics in Britain, but her image in America is almost untarnished. It appears he has an untarnished record: there are no disciplinary actions by any hospital, federal agency or state medical board.Under the principal's guiding hand, the reputation of the school was untarnished.He denied that his own untarnished playing reputation at the club could suffer as a result of Glasgow's murky football rivalry.\nSMART Vocabulary: related words and phrases\nUnspoilt\nclear\npure\npurity\nunadulterated\nunalloyed\nunblemished\nunmarred\nunscarred\nunsoiled\nunstained\nunsullied\nuntainted\nvirgin\nvirginal\nvirginally\nuntarnished adjective\n(METAL)\nIf metal is untarnished, it has not lost its shine: The urn was encased in untarnished gold.\nMore examplesFewer examplesObservation of untarnished gold could account for the poet’s choice of this metal for the divine armour.Clean the jewellery according to these instructions and you’ll find shiny, untarnished silver underneath.\nSMART Vocabulary: related words and phrases\nClean & tidy\n(as) clean as a (new) pin idiom\napple pie\naseptic\nbe in apple-pie order idiom\ncleanliness\nclipped\nneatness\nnon-clogging\nnon-polluting\nordered\norderliness\norderly\nsprucely\nsqueaky-clean\nstainless\nsterile\nsuper-clean\ntidily\nvirginally\nwell kept\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChemistry: metals & metalworking"}