{"id":393314,"name":"until","type":"preposition","us_sound":"ənˈtɪl","us_link":"../audio/u/eus74757.mp3","uk_sound":"ənˈtɪl","uk_link":"../audio/u/ukunspe030.mp3","content":"until preposition, conjunction\n(TIME)\nAdd to word list\nAdd to word list\nA1 up to (the time that): I was up until three o'clock trying to get it finished! Shouldn't we wait until Antony's here? not until\nB1 not before a particular time or event: We didn't eat until past midnight.\nSee more\nMore examplesFewer examplesShe waited until her coffee had cooled down before taking a sip.We didn't arrive at our hotel until after midnight.The photographs will be on exhibition until the end of the month.You make wine by leaving grape juice to ferment until all the sugar has turned to alcohol.You'll have to wait until your next birthday for a new bike.\nSMART Vocabulary: related words and phrases\nUntil a particular moment\nbefore\nday\nfar\nhitherto\nin\ninside\ninterim\nmeanwhile\nnow\npending\nthus\ntill\ntime\nto\nto date idiom\nup to (doing) something idiom\nwait\nyet\nSee more results »\nuntil preposition, conjunction\n(DISTANCE)\nA2 as far as: You should stay on the train until Manchester and then change.\nSMART Vocabulary: related words and phrases\nDescribing movement towards\n-ways\nat\nconvergent\nearthward\nfacing\nfor\nforward\nforwards\nhither\ninwards\non\noncoming\nonward\nonwards\nround\nthither\nto\nup\nward\nwise\nSee more results »\nGrammar\nBefore, by, till, untilIf you have to do something before a certain point in time, then when that point arrives, the action must already be completed: …\nUntilUntil is a preposition and a conjunction. Until is often shortened to till or ’til. Till and ’til are more informal and we don’t usually use them in formal writing. …\nUntil as a prepositionUntil as a preposition means ‘up to (the time that)’: …\nUntil as a conjunctionWe use until as a subordinating conjunction to connect an action or an event to a point in time: …\nUntil: typical errorsWe don’t use until to talk about things that will happen before a particular time or deadline; we use by: …\nuntil preposition, conjunction\n(TIME)\nAdd to word list\nAdd to word list\nup to the stated time: I was up until 3 a.m.\nuntil preposition, conjunction\n(DISTANCE)\nas far as: Stay on the bus until 57th Street and then walk one block west. Idiom\nnot until"}