{"id":393918,"name":"unvaccinated","type":"adjective","us_sound":"ʌnˈvæk.sə.neɪ.t̬ɪd","us_link":"../audio/u/cdo0623usunva4542.mp3","uk_sound":"ʌnˈvæk.sɪ.neɪ.tɪd","uk_link":"../audio/u/cdo0623ukunva4576.mp3","content":"Add to word list\nAdd to word list\nIf a person or animal is unvaccinated, they have not been given a vaccine (= a substance that is put into your body to protect you from a disease): There was an outbreak of measles among unvaccinated children. Unvaccinated animals can present a severe health risk to humans. Related word\nvaccinate\nMore examplesFewer examplesMost of the people who died were either unvaccinated or over 70 years of age.The illness has been reported in both vaccinated and unvaccinated children.All of the unvaccinated mice died within two days of becoming infected.\nSMART Vocabulary: related words and phrases\nImmunology & vaccination\nactive immunity\nanti-vax\nantibody\nantigen\nantigenic\nantiserum\nantivaxxer\nherd immunity\nimmune response\nimmunity\nimmunization\nimmunocompromised\nimmunology\nimmunosuppressed\ninoculate\ninoculation\nvaccinate\nvaccinated\nvaccination\nvax\nSee more results »\nthe unvaccinated\npeople or animals who have not been vaccinated (= have not been given a vaccine to protect them from a disease): Vaccinating the healthy protects the unvaccinated. The unvaccinated include babies under a year old, who are still too young to be given the vaccine.\nMore examplesFewer examplesThe unvaccinated are mainly children of parents who are worried about potentially harmful side effects of immunization.Doctors are worried even if the numbers of the unvaccinated are still relatively small.Governments promote vaccination in order to create \"herd immunity\" - from which the unvaccinated will also benefit.\nSMART Vocabulary: related words and phrases\nImmunology & vaccination\nactive immunity\nanti-vax\nantibody\nantigen\nantigenic\nantiserum\nantivaxxer\nherd immunity\nimmune response\nimmunity\nimmunization\nimmunocompromised\nimmunology\nimmunosuppressed\ninoculate\ninoculation\nvaccinate\nvaccinated\nvaccination\nvax\nSee more results »"}