{"id":394551,"name":"unwind","type":"verb","us_sound":"ʌnˈwaɪnd","us_link":"../audio/u/unwind.mp3","uk_sound":"ʌnˈwaɪnd","uk_link":"../audio/u/ukuntim030.mp3","content":"unwind verb\n(UNFASTEN)\nAdd to word list\nAdd to word list\nC2 [ I or T ] If you unwind something that is wrapped around an object, you unfasten it, and if it unwinds, it becomes unfastened: In a nearby medical tent, a US Army doctor gently unwinds Metruk's bandage.\nSMART Vocabulary: related words and phrases\nUnfastening and opening\nbreak something open\nbreaker\nbroach\ngape\nlet/set something loose idiom\nloose\nloosen\nshut (someone) up\ntease\ntease something out\nthe earth/ground/floor opens idiom\nunbolted\nunbuckle\nunfold\nunknot\nunlace\nunlock\nunpick\nunplug\nunzip\nSee more results »\nunwind verb\n(RELAX)\nC1 [ I ] (also wind down) to relax and allow your mind to be free from worry after a period of work or some other activity that has made you worried: A glass of wine in the evening helps me to unwind after work.\nThesaurus: synonyms, antonyms, and examples\nto relaxrelaxAfter a long day in the office, I love nothing more than relaxing on the sofa.chill outWe spent the whole week chilling out on the beach.chillaxHey, man, just chillax.unwindMusic helps me to unwind.wind downOur daughter knows that when we read a story at the end of the day, it's time to wind down and get ready for bed. take it easyYou'll need to spend a few days taking it easy after the operation.\nSee more results »\nSMART Vocabulary: related words and phrases\nCalming and relaxing\nappease\nassuage\nballs-to-the-wall\nbask\nbread\nchill\ncompose\nkick back\nlet/blow off steam idiom\nlie down\nlighten something up\nlull\nmelt\nplacebo\nrelaxation\nrelaxer\nrelaxing\nself-soothe\nsettle down\nshirt\nSee more results »\nunwind verb\n(UNFASTEN)\nAdd to word list\nAdd to word list\n[ T ] to unfasten something that is wrapped around an object: to unwind string\nunwind verb\n(RELAX)\n[ I ] (also wind down) to relax after a period of work or anxiety: I’m just going to watch some TV and unwind.\nAdd to word list\nAdd to word list\n[ T ]\n&#160; FINANCE to sell shares, etc. that you bought expecting that their price would rise: Institutional investors caused prices to fall as they unwound positions that they took when they were betting on rising stock prices.\n[ T ]\n&#160; FINANCE to buy the shares, etc. that you borrowed expecting that their price would go down and that you now need to deliver: Traders unwound short positions, expecting gasoline would be lower this time of year.\n[ I or T ] to change or remove the effects of something: Financial markets believe that these imbalances can be unwound gradually, allowing the economy to land softly. People's ability to service debt is unwinding.\n[ I ] (also wind down) to relax and allow your mind to be free from worry after a period of work: The facility was built as a place where casino workers could go and unwind after their shifts. unwinding noun [ U ]\nThe mark's weakness against the yen is a result of the unwinding of long positions."}