{"id":394751,"name":"up","type":"adverb","us_sound":"ʌp","us_link":"../audio/u/up.mp3","uk_sound":"ʌp","uk_link":"../audio/u/ukunwis009.mp3","content":"up adverb\n(HIGHER)\nAdd to word list\nAdd to word list\nA2 towards a higher position; towards a higher value, number, or level: Put those books up on the top shelf. A gravel road leads through the jungle and up into the Andes. Pushing the number of unit sales up every quarter can't be continued indefinitely.up to The water was up to/had come up to the level of the windows.\nout of the ground: He spent the afternoon digging carrots up. up and down\nB2 from a higher to a lower position repeatedly: jump up and down My little girl started jumping up and down with rage when she heard she couldn't go.\nSee more\nMore examplesFewer examplesA coil of thick blue smoke rose up from his pipe.Transatlantic airfares are going up.Although long-distance phone calls are going up, the charge for local calls will not alter.Share prices moved up slowly yesterday.She filled the jug up with cream.\nSMART Vocabulary: related words and phrases\nUp and upward\nascent\nclimbing\nerect\nheavenward\nperpendicular\nskyward\nuphill\nuplift\nuplifted\nupper\nuppermost\nuppish\nuppishly\nupright\nupturned\nupward\nupwards\nvertical\nvertically\nup adverb\n(VERTICAL)\nA1 in or into a vertical position: Would you stand up for a minute? I want to see how tall you are. Compare\ndown adverb (LOWER POSITION)\nMore examplesFewer examplesPutting up some new wallpaper has made all the difference to the place.Hang the clothes up to dry.His trousers were held up with a piece of elastic.The children's work had been put up on the walls of the classroom.I stuck the notice up on the board.\nSMART Vocabulary: related words and phrases\nUp and upward\nascent\nclimbing\nerect\nheavenward\nperpendicular\nskyward\nuphill\nuplift\nuplifted\nupper\nuppermost\nuppish\nuppishly\nupright\nupturned\nupward\nupwards\nvertical\nvertically\nup adverb\n(TOP)\nA2 in a high position; at the top: Our boardroom is up on the 23rd floor.way up You can tell which way up the crates have to be because they all say \"TOP\". Compare\ndown adverb (LOWER LEVEL)\nMore examplesFewer examplesHe tilted his chair backwards and put his feet up on his desk.I need you to hold it steady while I'm up the ladder.Dad is up on the roof clearing the guttering.The sugar is up on that shelf behind you.Luckily, my toast landed on the carpet with the buttered side up!\nSMART Vocabulary: related words and phrases\nUp and upward\nascent\nclimbing\nerect\nheavenward\nperpendicular\nskyward\nuphill\nuplift\nuplifted\nupper\nuppermost\nuppish\nuppishly\nupright\nupturned\nupward\nupwards\nvertical\nvertically\nup adverb\n(NEAR)\nB1 very near: up to Carrying a gun, he walked up to the cashier and demanded money.draw up A limousine drew up (= parked) outside the hotel.\nThesaurus: synonyms, antonyms, and examples\nto come closer in space or timeapproachA stranger approached and asked to have her picture taken with him.come/get closerThe swarm of bees was coming closer and closer. come/get nearerAs she came nearer the building the movement of the crowd became slower.draw closer/nearerThe holidays are drawing closer.come upA stranger came up to me and shook my hand.walk, go, etc. upI went up to him and asked him who he was.\nSee more results »\nMore examplesFewer examplesA car drove up alongside (ours).He went up to a complete stranger and started talking.She strode purposefully up to the desk and demanded to speak to the manager.A young girl came up to me and asked for money.We crept up behind her and yelled \"Boo!\"\nSMART Vocabulary: related words and phrases\nDescribing movement towards\n-wards\n-ways\nat\nconvergent\nearthward\nfacing\nfor\nforward\nforwards\nhither\ninwards\non\noncoming\nonward\nonwards\nthither\nto\nward\nway\nwise\nSee more results »\nup adverb\n(INCREASE)\nB2 to a greater degree; in order to increase: heat something up The fire heats the room up (= makes it warmer) within minutes.turn something up Grandma always turns the TV up really loud because she can't hear very well.get worked up Try not to get worked up (= increasingly excited or angry) - I'm sure we can resolve this.\nB2 If a level or amount is up, it has increased: The cost of car insurance is up, but not very much.up something on something Last year the company's turnover was $240 billion, up three percent on (= compared with) the previous year.\nMore examplesFewer examplesIt was rainy this morning, but it brightened up after lunch.I might just warm up the leftovers from yesterday's meal in the microwave.Guide dogs open up the lives of the blind or visually impaired.His time in the army certainly toughened him up.My foot swelled up to three times the normal size when it was stung by a wasp.\nSMART Vocabulary: related words and phrases\nIncreasing and intensifying\naccretion\naccumulate\naccumulative\naccumulatively\nadd fuel to the fire idiom\nblaze\ncrank\nexplosive\ngo up\ngrowing\ngrowingly\nheighten\nhot up\nmushroom\nramp something up\nratchet something up/down\nre-escalate\nre-escalation\nredouble\nstake\nSee more results »\nup adverb\n(NOT IN BED)\nB1 not in bed: get up It's time to get up now! I was up all night, finishing my essay. up and about/around\nto be able to get out of bed and move around again after a period of illness, because your health has improved enough: I was up and about a few hours after giving birth.\nSee more\nMore examplesFewer examplesOn a working day I tend to get up around seven o'clock.I'm unused to getting up so early.I was up until three o'clock trying to get it finished!My sister was up most of the night with her baby who's teething.We stayed up (late) to watch a film.\nSMART Vocabulary: related words and phrases\nAnimal physiology: not sleeping & not unconscious\nanti-sleep\ncome round\nget up\ninsomnia\nkeep someone up\nknock\nknock up\nland\nnight owl\nrise\nsit (someone) up\ntoss\nwait up\nwakeful\nwakefulness\nwaken\nwakey-wakey\nwaking\nwhite night\nwoke\nSee more results »\nup adverb\n(EXIST)\ninto existence, view, or attention: be set up Originally the charity was set up to help orphans in urban areas.come up I'm sorry, but something unexpected has come up (= has happened) at the office, and I'll be home late.coming up Coming up (= happening next) after the break, we have a man who claims he can communicate with fish.bring something up Would this be a good time to bring up the issue of salary?\nMore examplesFewer examplesThey're planning to set up their own business.Could we set up a meeting for next week?We were discussing who would be suitable for the job, and your name came up.A job in the sales department has come up - would you be interested?There are several things I'd like to bring up at the meeting tomorrow.\nSMART Vocabulary: related words and phrases\nExisting and being\naccount for something\nalive\nbe\nbe a thing idiom\nbeen\nestate\nexistentially\nextant\nfound\nhave legs idiom\nhood\nlie in\nliving\nrun\nspring up\nthey're\nthing\nthingness\nviability\nwe're\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAppearing & disappearing\nDescribing when something happened or will happen\nup adverb\n(EQUAL)\nso as to be equal in quality, knowledge, or achievement: catch up (with) She couldn't go to school for a few weeks because of illness, but she'll be able to catch up (with her work) quickly.keep up (with) So much scientific research is being performed that it's virtually impossible to keep up (with all the new developments).\nMore examplesFewer examplesI need a couple of days in the office to catch up with some paperwork.We've received so many orders that we're finding it difficult to keep up with the demand.I'm planning to catch up on some sleep this weekend.Jack finds it difficult to keep up with the rest of the class.My Italian friends speak so fast that I find it really difficult to keep up with what they're saying.\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\nadjacent\naffinity\nakin\nalike\nallied\nballpark\ncongruent\nditto\nequivalent\nequivalently\nevenly\nevery inch idiom\nnon-distinctive\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\nrespecter\nsynonymous\nSee more results »\nup adverb\n(TOGETHER)\nin a state of being together with other similar things: You have half an hour to gather up anything you'll need for the journey.add something up Add up the column of numbers in your head and then tell me what the total is.\nMore examplesFewer examplesif you put a little money aside each week, it's surprising how quickly it adds up.if you add those four figures up, it comes to £400.Collect up your things and follow me.She gathered up the newspapers that were scattered around the floor.I just need to gather up a few things and then we can go.\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nconcordance\ndescribe\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nset something up\nshake someone down\nshort-list\nshortlist\nsort\ntick\nSee more results »\nup adverb\n(TIGHTLY)\ntightly or firmly in order to keep something safe or in position: tie something up Tie up the top of the bag so the rubbish doesn't fall out.wrap up You'd better wrap up (= wear warm clothes) - it's cold outside.do something up UK Can you do my shoelaces up for me?\nMore examplesFewer examplesShe wrapped the vase up carefully before packing it in the suitcase.I found a bundle of letters tied up with a red ribbon at the back of her drawer.Can you help me do up my dress?Do your laces up or you'll trip over.Wrap him up in a blanket and give him a hot drink.\nSMART Vocabulary: related words and phrases\nTight and tightening\nastringency\nchokehold\nclose-fitting\ninelasticity\nretighten\nskinny\nsnug\nstiffen\nstrain\nstraitly\nsuper-tight\ntauten\ntautly\ntense\ntension\ntight\ntight-fitting\ntighten\ntighten something up\ntightly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSafe and secure\nup adverb\n(SMALLER)\nbroken or cut into smaller pieces; made smaller in area: cut something up He cut the letter up into a hundred pieces.fold something up She folded the newspaper up and put it in her bag.blow up The car blew up (= exploded) when flames reached its fuel tank.\nMore examplesFewer examplesShe broke the bar of chocolate up and handed each child a piece.I'll cut up a few pieces of fruit for the kids.He folded up the sheets and put them in the washing basket.We had to smash up the old fireplace to get it out.She chopped up a small onion and added it to the pan.\nSMART Vocabulary: related words and phrases\nSeparating and dividing\napheresis\natomize\nbifurcate\nbifurcation\nbisect\ndissociate\ndissociate yourself from something\ndissociation\ndisunion\ndisunite\nparcel something out\npartible\nperiodization\nperiodize\npolarize\nunbridgeable\nunforked\nunjoined\nuntangle\nwheat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTearing and breaking into pieces\nup adverb\n(AGE)\nto a greater age: grow up No one said that growing up would be easy or painless.bring someone up Many single parents struggle to bring their children up on a low income.\nMore examplesFewer examplesLearning to take disappointments is all part of growing up.She decided she'd rather bring her children up in the countryside.\nSMART Vocabulary: related words and phrases\nStages of life\nadolescence\nadult life\nadulthood\nadultification\nadultify\ncoming of age\nday\nearly years\nephebe\nhealthspan\nheyday\nin my day idiom\nin your salad days idiom\nIndian summer\nprime\nrite of passage\nsalad\nschooldays\nsomeone's declining years idiom\nthose were the days idiom\nSee more results »\nup adverb\n(HAPPENING OR WRONG)\nB1 [ after verb ] used when talking or asking about what is happening or wrong: Everyone was talking in whispers, and I could tell something was up (= something unusual was happening). What's up?\nused to ask what is wrong: You seem upset. What's up?\nused to ask what is happening, often as a way of greeting someone: What's up, guys?\nSee more\nSMART Vocabulary: related words and phrases\nOccurring and happening\nafoot\nasynchronous\nasynchronously\nattend\nattendant\nbe at work idiom\neventuate\nfall into place idiom\nfollow on\ngo hand in hand with something idiom\ngo off\ngo on\ngone\npass\nresynchronize\nroll\nroll around\nshake out\nsucceed\nsupervene\nSee more results »\nup adverb\n(MEANING)\nwhat's up with someone/something\nmainly US (also what's with someone/something) used to say that you do not understand something, or to ask for an explanation of something: I don't get what's up with all the bad reviews. I actually liked this place!\nSee more\nup adverb\n(FINISHED)\n[ after verb ] When a period of time is up, it is finished: When the two hours were up nobody had answered all of the questions.time is up Your time is up - it's someone else's turn on the training equipment now.\nSMART Vocabulary: related words and phrases\nFinished & over\nall over\nbar\nbe (all) over bar the shouting idiom\nbe done and dusted idiom\nclose\nclosed\ndown\nfinished\nfinito\nin the can idiom\nit's a wrap idiom\njig\nlapsed\nout\nover\nsee\nsee the last of something/someone idiom\nsunset\nto the last idiom\nwrap\nSee more results »\nup adverb\n(IMPROVE)\ninto an improved position or state: move up By lap 26, Hamilton had moved up into second position.up with Stein had a bad start to the race, but by the ninth lap she was up with the leaders. Compare\ndown adverb (LOWER LEVEL)\nSMART Vocabulary: related words and phrases\nBecoming better\nalive\nblossom\nblossom into something\nby/in leaps and bounds idiom\ncome alive idiom\ncome along\ncorrective\nheal\nlook up\nmake a man (out) of someone idiom\nmarginal\nmend\nmend your ways idiom\nself-betterment\nself-improvement\nshape up\nshape up or ship out! idiom\nsharpen\nsharpen (something) up\nwipe\nSee more results »\nup adverb\n(END)\nB2 to an end, finish, or state of being complete: finish something up Finish up the old loaf of bread before you start a new one.end up in Crime won't help - you'll end up in prison.round something up I'd like to round up the meeting by thanking all those who were able to attend at such short notice.\nSMART Vocabulary: related words and phrases\nCausing something to end\nabandon\nabandonment\nall good things (must) come to an end idiom\nand have done with it idiom\nbe over the hump idiom\nbrake\ncure\nfreeze\nhalt\nhang\njack something in\nkill something stone-dead idiom\nknock\nlid\nsnap\nsnuff something out\nstamp on something\nstamp something out\nstanch\nstaunch\nSee more results »\nup adverb\n(DIRECTION)\ntowards the north: up to On Tuesday she'll be travelling up to Atlanta from New Orleans.\nUK towards a more important place, especially a city: up to How often do you go up to London?up from She comes up from her village about once a month on the train.\nSMART Vocabulary: related words and phrases\nDescribing movement towards\n-wards\n-ways\nat\nconvergent\nearthward\nfacing\nfor\nforward\nforwards\nhither\ninwards\non\noncoming\nonward\nonwards\nthither\nto\nward\nway\nwise\nSee more results »\nup adverb\n(INTENDED)\nup for something\nintended, suggested, or being considered for something: up for sale That house at the end of our road is up for sale again.\nSee more\nup adverb\n(EAGER)\nup for (doing) something informal\nwilling and able to do or take part in an activity: After a long day at work I wasn't really up for a party.\nSee more\nup adverb\n(TRIAL)\n[ after verb ] UK on trial in a court: up before If he doesn't pay the fine soon, he'll be up before the magistrate.up for Smith is up for armed robbery.\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\nextrajudicial\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\npleading\npower of attorney\nprecedent\npretrial\nprobate\nthe Webster ruling\nwardship\nwitness to something\nwobbler\nSee more results »\nup adverb\n(ROAD)\n[ after verb ] UK When a road is up, it is being repaired and so is unsuitable for use: The council has got the road up because of a broken sewer.\nSMART Vocabulary: related words and phrases\nRoads & routes in general\nadopt\nadopted\napproach\nascent\nbicycle lane/path\nbike lane\ndead end\ndetour\nexit\nimpassable\nlane\nmilk round\nmulti-lane\nroadway\nroadworks\nroute\nRR\nshortcut\nskid marks\ntoll road\nSee more results »\nup adverb\n(HAIR)\nIf someone's long hair is up, it is arranged on the top or back of the head: hair up You look nice with your hair up.\nSMART Vocabulary: related words and phrases\nUp and upward\nascent\nclimbing\nerect\nheavenward\nperpendicular\nskyward\nuphill\nuplift\nuplifted\nupper\nuppermost\nuppish\nuppishly\nupright\nupturned\nupward\nupwards\nvertical\nvertically\nup adverb\n(NEXT)\nnext to play in a game or sports match, or next to perform, happen, etc.: Next up after that is a match against Blackburn Rovers at home. Up next is an untitled Woody Allen film. Grammar\nUpUp is an adverb, a preposition and an adjective. …\nUp as an adverbWe use up as an adverb to talk about movement towards a higher position, value, number or level: …\nUp as a prepositionWe use up to talk about a higher position or movement to a higher position: …\nUp as an adjectiveWe use up as an adjective usually to talk about increases in prices, levels or amounts: …\nUp to with numbersWe use up to with numbers and amounts when we are being approximate. It means ‘as much as’ or ‘not more than’: …\nUp as a particleUp is commonly used as a particle in phrasal verbs: …\nIdioms\nbe up there with someone\nup and down\nup and down somewhere\nup to (doing) something\nbe up to something\nup with\nup preposition\n(HIGHER)\nA2 to or in a higher level or position: We followed her up the stairs to a large meeting room.\nMore examplesFewer examplesThe lorry chugged up the hill.With a knife clenched between his teeth, he climbed up the tree to cut some coconuts.The spider crept up the wall.He came charging up the stairs to tell me the good news.The noise of the car startled the birds and the whole flock flew up into the air.\nSMART Vocabulary: related words and phrases\nUp and upward\nascent\nclimbing\nerect\nheavenward\nperpendicular\nskyward\nuphill\nuplift\nuplifted\nupper\nuppermost\nuppish\nuppishly\nupright\nupturned\nupward\nupwards\nvertical\nvertically\nup preposition\n(TOP)\nat the top of: You'll find a dusty attic up these stairs. If you want Fred, he's up that ladder.\nMore examplesFewer examplesHer office is up those steps to your right.They've got a different flag up the flagpole today.We had to rescue our kitten from up the tree.Who would build their house up a mountain? That's silly.Is anyone still up the tower, or did you all come down together?\nSMART Vocabulary: related words and phrases\nUp and upward\nascent\nclimbing\nerect\nheavenward\nperpendicular\nskyward\nuphill\nuplift\nuplifted\nupper\nuppermost\nuppish\nuppishly\nupright\nupturned\nupward\nupwards\nvertical\nvertically\nup preposition\n(ALONG)\nA2 (further) along: The car shot off up the road at high speed. They live just up the road. up and down\nB2 along the surface of something first in one direction and then in the opposite direction, usually repeatedly: He was running up and down the street, shouting.\nSee more\nMore examplesFewer examplesJack, move up the bench a bit, then Tess can sit next to me.We took turns to row the boat up the river.The gravel crunched underfoot as we walked up the path.There's a big traffic jam further up the motorway, so we'd better take a different route.The plane set off up the runway, gradually gathering speed.\nSMART Vocabulary: related words and phrases\nAhead, in front and beyond\nahead\nahead of\nante\nbe (right) under your nose idiom\nbefore\nbeyond\ndownriver\nfollow\nfollow your nose idiom\nfore\nforward\nfront\nfront end\nfrontally\nhead\nlead\nnose\npara\npast\nyonder\nup preposition\n(ORIGIN)\ntowards the starting point of something, especially a river or stream: Rowing up (the) river against the current was very hard work. See also\nupriver\nupstream\nSMART Vocabulary: related words and phrases\nBackwards, sideways and back and forth\nanticlockwise\naside\nback and forth idiom\nback to front phrase\nbackward\nbackwardly\nhither and thither idiom\nlateral\nlaterally\nlibration\npull\nreverse\nround\nsaw\nstand\nstep\nstep aside\nswept-back\nthere and back idiom\nto and fro\nSee more results »\nup preposition\n(TO)\nUK not standard to or at: go up Are you going up the club tonight? Compare\ndown preposition (TO) UK not standard\nSMART Vocabulary: related words and phrases\nDescribing movement towards\n-wards\n-ways\nat\nconvergent\nearthward\nfacing\nfor\nforward\nforwards\nhither\ninwards\non\noncoming\nonward\nonwards\nthither\nto\nward\nway\nwise\nSee more results »\nGrammar\nUpUp is an adverb, a preposition and an adjective. …\nUp as an adverbWe use up as an adverb to talk about movement towards a higher position, value, number or level: …\nUp as a prepositionWe use up to talk about a higher position or movement to a higher position: …\nUp as an adjectiveWe use up as an adjective usually to talk about increases in prices, levels or amounts: …\nUp to with numbersWe use up to with numbers and amounts when we are being approximate. It means ‘as much as’ or ‘not more than’: …\nUp as a particleUp is commonly used as a particle in phrasal verbs: …\nIdioms\nbe up yourself\nup yours!\nup adjective\n(RISING)\nmoving up: an up escalator See also\nupper adjective\nMore examplesFewer examplesTotal sales this month were up by $2 billion.Net profits in September were marginally up on the figures for August.Kathy wore her hair up with a pair of expensive looking earrings.We need to go to the first floor, where's the up escalator?an up stroke\nSMART Vocabulary: related words and phrases\nUp and upward\nascent\nclimbing\nerect\nheavenward\nperpendicular\nskyward\nuphill\nuplift\nuplifted\nupper\nuppermost\nuppish\nuppishly\nupright\nupturned\nupward\nupwards\nvertical\nvertically\nup adjective\n(IN OPERATION)\n[ after verb ] When a system, computer, or similar machine is up, it is operating, especially in its usual way: Andy, do you know when the network will be up again? Opposite\ndown\nMore examplesFewer examplesThere was a brief powercut but by ten o'clock the computers were up again.Will the system be up again tomorrow morning?\nSMART Vocabulary: related words and phrases\nMachines - Functioning\naction\nactuator\ndeactivation\nengaged\nfaultily\nfaulty\nfire someone up\nfunction as something/someone\nlight\noperative\npeg\npeg out\nplay something up\npower\npower (something) up\nrefire\nreset\nroad\ntick\nworking\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer concepts\nup adjective\n(HAPPY)\ninformal feeling happy: She's been really up since she started her new job.\nSMART Vocabulary: related words and phrases\nFeeling pleasure and happiness\n(as) pleased as Punch idiom\nASMR\nbe dancing in the streets idiom\nbe floating on air idiom\nbe full of the joys of spring idiom\nchipper\nchirpily\nchirpy\nchuffed\ncontented\ngruntled\nhappily\nhappy camper\nhappy place idiom\njaunty\nself-healing\nshining\nsunnily\nswooning\nswooningly\nSee more results »\nup adjective\n(WINNING)\nhaving more points, goals, etc. than your opponent in a match or competition: By half time they could have been six or seven up. With 88 seconds remaining in the game, Hungary was up by five goals.\nMore examplesFewer examplesA couple of holes later we were three up. England are one up against Germany.\nSMART Vocabulary: related words and phrases\nWinning and defeating\nannihilate\nannihilation\nbank\nbe gunning for someone idiom\nbe one in the eye for someone idiom\nconvincing\nmoral victory\nmove/go in for the kill idiom\nnear thing\noutclass\noutcompete\nscrape\nsew\nslaughter\nstomp on someone/something\nsweep the board idiom\ntake someone down\ntake someone to the cleaner's idiom\ntake something apart\nthrash\nSee more results »\nGrammar\nUpUp is an adverb, a preposition and an adjective. …\nUp as an adverbWe use up as an adverb to talk about movement towards a higher position, value, number or level: …\nUp as a prepositionWe use up to talk about a higher position or movement to a higher position: …\nUp as an adjectiveWe use up as an adjective usually to talk about increases in prices, levels or amounts: …\nUp to with numbersWe use up to with numbers and amounts when we are being approximate. It means ‘as much as’ or ‘not more than’: …\nUp as a particleUp is commonly used as a particle in phrasal verbs: …\nIdiom\nup and running\nup verb\n(INCREASE)\n[ T ] -pp- to increase something such as a price: We won't be able to make a profit on the deal without upping the sale price. It looks like tax rates are going to be upped again.\nThesaurus: synonyms, antonyms, and examples\nto get fasterspeed upThe car sped up to 100 mph.pick up speedThe hurricane is picking up speed as it approaches the coast.gain speedAccidents often happen when a driver gains speed going downhill. gather speedThe economic recovery was starting to gather speed.accelerateThe vehicle accelerated around the turn.\nSee more results »\nSMART Vocabulary: related words and phrases\nPrice increases\naccrual\nadded value\nanti-inflation\nanti-inflationary\nappreciate\nappreciate by something\nappreciate in value\nbull market\ndead cat bounce\ngo through the roof idiom\nhyperinflation\ninflationary\ninflationary spiral\nput something up\nrack\nrack something up\nrebound\nreinflate\nreinflation\nroof\nSee more results »\nup verb\n(GO)\nup and ...\nused with another verb to emphasize that someone left a place or did something in a sudden and possibly unexpected way: up and leave/go After dinner they just upped and left/went without saying goodbye.\nSee more Idiom\nup your game\nhigher or improved: uphill uplift\nSMART Vocabulary: related words and phrases\nHigh, tall and deep\nabysmal\naltitude\nbottomless\ndeep\ndwarf\nectomorph\nelevated\neye level\nhigher\nlofty\novershadow\nrangy\nrear\nrear above/over something/someone\nstand\ntall\ntallish\ntallness\ntower\ntower above/over someone/something\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGood, better and best\nup adverb [not gradable]\n(HIGHER)\nAdd to word list\nAdd to word list\ntoward a higher position, or toward a higher value, number, or level: Pick up your clothes and put them away. We need to push sales figures up higher next quarter. The kids were jumping up and down on the bed.\nup adverb [not gradable]\n(VERTICAL)\nin or into a vertical position: She jumped up to answer the phone. They put up (= built) the house in a matter of weeks.\nup adverb [not gradable]\n(TOP)\nin a high position; at the top: They moved to a house up in the hills.\nup adverb [not gradable]\n(INCREASINGLY)\nto a greater degree; in order to increase: The afternoon sun really heats up this room (= increases the heat in this room). Please speak up (= louder) – I can’t hear you.\nup adverb [not gradable]\n(INTO EXISTENCE)\ninto existence, view, or consideration: I didn’t hesitate to bring up the salary issue. Something came up at the office and I had to work late.\nup adverb [not gradable]\n(EQUAL)\nso as to be equal in quality or achievement: It’s impossible to keep up with all the new computer developments.\nup adverb [not gradable]\n(NEAR)\nvery near: He walked right up to me and introduced himself. The cop pushed me up against the wall.\nup adverb [not gradable]\n(TOGETHER)\nin a state of being together with other similar things: Gather up your things – it’s time to go. She added up the numbers in her head.\nup adverb [not gradable]\n(TIGHTLY)\ntightly or firmly in order to keep something safe or in position: Tie the boat up at the dock. You’d better bundle up (= wear warm clothes) – it’s cold outside.\nup adverb [not gradable]\n(SMALLER)\nmade smaller in area or amount, esp. by cutting or dividing: Cut the cheese up into bite-size pieces. They broke the company up into three separate units. He folded up the newspaper and put it in his briefcase.\nup adverb [not gradable]\n(AGE)\nto a greater age: She wants to be a singer when she grows up.\nup adverb [not gradable]\n(INTO IMPROVED POSITION)\ninto an improved position or state: By the third lap, Simms had moved up into second position.\nup adverb [not gradable]\n(TOWARD NORTH)\ntoward the north: She comes up from Washington about once a month. up noun us\nYour browser doesn't support HTML5 audio\n/ʌp/up noun us\nYour browser doesn't support HTML5 audio\n/ʌp/Idioms\non the up and up\nup and about\nup and do something\nup for grabs\nup in arms\nup in the air\nup the creek\nup to par\nup to scratch\nup to snuff\nMore idioms\nup to speed\nup till\nup preposition\n(ALONG)\n(farther) along: There’s a coffee shop just up the street.\nup preposition\n(TOP)\nat the top of: His house is up the hill.\nup adjective, adverb [not gradable]\n(OUT OF BED)\nout of bed: What time did you get up?\nup adjective, adverb [not gradable]\n(ENDED)\nfinished, or to an end, finish, or state of being completed: Finish up your breakfast – it’s almost time for school. My time is almost up on the parking meter.\nup adjective [not gradable]\n(IN OPERATION)\n(of a system or machine, esp. a computer) operating, esp. in its usual way: The new inventory system should be up and running by the end of the month.\nup adjective [not gradable]\n(INTENDED)\nintended, suggested, or being considered: The house at the end of our street is up for sale. Ray’s up for promotion.\nup verb [T]\n(HIGHER)\nto increase the amount or level of something: We won’t be able to make a profit unless we up our prices.\nAdd to word list\nAdd to word list\ntowards a higher value, number, or level: Share prices moved up slowly yesterday. Pushing the number of unit sales up every quarter can't be continued indefinitely.\nif a level or amount is up, it has increased: The cost of insurance is up quite a lot this year.up 5%, 20%, etc. on sth Last year the company's turnover was up 3% on the previous year.\nin a state of being together with other similar things: Add up the column of figures.\nto an end or state of being complete: Finish up this report before you leave tonight. I'd like to wind up the meeting by thanking you for coming.\nup for sth\nintended, suggested, or being considered for something: Jack is up for promotion this year. They put the building up for sale.\n(also up for doing sth) willing and able to do or take part in an activity: After a long day of meetings, I wasn't really up for taking the clients out for dinner. He asked if anyone wanted to try, and I said I was up for it.\nup to sth\nas high as a particular level or number: The Competition Commission clamped down on lenders who charge borrowers in deprived areas interest rates of up to 900%. Owners who hire illegal workers face up to five years in prison. Women who have been with a firm for some time are told that their files have been reviewed and suddenly their work is not up to standard.\n(also up until sth) until a particular point in time: Up to now, we've had all the resources we needed. I was treated as a trusted employee up until about six months ago.\nable to do something: I had four hundred pages of reports to read, and I just didn't feel up to it.up to the job/task Do you think he's up to the job?\nif a computer, system, etc. is up, it is operating normally: The system is up again, so we have to get back to work. Do you know when the network will be up again? Compare\ndown adjective\nup and running\nif a computer, machine, or system is up and running, it is operating normally: The air-conditioning is up and running again after two days of problems.\non the up (and up) UK\nimproving or increasing: It's only a small business but it's definitely on the up. House prices are still on the up.\non the up and up US\nused to describe something that is done legally or honestly: Do you feel everything with the governor's land deal was done on the up and up? Drug makers face at least one major challenge: convincing consumers that ads are on the up and up.\nups and downs\nthe normal good times and bad times that happen in any situation or period: Luard was looking to buy a new business to balance his other companies' dependence on the ups and downs of the oil sector. The magazine industry has had its ups and downs.\nto increase something such as a price: We won't be able to make a profit on the deal without upping the sale price. It looks like tax rates are going to be upped again. See also\nup the ante"}