{"id":394914,"name":"update","type":"verb","us_sound":"ʌpˈdeɪt","us_link":"../audio/u/update_01_00.mp3","uk_sound":"ʌpˈdeɪt","uk_link":"../audio/u/ukunwis015.mp3","content":"Add to word list\nAdd to word list\nB2 to make something more modern or suitable for use now by adding new information or changing its design: an updated version of the software\nB1 to give someone the most recent information: We'll update you on this news story throughout the day.\nThesaurus: synonyms, antonyms, and examples\nto tell someone somethingtellMy friend told me you were looking for me.let someone knowLet me know if you'd like to come.giveCan you give the message to Jo?communicateA 60-second TV commercial isn't always the best way to communicate a complex medical message.informThe relatives of the injured have been informed of the accident.notifyThe school has to notify parents if their children do not arrive at school.\nSee more results »\nMore examplesFewer examplesThey've updated a lot of the entries in the most recent edition of the encyclopaedia.Their website is updated daily.Can you update me on progress so far?Do you have an updated version of the system?She spent several hours updating the mailing list.\nSMART Vocabulary: related words and phrases\nRestoring and reviving\nbalsam\nbounce\nbounce back\nfacelift\nflip\nlick your wounds idiom\nmodernization\nmodernize\nmove with the times idiom\nrecrudescence\nregeneration\nregenerative\nrejuvenate\nrejuvenation\nresurgent\nresurrect\nresurrection\nresuscitation\nrevamp\nrevitalize\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnnouncing, informing & stating\nB2 an act of updating something or someone with new information: Jo's just doing an update on the mailing list. I'll need regular updates on your progress.\nB2 a new form of something that existed at an earlier time: It's an update of an old 60s movie.\nMore examplesFewer examplesCan you give me an update on progress so far?Later in this bulletin we will be going over to our Westminster studio for an update on the situation.It's an update of a previous version of the software.Do you know whether it's possible to buy updates?a news update\nSMART Vocabulary: related words and phrases\nAnnouncing, informing & stating\nacquaint someone/yourself with something\nannunciation\napprise someone of something\navowedly\nawaken someone to something\nbreak\nbreathe/say a word idiom\ndisseminate\nimpart\non the record idiom\npass\nproclaim\npropagate\nput something before someone\nput something out\nput something out of its misery idiom\nrapporteur\nreportable\nreported\nstatement\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCategories and varieties\nAdd to word list\nAdd to word list\nto make something more accurate and suitable for use now by showing new facts or conditions: The school’s budget is updated annually. When you move, don’t forget to update your mailing address.\nTo update is also to make something more modern: The old procedures need to be updated and streamlined.\nnew or more accurate information based on new facts or conditions: You can get hourly news updates on the Internet.\nAdd to word list\nAdd to word list\nto make something more modern or suitable for use now by adding new information or changing its design: They haven't updated the software in three years. We've recently updated the decor in all of our restaurants. Scientific textbooks must be updated regularly.\nto give someone the most recent information: update sb on sth Can you update me on progress so far?\na statement giving the most recent information about a subject or situation: an update on sth I'll need regular updates on your progress. Passengers watch airport television screens waiting for news updates.\nIT a more recent, and usually improved, form of something, especially something that is regularly changed: Each software update has a version number.an update of sth The latest version is a much improved update of the original program."}