{"id":395050,"name":"uphold","type":"verb","us_sound":"ʌpˈhoʊld","us_link":"../audio/u/uphold.mp3","uk_sound":"ʌpˈhəʊld","uk_link":"../audio/u/ukunwis023.mp3","content":"Add to word list\nAdd to word list\nC2 to defend or keep a principle or law, or to say that a decision that has already been made, especially a legal one, is correct: As a police officer you are expected to uphold the law whether you agree with it or not. Judge Davis upheld the county court's decision.\nMore examplesFewer examplesThe government has promised to uphold the principles of democracy.We will endeavour to uphold the high educational standards which have become associated with this institution.The freedom of the press must be upheld.A committed socialist, he upheld the rights of the voiceless and the underprivileged.The court is said to be upholding its decision.\nSMART Vocabulary: related words and phrases\nBacking, supporting & defending\nadopt\nadvocacy\naffirmation\nally yourself to/with someone\nargumentation\nbadge\nbailout\nchampion\nkeep the flag flying idiom\npatronage\nrecommended\nred carpet\nreinforce\nright behind someone idiom\nroll out the red carpet idiom\nroot\nroot for someone\nstick\nstick together\nsympathetic\nSee more results »\nRelated word\nupholder\nAdd to word list\nAdd to word list\nto defend or maintain a principle or law, or to state that a decision that has already been made, esp. a legal one, is correct: The Supreme Court upheld California’s term limit measure.\nAdd to word list\nAdd to word list\nto state that a decision which has already been made, especially a legal one, is correct: uphold a decision/ruling/appeal The court is said to be upholding its decision.\nto keep or defend a principle or law: When he took office he swore to uphold the laws of the land. The decision by the court upholds the right of rural Alaskans to subsistence hunt and fish on most waters in Alaska. upholder noun [ C ] uk/ʌpˈhəʊldər/ us/-ˈhoʊldɚ/\nOur country's reputation as an upholder of standards of freedom and decency is being questioned."}