{"id":395124,"name":"uplink","type":"noun","us_sound":"ˈʌp.lɪŋk","us_link":"../audio/u/cdo1121usupli4413.mp3","uk_sound":"ˈʌp.lɪŋk","uk_link":"../audio/u/cdo1121ukupli4287.mp3","content":"Add to word list\nAdd to word list\na communications link for signals to be sent to a satellite, spacecraft, or aircraft: Most existing stations are not equipped with the satellite uplinks that allow credit card billing. A video image was beamed via satellite uplink to four television stations on the other side of the world. The reporters had to drive to an uplink facility to transmit their video. Compare\ndownlink noun\ncomputing, internet &amp; telecoms\n&#160; specialized a link to a different, or different part of a, communications or computer network: You will probably need one port to act as an uplink to your router. This special port - the uplink port - is made for the purpose of connecting to another DCE device.\nMore examplesFewer examplesThe motion of the satellite plays a role, creating a Doppler shift associated with the uplink and downlink between the satellite and ground station.Each rover must be able to be controlled from the home university campus through a commercial broadband wireless uplink.Her invention was an autonomous Wave Glider robot outfitted with a hydrophone, microphone, time-lapse camera, and satellite uplink.\nSMART Vocabulary: related words and phrases\nCommunications - general words\nanti-satellite\napp\nautodial\nautodialler\nbar\ncybernetics\nhack\nmulti-line\nmultimode\nmultipath\nnoise\nnon-computer\nnon-network\npatch\nsilent\ntrace\nwebchat\nZoom bomb\nZoombomber\nZoombombing\nSee more results »\nto send signals using a communications link to a satellite, spacecraft, or aircraft: The radio transmission was uplinked to the world by satellite TV. You see them uplinking everywhere: bloggers, techies and assorted Internet enthusiasts. Compare\ndownlink verb\nto send or connect something using a link to a different, or different part of a, communications or computer network: This is a fast-paced age when information is digitized, faxed, uplinked, and downloaded. Compare\ndownlink verb\nMore examplesFewer examplesThe packets are uplinked to a satellite which broadcasts them.Broadcasts are \"uplinked\" to the satellite transponder and \"downlinked\" to the ground receiving dish.Most National Networks uplink their \"network feed\" to the local affiliates out of New York via satellites. No Broadcast Licensee is authorised to uplink or resell, repackage or sub-lease broadcast uplink services except and to the extent expressly authorized by the Authority. Using a phone we will be able to uplink into our DNA database and may be able to provide detectives with the name of their suspect right away.\nSMART Vocabulary: related words and phrases\nCommunications - general words\nanti-satellite\napp\nautodial\nautodialler\nbar\ncybernetics\nhack\nmulti-line\nmultimode\nmultipath\nnoise\nnon-computer\nnon-network\npatch\nsilent\ntrace\nwebchat\nZoom bomb\nZoombomber\nZoombombing\nSee more results »"}