{"id":395129,"name":"upload","type":"verb","us_sound":"ʌpˈloʊd","us_link":"../audio/u/usb03045.mp3","uk_sound":"ʌpˈləʊd","uk_link":"../audio/u/ukb03045.mp3","content":"Add to word list\nAdd to word list\nB1 to copy or move programs or information to a larger computer system or to the internet Compare\ndownload verb\nThesaurus: synonyms, antonyms, and examples\nto access something on a computer, tablet, or smartphoneaccessI tried to access the site, but my browser became unresponsive.downloadI downloaded the software and installed it.uploadI uploaded my changes, and the site went live.retrieveThe data can be retrieved in a fraction of a second.\nSee more results »\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntap\ntoolbar\nvectorization\nvectorize\nvirtualization\nvirtualize\nwake word\nzip file\nSee more results »\na computer program or information that can be uploaded\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntap\ntoolbar\nvectorization\nvectorize\nvirtualization\nvirtualize\nwake word\nzip file\nSee more results »\nAdd to word list\nAdd to word list\nto copy or move programs or information to another computer system, especially to the internet or a larger computer: upload a copy/file/document I uploaded the file as soon as I had finished working on it.upload sth to sth With the press of a single button, you can upload information to a server. Compare\ndownload\n[ C or U ] the act or process of copying programs or information into a computer's memory, especially to the internet or a larger computer: The file is ready for upload. During each upload, the computer's security can be compromised.\n[ C ] a computer program or information that can be uploaded: Internet uploads will play a growing role in your business.\nCompare\ndownload noun"}