{"id":395156,"name":"uppercase","type":"noun","us_sound":"ˌʌp.ɚˈkeɪs","us_link":"../audio/u/uszzzzc096.mp3","uk_sound":"ˌʌp.əˈkeɪs","uk_link":"../audio/u/ukad5002.mp3","content":"Add to word list\nAdd to word list\nIf letters are in uppercase, they are written as capitals: Typing an entire message in uppercase is considered equivalent to shouting. Your password should consist of a combination of numbers and letters (using both uppercase and lowercase). The terminal was set to use upper-case only. To change to upper case, press ESC + u. Compare\nlowercase noun mainly USSynonym\ncapital (LETTER)\nMore examplesFewer examplesLogical host names are first converted to uppercase.Most information is supplied to programs in uppercase.Pressing the shift key causes letters to be output in upper case.\nSMART Vocabulary: related words and phrases\nPunctuation\nabbreviated\naccent\nacute\napostrophe\nat sign\nblock capitals\nbracket\ncaron\ncolon\ncomma\ndiacritical\ndouble prime\npunctuation mark\nsemicolon\nsmall cap\nsmall capitals\nsolidus\ntilde\nunbracketed\nuncapitalized\nSee more results »\nwritten as capital letters: uppercase letters The spell checker that I use won't catch the occasional upper-case letter that should be lower case. A collection of eight bits is called a byte, abbreviated with an uppercase B. Passwords should be a minimum of eight characters with at least one number, one upper case letter, two lower case letters, and one special character. Synonym\ncapital (LETTER)Compare\nlowercase adjective\nsmall adjective (LETTER SIZE)\nMore examplesFewer examplesTo get uppercase characters you click Shift first, then the letter.The authority's brand looks like an upper-case G with a waterfall tumbling out of it.You may use either upper case or lower case letters.\nSMART Vocabulary: related words and phrases\nLettering & alphabets\nABC\nall caps\nalphabet\nalphabetically\nascender\nBraillist\ncamel case\ncopperplate\ndemotic\nhieroglyph\nideogram\ninitial\nLatinized\nmulti-character\nnon-phonetic\npaleographical\npenmanship\nroman\nstenography\nupper case\nSee more results »\nAdd to word list\nAdd to word list\nwriting the large form of letters when they are printed or written; capital letters uppercase adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˌˈʌp·ərˈkeɪs/"}