{"id":395515,"name":"upward","type":"adverb","us_sound":"ˈʌp.wɚd","us_link":"../audio/u/cdo0318usupwa5394.mp3","uk_sound":"ˈʌp.wəd","uk_link":"../audio/u/ukupstr010.mp3","content":"Add to word list\nAdd to word list\nC1 →\nupwards Opposite\ndownward\nExamples\nHouse prices have started moving upward again.He pointed upward.A small bird flapped its wings furiously and flew upward.Buyers still outnumber sellers and are pushing prices upward.The blaze swept rapidly upward and engulfed the five-storey building.\nSMART Vocabulary: related words and phrases\nUp and upward\nascent\nclimbing\nerect\nheavenward\nperpendicular\nskyward\nup\nuphill\nuplift\nuplifted\nupper\nuppermost\nuppish\nuppishly\nupright\nupturned\nupwards\nvertical\nvertically\nC1 moving towards a higher position, level, or value: With an upward trend in inflation, you expect prices to rise. Opposite\ndownward\nMore examplesFewer examplesThere's been an upward trend in sales in the last few years.Inflation is likely to accelerate this year, adding further upward pressure on interest rates.Move the lever in an upward direction.Mike found it difficult to swim in the strong upward current.A sudden upward movement in property prices has made things increasingly difficult for first-time buyers.\nSMART Vocabulary: related words and phrases\nUp and upward\nascent\nclimbing\nerect\nheavenward\nperpendicular\nskyward\nup\nuphill\nuplift\nuplifted\nupper\nuppermost\nuppish\nuppishly\nupright\nupturned\nupwards\nvertical\nvertically\nAdd to word list\nAdd to word list\nfrom a lower to a higher position, level, or value: Tachi glanced upward to the stars. The stock market charged upward yesterday. upward adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈʌp·wərd/\nIt was an upward climb to the campsite.\nAdd to word list\nAdd to word list\nmoving towards a higher position, level, or value: upward climb/momentum/movement London's shares maintained their upward momentum yesterday. upward curve/trend The market has been on a steady upward trend since the Fed stopped raising rates.upward pressure There are fears that further falls in the dollar will put more upward pressure on eurozone interest rates.\n→\nupwards"}