{"id":396234,"name":"us","type":"pronoun","us_sound":"ʌs","us_link":"../audio/u/us_02_00.mp3","uk_sound":"ʌs","uk_link":"../audio/u/ukuric_011.mp3","content":"us pronoun\n(GROUP)\nAdd to word list\nAdd to word list\nA1 used as the object of a verb or a preposition to refer to a group that includes the speaker and at least one other person: Thank you for driving us to the station. Many of us in the editorial department disagree with the changes that are happening.\nMore examplesFewer examplesIf you get to the restaurant before us just wait at the bar.We really appreciate all the help you gave us last weekend.We were asked to show some identification before the security guards would let us in.The teacher asked us to form a circle and join hands.She thinks she's better than the rest of us.\nSMART Vocabulary: related words and phrases\nLinguistics: personal pronouns\n'em\nhe\nher\nI, i\nit\nme\nnumber one\npersonally\nS, s\ns/he\nshe\nthee\nthem\nthemself\nthou\ny'all\nyou\nyou-all\nYours truly phrase\nyous\nSee more results »\nus pronoun\n(ME)\nUK not standard (especially used in spoken English) me: Give us a light, mate. Give us it here and I'll see if I can mend it.\nSMART Vocabulary: related words and phrases\nLinguistics: personal pronouns\n'em\nhe\nher\nI, i\nit\nme\nnumber one\npersonally\nS, s\ns/he\nshe\nthee\nthem\nthemself\nthou\ny'all\nyou\nyou-all\nYours truly phrase\nyous\nSee more results »\nGrammar\nSubject and object pronounsPersonal subject pronouns act as the subject of a clause. We use them before a verb to show who is doing the verb. We do not usually leave out the pronoun: …\nI, meWe use I and me to refer to the speaker or writer. I is the subject form and me is the object form: …\nYouWe use you to refer to the listener or reader. It is both the subject and the object form. You can refer to one person or more than one person. It is usually clear from the context whether you is singular or plural: …\nHe, him; she, herHe, him, she and her are singular third person pronouns. He and him are the masculine forms. She and her are the feminine forms: …\nItWe use it to refer to things: …\nWe, usWe use we and us to refer to different groups of people, but always including the speaker. We and us can refer to the speaker + the listener, or the speaker + other people but not the listener, or people in general including the speaker: …\nThey, themWe use they and them to refer to specific groups of people, things and animals: …\nour: Where've you parked us car?\nSMART Vocabulary: related words and phrases\nLinguistics: possessive forms\nhers\nhis\nits\nmine\nmy\nour\nours\nS, s\nthe\ntheir\ntheirs\nthine\nthy\nyer\nyour\nyours\nthe US\nmainly UK (US usually the U.S.) abbreviation for the United States (of America): A new study of education in the US has just been published. The US has had several years of solid growth. The US have taken a different view of the situation.\nMore examplesFewer examplesThere are many reasons why the US has a better record on charitable giving than many other nations.The US has a much larger economy and therefore it also has a much larger GDP.Most of these shows were produced in the US.\nSMART Vocabulary: related words and phrases\nCountries, nationalities & continents: country names\nAfghanistan\nAlbania\nAlbion\nAlgeria\nAndorra\nEquatorial Guinea\nEritrea\nEstonia\nEswatini\nEthiopia\nMauritania\nMauritius\nMelanesia\nMexico\nMicronesia\nSt Kitts and Nevis\nSt Lucia\nSt Vincent and the Grenadines\nSudan\nSuriname\nSee more results »\nbelonging to or relating to the United States of America or its people: She had served in the US army for several years. The decision was taken by the US State Department. When did you become a US citizen?\nMore examplesFewer examplesHe promised to help rescue the struggling US car industry.Another major war-games exercise by the US Navy began on Thursday.The majority of those arrested were US citizens.\nSMART Vocabulary: related words and phrases\nCountries, nationalities & continents: country names\nAfghanistan\nAlbania\nAlbion\nAlgeria\nAndorra\nEquatorial Guinea\nEritrea\nEstonia\nEswatini\nEthiopia\nMauritania\nMauritius\nMelanesia\nMexico\nMicronesia\nSt Kitts and Nevis\nSt Lucia\nSt Vincent and the Grenadines\nSudan\nSuriname\nSee more results »\nAdd to word list\nAdd to word list\nthe person speaking with other people included; the form of \"we\" that follows the verb: Thanks for giving us a lift to the airport.\nabbreviation for United States: a US citizen"}