{"id":396252,"name":"use","type":"verb","us_sound":"juːz","us_link":"../audio/u/cald4us2374.mp3","uk_sound":"juːz","uk_link":"../audio/u/cald4uk1615.mp3","content":"use verb\n(PURPOSE)\nAdd to word list\nAdd to word list\nA1 [ T ] us\nYour browser doesn't support HTML5 audio\nuk\nYour browser doesn't support HTML5 audio\n/juːz/ used | used to put something such as a tool, skill, or building to a particular purpose: This glass has been used - could you get me a clean one? [ + to infinitive ] Use scissors to cut the shapes out. Going on the expedition gives me a chance to use all the training I've had. The old hospital isn't used any more.be used for These lights are used for illuminating the playing area.use something against someone/something To use military force against the protesters would be unacceptable.\nMore examplesFewer examplesYour table manners are appalling - don't you know how to use a knife and fork?Please use the side entrance.If we clear out the spare room, you can use it as a study.The teacher demonstrated how to use the equipment.Pronouns are often used to refer to a noun that has already been mentioned.\nSMART Vocabulary: related words and phrases\nUsing and misusing\nadopt\nadoption\navail\navail yourself of something\nbe/go heavy on something idiom\ndraw\nexhaust\ngo through\ngobble something up\nmake capital out of something idiom\nmax\nmax out\nspare\nspent\ntap\nturn over\nturn to someone/something\nturn/use something to good account idiom\nunblock\nunderuse\nSee more results »\nuse verb\n(REDUCE)\nB1 [ T ] uk\nYour browser doesn't support HTML5 audio\n/juːz/ us\nYour browser doesn't support HTML5 audio\n/juːz/ used | used to reduce the amount of or finish something, by eating it, burning it, writing on it, or by a chemical reaction: use something (up) We've used (up) nearly all of the bread - will you buy some more? Does she still use drugs? Don't worry if you use the shampoo up (= use all of it) - I'll get more tomorrow. Compare\nconsume\nMore examplesFewer examplesThere wasn't enough coal during the war, so we had to use it sparingly.We used four tins of paint when we painted the ceiling.There's no hot water - Rachel used it all for her bath.All right - who used the last carton of milk?Can I use some of that wrapping paper, or do you need it yourself?\nSMART Vocabulary: related words and phrases\nUsing and misusing\nadopt\nadoption\navail\navail yourself of something\nbe/go heavy on something idiom\ndraw\nexhaust\ngo through\ngobble something up\nmake capital out of something idiom\nmax\nmax out\nspare\nspent\ntap\nturn over\nturn to someone/something\nturn/use something to good account idiom\nunblock\nunderuse\nSee more results »\nuse verb\n(WORD)\nB2 [ T ] uk\nYour browser doesn't support HTML5 audio\n/juːz/ us\nYour browser doesn't support HTML5 audio\n/juːz/ used | used to say or write a particular word or phrase: \"Autumn\" is used in British English and \"fall\" in American English. That's an expression she often uses to describe how she feels.\nSMART Vocabulary: related words and phrases\nSaying & uttering\n(your) every word idiom\nadd\ncome out with something\nevery\nfall from something\nfind your voice idiom\nget in\nin your own words idiom\nintone\nloud\nmouth\nquoth\nsay\nspoken\nstring\ntalk sense idiom\nthink\nutterance\nverbalize\nvolunteer\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWriting & typing\nuse verb\n(TAKE ADVANTAGE)\nC2 [ T ] usually disapproving uk\nYour browser doesn't support HTML5 audio\n/juːz/ us\nYour browser doesn't support HTML5 audio\n/juːz/ used | used to take advantage of a person or situation; to exploit: He's just using you - he'll steal your ideas and then take the credit for them himself. It might be possible to use their mistake to help us get what we want.\nMore examplesFewer examplesShe uses her newspaper column to expound her views on environmental issues.I think that some of her friends use her, rather, because she is so generous.She is just using the situation to gain a lot of cheap publicity.Many illegal immigrants are being shamefully used by unscrupulous employers.After years of being used and abused by her husband, Ruth finally left him.\nSMART Vocabulary: related words and phrases\nTreating people or animals badly\nabuser\nanti-harassment\nat the hands of someone idiom\nbatten\nbatten on someone\nhit someone where it hurts idiom\nill-treat\nill-treatment\nill-used\nimpose\npick\npick on someone\nprey\nprey on something\nput someone through something\ntyrannize\ntyranny\nuncared for\nvictimization\nvictimize\nSee more results »\nuse verb\n(IN THE PAST)\nuse to uk\nYour browser doesn't support HTML5 audio\n/ˈjuːsˌtə/ us\nYour browser doesn't support HTML5 audio\n/ˈjuːsˌtə/\nIn negative sentences and questions, \"use to\" replaces \"used to\" when it follows \"did\" or \"didn't\": Did he use to be the doctor in \"Star Trek\"? We didn't use to go out much during the winter. Did you use to stay with your grandparents when you were a kid? I didn't use to like mushrooms, but I do now. The school didn't use to admit girls.\nSMART Vocabulary: related words and phrases\nIn the past\nago\nany more idiom\nanymore\nback in the day idiom\nback then idiom\nclock\ndim\ndot\nflood\nmemory\nmoon\nmore\nno longer idiom\nnon-current\nrewind the clock idiom\nsometime\nstep\nstep back (in time) idiom\nthe mists of time idiom\nthe status quo ante\nSee more results »\nIdioms\ncould use something\nuse your headPhrasal verb\nuse something up\nuse noun\n(PURPOSE)\nB1 [ C or U ] a purpose for which something is used: A food processor has a variety of uses in the kitchen.use for Don't throw that cloth away - you'll find a use for it one day. No, I don't want to buy a boat - I don't have any use for one!\nA2 [ U ] the act of using something, or a period of time when something is being used or can be used: put something to (good) use You should be able to put your experience in electronics to (good) use in your new job.in use Don't touch the machine when it's in use.not in use a flat-screen TV that becomes a mirror when it is not in useout of use It's a name that has almost fallen out of use (= is hardly used now ).the use of There has been an increase in the use of migrant workers in recent years.go out of/come into use Traditional farming methods are going out of/coming into use (= used less and less/more and more) in many areas. make use of something\nB2 to use something that is available: We might as well make use of the hotel's facilities.\nSee more the use of something\nC2 permission to use something, or the ability to use something: have the use of something They said we could have the use of their beach house whenever they weren't there.\nSee more\nMore examplesFewer examplesThe use of cameras in this museum is strictly forbidden.I made good use of my time , mixing with a lot of different people and practising my Spanish.We make helicopters mainly for military use rather than civil use.There was a big controversy over the use of drugs in athletics.We disapprove of this use of company funds for political purposes.\nSMART Vocabulary: related words and phrases\nGoals and purposes\naffordance\nambition\navail\ncause\ndedicated\ndeflect\ndream\neye\nit's the thought that counts idiom\nkey performance indicator\nKPI\nmoonshot\nobjective\npoint\ntarget\ntarget setting\nthought\ntowards\nundedicated\nundirected\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUsing and misusing\nuse noun\n(CONSUMPTION)\n[ C or U ] the process of reducing the amount of something by burning it, eating it, involving it in a chemical reaction, etc.: use of In anaerobic respiration, sugar is broken down to lactic acid without the use of oxygen. a more efficient use of resources\nSMART Vocabulary: related words and phrases\nUsing and misusing\nadopt\nadoption\navail\navail yourself of something\nbe/go heavy on something idiom\ndraw\nexhaust\ngo through\ngobble something up\nmake capital out of something idiom\nmax\nmax out\nspare\nspent\ntap\nturn over\nturn to someone/something\nturn/use something to good account idiom\nunblock\nunderuse\nSee more results »\nuse noun\n(WORD)\n[ C ] one of the meanings of a word, or the way that a particular word is used: Can you list all the uses of the word \"point\"?\nSMART Vocabulary: related words and phrases\nMeaning & significance\nacceptation\nadd\nadd up to something\nbackspin\nbe a badge of something idiom\nconnotation\ni.e.\ninterpretable\nlocution\nlocutionary\nmeaning\nmeaningfully\nmeaningfulness\npurport\nsense\nsignificant\nspeak\nsubtext\nsubtextually\nwhat's with something? idiom\nSee more results »\nIdioms\nbe (of) (any/some) use\nbe (of) no use\nwhat's the use of...?\nuse verb [T]\n(PUT INTO SERVICE)\nAdd to word list\nAdd to word list\nto put something into your service for a purpose: Do you know how to use a computer? We could use your help. She uses so many big words, it’s hard to understand her.\nuse verb [T]\n(MAKE IT LESS)\nto reduce the amount of something: We have used all the funds in that account.\nuse verb [T]\n(ACT SELFISH)\nto be friendly toward someone for your own advantage or purposes: She used him to help her get into movies and then discarded him.\nusable adjective us\nYour browser doesn't support HTML5 audio\n/ˈju·zə·bəl/\nable to be used for a purpose: The house needs a lot of work to make it usable. Idiom\nin usePhrasal verb\nuse up something\nuse noun [C/U]\n(PUT INTO SERVICE)\nIf someone or something is of no use, it cannot be of help: [ U ] There’s no use paying for a permit if you won’t need it. [ U ] He was of no use to us because he couldn’t work every day."}