{"id":396266,"name":"useless","type":"adjective","us_sound":"ˈjuːs.ləs","us_link":"../audio/u/useless.mp3","uk_sound":"ˈjuːs.ləs","uk_link":"../audio/u/ukuric_025.mp3","content":"Add to word list\nAdd to word list\nB1 of no use; not working or not achieving what is needed: Without fuel, the vehicles will become useless for moving supplies. [ + to infinitive ] It's useless to speculate without more information.\nThesaurus: synonyms, antonyms, and examples\nuselessuselessWe have cleared out carloads of useless junk.no useMoney is no use if it's just sitting there.serve no purposeSuch warnings serve no purpose other than to scare the public.pointlessShe sees cleaning as a pointless exercise since everything is going to get dirty again.worthlessThe majority of objects in the exhibition are worthless junk.\nSee more results »\nmainly UK informal not at all good at doing something: Don't ask me to add it up - I'm useless at maths. She's very good at methodical work, but useless when there's a lot of pressure. You're absolutely useless - can't you even go to the shops without getting lost!\nThesaurus: synonyms, antonyms, and examples\nbad at somethingbad atI was overweight and bad at sport.hopelessI’m completely hopeless in the kitchen.uselessUK He’s useless at maths.rubbishUK She’s a pretty rubbish singer, really.incompetentThe rules have made it hard to remove incompetent teachers.\nSee more results »\nMore examplesFewer examplesIt's useless trying to convince her that she doesn't need to lose any weight.His books are full of repetition and useless information.This computer's bloody useless! It's always going wrong.The shelves were covered with ornaments and useless knick-knacks.For all her qualifications, she's still useless at the job.\nSMART Vocabulary: related words and phrases\nUseless and futile\na mug's game idiom\nadrift\naimless\naimlessly\naimlessness\nairy-fairy\nfruitless\nfruitlessly\nfruitlessness\nfutile\nfutilely\nmotiveless\nnegate\nnegation\nno good idiom\nunrealistically\nunseriousness\nuntil you are blue in the face idiom\nunviability\nunviable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInability and awkwardness\nRelated words\nuselessly\nuselessness\nAdd to word list\nAdd to word list\nof no value; worthless: With dead batteries, the flashlight was useless."}