{"id":396342,"name":"usual","type":"adjective","us_sound":"ˈjuː.ʒu.əl","us_link":"../audio/u/usual.mp3","uk_sound":"ˈjuː.ʒu.əl","uk_link":"../audio/u/ukusher006.mp3","content":"Add to word list\nAdd to word list\nA2 normal; happening, done, or used most often: I went to bed at my usual time. There was more rainfall than usual this summer in the mountain areas. You'll find the cutlery in its usual place. Terry was, as usual, slow to respond. The library is open for business as usual despite the snowstorm.\nThesaurus: synonyms, antonyms, and examples\nnormalnormalTemperatures are well above normal today.usualI went to bed at my usual time.ordinaryThe magazine has stories about ordinary people rather than celebrities.standardIt's standard practice for surgeons to wear gloves.naturalIt's completely natural to feel anxious on your first day at a new school.typicalHe was a typical teenager - arguing with his parents and staying out late.\nSee more results »\nMore examplesFewer examplesWith fewer cars on the roads, traffic is flowing more smoothly than usual.The flower seller was in his usual spot outside the station.He's complaining of all the usual flu symptoms - a high temperature, headache and so on.My usual train was cancelled. That's why I'm so late.The children have left all the lights on, as usual!\nSMART Vocabulary: related words and phrases\nHabitual and customary\naccustomed\nall in a day's work idiom\nas a (general) rule idiom\nas a matter of course idiom\nas per usual/normal idiom\ninveterate\ninveterately\nknee-jerk\nmainstream\nmainstreaming\nmake it a rule idiom\nmechanical\noften\nordinarily\nper\nprevail\npro forma\nregulation\nsurprise, surprise idiom\nterritory\nSee more results »\nSomeone's usual is the drink, especially an alcoholic one, that they most often have, for example when in a bar: A gin and tonic for my dad, and I'll have the/my usual.\nSMART Vocabulary: related words and phrases\nAlcohol - general words\nalcoholic\nalcopop\nAngostura\naperitif\nbevvy\nbooze\nintoxicant\nkick\nlibation\nliquid lunch\nliquor\nlong drink\nnip\npredrinks\npregaming\npreload\npreloading\nquick one\nslug\nstiff\nSee more results »\nAdd to word list\nAdd to word list\nhappening or done most of the time; ordinary: I’ll put the keys in the usual place. If you can believe it, the food was worse than usual. usually adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈju·ʒə·wə·li/\nHe usually gets home from work at about six."}