{"id":396474,"name":"utility","type":"noun","us_sound":"juːˈtɪl.ə.t̬i","us_link":"../audio/u/eus74790.mp3","uk_sound":"juːˈtɪl.ə.ti","uk_link":"../audio/u/ukusher021.mp3","content":"utility noun\n(SERVICE)\nAdd to word list\nAdd to word list\n[ C ] a service that is used by the public, such as an electricity or gas supply: The biggest financial worries are mortgages followed by utility bills. We each pay £500 in rent plus utilities.\n[ usually plural, C ] a company that provides a service such as an electricity or gas supply: Utilities say they've been deluged by people who are having trouble paying their bills. For several years utilities that provide drinking water have kept emergency pumps on standby. the administration of public utilities\nSMART Vocabulary: related words and phrases\nSociety - general words\namenity\ncivilization\ncivilized\nconsumer society\nculturomics\ndigital divide\nhunter-gatherer\nnon-segregated\nnon-segregation\nnon-utility\npluralism\nsociality\nsocially\nsocietal\nsocietally\nsocio-\nsociologist\nsociology\nsuperstructure\nuncivilized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSocial services & sanitation\nutility noun\n(USE)\n[ U ] formal the usefulness of something, especially in a practical way: The utility of this substance has been proven in a series of tests. Under such conditions, a common medium of exchange would have no utility at all.\nSMART Vocabulary: related words and phrases\nGoals and purposes\naffordance\nambition\navail\ncause\ndedicated\ndeflect\ndream\neye\nit's the thought that counts idiom\nkey performance indicator\nKPI\nmoonshot\nobjective\npoint\ntarget\ntarget setting\nthought\ntowards\nundedicated\nundirected\nSee more results »\nof a sports player, able to play effectively in different positions: Jones is a utility infielder, a strong player at every position. He functioned as England's utility batsman, the man who could be relied upon to plug any hole in any crisis. See also\nutility player\nable to do several different things well: I recommend this innovative utility tool that can handle all sorts of cutting projects. See also\nutility knife\ndesigned mainly to be useful rather than attractive or fashionable : She wore an outdoorsy utility jacket but somehow managed to make farming look chic. After the war material and good design were in short supply and the country produced what was called utility clothing. It was a student's room with utility furniture and posters on the walls.\nSMART Vocabulary: related words and phrases\nCompetitors & participants in sports & games\nanchor\nback four\nballer\nballplayer\nbase jumper\nbenchwarmer\nchallenger\nkeeper\nlogroller\nlong-jumper\nlongboarder\nmajor league\nmid-table\nracer\nretire\ntrampolinist\ntrialist\ntriathlete\ntriple jumper\ntriple threat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUseful or advantageous\nutility noun\n(USEFULNESS)\nAdd to word list\nAdd to word list\n[ U ] ability to satisfy a particular need; usefulness: Its basic utility lies in being able to drive where other vehicles can’t go.\nutility noun\n(PUBLIC SERVICE)\n[ C ] a supply of gas, electricity, water, or telephone service to homes and businesses, or a business that supplies such services: a utility bill After I call the movers, I’ll call to have the utilities turned on.\nAdd to word list\nAdd to word list\n[ C ] a service for supplying electricity, gas, etc.: utility bill/company/costs Please enclose a copy of a recent utility bill as proof of address. the rising cost of utilities\n[ C ] a large company that provides a service such as electricity, gas, etc.: We are a natural gas utility serving over a million customers in the Michigan area. With energy consumption rising, many public utilities are struggling to meet peak-time demand.\n[ C ]\n&#160; IT a computer program that is used to do a particular task: The program includes a set of utilities and file recovery tools for advanced users.\n[ U ] how useful something is: The product became popular thanks to its high utility in many different situations."}