{"id":172064,"name":"habit","type":"noun","us_sound":"ˈhæb.ɪt","us_link":"../audio/h/eus75781.mp3","uk_sound":"ˈhæb.ɪt","uk_link":"../audio/h/ukgyros007.mp3","content":"habit noun\n(REPEATED ACTION)\nAdd to word list\nAdd to word list\nB1 [ C or U ] something that you do often and regularly, sometimes without knowing that you are doing it: out of habit I always buy the same brand of toothpaste out of (= because of) habit.get into the habit I'm trying not to get into (= start) the habit of always having biscuits with my coffee. I used to swim twice a week, but I seem to have got out of (= ended) the habit recently.pick up a habit I was taught to drive by my boyfriend and I'm afraid I've picked up (= caught) some of his bad habits.break a habit I'm trying to get him to break (= end intentionally) the habit of switching on the TV when he comes home at night.make a habit of it I don't mind being woken up once or twice in the middle of the night by my flatmate so long as she doesn't make a habit of it (= do it frequently).in the habit of I'm not really in the habit of looking at (= I don't usually look at) other people's clothes, but even I noticed that awful suit!\nB2 [ C ] something annoying that someone often does: have a habit of She has a habit of finishing off other people's sentences.\nB2 [ C ] a strong physical need to keep taking a particular drug: a cocaine habitfigurative humorous I'm afraid I've got a chocolate habit.\nMore examplesFewer examplesIt's so hard to stop smoking when it's been a lifelong habit.Get into the habit of tuning your guitar every day before you practise.Picking your nose is a revolting habit.Members of the public were asked about their shopping habits.We've fallen into the habit of getting up late on Saturday mornings.\nSMART Vocabulary: related words and phrases\nHabitual behaviour\nADL\natavism\natavistic\ncounter-tendency\ncreature\ncreature of habit idiom\ndiet\nidiosyncrasy\nidiosyncratic\nidiosyncratically\nleaning\npenchant\nprogramme\nritualism\nritualistic\nritualistically\nritualized\nritually\nroutine\nspecialize\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDrug addiction\nhabit noun\n(CLOTHING)\n[ C ] a special piece of long clothing worn by monks and nuns\nDev Carr/Image Source/GettyImages\nSMART Vocabulary: related words and phrases\nReligious people: monks & nuns\nabbess\nabbey\nabbot\nanchorite\nascetic\nbenedictine\nFranciscan\nfriar\nfriary\nhermit\nlay brother\nmonastic\nmonastically\nmonasticism\nmonk\nmother\nprioress\npriory\nTrappist monk\nveil\nSee more results »\nAdd to word list\nAdd to word list\na particular act or way of acting that you tend to do regularly: [ U ] Judy is in the habit of sleeping late on Sundays. [ U ] I have the habit of checking my e-mail as soon as I log on to my computer. [ C ] Eating between meals is a bad habit."}