{"id":172169,"name":"hacking","type":"adjective","us_sound":"ˈhæk.ɪŋ","us_link":"../audio/h/cdo0123ushack0968.mp3","uk_sound":"ˈhæk.ɪŋ","uk_link":"../audio/h/cdo0123ukhack1149.mp3","content":"Add to word list\nAdd to word list\nA hacking cough is loud and sounds painful: He is constantly puffing on cigarettes and has a hacking cough. Synonym\nhacky\nMore examplesFewer examplesSome of the blood pressure and cardiac medications cause a dry hacking cough.She had a hacking dry cough and felt sick.The disease in adults typically causes a long lasting hacking, generally non-productive, cough.Someone coughed, hoarse and hacking.\nSMART Vocabulary: related words and phrases\nRespiratory disorders\naltitude sickness\nanti-asthma\nanti-tubercular\nanti-tuberculosis\nanti-tuberculous\nasthmatic\ncongested\nemphysema\nhay fever\nhepatopulmonary syndrome\nhyperventilate\nlegionnaires' disease\nlong Covid\nman flu\nstrep throat\nstuffiness\ntubercular\nupper airway resistance syndrome\nventilate\nventilated\nSee more results »\nhacking noun [U]\n(COMPUTING)\nthe activity of getting into someone else's computer system without permission in order to find out information or do something illegal: Companies installing broadband were worried that such an open and permanent link to the internet would make them more vulnerable to hacking.hacking attack The FBI is probing the biggest ever hacking attack on the internet.\nMore examplesFewer examplesComputer hacking is not a crime under Filipino law.Ethical hacking is becoming increasingly necessary for our survival.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhexadecimal\nhill climbing\nhome automation\nhotspot\nimportation\nmeg\noptical\nprotocol\nsimulation\ntethering\ntexturing\nthreading\ntick box\ntimesharing\nSee more results »\nhacking noun [U]\n(HORSE RIDING)\nmainly UK the activity of riding on a horse in the countryside for pleasure: go hacking I go hacking on the Heath trail first thing every morning. Most horses are used today for pleasure riding, for example hacking and pulling traps.\nMore examplesFewer examplesI love just jumping on my pony and going hacking.You don't have to spend much money for basic hacking and general enjoyment of your horse.\nSMART Vocabulary: related words and phrases\nHorse riding\nbridle\ncanter\ncinch\ncurry\nendurance rider\nendurance riding\nequestrianism\neventer\ngait\ngirth\nhigh-spirited\njib\njodhpurs\nmounted\nrein\nsaddle-sore\nsidesaddle\nsilk\nsnaffle\ntoreador\nSee more results »\nAdd to word list\nAdd to word list\nthe activity of using a computer to access information stored on another computer system without permission, or to spread a computer virus: Hacking is now much more sophisticated and harder to detect than a few years ago."}