{"id":172160,"name":"hacker","type":"noun","us_sound":"ˈhæk.ɚ","us_link":"../audio/h/hacker.mp3","uk_sound":"ˈhæk.ər","uk_link":"../audio/h/ukgyros017.mp3","content":"Add to word list\nAdd to word list\n(also computer hacker) someone who gets into other people's computer systems without permission in order to find out information or to do something illegal : Problems can occur when a company does not know a hacker has broken into its system. \"Bots\" can even allow hackers to take over systems.\n(also phone hacker) someone who uses another person's phone system without permission, especially to listen to their spoken messages: When her voicemail inbox became full, hackers reportedly deleted messages to make room for new ones. There are also suggestions that hackers could make expensive phone calls at the owner's expense.\nMore examplesFewer examplesConcerns remain, particularly about hackers breaking open confidential Internet-based records.Early warnings about hacker attacks and viruses have the potential to save firms trouble and money.The company makes software to protect wireless phones from hackers and viruses.A big appeal of cell phones for hackers is that the devices are generally always on, they're sending and receiving more data, and they typically have poor security.\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\ndrill down\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntoolbar\nvectorization\nvectorize\nvirtualization\nvirtualize\nwake word\nzip file\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMiscellaneous criminals\nCommunications - general words\nAdd to word list\nAdd to word list\na person who is skilled in the use of computer systems, often one who illegally obtains access to private computer systems: Hackers are a major defense department concern.\nAdd to word list\nAdd to word list\nsomeone who uses a computer to access information stored on another computer system without permission, or to spread a computer virus: The software company said that more than 30,000 computers were hijacked by hackers each day and used to illegally send out spam. Installing a firewall is one method of trying to protect against hackers. Hacker attacks, financial fraud, and data theft are now everyday concerns. a computer/internet hacker a criminal/malicious hacker"}