{"id":172393,"name":"haemorrhage","type":"noun","us_sound":"ˈhem.ɚ.ɪdʒ","us_link":"../audio/h/hemorrhage.mp3","uk_sound":"ˈhem.ər.ɪdʒ","uk_link":"../audio/h/ukhaema005.mp3","content":"Add to word list\nAdd to word list\na large flow of blood from a damaged blood vessel (= a tube carrying blood around the body): He had a brain haemorrhage. Serious haemorrhage may occur at any time throughout pregnancy.\na sudden or serious loss: The higher salaries paid overseas have caused a haemorrhage of talent from this country.\nMore examplesFewer examplesThe cause of death was given as cerebral haemorrhage.She was taken to hospital but suffered a haemorrhage and died.\nSMART Vocabulary: related words and phrases\nDisorders & diseases of the heart & blood\nacquired agammaglobulinemia\nagammaglobulinemia\nagnogenic myeloid metaplasia\nangina\nanoxia\ndefibrillation\ndilated cardiomyopathy\nEbstein's anomaly\neconomy-class syndrome\nEisenmenger syndrome\nfur\nhaemophilia\nhypoglycaemia\nlockjaw\nnon-diabetic\nnon-haemolytic\npaediatric thrombocytopenia\npatent ductus arteriosus\npericarditis\nvaricose vein\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLosing and loss\n[ I ] to lose a large amount of blood in a short time: She started haemorrhaging while giving birth to the baby. There was a risk he would haemorrhage on the operating table.\n[ I or T ] to lose large amounts of something such as money over a period of time and be unable to stop this happening: haemorrhage money The business has been haemorrhaging money for several months. Support has been haemorrhaging from the party.\nMore examplesFewer examplesThe next day he started to haemorrhage and was rushed to hospital.The industry continues to haemorrhage assets.Staff have been haemorrhaging from children's services with no one to replace them.\nSMART Vocabulary: related words and phrases\nDisorders & diseases of the heart & blood\nacquired agammaglobulinemia\nagammaglobulinemia\nagnogenic myeloid metaplasia\nangina\nanoxia\ndefibrillation\ndilated cardiomyopathy\nEbstein's anomaly\neconomy-class syndrome\nEisenmenger syndrome\nfur\nhaemophilia\nhypoglycaemia\nlockjaw\nnon-diabetic\nnon-haemolytic\npaediatric thrombocytopenia\npatent ductus arteriosus\npericarditis\nvaricose vein\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLosing and loss\nAdd to word list\nAdd to word list\nto lose a large amount of money or large numbers of customers, jobs, etc.: The leisure and hospitality industry hemorrhaged 10,000 jobs and the manufacturing sector lost 6,000. to haemorrhage cash/staff/customers\nhaemorrhage red ink\nto lose a lot of money in a short period of time: Buffeted by Japanese and Korean competition, U.S. carmakers hemorrhage red ink like stuck pigs.\nthe loss of a large amount of money or large numbers of customers, jobs, etc.: the haemorrage of sth The pay-per-view service is worried about the haemorrage of viewers to its competitors."}