{"id":172878,"name":"half","type":"noun","us_sound":"hæf","us_link":"../audio/h/half.mp3","uk_sound":"hɑːf","uk_link":"../audio/h/ukhairp013.mp3","content":"Add to word list\nAdd to word list\nA2 either of the two equal or nearly equal parts that together make up a whole: half of \"What's half of 96?\" \"48.\"half (of) Roughly half (of) the class are Spanish and the others are a mixture of nationalities.in half/into halves Cut the apple in half/into halves (= into two equal parts).half as My little brother is half as tall as me/half my height.half a dozen Can you get me half a dozen (= six) eggs, please? Half of me would just like to give it all up and travel around the world (= partly I would like to, but partly I would not). She was born in the latter half of the 18th century. The recipe tells you to use a pound and a half of butter.\nB2 informal a lot: She invited a lot of people to the party but half of them didn't turn up.half (of) the time I don't even know where she is half (of) the time. half past\nA1 (also UK informal half) Half past a particular hour is 30 minutes later than that hour: I'll meet you at half past nine (= 09.30 or 21.30).\nSee more\nB1 only partly: He answered the door half naked. I was half expecting to see her at the party. I'm half inclined to take the job just because it's in Argentina. He was being funny but I think he was half serious. The bottle's half empty. go halves informal\nto divide the cost of something with someone: go halves on Shall we go halves on a bottle of champagne?\nSee more half and half\nequal amounts of two different things: The waste is mixed half and half with reclaimed wood and turned into decking.\nSee more half as much again\n50 percent more of the existing number or amount: Last year, we raised almost £15,000. This year we raised about half as much again.\nSee more\nMore examplesFewer examplesThere were some tense moments in the second half of the game.It tastes exactly the same as the real thing, but it has half the fat.The exam lasted an hour and a half.Two halves make a whole.Over half his speech was devoted to the issue of unemployment.\nSMART Vocabulary: related words and phrases\nFractions\ncomplex fraction\ncompound fraction\ndeci-\ndenominator\neighteenth\neighth\nfortieth\nfraction\nin\nmillionth\nmixed fraction\nninth\nproper fraction\nseventh\nseventieth\nsixteenth\nsixth\nsixtieth\nthirteenth\nthirtieth\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLarge in number or quantity\nIncomplete\nGrammar\nHalf as a noun …\nHalf as an adjective …\nHalfA half is one of two equal parts of something: …\nHalf in noun phrasesWe can use half and half of before nouns with the definite article (the), possessives (my, your) and demonstratives (this, that): …\nHalf as an adverbWe can use half as an adverb which means ‘not completely’, ‘partly’: …\nIdioms\nbe half the battle\nbe half the dancer, writer, etc. you used to be\ngiven half a/the chance\nhow the other half lives\nnot do things by halves\nnot half\nnot half as\nnot know the half of it\nthat was a game, meal, walk, etc. and a half!\nhalf noun [C]\n(SPORT)\nfirst/second half\neither of two periods of time into which a game is divided: He has only made one NFL start and was pulled out after an ineffective first half.\nSee more\nin team sports, either of the two halves into which the playing area is divided: His attacking instincts often find him playing in the opposition's half. A long kick allowed Bath to break into the Bristol half. We're giving away too many silly fouls, especially in our own half.\nin team sports such as football, rugby, and hockey, a player who plays mostly in the middle of the playing area: They have two young halves, who will only get better. The halves played close in front of the defending centre-half.\nin golf, a score for a hole that is the same as your opponent's score: She holed from six feet for a half at the seventeenth. It was only with an 18-inch putt for a half at the 15th that he claimed the match, and his team's victory.\nSMART Vocabulary: related words and phrases\nSurfaces on which sports take place\n18-yard box\nastroturf\nbound\nbowling green\ncanvas\nclimbing wall\ncourt\ngoal line\nground staff\nout of bounds idiom\nplayability\nplayable\nplaying field\npump track\nrecreation center\nring\nrink\nsideline\nskatepark\nupright\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral terms used in ball sports\nGolf\nhalf noun [C]\n(DRINK)\nUK informal half a pint of a drink, especially beer: A pint of lager and two halves, please.\nSMART Vocabulary: related words and phrases\nAlcohol - general words\nalcoholic\nalcopop\nAngostura\naperitif\nbevvy\nbooze\nintoxicant\nkick\nlibation\nliquid lunch\nliquor\nlong drink\nnip\npredrinks\npregaming\npreload\npreloading\nquick one\nslug\nspecific gravity\nSee more results »\nhalf noun [C]\n(TICKET)\nUK a ticket that is cheaper because it is for a child: Two (adults) and three halves to Manchester, please.\nSMART Vocabulary: related words and phrases\nTickets\naccommodation\napex\nboarding pass\ncoach class\ne-ticket\nhall pass\npass\nrain check\nreturn fare\nreturn ticket\nround fare\nround-trip ticket\nseason ticket\nsingle\nstandby\nsupersaver\nticketing\nticketless\ntimed ticket\ntransfer\nSee more results »\nGrammar\nHalf as a noun …\nHalf as an adjective …\nHalfA half is one of two equal parts of something: …\nHalf in noun phrasesWe can use half and half of before nouns with the definite article (the), possessives (my, your) and demonstratives (this, that): …\nHalf as an adverbWe can use half as an adverb which means ‘not completely’, ‘partly’: …\nAdd to word list\nAdd to word list\neither of the two equal or nearly equal parts that together make up a whole: [ U ] Half of 12 is 6. [ U ] Half (of) the students are Spanish. [ U ] Cut the apple in half (= into two equal parts). [ C ] The recipe calls for a pound and a half of potatoes.\nIn sports, a half is one of two equal periods of play, often with a short pause for rest between them. Idiom\nhalf the battle\nreferring to either of the two equal or nearly equal parts that together make up a whole: Each talk should last about a half hour/half an hour (= 30 minutes). We need half a dozen (= six) eggs.\nHalf also means partly or not completely: She was still sleepy and only half aware of what was happening. I half expected (= almost expected) to see her at the party."}