{"id":172984,"name":"hall","type":"noun","us_sound":"hɑːl","us_link":"../audio/h/hall.mp3","uk_sound":"hɔːl","uk_link":"../audio/h/ukhairp020.mp3","content":"hall noun\n(PART OF HOUSE)\nAdd to word list\nAdd to word list\nA2 [ C ] mainly UK (US usually entryway); (also hallway) the area just inside the main entrance of a house, apartment, or other building that leads to other rooms and usually to the stairs: in the hall I left my bags in the hall. Synonym\nentrance hall\nMint Images/Mint Images RF/GettyImages\n[ C ] (also hallway) a passage inside a house, apartment building, school, hotel, etc. with doors to other rooms or apartments along its sides: down the hall There is a meeting room down the hall from my office.along the hall She ran along the hall and knocked on her neighbour's door.\nHenn Photography/GettyImages\nMore examplesFewer examplesThe kids always clutter the hall up with school bags and coats and stuff.We're having a new carpet laid in the hall next week.A portrait of the earl takes pride of place in the entrance hall.She ran excitedly down the hall to greet her cousins.You should not be hanging around in the halls during classes.\nSMART Vocabulary: related words and phrases\nParts of buildings: passages & entrance areas\narcade\narchway\nbreezeway\nconcourse\ncorridor\ndesk\nentryway\ngangway\ngateway\nhallway\nmarquee\npassage\npatio\nporch\nportal\nreception\nside entrance\nside return\nterrace\nvestibule\nSee more results »\nhall noun\n(LARGE ROOM)\nA2 [ C ] a building or large room used for events involving a lot of people: the Royal Albert Hallconcert hall The new concert hall will seat 1,700 people.church hall I'm playing in a concert at the church hall. See also\nsports hall\nMore examplesFewer examplesThe people at the back of the hall started jeering at the speaker.There's a big sports hall for tennis and badminton and such like.The presentation of prizes and certificates will take place in the main hall.The children funnelled along the corridor into the school hall.The new concert hall seats 1500 people.\nSMART Vocabulary: related words and phrases\nParts of buildings: rooms\nantechamber\nanteroom\natelier\nattic\nballroom\ndressing room\nefficiency room\nen suite\neyrie\nfamily room\nmeat locker\nmulti-chambered\nmulti-room\nobservation lounge\npanic room\nutility room\nvestibule\nwaiting room\nwet room\nworkroom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPublic buildings\nhall noun\n(STUDENT BUILDING)\n[ C or U ] UK (also UK halls); (US residence hall) a college or university building where students live: The guide is called \"Cheap Sleeps in Europe\" and includes campsites, student halls and B&amp;Bs. I was 21 and living in a university hall.in hall Students usually eat breakfast in hall.in halls Is it cheaper to live in halls or rent privately?\nMore examplesFewer examplesHis decision to stay at home is unsurprising when the cost of student halls in London is considered.An example of someone using English might be a Spanish Erasmus student chatting with Austrian friends in a student hall in Vienna. Security in residence halls is tight. Most dormitories are kept locked day and night.Accommodation in halls is allocated according to criteria that includes year of study, age and geographical distance from the university.He will live \"in hall\" and have his own room but must share a bathroom.\nSMART Vocabulary: related words and phrases\nUniversity & college education\nacademe\nacademia\nanti-university\nbeadle\nbusiness school\ngrad\ngraduate\nhall of residence\nhonor society\nOxon\nPanhellenic\npass degree\npoly\npolytechnic\nthe groves of academe idiom\nuniversity\nunselective\nvice chancellor\nwarden\nwardenship\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHouses & homes\nhall noun [C]\n(PASSAGE)\nAdd to word list\nAdd to word list\n(also hallway, us/ˈhɔl·weɪ/) a passage in a building, or the area just inside the main entrance of a building: Her office is just down the hall.\nhall noun [C]\n(BUILDING)\na building or large room used for events involving a lot of people: a concert/lecture hall\nA hall can also be a building at a college or university."}