{"id":173072,"name":"hallucinatory","type":"adjective","us_sound":"həˈluː.sɪ.nə.tɔːr.i","us_link":"../audio/h/eus72139.mp3","uk_sound":"həˈluː.sɪ.nə.tər.i","uk_link":"../audio/h/ukhairp028.mp3","content":"Add to word list\nAdd to word list\nrelating to or causing hallucinations (= experiences in which you see, hear, feel, or smell something that does not exist): In some patients the drug has been found to have hallucinatory side effects. He heard hallucinatory voices telling him what to do. She had a number of hallucinatory episodes.\nsimilar to a hallucination (= an experience in which you see, hear, feel, or smell something that does not exist) because of being strange, not seeming to be completely real, etc.: She films at night, giving her work a hallucinatory quality. Huge, hallucinatory paintings cover the walls. Synonyms\ndreamlike\nsurreal\nrelating to false information that is produced by an artificial intelligence (= a computer system that has some of the qualities that the human brain has, such as the ability to produce language in a way that seems human): One of the big problems with creative AIs is that it is all too easy for them to switch from accurate to hallucinatory. If the system goes into a hallucinatory state, the advice is to reset the system.\nMore examplesFewer examplesSome indigenous peoples use hallucinatory drugs to achieve spiritual experiences.There can be severe psychiatric complications including chronic paranoid hallucinatory psychoses.My first hallucinatory experience had nothing to do with drugs.I was haunted by the striking, hallucinatory imagery of her poems.The music is woozy, almost hallucinatory.\nSMART Vocabulary: related words and phrases\nDreaming\nbe hearing/imagining/seeing things idiom\nbe miles away idiom\ndaydream\ndaydreamer\ndaydreaming\ndreamful\ndreamfully\ndreamless\ndreamlessly\ndreamscape\nhallucination\nimagination\nin a dream idiom\nmile\nnightmare\noneiric\nphantasmagorical\nredream\nreverie\nWalter Mitty\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStrange, suspicious and unnatural\nComputer concepts"}