{"id":173063,"name":"hallucinate","type":"verb","us_sound":"həˈluː.sə.neɪt","us_link":"../audio/h/hallucinate.mp3","uk_sound":"həˈluː.sɪ.neɪt","uk_link":"../audio/h/ukhairp026.mp3","content":"Add to word list\nAdd to word list\nto seem to see, hear, feel, or smell something that does not exist, usually because of a health condition or because you have taken a drug: He hadn't slept for several days and was hallucinating through exhaustion and dehydration. He began hallucinating and hearing voices. She hallucinated a person talking to her when no one was there.\nWhen an artificial intelligence (= a computer system that has some of the qualities that the human brain has, such as the ability to produce language in a way that seems human) hallucinates, it produces false information: LLMs are notorious for hallucinating – generating completely false answers, often supported by fictitious citations. The latest version of the chatbot is greatly improved but it will still hallucinate facts.\nMore examplesFewer examplesThey became ill from oxygen deprivation, causing them to hallucinate.After the crash, she even hallucinated once while in her car that she was back in the plane. Why do generative AI tools hallucinate?They warned that large language models are prone to hallucinate text.\nSMART Vocabulary: related words and phrases\nDreaming\nbe hearing/imagining/seeing things idiom\nbe miles away idiom\ndaydream\ndaydreamer\ndaydreaming\ndreamful\ndreamfully\ndreamless\ndreamlessly\ndreamscape\nhallucinatory\nimagination\nin a dream idiom\nmile\nnightmare\noneiric\nphantasmagorical\nredream\nreverie\nWalter Mitty\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer concepts\nAdd to word list\nAdd to word list\nto see or hear something that does not exist: Police said the suspect was yelling incoherent statements as if he was hallucinating. hallucination noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/həˌlu·səˈneɪ·ʃən/\n[ C ] His fever was so high he was having hallucinations."}