{"id":173151,"name":"halt","type":"verb","us_sound":"hɑːlt","us_link":"../audio/h/eus72143.mp3","uk_sound":"hɒlt","uk_link":"../audio/h/ukhallw006.mp3","content":"Add to word list\nAdd to word list\nto (cause to) stop moving or doing something or happening: \"Halt!\" called the guard. \"You can't go any further without a permit.\" Production has halted at all of the company's factories because of the pay dispute. Security forces halted the demonstrators by blocking the road.\nThesaurus: synonyms, antonyms, and examples\nto end something or cause it to endstopStop pulling your brother's hair this instant!quitQuit poking your sister, will you?haltWe halted the assembly line to check the equipment.discontinueThe lab has discontinued this line of research due to ethical concerns.ceaseAll operations at the company will cease, and the assets will be auctioned off.\nSee more results »\nMore examplesFewer examplesThe government has had to take measures to halt the population explosion.The government must take measures, he said, to halt the country's slide into recession.The ever-increasing demand for private cars could be halted by more investment in public transport.Filming was halted after the lead actor became ill.Building at the site was halted after human remains were unearthed earlier this month.\nSMART Vocabulary: related words and phrases\nCausing something to end\nabandon\nabandonment\nall good things (must) come to an end idiom\nand have done with it idiom\nbe over the hump idiom\nbrake\ncure\nhang\njack something in\nkill something stone-dead idiom\nknock\nknock off (something)\nlay\nlid\nsnap\nstamp on something\nstamp something out\nstanch\nstaunch\nstem\nSee more results »\nan occasion when something stops moving or happening: halt in the recent halt in productionbring something to a halt Severe flooding has brought trains to a halt (= prevented them from moving) on several lines in Scotland.come to a halt The bus came to a halt (= stopped) just in time to avoid hitting the wall.grind to a halt If traffic increases beyond a certain level, the city grinds to a halt (= stops completely).screech to a halt The car screeched to a halt (= stopped suddenly and noisily) just as the lights turned red.\nThesaurus: synonyms, antonyms, and examples\nthe final part of somethingendThis mammal roamed the steppes during the end of the last Ice Age.closeStock prices were up 6 percent at the close of the trading day.culminationThis starring role in a West End musical is the culmination of her years of hard work in local theatres. completionAt the completion of the exam, please return the materials to the proctor's desk and exit the room quietly.endpointBoth parties agree that they have reached a suitable endpoint to the negotiations.\nSee more results »\ncall a halt to something\nto prevent something from continuing: How many more people will have to die before they call a halt to the fighting?\nSee more\nSMART Vocabulary: related words and phrases\nStaying and remaining\nabrupt halt\nbe left phrase\ncloseted\nhang\nhold\nhold something over\nnon-rotating\nnon-tenured\noutstay\noverstay\noverwinter\nsit\nspot\nstay in\nstay on\nstay put idiom\nstick\nstick around\nsticky\nstop in\nSee more results »\nAdd to word list\nAdd to word list\nto stop something, or to bring something to a stop: [ I ] \"Halt!\" ordered the guard. [ T ] Congress voted additional funds in an effort to halt the spread of the disease. [ T ] Nationwide, mail delivery was halted by the strike. halt noun [ U ] us\nYour browser doesn't support HTML5 audio\n/hɔlt/\nAll work had come to a halt and everyone was standing silently at their desks."}