{"id":173531,"name":"handout","type":"noun","us_sound":"ˈhænd.aʊt","us_link":"../audio/h/handout.mp3","uk_sound":"ˈhænd.aʊt","uk_link":"../audio/h/ukhandb030.mp3","content":"handout noun [C]\n(INFORMATION)\nAdd to word list\nAdd to word list\nB2 a document given to students or reporters that contains information about a particular subject: On page two of your handout you will find a list of the books that I have referred to during the lecture.\nMore examplesFewer examplesI've listed some useful reading material on the handout.At the beginning of term, we got handouts to read about all the different clubs and activities.\nSMART Vocabulary: related words and phrases\nSummaries and summarizing\nabridgment\nabstract\nbiodata\ncatch-all\ncurriculum vitae\nexecutive summary\ngist\nin short idiom\nnutshell\nresume\nshorthand\nshorthand for something idiom\nstory\nsum (something/someone) up\nsummarization\nthe long and the short of it idiom\nTLDR\nto cut a long story short idiom\ntrot\nupsum\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInformation and messages\nhandout noun [C]\n(PRESENT)\noften disapproving something such as food, clothing, or money that is given free to someone who has a great need for it: government handout I'm not interested in government handouts - all I want is a job.\nSMART Vocabulary: related words and phrases\nGifts in the form of money\naid\naward\nbenefaction\nbequest\nbonus\nbounty\ncharity box\ncommunity chest\ndebt relief\ndonation\ndonation box\ndowry\nforeign aid\ngift card\ngratuity\nhonorarium\nMaundy\nreward\ntip\ntronc\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGenerous & charitable\nhandout noun [C]\n(SOMETHING FREE)\nAdd to word list\nAdd to word list\nsomething such as food, clothing, or money that is given free to someone who needs it: government handouts\nhandout noun [C]\n(DOCUMENT)\na document given to each person who is present, usually to give information about a particular subject: Her handout included a list of the books she referred to.\nAdd to word list\nAdd to word list\nsomething such as food, clothing, or money that is given free to someone who is in need of it: She ended up living on handouts and food vouchers. federal/government/state handouts\nmoney that is paid to someone without their asking for it: The electricity company offered shareholders a £238m handout. Shareholders are to receive a 25p a share cash handout after the company banked £219m from the sale last year.\nFINANCE money that is given by a government to people, organizations, or industries to encourage a particular activity: More than 50 American billionaires have received government farm handouts in recent years from a program created to help struggling small farmers survive.\nMEETINGS a document containing information that is given to people at a meeting or other event: Keep the information in your media handout factual and to the point."}