{"id":173384,"name":"hand","type":"noun","us_sound":"hænd","us_link":"../audio/h/hand.mp3","uk_sound":"hænd","uk_link":"../audio/h/ukhallw029.mp3","content":"hand noun\n(BODY PART)\nAdd to word list\nAdd to word list\nA1 [ C ] the part of the body at the end of the arm that is used for holding, moving, touching, and feeling things: by hand All their toys are made by hand. I delivered her invitation by hand (= not using the postal service).get your hands off something informal Get your hands off (= stop touching) my bike!good with your hands He can fix anything - he's so good with his hands.hold someone’s hand You have to hold my hand when we cross the road.hold hands They walked by, holding hands.in your hand Hold your fork in your left hand and your knife in your right hand.in hand She sat, pen in hand (= with a pen in her hand), searching for the right words.keep your hands off someone They can't keep their hands off each other - they never stop kissing and cuddling.shake someone's hand \"Congratulations!\" she said and shook my hand.shake someone by the hand The politican shook every single rally attendee by the hand.shake hands (with) The players from each side lined up and shook hands (with each other).take someone by the hand She took me by the hand and led me into the cave.hand towel Wash hand towels once a week.\ndeepblue4you/E+/GettyImages\nMore examplesFewer examplesThe baby gripped my finger with her tiny hand.Hold the racquet in one hand and the ball in the other.The school provides paper towels for the children to dry their hands on.I've got my hands in my pockets to keep them warm.The teacher asked us to form a circle and join hands.\nSMART Vocabulary: related words and phrases\nThe hand\ncarpal\ncarpometacarpal\ncarpus\ncuticle\ndexterity\ndexterous\nfinger\nfingertip\nknuckle\nleft-handed\nleft-hander\nlittle finger\nmetacarpus\nminimus\nnail\nopposable\npalm\npalmar\nphalangeal\npinkie\nSee more results »\nhand noun\n(CLOCK/WATCH)\n[ C ] one of the long, thin pieces that point to the numbers on a clock or watch: second hand Does anyone have a watch with a second hand?\nOleg Moiseyenko/Moment/GettyImages\nMore examplesFewer examplesThe minute hand is longer than the hour hand.The hands and dial of the watch glow in the dark.The hands on the clock showed the exact time at which the explosion occurred.The watch movement regulates the speed at which the hands move.The hands of the watch are attached to individual gear wheels that turn at specific speeds.\nSMART Vocabulary: related words and phrases\nWatches & clocks\n24-hour clock\nagainst the clock idiom\nalarm\nalarm clock\nat/on the stroke of something idiom\natomic clock\nhorologist\nhorology\nhour hand\nhourglass\njewel\nmilitary time\nquartz\nstroke\ntick\nticking\ntimekeeper\ntimepiece\nturn the clocks back phrase\ntwenty-four-hour clock\nSee more results »\nhand noun\n(CARDS)\n[ C ] a (single part of a) game of cards, or the set of cards that a player has in a game: hand of Who wants to play a hand of poker?deal a hand You dealt me an appalling hand in that game.\nSMART Vocabulary: related words and phrases\nCard games\nall in\nbidding\nblackjack\nbridge\nbusted flush\ncanasta\ncard sharp\ndeal\ndiamond\nhonour\npool\nqueen\nre-raise\nrebid\nrecut\nrookie card\nsolitaire\nspade\nstick\nstraight\nSee more results »\nhand noun\n(ABILITY)\ngood/sure hands\nIf you have good hands, you have the ability to use your hands to do something well: You want a fielder with good hands at shortstop. You can trust a goalie who has sure hands to keep her team in the game.\nSMART Vocabulary: related words and phrases\nSkilled, talented and able\nable\nably\naccomplished\nadept\nadeptly\ndexterous\ndexterously\ndigital native\nexpert\nexpertly\npedicure\npedigreed\npolished\npractised\nproficient\nultra-slick\nup to (doing) something idiom\nwell qualified\nwhite-collar\nwith the best of them idiom\nSee more results »\nhand noun\n(HELP)\nB1 [ S ] help with doing something that needs a lot of effort: [ + -ing verb ] Would you like a hand carrying those bags?give/lend someone a hand (with something) Could you give/lend me a hand (with the table), please?need a hand with I think Matthew might need a hand with his maths homework.use a hand with I could really use a hand with these accounts if you could spare a moment.\nThesaurus: synonyms, antonyms, and examples\nto help someonehelpCan I help you get that?aidThe project is designed to aid poorer countries.assistThe army arrived to assist in the search.collaborateWe collaborated on the project.cooperateSeveral countries are cooperating in the relief effort.benefitThe children have benefited greatly from the new facilities.\nSee more results »\nSMART Vocabulary: related words and phrases\nHelping and co-operating\nabet\naccommodative\naid\nany port in a storm idiom\nassist\nassist with something\nattend\nbridge\ncarry\nfacilitate\nfacilitation\nfinancial assistance\ngive someone a leg up idiom\ngive/lend someone a helping hand idiom\nrecourse\nrelief\nrun errands idiom\nshare a platform idiom\nsponsor\nstart (something) off\nSee more results »\nhand noun\n(PERSON)\n[ C ] a person who does physical work or is skilled or experienced in something: How many extra hands will we need to help with the harvest?factory hand I joined the firm as a factory hand and gradually worked my way up to the top. See also\nfarmhand (WORKER)\n[ C ] a sailor: All hands on deck!\nSMART Vocabulary: related words and phrases\nTypes of employment\nadmin\nadministrative\nadministrative assistant\nadministratively\nat the coalface idiom\njobbing\njobless\njoblessness\njobseeker\nlabour-intensive\nqualified\nrecertify\nredundancy\nredundant\nretcon\nWFH\nwhite-collar\nwho's who idiom\nwilderness years idiom\nwork experience\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople who work on boats & ships\nhand noun\n(INVOLVEMENT)\n[ S ] involvement in or influence over an event: have a hand in It is not thought that terrorists had a hand in the explosion.\nSMART Vocabulary: related words and phrases\nTaking part and getting involved\nactor\nall in\nalong\nattendee\nbe (a) party to something idiom\nconcern\nengagement\ngo in on something\nhat\nhave a horse in the race idiom\nhave skin in the game idiom\nimmerse\nmuscle\nneck\npitch in\nplunge\nplunge in/plunge into something\npunch above your weight idiom\nre-engage\nthick\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPower to control\nhand noun\n(CLAP)\n[ S ] clapping for a performer: give a big hand to So please give a big hand to (= welcome with clapping) your host for the evening, Bill Cronshaw!\nSMART Vocabulary: related words and phrases\nPraising and applauding\nacclaim\nacclamation\naccolade\nadulate\nadulation\ncomplimentary\nenthronement\neulogistic\neulogistically\neulogize\neulogy\nhail\nhonour\novation\npaean\npanegyric\npanegyrical\npanegyrist\nrave\nslap\nSee more results »\nhand noun\n(WRITING)\n[ S ] old use a person's writing: an uneven hand\nSMART Vocabulary: related words and phrases\nWriting & typing\nannotate\nasemic\nbang\nbang something out\nbash something out\nborrow\nborrow something from something\nchart\ndot\ninscribe\nkeyboard\nre-registration\nreadability\nrecompose\nreformulate\nrekey\nsemiotics\nspeller\ntab\ntranscribe\nSee more results »\nhand noun\n(MEASUREMENT)\n[ C ] a unit for measuring the height of a horse up to its shoulder: One hand equals four inches (= 10.16 centimetres).\nSMART Vocabulary: related words and phrases\nHorse riding\nbridle\ncanter\ncinch\ncurry\nendurance rider\nendurance riding\nequestrianism\neventer\ngirth\nhigh-spirited\nhorseman\njib\njodhpurs\nmounted\npony trekking\nrein\nsaddle-sore\nsidesaddle\nsnaffle\nwhip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMiscellaneous units of measurement\nIdioms\nat hand\nat the hands of someone\na game in hand\nget/lay/put your hands on someone\nget/lay/put your hands on something\ngo hand in hand with something\nhand in glove\nhand in hand\nhand over fist\nhand to hand\nMore idioms\nsomeone's hands are tied\nhave your hands full\nhave something in hand\nhave something on your hands\nhold/put your hands up\nin hand\nthe job/matter in hand\nkeep your hand in\nkeep a firm hand on something\nlive (from) hand to mouth\non hand\non the one hand ... on the other hand\nout of hand\nplay into someone's hands\nput your hand in your pocket\na safe pair of hands\ntake someone/something in hand\nwin (something) hands down\nB1 to put something into someone's hand from your own hand: [ + two objects ] The waiter smiled politely as he handed me my bill/handed my bill to me.hand something on (to someone) Please read this memo carefully and hand it on (to your colleagues).\nThesaurus: synonyms, antonyms, and examples\nto give something to someonegiveGive me that dirty plate.offerYour doctor should be able to offer advice.provideThis booklet provides useful information about local services.supplyThe lake supplies the whole town with water.donateFour hundred dollars has been donated to the school book fund.\nSee more results »\nin sports such as football or ice hockey, to catch or hit the ball or puck with the hand, in a way that is against the rules: The player was penalized for handing the ball.\nMore examplesFewer examplesWhen you've finished your work sheets, clip them together and hand them to me.She handed me a business card with her name neatly embossed on it.The waiter handed me the menu with a flourish.She handed me a tissue just as I sneezed.Please would you hand me my coat?\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\nafford\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHitting and beating\nFootball/soccer\nHockey\nIdiom\nhave (got) to hand it to someonePhrasal verbs\nhand something around\nhand something back\nhand something down\nhand something in\nhand off\nhand someone off\nhand something off\nhand something out\nhand something over\nhand something/someone over\nMore phrasal verbs\nhand something round\nhand noun\n(BODY PART)\nAdd to word list\nAdd to word list\n[ C ] the part of the body at the end of the arm that includes the fingers and is used for holding, moving, touching, and feeling things: Keep both hands on the steering wheel. When eating, most Americans hold the fork in their right hand. He took my hand (= held it with his hand) as we walked along.\nhand noun\n(CLOCK)\n[ C ] one of the two long narrow parts on a clock or watch that move to show the time: the hour/minute hand\nhand noun\n(CARDS)\n[ C ] the set of cards that a player is given in a game: a winning/losing hand\nhand noun\n(HELP)\n[ C usually sing ] help with doing something: Can I give you a hand with those bags?\nhand noun\n(WORKER)\n[ C ] a person who does physical work, esp. as one of a team or group: a farm hand\nhand noun\n(CLAPPING)\n[ C usually sing ] a period of clapping to show enjoyment of a performance: Let’s give this band a big hand.\nIdioms\nat hand\nat the hands of someone\nby hand\ngive someone a hand\nhand in hand\nhands down\nhands off (something)\nin good hands\nin hand\nin the hands of someone\nMore idioms\non hand\nhand verb [T]\n(PUT INTO HAND)\nto put something from your hand into someone else’s hand: Would you please hand me a pencil? Phrasal verbs\nhand back something\nhand down something\nhand down something\nhand in something\nhand out something\nhand over something/someone\nAdd to word list\nAdd to word list\n[ C ]\n&#160; WORKPLACE someone employed to do physical work: a factory/farm hand\nhand in hand\nalways happening or being done together: go hand in hand (with sth) Taking too much risk often goes hand in hand with another big mistake - putting all your money into one project.\nworking closely with someone: I see myself working hand in hand with him on this.\nat hand\navailable: Help is at hand for owners of small and growing businesses.\nbeing worked on or dealt with at the present time: He would use his team members' particular experiences and talents to help him attack the problem at hand.\nby hand\nmade or done using your hands rather than a machine: She entered the information into a computer by hand.\ndelivered by a person, rather than sent in the mail: It had been delivered by hand and there was no post mark. See also\nhandmade\nget your hands on sb/sth\ninformal to find or get someone or something you want: She would have to wait days for funds to clear before she could get her hands on the money.\ngood with your hands\nable to make or do things well with your hands: Martin was good with his hands and worked for a time repairing piers at a marina.\nin hand\nalready available or being done: Plans for the restructuring are already in hand.\nin the hands of sb\nbeing dealt with or looked after by a particular person or group of people: leave/put sth in the hands of sb The document is important because it puts the decisions in the hands of management.\ncontrolled or owned by a particular person or group of people: be/lie/rest in the hands of sb The company's future is firmly in the hands of its creditors. The post office in this country is still in the hands of the state.\non hand\navailable and ready to help or be used if necessary: They said he had $7.5 million cash on hand.be on hand to do sth A team of experts is on hand to answer individual problems or questions.\nout of your hands\nno longer able to be controlled by you, or no longer your responsibility: The decision over his future had been taken out of his hands by management.\nput your hand in your pocket UK\nto give money to someone or to a charity: People are more likely to put their hands in their pockets if they know it's for a good cause.\nthe job/matter in hand\nthe job or subject that is important at the present time: He is a consummate professional, very focused on the job in hand.\nto hand UK\nnear and able to be used: Rosco always kept large amounts of cash to hand. See also\nhand in glove\ncash in hand noun\nchange hands\nhandmade\nhold noun\nshake hands\na show of hands"}