{"id":173500,"name":"handle","type":"noun","us_sound":"ˈhæn.dəl","us_link":"../audio/h/handle.mp3","uk_sound":"ˈhæn.dəl","uk_link":"../audio/h/ukhandb022.mp3","content":"handle noun [C]\n(PART)\nAdd to word list\nAdd to word list\nB2 a part of an object designed for holding, moving, or carrying the object easily: a door handle the handle on a suitcase I can't pick the kettle up - the handle's too hot.turn a handle She turned the handle and slowly opened the door.\npbombaert/Moment/GettyImages\nMore examplesFewer examplesI just opened the drawer as usual and the handle came away in my hand.The handle on this door is rather stiff.Slowly, I turned the door handle.I picked it up and the handle broke off.The door handles were made of brass.\nSMART Vocabulary: related words and phrases\nHaving in your hands\nahold\narm\nchokehold\nclasp\nclench\ncling\ncup\ndandle\ngrasp\ngrip\nhand in hand idiom\nhang\nhang on\nhang/hold on like grim death idiom\nhold\nnurse\nonto\npurchase\nseize\ntaken\nSee more results »\nhandle noun [C]\n(NAME)\ninformal a name of a person or place, especially a strange one: That's some handle to go through life with!\ninternet &amp; telecoms\n&#160; specialized, informal a name that someone is known by on the social media website Twitter™ : Twitter handles start with an @ sign. You can follow the team on Twitter under the handle @ManUtd.\nSMART Vocabulary: related words and phrases\nNames and titles\nA.N. Other\nage\naka\nalias\nappellation\nform of address\ngiven name\ngood name\nidentity\nilk\npet name\nplace name\npseudonym\npseudonymity\npseudonymous\ntrademark\nunchristened\nunder the name of idiom\nunidentified\nunnamed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternet terminology\nIdioms\nto get a handle on something\nto have a handle on something\nhandle verb\n(DEAL WITH)\nB1 [ T ] to deal with, have responsibility for, or be in charge of: I thought he handled the situation very well. Some people are brilliant with computers, but have no idea how to handle (= behave with) other people. If you can't handle the job I'll get someone else to do it. Who handles the marketing in your company?\nMore examplesFewer examplesThis is a very delicate situation and it needs to be handled sensitively.Only some of the bank's lending operations are handled directly by the manager.The president has been criticized for the way he has handled the whole affair.The customer services department handles any customer complaints.So far, he seems to be handling the job well, but it's really too soon to judge.\nSMART Vocabulary: related words and phrases\nDealing with things or people\naddressable\napproach\nattend to someone/something\nbe all over it idiom\nbeard the lion (in his/her den) idiom\nbed\ncut\ngrip\nhave it out with someone idiom\nhold\nhold on idiom\nI/I've got this idiom\nill-prepared\nsquare\ntend to someone/something\nto get a handle on something idiom\nto have a handle on something idiom\ntough\ntough something out\nweather\nSee more results »\nhandle verb\n(TOUCH)\nC2 [ T ] to pick something up and touch, hold, or move it with your hands: Always wash your hands before handling food. Please don't handle the vases - they're very fragile.\nSMART Vocabulary: related words and phrases\nTouching & feeling\narm\ndab\nfelt\nfiddle\nfiddle (around) with something\nget to second base idiom\nget to third base idiom\ngraze\nkiss\nnudge\npaw\npet\nretexture\nsecond base\ntactile\ntactilely\ntactility\ntexturally\ntouch\ntoy\nSee more results »\nhandle verb\n(OPERATE)\n[ T ] to operate or control something that could be difficult or dangerous: Have you ever handled a gun before?\n[ I usually + adv/prep ] If a car handles well, it is easy and pleasant to drive.\nSMART Vocabulary: related words and phrases\nControlling and being in charge\naggrandize\nassert your authority\nassume\nassumption\nauthoritative\ncynical\nget the better of someone idiom\nget your hooks into someone/something idiom\nget/fall into the wrong hands idiom\ngovern\nguiding principle\npaternalistic\npaternalistically\nperemptorily\nperemptory\nplay God idiom\ntame\nwhat someone says, goes idiom\nwrangle\nwrangler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOn the road: driving & operating road vehicles\nhandle verb\n(SELL)\n[ T ] to buy and sell goods: We only handle cosmetics that have not been tested on animals.mainly UK He's been arrested for handling stolen goods.\nSMART Vocabulary: related words and phrases\nBuying & selling - general words\nall-you-can-eat\nanti-consumer\nanti-dumping\nback order\nbarter\ndeal in something\ndealership\ndesk research\nebay\neconomic activity\nflood\nhammer\npre-emption\npre-order\nprocurement\nrewards card\nsanctions-busting\nshelf\nstretch\ntender\nSee more results »\nhandle verb [T]\n(TOUCH)\nAdd to word list\nAdd to word list\nto lift something and touch, hold, or move it with your hands: Please handle the old photographs carefully.\nhandle verb [T]\n(DEAL WITH)\nto deal with, have responsibility for, or be in charge of something: Who handles the marketing in your company? Some managers have no idea how to handle people.\nhandle noun [C]\n(TOUCH)\na part of an object designed for holding, moving, or carrying the object: the handle of a shovel I can’t pick the pot up – the handle’s too hot.\nAdd to word list\nAdd to word list\nto deal with something difficult: handle pressure/stress/problems It was a job that taught me how to handle pressure and use it to my advantage.\nto deal with something or someone such as money, goods, or customers: Your financial adviser can handle all the details of purchasing shares.\nto be responsible for organizing or managing something or someone: The office in Europe also handles marketing for the region.\nCOMMERCE to buy and sell goods: We only handle cosmetics which have not been tested on animals.\nCOMMERCE to move or store goods: The distribution company handles around 45 per cent of all the milk produced in the UK. He admitted handling stolen goods.\nto use your hands to move or hold something: Staff are trained and equipped to handle hazardous materials.\nget/have a handle on sth informal\nto understand something or be able to deal with something: By coming in early and staying late she started to get a handle on the problem."}