{"id":173800,"name":"happened","type":"verb","us_sound":"ˈhæp.ən","us_link":"../audio/h/happen.mp3","uk_sound":"ˈhæp.ən","uk_link":"../audio/h/ukhapha005.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nhappen\nhappen verb [I]\n(HAVE EXISTENCE)\nA2 (of a situation or an event) to have existence or come into existence: No one knows exactly what happened but several people have been hurt. Anything could happen in the next half hour. A funny thing happened in the office today. I don't want to think about what might have happened if he'd been driving any faster. happen to someone\nA2 If something happens to someone or something, it has an effect on him, her, or it: I don't know what I'd do if anything happened to him (= if he was hurt, became ill, or died). What happened to your jacket? There's a big rip in the sleeve. What's happened to my pen? (= Where is it?) I put it down there a few moments ago.\nMore examplesFewer examplesIt is frightening to think what might happen if she left him.I cannot predict what will happen next year.I could tell from her expression that something serious had happened.The police showed him a photo to try to jog his memory about what had happened on the night of the robbery.\"Do you remember much about the accident?\" \"No, it all happened so suddenly.\"\nSMART Vocabulary: related words and phrases\nOccurring and happening\nafoot\nasynchronous\nasynchronously\nattend\nattendant\nbe at work idiom\neventuate\nfall into place idiom\nfollow on\ngo hand in hand with something idiom\ngo off\ngo on\ngone\npass\nresynchronize\nroll\nroll around\nshake out\nsucceed\nsupervene\nSee more results »\nhappen verb [I]\n(CHANCE)\nC1 to do or be by chance: [ + to infinitive ] They happened to look (= looked by chance) in the right place almost immediately. [ + (that) ] Fortunately it happened (that) there was no one in the house at the time of the explosion. [ + that ] It just so happens that I have her phone number right here. She happens to like cleaning (= she likes cleaning, although that is surprising). I happen to think he's right (= I do think so, although you do not). As it happened (= although it was not planned), I had a few minutes to spare.\nMore examplesFewer examplesOn Sundays I just wear any old thing that I happen to find lying around.Did she happen to mention whether she would be coming?I just happened to be walking past when he came out of the shop.Jack happens to be a cousin of mine, so I'll introduce you to him.Do you happen to know what time the next bus is due?\nSMART Vocabulary: related words and phrases\nChance and randomness\naccident\naccident of birth\naleatory\narbitrarily\narbitrariness\ncrapshoot\neven-money\nfluke\nfluky\nfortuitous\nluck\nluck into something\nmore by accident than design idiom\nmore by luck than judgment idiom\nnon-purposive\nrandomness\nserendipitous\nserendipitously\nsortition\nstumble into something\nSee more results »\nGrammar\nHappenHappen means ‘occur’ and most commonly ‘occur by chance’: …\nPhrasal verbs\nhappen along/by (somewhere)\nhappen on/upon something/someone"}