{"id":173806,"name":"happy","type":"adjective","us_sound":"ˈhæp.i","us_link":"../audio/h/happy.mp3","uk_sound":"ˈhæp.i","uk_link":"../audio/h/ukhapha010.mp3","content":"happy adjective\n(PLEASED)\nAdd to word list\nAdd to word list\nA1 feeling, showing, or causing pleasure or satisfaction: a happy marriage/childhood She looks so happy. School days are said to be the happiest days of your life. Nicky seems a lot happier since she met Steve.happy to You'll be happy to know that Jean is coming with us. I'm perfectly happy to (= I will willingly) help out.happy (that) I'm so happy (that) everything is working out for you. Barry seems happy enough working for himself.happy about/with Are you happy about/with (= satisfied with) your new working arrangements? Your mother's not going to be very happy when she sees the mess you've made!formal The manager will be happy (= is willing) to see you this afternoon.\nThesaurus: synonyms, antonyms, and examples\nfeeling or showing pleasurehappyI'm much happier in my new job.cheerfulShe's always very cheerful.in a good moodYou're in a good mood this morning!pleasedHe was pleased that she had come back.gladI was so glad to see her.\nSee more results »\nMore examplesFewer examplesChildhood is not always a happy time.If there's anything you don't understand, I'll be happy to explain.They had a long and happy marriage.The staff are not very happy about the latest pay increase.It was clear that he wasn't happy with the arrangements, so I tried to book a different hotel.\nSMART Vocabulary: related words and phrases\nFeeling pleasure and happiness\n(as) pleased as Punch idiom\nASMR\nbe dancing in the streets idiom\nbe floating on air idiom\nbe full of the joys of spring idiom\nchipper\nchirpily\nchirpy\nchuffed\ncontented\ngruntled\nhappily\nhappy camper\nhappy place idiom\njaunty\nself-healing\nshining\nsunnily\nswooning\nswooningly\nSee more results »\nhappy adjective\n(GREETING)\nA1 [ before noun ] (used in greetings for special occasions) full of enjoyment and pleasure: Happy Birthday! Happy Anniversary! Happy New Year!\nMore examplesFewer examplesWe all clinked our glasses together and drank to a happy new year.We wish you a long and happy retirement.The card said 'Happy Anniversary' in big silver letters.Happy Christmas, Mum - this is for you.I didn't even see her to wish her a happy birthday.\nSMART Vocabulary: related words and phrases\nWelcoming, greeting & greetings\nafternoon\nair kiss\naloha\nayup\nbid someone/something adieu\ng'day\ngod\nhello\nhello stranger idiom\nhiya\nhowdy\nlady\nmerry Christmas! idiom\nmind\nmorning\nnamaskar\npleased\npoke\npress the flesh idiom\nwish\nSee more results »\nhappy adjective\n(LUCKY)\n[ before noun ] (of a condition or situation) lucky: happy coincidence We hadn't planned to be in France at the same time as Ann and Charles - it was just a happy coincidence.\nSMART Vocabulary: related words and phrases\nGood luck and bad luck\nalign\nbad/hard/tough luck! idiom\nbe bad luck on someone idiom\nbe down on your luck idiom\nbe in/out of luck idiom\nfortune cookie\nfortune smiles on someone idiom\nget the short end of the stick idiom\ngodsend\ngrace\nmerciful\nmercifully\nmercy\nmiracle\nmisadventure\nstreak\nunlucky\nvoodoo\nwith any luck idiom\nyour luck's in! idiom\nSee more results »\nhappy adjective\n(SUITABLE)\nliterary (of words or behaviour) suitable: It wasn't a happy choice of phrase given the circumstances.\nSMART Vocabulary: related words and phrases\nSuitable and acceptable\nable\nacceptability\nacceptable\nacceptably\naccepted\nconvenience\nconveniently\ncorrectly\ncorrectness\ndecent\ndecently\nfelicity\njust what the doctor ordered idiom\nlegitimate\npractical\nre-eligibility\nre-eligible\nrelevance\nrelevant\nrelevantly\nSee more results »\nIdioms\nthe happy day\nthe happy event\nhappy ever after\nhappy place\nnot be a happy camper\nhappy adjective\n(PLEASED)\nAdd to word list\nAdd to word list\nfeeling, showing, or causing pleasure or satisfaction: To tell the truth, I’ve never been happier in my whole life. People want movies to have happy endings. [ + (that) clause ] I’m happy (that) everything is working out for you. I’ve been very happy with (= satisfied with) the education that my boys have gotten through scouting.\nHappy is used as a polite way to express your willingness to do something: [ + to infinitive ] I’m driving that way and I’d be happy to drop you off at your home. [ + to infinitive ] It was no trouble at all – I was happy to be of help.\nHappy is also used in greetings for special occasions, expressing good wishes: Happy birthday! Happy New Year\nhappy adjective\n(LUCKY)\nlucky: By a happy coincidence, we found ourselves on the same flight. Note: said about a condition or situation Idiom\nnot a happy camper"}