{"id":173848,"name":"harangue","type":"verb","us_sound":"həˈræŋ","us_link":"../audio/h/harangue.mp3","uk_sound":"həˈræŋ","uk_link":"../audio/h/ukhapha012.mp3","content":"Add to word list\nAdd to word list\nto speak to someone or a group of people, often for a long time, in a forceful and sometimes angry way, especially to persuade them: A drunk in the station was haranguing passers-by.\nSMART Vocabulary: related words and phrases\nLecturing & addressing\nad lib\nco-present\ndiscourse\neunoia\nextemporize\nfloor\njawbone\nlead off\nlightning talk\nmonologue\nonto\noratorically\npresentation\nsermon\nsermonize\nspeak\nspeech\nspeechify\ntalk at someone\nvalediction\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTalking angrily\na long and angry speech or piece of writing in which you criticize someone or something or try to persuade someone that you are right: The team was given the usual half-time harangue by the manager.\nMore examplesFewer examplesHe launched into yet another harangue defending his war policy. Long before its 90 minutes have concluded you may be wishing for a commercial break, or at least a visit from a celebrity guest, to interrupt the stream of angry harangues.The novel is more than a harangue about the degradation of air travel. The rest of the preface is a harangue on alphabet reform. It was one of those tedious, interminable harangues about the wrong-doings of England.\nSMART Vocabulary: related words and phrases\nTalking angrily\nbite\nbite someone's head off idiom\nbite/snap someone's head off idiom\nbluster\nblusteringly\ndress\ndress down\nedge\nfling\nhue\nhuff\ninvective\njump\npiece\nrant\nspit\nspit blood/venom idiom\nstorm\ntongue-lashing\nupbraid\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLecturing & addressing\nAdd to word list\nAdd to word list\nto speak to someone or a group of people, often for a long time, in a forceful and sometimes angry way, esp. to persuade them or to express disapproval: He harangued the class for half an hour about not paying attention. harangue noun [ C ] us\nYour browser doesn't support HTML5 audio\n/həˈræŋ/\nThe coach delivered his regular half-time harangue to the team."}