{"id":174005,"name":"hardware","type":"noun","us_sound":"ˈhɑːrd.wer","us_link":"../audio/h/hardware.mp3","uk_sound":"ˈhɑːd.weər","uk_link":"../audio/h/ukhardw001.mp3","content":"hardware noun [U]\n(COMPUTER)\nAdd to word list\nAdd to word list\nB1 the physical and electronic parts of a computer, rather than the instructions it follows Compare\nsoftware\nExamples\nMuch of our existing military hardware is obsolescent.The machine allows multitasking without the need to buy extra hardware.The thieves stole thousands of pounds worth of computer hardware.The cost of computer hardware has fallen in the last ten years.All the old hardware has been dumped into a skip.\nSMART Vocabulary: related words and phrases\nComputer hardware\n3-D printer\nassociative memory\nblackberry\nbrick\nbubblejet\nconsole\ndata projector\nelectronic organizer\nflat screen\nhard drive\nmainframe\nmicrochip\nmicroprocessor\nnumber pad\noptical character reader\noptical reader\noptically\npalmtop\npatch\nplug and play\nSee more results »\nhardware noun [U]\n(TOOLS)\nmetal tools, materials, and equipment used in a house or a garden, such as hammers, nails, and screws\nSMART Vocabulary: related words and phrases\nTools in general\naid\nambidextrous\nblade\nblaster\ncontrivance\ncutter\ndevice\nfan\ngadget\ngrabber\ninstrument\nmachine tool\npower tool\nprecision instrument\nspacer\nspreader\ntoolbox\ntoolkit\nutensil\nutility belt\nSee more results »\nhardware noun [U]\n(MILITARY)\ninformal equipment, especially if it is for military use or if it is heavy\nSMART Vocabulary: related words and phrases\nMachines - general words\n3-D printer\nanimatronic\nautomated\nautomation\nbackhoe\nchuck\ncoffee machine\nconvenience\ncrankshaft\nflywheel\nHeath Robinson\nhumanoid\nmill\nshredder\nstump grinder\nsupersensitivity\nsynchrotron\ntabulator\nteleprompter\nwater cooler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArms & munitions in general\nhardware noun [U]\n(TOOLS)\nAdd to word list\nAdd to word list\nmetal objects, materials, and equipment, such as tools: a hardware store\nhardware noun [U]\n(COMPUTER)\nthe physical and electronic parts of a computer, rather than the instructions it follows\nAdd to word list\nAdd to word list\nIT the physical and electronic parts of a computer or other piece of equipment, rather than its software: The growth of the computer and consumer electronics industries is driven by a steady stream of advances in both hardware and software. Its primary product is networking hardware.\nmetal tools, materials, and equipment, such as hammers and nails: Environmental protection has increasingly affected the production of building materials and hardware. If we make it easier for the hardware stores to sell our products, that helps us.\nequipment, especially for industrial or military use: The company's principal lines of business are air compressors, architectural hardware products, and construction equipment. The modern-day battlefield is more congested than ever before with aircraft and military hardware."}