{"id":173978,"name":"hardly","type":"adverb","us_sound":"ˈhɑːrd.li","us_link":"../audio/h/hardly.mp3","uk_sound":"ˈhɑːd.li","uk_link":"../audio/h/ukhapha027.mp3","content":"hardly adverb\n(ONLY JUST)\nAdd to word list\nAdd to word list\nB1 only just; almost not: can hardly I could hardly hear her at the back. The party had hardly started when she left. He hardly ate anything/He ate hardly anything.hardly ever We hardly ever (= almost never) go to concerts. Hardly had a moment passed before the door creaked open.\nMore examplesFewer examplesIt's so airless in here - I can hardly breathe.Hardly anyone turned up for the party.The instructions are printed so small I can hardly read them.\"Where's Mikey?\" \"How should I know? He's hardly ever in the office these days.\"I hardly watch any television, apart from news and current affairs.\nSMART Vocabulary: related words and phrases\nMerely and barely\nall\nall of something idiom\nat a pinch idiom\nbarely\nbut\nby a whisker idiom\nby inches idiom\nill\ninch\njust\nlittle\nmere\nmerely\nmerest\nnarrowly\nnothing more than idiom\nonly\nscarce\nscarcely\nwhisker\nSee more results »\nhardly adverb\n(CERTAINLY NOT)\nB2 certainly not: can hardly You can hardly expect a pay rise when you've only been working for the company for two weeks! Well don't be angry with me - it's hardly my fault that it's raining!\nMore examplesFewer examplesIt's a policy that was hardly calculated to win votes.Her worldly success can hardly be denied.I had hoped for a little more from the world's greatest tenor, whose performance was workmanlike but hardly inspired.He had a few tufts of hair on his chin, but you could hardly call it a beard.It's hardly not surprising (that) you're putting on weight, considering how much you're eating.\nSMART Vocabulary: related words and phrases\nYes, no & not\na sure thing idiom\naffirmation\naffirmatively\nain't\nbetcha\nbit\ndidn't\ndis\ndoes a bear/do bears shit in the woods? idiom\nfar\nno way idiom\nnot that idiom\nopposed\nslight\nsure\nwasn't\nweren't\nwon't\nwouldn't be seen dead idiom\nyes\nSee more results »\nGrammar\nHardlyHardly is an adverb. …\nHardly ever, rarely, scarcely, seldomHardly ever, rarely, scarcely and seldom are frequency adverbs. We can use them to refer to things that almost never happen, or do not happen very often. They have a negative meaning. We use them without not. Rarely, scarcely and seldom are more common in writing than in speaking: …\nhardly adverb [not gradable]\n(ONLY JUST)\nAdd to word list\nAdd to word list\nonly just or almost not: Hardly a day passes that I don’t think about it. You’ve hardly eaten anything. Something is wrong with the phone – I can hardly hear you. I can hardly wait for your visit. We hardly ever see them anymore.\nhardly adverb [not gradable]\n(CERTAINLY NOT)\ncertainly not: It’s hardly surprising that he was angry."}