{"id":173924,"name":"hardcore","type":"adjective","us_sound":"ˌhɑːrdˈkɔːr","us_link":"../audio/h/eus13176.mp3","uk_sound":"ˌhɑːdˈkɔːr","uk_link":"../audio/h/ukcld00634.mp3","content":"hardcore adjective\n(EXTREME)\nAdd to word list\nAdd to word list\n(of a person) having a very strong belief or interest in something or a lot of determination to do it, sometimes to a degree that most people would consider unreasonable or unacceptable: A hardcore faction within the group is thought to have carried out the bombings. We want to develop games that have a broader appeal beyond hard-core gamers. The team is pretty hardcore, even practising in the snow.\nhaving extreme qualities that are attractive to people with a very strong belief or interest in something or a lot of determination to do it: Hardcore activism is their mission. Their sound is hard-core punk.\nMore examplesFewer examplesAs more people quit smoking, the only people left are hard-core smokers who need more help.He has strong principles; he's hard core.Hardcore comic fans often have mixed feelings about superhero movies.There are some hard-core renters who never intend to buy a home, because they enjoy the freedom of being a tenant.More daring campers can go on an assault course or mini quad-bike, or for less hardcore activities, try horse riding or fishing.The police are determined to tackle the problem of hard-core drug abuse in the city.To remain hardcore the club had to close and reopen under a new name.\nSMART Vocabulary: related words and phrases\nPassionate or passing interests\ncentrism\ncraze\ncult\ncultish\ncultishly\ndrug\neat\neat, sleep, and breathe something idiom\nfad\nfaddish\nfaddism\nfancy\ngeekery\nkick\nmania\npassion\npassion project\nreligion\nruling\nsomeone's ruling passion idiom\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: very & extreme\nReligious people: believers & non-believers\nhardcore adjective\n(SEX)\nshowing sexual acts clearly and in detail: hardcore pornography Compare\nsoft-core\nhardcore noun\n(SMALL GROUP)\n[ S, + sing/pl verb ] (also hard core, hard-core) a small group of people within a larger group, who have a very strong belief or interest in something or a lot of determination to do it, even if most other people consider this unreasonable or unacceptable: The hard core of the party has not lost sight of the original ideals. A hard-core of drivers still persistently drive when drunk. There was a hardcore who came to the festival mostly to fight.\nMore examplesFewer examplesChange was repeatedly blocked by a hard core of unelected conservatives.This compromise is likely to be rejected by the anarchist hard core.This is a musical event that used to be ignored by everyone except the hardcore.\nSMART Vocabulary: related words and phrases\nPassionate or passing interests\ncentrism\ncraze\ncult\ncultish\ncultishly\ndrug\neat\neat, sleep, and breathe something idiom\nfad\nfaddish\nfaddism\nfancy\ngeekery\nkick\nmania\npassion\npassion project\nreligion\nruling\nsomeone's ruling passion idiom\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: very & extreme\nReligious people: believers & non-believers\nhardcore noun\n(FOR BUILDING)\n[ U ] mainly UK pieces of broken stone, brick, etc. used to make the base under a floor, path, or road: The ash from the incinerators is recycled as hardcore for construction. The lorries brought in hard core to lay the roads.\nMore examplesFewer examplesAbout 20 inches of the concrete pipes extend into the hardcore.The paving stones were going to be be broken up and used as hard-core for new roads.\nSMART Vocabulary: related words and phrases\nBuilding materials\nadobe\nagglomerate\nairbrick\nasphalt\nbamboo\ndrywall\nfibro\nflagged\nflagstone\nflitch\nlacquer\npaving\nprestressed\nputty\nrazor wire\nrebar\nunreinforced\nwattle\nwattle and daub\nweatherboarding\nSee more results »\nhardcore noun\n(MUSIC)\n[ U ] (also hard-core, hard core) (also hardcore punk) a type of extremely fast, loud punk music (= fast, loud, sometimes offensive music that was popular in the late 1970s), often with angry political lyrics (= words): We were inspired by early 80s hardcore. We play with more sophistication than the heavy-metal, punk, and hard-core bands we listened to in our youth.\nMore examplesFewer examplesA friend got me into punk rock and hard-core, and I started playing guitar.He liked hard core, but the band he played in was pop-punk.He was in the hardcore band Intense Youth.They were playing that pounding hardcore punk of theirs.The Beastie Boys played hardcore punk, meandering jazz-funk and 1980s metal.\nSMART Vocabulary: related words and phrases\nPop, rock & soul\nagit-pop\nanti-rock\nbacking dancer\nbacking singer\nbackspin\ndisc jockey\nDJ\ndrum and bass\nelectronica\nemo\njukebox\nK-pop\nlyrically\nmod\nMotown\nNew Age music\nsampler\ntop ten\ntrap music\ntrip-hop\nSee more results »"}