{"id":174127,"name":"harmonic","type":"adjective","us_sound":"hɑːrˈmɑː.nɪk","us_link":"../audio/h/usharmo001.mp3","uk_sound":"hɑːˈmɒn.ɪk","uk_link":"../audio/h/ukhardw022.mp3","content":"Add to word list\nAdd to word list\nrelating to harmony (= a pleasant musical sound made by different notes being played or sung at the same time): Jazz pioneer Ornette Coleman was a harmonic and melodic innovator. harmonic complexity\nmusic\n&#160; specialized consisting of a special note that sounds when a musical note is played that is different from the main note: The calls are of such a low frequency that they are inaudible to the human ear; we can hear only the accompanying harmonic tones.\nphysics\n&#160; specialized relating to the harmonics in an oscillation or wave: They developed a control system for detecting harmonic oscillation in a chemical mechanical polishing process.\nMore examplesFewer examplesThe composer restricts himself to a fairly narrow harmonic and rhythmic palette.Jazz instrumentalists are known for their feats of melodic and harmonic invention and technical virtuosity.Dissonant harmonic clashes heighten the expressive power of the piece.The ancient Greeks realized that the harmonic intervals of their musical system reflected fundamental mathematical proportions.\nSMART Vocabulary: related words and phrases\nTechnical music terms\naccidental\nadagio\naleatory\nantiphonal\narpeggio\narr.\ncadence\ngiusto\nglide\ngroove\nharmonic progression\nharmony\nkey signature\nlegato\nsyncopation\ntempered\ntempo\ntimbre\ntime signature\ntonal\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysics in general\nmusic\n&#160; specialized a special note that sounds when a musical note is played that is different from the main note: The overtones and harmonics create a very rich sound. As with any guitar string, there is the fundamental and the harmonics. Compare\nfundamental\novertone\nphysics\n&#160; specialized one of the frequencies (= numbers of waves produced in a fixed period) in an oscillation (= a regular change in a wave or electric current) or wave: A single frequency with its harmonics progressively broadens when the discharge current is increased.\nMore examplesFewer examplesThese harmonics generate a sound somewhere between a roar and a musical chord.He had a way of playing harmonics on his guitar in which the sound had an ethereal quality.A complex sound has, in addition to the fundamental frequency, overtones or upper harmonics. In the first movement, the oscillations contain both fundamental tones and harmonics.\nSMART Vocabulary: related words and phrases\nTechnical music terms\naccidental\nadagio\naleatory\nantiphonal\narpeggio\narr.\ncadence\ngiusto\nglide\ngroove\nharmonic progression\nharmony\nkey signature\nlegato\nsyncopation\ntempered\ntempo\ntimbre\ntime signature\ntonal\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysics in general"}