{"id":174140,"name":"harmoniously","type":"adverb","us_sound":"hɑːrˈmoʊ.ni.əs.li","us_link":"../audio/h/usharmo002.mp3","uk_sound":"hɑːˈməʊ.ni.əs.li","uk_link":"../audio/h/ukhardw026.mp3","content":"harmoniously adverb\n(pleasantly)\nAdd to word list\nAdd to word list\nin a friendly and peaceful way: We worked together very harmoniously. In Ethiopia, Muslims and Christians live harmoniously together.\nin a way in which things look, taste, or work well together: All the flavours blend harmoniously in this wonderful dish. The church harmoniously combines Romanesque towers and nave with Gothic steeples, choir, and chancel.\nMore examplesFewer examplesDemocrats don't always coexist harmoniously.It is an example of how power companies can work harmoniously with the environment. This cream works harmoniously with the skin.There are few pleasures as sweet as that derived from a harmoniously created garden.\nSMART Vocabulary: related words and phrases\nFriendly\naffability\naffable\naffably\naffiliative\nagreeableness\nconversable\nconvivial\nconviviality\nconvivially\ncordial\nhospitably\nhospitality\ninseparable\nintimacy\nsugar and spice idiom\nsweet-natured\nsweet-tempered\nsweetness\nthe human touch\ntogetherness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCalm and relaxed\nBalance and imbalance\nharmoniously adverb\n(music)\nin a way that has a pleasant tune or harmony: Young and old sang harmoniously together. He has a voice that blends harmoniously with pop instrumentation.\nMore examplesFewer examplesViolin music swelled harmoniously on the hi-fi.In music we have the perfect model of contrasting voices working together harmoniously.Cristina Nassif's rich and robust soprano blended harmoniously with the masculine baritone of Michael Todd Simpson.\nSMART Vocabulary: related words and phrases\nDescribing qualities of sound\naudibly\nboomy\nchocolatey\nchuff\nclomp\ncrackling\near-splitting\nmellifluously\nmelodically\nmelodiously\nmetallically\nmurmurous\nraucous\nsilvery\nstaccato\ntextured\nthready\ntinnily\ntunefully\ntunefulness\nSee more results »\nSee\nharmonious"}