{"id":174098,"name":"harm","type":"noun","us_sound":"hɑːrm","us_link":"../audio/h/harm.mp3","uk_sound":"hɑːm","uk_link":"../audio/h/ukhardw015.mp3","content":"Add to word list\nAdd to word list\nB2 physical or other injury or damage: Both deny conspiring to cause actual bodily harm.do something harm A mistake like that will do his credibility a lot of harm.do someone harm Missing a meal once in a while never did anyone any harm.(there's) no harm in You could always ask Jim if they need any more staff in his office - (there's) no harm in asking (= no one will be annoyed and you might benefit).mean no harm She meant no harm (= did not intend to offend) - she was only joking.come to harm She was frightened by the experience but she came to no harm (= was not hurt).\nMore examplesFewer examplesThere's no harm in applying for other jobs, but if I were you, I wouldn't advertise the fact at work.Huge projects designed to aid poorer countries can sometimes do more harm than good.I'm sure he's well-intentioned - he wouldn't mean any harm.Modernizing historic buildings can often do more harm than good.Should any harm befall me on my journey, you may open this letter.\nSMART Vocabulary: related words and phrases\nDamaging and spoiling\nadulterate\nadulterated\nadulteration\napplecart\nat-risk\nbutcher\neat\neat away at something\nerode\nflaw\nfoul\nfoul (something) up\ngloss\nrain on someone's parade idiom\nrampage\nravage\nravages\nruin\nsour\nwreck\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInjuring and injuries\nIdioms\ndo more harm than good\nno harm no foul\nout of harm's way\nB2 to hurt someone or damage something: Thankfully no one was harmed in the accident. The government's reputation has already been harmed by a series of scandals.\nMore examplesFewer examplesResearch shows that it is not divorce per se that harms children, but the continuing conflict between parents.The oil that discharged into the sea seriously harmed a lot of birds and animals.She only buys dolphin-friendly tuna fish that is caught without harming dolphins.If you harm her, you're going to have the police to reckon with.He claims that the report has harmed his reputation.\nSMART Vocabulary: related words and phrases\nDamaging and spoiling\nadulterate\nadulterated\nadulteration\napplecart\nat-risk\nbutcher\neat\neat away at something\nerode\nflaw\nfoul\nfoul (something) up\ngloss\nrain on someone's parade idiom\nrampage\nravage\nravages\nruin\nsour\nwreck\nSee more results »\nIdiom\nharm a hair on someone's head\nAdd to word list\nAdd to word list\nphysical or other injury or damage: Missing a meal once in a while won’t do you any harm. Fortunately, she didn’t come to any harm when the car skidded. Maybe Jim can help you – there’s no harm in asking (= no one will be annoyed and you might benefit). harm verb [ T ] us\nYour browser doesn't support HTML5 audio\n/hɑrm/\nThe tornado blew out the windows of a nearby school, but none of the children were harmed. harmful adjective us\nYour browser doesn't support HTML5 audio\n/ˈhɑrm·fəl/\nThis group of chemicals is known to be harmful to the environment.\nAdd to word list\nAdd to word list\ndamage done to something: The board failed to prove irreparable harm in its suit against the council. The harms associated with climate change are serious and well recognized.not do (any) harm to sb/sth The bond offers great benefits for issuers without doing any harm to investors. economic/environmental/financial harm\ndo more harm than good\nused to say that an action is not helpful and could make a situation worse: Suspending payments on government debts would do more harm than good.\nto damage something or make something worse: harm the economy/environment/country Economists warned that such a spending pattern could not be sustained without harming the economy. harm business/industry"}