{"id":174123,"name":"harmony","type":"noun","us_sound":"ˈhɑːr.mə.ni","us_link":"../audio/h/harmony.mp3","uk_sound":"ˈhɑː.mə.ni","uk_link":"../audio/h/ukhardw030.mp3","content":"harmony noun\n(MUSIC)\nAdd to word list\nAdd to word list\nC2 [ C or U ] a pleasant musical sound made by different notes being played or sung at the same time: in harmony The choir sang the last verse in harmony. It is a simple melody with complex harmonies.\nMore examplesFewer examplesIt's thrilling to hear the four-part harmony, with the voices perfectly balanced.We need a few people in the congregation to sing the harmonies and not just the simple hymn tune.She played the tune on the flute and I did some harmonies on the piano.The modern generation of composers discarded traditional ideas of melody and harmony.His music is known for its clashing discords, but at the end of this piece he gives us a rare passage of pure harmony.\nSMART Vocabulary: related words and phrases\nTechnical music terms\naccidental\nadagio\naleatory\nantiphonal\narpeggio\narr.\ncadence\ngiusto\nglide\ngroove\nharmonic\nharmonic progression\nkey signature\nlegato\nsyncopation\ntempered\ntempo\ntimbre\ntime signature\ntonal\nSee more results »\nharmony noun\n(MATCH)\nB2 [ U ] a situation in which people are peaceful and agree with each other, or when things seem right or suitable together: racial harmony (= good feelings between different races) domestic harmony (= good feelings in the family or home)in (perfect) harmony Imagine a society in which everyone lived together in (perfect) harmony.in harmony with We must ensure that tourism develops in harmony with the environment.\nSMART Vocabulary: related words and phrases\nBalance and imbalance\naccord with something\nalign\naxisymmetric\nbalance (something) out/up\nbalance of power\nharmonious\nharmonization\nharmonize\nimbalance\nin accord with someone/something\ninharmonious\nnonequilibrium\noff balance\non an even keel idiom\none man's loss is another man's gain idiom\nout of alignment\nunbalance\nunharmonious\nwell balanced\nwell rounded\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFriendly\nCalm and relaxed\nharmony noun\n(MUSIC)\nAdd to word list\nAdd to word list\n[ C/U ]\n&#160; music notes that are played or sung with the main tune and that make the piece more complicated and interesting\nharmony noun\n(AGREEMENT)\n[ U ] agreement of ideas, feelings, or actions, or a pleasing combination of different parts: He imagined a society in which all races lived together in harmony.\n[ U ]\n&#160; art Harmony is the combination of separate but related parts in a way that uses their similarities to bring unity to a painting, drawing, or other art object.\nAdd to word list\nAdd to word list\nthe situation in which people live or work happily together without any big problems: social/racial/political harmony"}