{"id":174157,"name":"harmonization","type":"noun","us_sound":"ˌhɑːr.mə.nəˈzeɪ.ʃən","us_link":"../audio/h/usharmo004.mp3","uk_sound":"ˌhɑː.mə.naɪˈzeɪ.ʃən","uk_link":"../audio/h/ukhardw028.mp3","content":"harmonization noun\n(matching)\nAdd to word list\nAdd to word list\n[ U ] the act of making different people, plans, situations, etc. suitable for each other, or the result of this: What is needed is a harmonization of regulations. The Grocery Manufacturers of America wants a harmonization of standards for imported food.\nMore examplesFewer examplesThere should be some degree of harmonization with our European trading partners.They believe in a harmonization with nature.Efforts continued to establish a harmonization of European accounting practices.\nSMART Vocabulary: related words and phrases\nBalance and imbalance\naccord with something\nalign\naxisymmetric\nbalance (something) out/up\nbalance of power\nharmonious\nharmonize\nharmony\nimbalance\nin accord with someone/something\ninharmonious\nnonequilibrium\noff balance\non an even keel idiom\none man's loss is another man's gain idiom\nout of alignment\nunbalance\nunharmonious\nwell balanced\nwell rounded\nSee more results »\nharmonization noun\n(music)\n[ U or C ] the act of adding harmonies to a tune, or the result of this: They'd found a way to make this beautiful Arabic music with lush harmonization. Bolero's melodic harmonizations\nMore examplesFewer examplesIn our music, we don't have harmonisation. Bach's harmonizations are immeasurably more intense.\nSMART Vocabulary: related words and phrases\nWriting, reading & studying music\nanti-musical\nbar\ncanonical\ncompose\ncomposition\ncompositional\nmusically\nmusicologist\nmusicology\nnon-musical\norchestrate\nreorchestration\nrescore\nself-composed\nsheet music\nsight-read\ntranspose\ntransposition\nuncanonical\nunmusical\nSee more results »\nSee\nharmonize\nAdd to word list\nAdd to word list\nthe act of making systems or laws the same or similar in different companies, countries, etc. so that they can work together more easily: global/international/tax harmonization Export companies are calling for a harmonization of regulations between America and the European Union.\nHR the process of giving all employees within a company the same rights and using the same rules for deciding pay, hours, etc."}