{"id":174176,"name":"harness","type":"noun","us_sound":"ˈhɑːr.nəs","us_link":"../audio/h/harness.mp3","uk_sound":"ˈhɑː.nəs","uk_link":"../audio/h/ukharne001.mp3","content":"Add to word list\nAdd to word list\na piece of equipment with straps and belts, used to control or hold in place a person, animal, or object: a safety harness a baby harness a parachute harness\nSMART Vocabulary: related words and phrases\nCords, ropes, cables & string\nbell pull\nbowline\nbungee\ncable\ncatgut\ncord\nfibre\nflex\nhalter\nhalyard\nlandline\nlanyard\nlariat\nlasso\nrein\nshackles\nshock cord\nstringed\nstringy\ntether\nSee more results »\nIdioms\nbe back in harness\nin harness with\nto put a harness on a horse, or to connect a horse to a vehicle using a harness\nto control something, usually in order to use its power: There is a great deal of interest in harnessing wind and waves as new sources of power.\nSMART Vocabulary: related words and phrases\nFastening and tying\nanchor\nbale\nbe locked together idiom\nbelay\nboard something up\nbolt\nbound\nbowline\nhalf hitch\nhobble\nhogtie\nknotted\nligature\nstake\nstrap something up\nstrop\ntack\ntape something up\ntether\ntie someone down\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nControlling and being in charge\nAdd to word list\nAdd to word list\na piece of equipment, including straps for fastening it, used to control an animal such as a horse or attach it to a load to be pulled, or a set of straps used to hold a person in place: a horse’s harness a parachute harness\nto put a harness on an animal or a person: He harnessed the baby into her car seat. The dam harnesses water power (= controls and uses it) to generate electricity.\nAdd to word list\nAdd to word list\nto collect and control something so that it can be used effectively: harness energy/ideas/skills Organizations need to harness the skills and knowledge of people who are retired or unemployed.harness the power of sth Plans to help developing countries harness the power of technology are important in the fight against global warming."}