{"id":174290,"name":"harshness","type":"noun","us_sound":"ˈhɑːrʃ.nəs","us_link":"../audio/h/harshness.mp3","uk_sound":"ˈhɑːʃ.nəs","uk_link":"../audio/h/ukharne016.mp3","content":"harshness noun [U]\n(UNKIND)\nAdd to word list\nAdd to word list\nthe quality of being unkind or severe: the harshness of the punishment The harshness of the Canadian winter took them by surprise.\nMore examplesFewer examplesThe harshness of the sentence appears out of proportion to the gravity of the offense.His speech was striking for the harshness of the criticism he leveled at corporate executives.The depth of feeling on all sides has on occasions introduced a degree of harshness and a lack of charity.\nSMART Vocabulary: related words and phrases\nUnkind, cruel & unfeeling\nacerbic\nacerbically\nacerbity\nacidly\nanti-cruelty\ncold-heartedly\ncruel\ncruelly\ncruelty\ncutthroat\nmeanness\nmental cruelty\nmerciless\nmercilessly\nmordant\ntrenchant\ntrenchantly\nuncharitable\nuncharitably\nunchristian\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSevere\nharshness noun [U]\n(OF SOUND, LIGHT)\nthe quality of being too strong, bright, loud, etc.: Plants around the room eased the harshness of the colours. Her photographs captured perfectly the harshness of the light and the dry, barren landscape of the hills.\nMore examplesFewer examplesHe uses the harshness of fluorescent lights to heighten the sense of discomfort.After the wine receives more air, it loses its harshness and becomes softer and lighter.Clouds of smoke still hung over the town and filtered some of the harshness from the light.\nSMART Vocabulary: related words and phrases\nThe qualities of colour\nanalogous\nbrightly\nbrightness\ncolourful\ncolourfully\ndarkness\nfluorescent\nharsh\nlurid\nnon-complementary\nnon-fluorescent\nnon-yellowing\nover-bright\npastel\nprismatic\nvibrantly\nviolent\nvivid\nvividly\nvividness\nSee more results »\nSee\nharsh\nAdd to word list\nAdd to word list\nthe quality of being cruel or unkind: the harshness of the punishment\nthe quality of being severe or unpleasant: We weren’t aware of the harshness of our condition."}