{"id":174337,"name":"harvest","type":"noun","us_sound":"ˈhɑːr.vəst","us_link":"../audio/h/harvest.mp3","uk_sound":"ˈhɑː.vɪst","uk_link":"../audio/h/ukharne018.mp3","content":"Add to word list\nAdd to word list\nB2 the time of year when crops are cut and collected from the fields, or the activity of cutting and collecting them, or the crops that are cut and collected: the grain/potato/grape harvest We had a good harvest this year.bumper harvest Farmers are reporting a bumper (= very big) harvest this year. It won't be long now till harvest (time).\nMore examplesFewer examplesWith the harvest finished, I was able to relax with an easy mind/conscience.The drought has made farmers anxious about the harvest.How many extra hands will we need to help with the harvest?The long hot summer has led to a record harvest this year.This year's harvest was one of the most successful since the record crop of 1985.\nSMART Vocabulary: related words and phrases\nFarming - general words\nagroecology\nagroforestry\nbiodynamic\nbiodynamics\nfarming\ngrain\nhomestead\nhydroponically\ninorganically\nlandrace\nmaincrop\nmonoculture\nreap\nterrace\nthe Agrarian Revolution\nuntillable\nuntilled\nvertical farming\nwater stress\nwater-stressed\nSee more results »\nharvest verb\n(FOOD)\n[ I or T ] to pick and collect crops, or to collect plants, animals, or fish as food: In the US, winter wheat is harvested in the early summer. By the end of the year, growers in the state will have harvested 1.8 million barrels of fruit. About 30 million pounds of red snapper are harvested from US waters every year. Farmers sort the vegetables when they harvest.\nMore examplesFewer examplesHe estimated that because of the dry weather he would not harvest a third of his fields.The islanders used to harvest nesting birds and their eggs by scaling the 1,400 foot cliffs.\nSMART Vocabulary: related words and phrases\nFarming - general words\nagroecology\nagroforestry\nbiodynamic\nbiodynamics\nfarming\ngrain\nhomestead\nhydroponically\ninorganically\nlandrace\nmaincrop\nmonoculture\nreap\nterrace\nthe Agrarian Revolution\nuntillable\nuntilled\nvertical farming\nwater stress\nwater-stressed\nSee more results »\nharvest verb\n(SUBSTANCE)\n[ T ] to take or collect a useful substance, for example water or a chemical element, from somewhere so that it can be used: Hydrogen and oxygen could be harvested from the frozen water reserves. We use harvested rainwater for most of our cooking.\nMore examplesFewer examplesOn the moon, water ice, oxygen, hydrogen, and maybe even nitrogen could be harvested as resources to supply a moon base with air and water.One proposal is to allow companies to install solar panels and sell the energy they harvest to residents.\nSMART Vocabulary: related words and phrases\nCollecting and amassing\naccumulate\nagglomerate\naggregation\namass\nassemble\ncompile\ncompiler\ncompletism\ncompletist\ncompost\nconcentrate\ncumulate\nfundraise\nfundraising\nmarshal\npiece something together\nput something together\nrake something up\nreassemble\nreconcentrate\nSee more results »\nharvest verb\n(BODY PARTS)\n[ T ] to take cells or other body parts from someone for medical use: The donor organ is harvested at the accident scene and rushed to a hospital. Stem cells harvested from cord blood have been used to successfully treat dozens of serious illnesses.\nSMART Vocabulary: related words and phrases\nCollecting and amassing\naccumulate\nagglomerate\naggregation\namass\nassemble\ncompile\ncompiler\ncompletism\ncompletist\ncompost\nconcentrate\ncumulate\nfundraise\nfundraising\nmarshal\npiece something together\nput something together\nrake something up\nreassemble\nreconcentrate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCells\nMedical treatment: surgery\nharvest verb\n(INFORMATION)\n[ T ] to collect large quantities of information, especially automatically: The ministry will not harvest data about salaries, sexual orientation, or country of origin for foreigners. Unauthorized use of personal information harvested from social networks is likely to anger potential customers.\nSMART Vocabulary: related words and phrases\nCollecting and amassing\naccumulate\nagglomerate\naggregation\namass\nassemble\ncompile\ncompiler\ncompletism\ncompletist\ncompost\nconcentrate\ncumulate\nfundraise\nfundraising\nmarshal\npiece something together\nput something together\nrake something up\nreassemble\nreconcentrate\nSee more results »\nharvest verb\n(ADVANTAGE)\n[ T ] to get an advantage or something valuable from a situation: He could harvest considerable political capital out of this incident. The only winners here seem to be the large, for-profit corporations who harvest profits from schools.\nSMART Vocabulary: related words and phrases\nCollecting and amassing\naccumulate\nagglomerate\naggregation\namass\nassemble\ncompile\ncompiler\ncompletism\ncompletist\ncompost\nconcentrate\ncumulate\nfundraise\nfundraising\nmarshal\npiece something together\nput something together\nrake something up\nreassemble\nreconcentrate\nSee more results »\nRelated word\nharvesting\nAdd to word list\nAdd to word list\nthe activity or time of gathering a crop, or a crop that is gathered: [ U ] We picked the corn that had been missed during harvest. [ C ] He had a large garden and loved to share his harvest with others. harvest verb [ I/T ] us\nYour browser doesn't support HTML5 audio\n/ˈhɑr·vəst/\n[ T ] They couldn’t get anyone to harvest their crop.\nAdd to word list\nAdd to word list\nINTERNET, MARKETING to collect information about people, products, companies, etc. from the internet using a search engine (= a program that searches for particular words in documents on websites): In computer jargon, search engines use robotic spiders - special software programs - that crawl continuously along the myriad trails of the World Wide Web, harvesting documents as they go.\nENVIRONMENT to collect a natural resource in order to use it effectively: Harvesting rainwater offers many advantages: it conserves municipal and well water and it is free."}