{"id":174593,"name":"haul","type":"verb","us_sound":"hɑːl","us_link":"../audio/h/hall.mp3","uk_sound":"hɔːl","uk_link":"../audio/h/ukhairp020.mp3","content":"Add to word list\nAdd to word list\nC2 to pull something heavy slowly and with difficulty: They hauled the boat out of the water.haul yourself up She hauled herself up into the tree.\nThesaurus: synonyms, antonyms, and examples\nto pull somethingpullPull your chair over here so you can see the screen. dragShe dragged the canoe down to the water.haulThey hauled the boat out of the water.towYou shouldn't drive fast when your car is towing a trailer.yankShe marched to the door and yanked it open.wrenchThe phone had been wrenched from the wall.\nSee more results »\nto take something or someone somewhere, especially by force: haul something away FBI agents hauled away boxes of records.haul someone off The police hauled him off to jail in front of his whole family.\nThesaurus: synonyms, antonyms, and examples\nto move someone or something from one place to anothercarryThese rail cars carry coal.haulHe grew up hauling coal out of the mines six days a week.cartThe suspects were carted away by police.lugI have to lug the shopping in from the car by myself!humpHe humped the mattress up to his third-floor flat by himself.schlepI need to schlep the trash to the curb.\nSee more results »\nmainly US to transport something, usually by road: The roomy wagon has plenty of space for hauling the sports equipment she uses as coach of her son's soccer team. The product loses its economic advantage when it must be hauled farther than 80 miles.\nThesaurus: synonyms, antonyms, and examples\nto move someone or something from one place to anothercarryThese rail cars carry coal.haulHe grew up hauling coal out of the mines six days a week.cartThe suspects were carted away by police.lugI have to lug the shopping in from the car by myself!humpHe humped the mattress up to his third-floor flat by himself.schlepI need to schlep the trash to the curb.\nSee more results »\nMore examplesFewer examplesHe hauled himself over the wall, grunting with the effort.A freight train can haul thousands of tons of goods.The fishermen were hauling the nets in at the back of the boat.It took three men to haul the roller across the pitch.We had to haul the wardrobe up three flights of stairs.\nSMART Vocabulary: related words and phrases\nPulling\ndraft\ndrag\ndraught\ndraw something up\nheave\nheave-ho\nheft\nhitch something up\npluck\nreel\nreel something in/out\nretract\nretractable\nsuck\ntow\ntow-away\ntraction\ntrail\nwrest\nyank\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing things to happen\nControlling and being in charge\nTransferring and transporting objects\nIdiom\nhaul assPhrasal verb\nhaul someone up\nhaul noun [C]\n(AMOUNT)\nC2 a usually large amount of something that has been stolen or is illegal: a haul of arms/drugs\nall the things someone buys on an occasion when they go shopping: shopping haul Check out the Ucinek family shopping haul.haul video I saw those gloves in a haul video.\nSMART Vocabulary: related words and phrases\nMasses and large amounts of things\naccumulation\nany number of things idiom\narmload\nbacklog\nbolus\nflood\nfoam\ninundation\nlion\nmany\nmotherlode\npile\nstack\nthe lion's share idiom\ntsunami\nwadge\nwave after/upon wave idiom\nwedge\nwelter\nwodge\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProducts & producers\nhaul noun [C]\n(FISH)\nthe amount of fish caught: Fishermen have been complaining of poor hauls all year.\nSMART Vocabulary: related words and phrases\nGeneral words for size and amount\n-sized\namount\nbulk\ncontent\nelement\nextent\nfootprint\ngood things come in small packages idiom\nlevel\nload\nlot\nmeasure\nmuch\norder\npercent\nquantity\nquota\nration\nsmall-scale\nstrength\nSee more results »\nhaul noun [C]\n(JOURNEY)\na journey, often a difficult one: a long/short haul From there it was a long haul/only a short haul back to our camp. See also\nlong-haul\nshort-haul\nSMART Vocabulary: related words and phrases\nJourneys\nadventure\nbreak-journey\ncarpool\ncarpooling\ncircumnavigation\ncommuting\nexpedition\nfield trip\ngrand tour\njaunt\njunket\nlayover\nmove\nodyssey\nride\nround trip\nsail\nseafaring\ntrip\nwanderings\nSee more results »\nIdioms\na long haul\nbe in something for the long haul\nhaul verb [T]\n(MOVE)\nAdd to word list\nAdd to word list\nto pull something heavy or transport something over long distances: They use these trucks to haul freight.\nA person who is hauled somewhere is forced to go there: She was arrested, fingerprinted, and hauled before a judge. If you even mention my name in public, I’ll haul you right into court! Phrasal verb\nhaul someone/something away\nhaul noun\n(DISTANCE)\n[ C usually sing ] a distance over which something is transported: short-haul flights It’s a long haul to Minnesota.\nhaul noun\n(AMOUNT)\n[ C ] an amount of something that was obtained illegally, esp. after it has been taken by the authorities: Police say it is the largest haul of stolen art in years.\nAdd to word list\nAdd to word list\nTRANSPORT to transport goods over a long distance by truck, train, or ship: In 2006, shippers on the Great Lakes hauled 110 million tons of cargo.\ninformal (also haul up) to make someone go to a person in authority to answer questions about something they have done: haul sb (up) before/in front of sb/sth The EU gave the government two months to come up with a good case or be hauled up before the European Court of Justice.\nhaul sb over the coals informal ( US also rake sb over the coals)\nto criticize someone severely for something they have done: Top ministers were hauled over the coals by the select committee for failing to disclose vital information in the inquiry.\na large amount of something that is illegal or has been stolen: It was one of the biggest drugs hauls police have seen in recent years.a haul of sth They uncovered a haul of arms and ammunition at the suspect's address.\na large amount of fish caught at one time: Fishermen have complained of poor hauls all year.\na distance travelled carrying goods: short/long haul The railroads say they can't make money off short hauls if they don't also get income from the long trips. See also\nbackhaul\nlong-haul\nshort-haul"}