{"id":174683,"name":"have","type":"auxiliary verb","us_sound":"hæv","us_link":"../audio/h/have.mp3","uk_sound":"hæv","uk_link":"../audio/h/ukhave_001.mp3","content":"Add to word list\nAdd to word list\nA2 used with the past participle of other verbs to form the present perfect and past perfect: I've heard that story before. Diane's already gone. John hasn't phoned. I haven't visited London before. Have you seen Roz? Has she been invited? They still hadn't had any news when I spoke to them yesterday.formal Had I known (= if I had known) you were coming, I'd have booked a larger room.\nMore examplesFewer examplesTalks between management and unions have collapsed.House prices have come down recently.Lots of people have complained about the noise.Many miners have suffered from the effects of coal dust in their lungs.I could never have achieved this without the encouragement of my husband and family.\nGrammar\nHaveHave is an irregular verb. Its three forms are have, had, had. The present simple third person singular is has: …\nHave: formsHave is an irregular verb. Its three forms are have, had, had. The present simple third person singular is has: …\nHave: usesWe use have as a main verb and an auxiliary verb. …\nHave: typical errorWe don’t use have in the third person singular of the present simple: …\nHave as a main verbThe main verb have has lots of uses. …\nHave as an auxiliary verbHave is one of three auxiliary verbs in English: be, do and have. We use have before -ed forms to make the present perfect and past perfect. …\nTypes of nounsA noun refers to a person, animal or thing. Some examples are: …\nhave verb\n(POSSESS)\nA1 [ T not continuous ] (also 've/'s); (UK also have got) to own: They have a beautiful home. He has plenty of money but no style. I've got two brothers. Do you have time to finish the report today? I've got a suggestion/an idea. have the decency, good sense, etc. to do something\nto do one good thing, although you do other bad or silly things: At least he had the good sense to turn the gas off.\nSee more\nMore examplesFewer examplesThese books have lovely clear print.The school likes to have a contact number for parents during school hours.Now that we have cable, we get a wonderfully crisp picture, even on our old TV.I love football, but unfortunately I have no talent as a player.At some point in the distant future I would like to have my own house.\nSMART Vocabulary: related words and phrases\nHaving and owning - general words\nacquire\nacquisition\nattach\nattach something to something\nbe endowed with something idiom\nbearer\ncarry\nholder\nlay\nlord/master/mistress/king/queen of all you survey idiom\nmake something (all) your own idiom\nmistress\nnot/never want for anything idiom\nrevert\nrevert to something\nshared ownership\nstake\nstake something out\nsurvey\nthey've\nSee more results »\nhave verb\n(BE ILL)\nA1 [ T ] (UK also have got) If you have a particular illness, you suffer from it: Have you ever had measles? I've got a cold.\nMore examplesFewer examplesFollowing a routine check-up, Mrs Mason was discovered to have heart disease.Emily has a very nasty cough.She went home early because she had a bad headache.My sister has diabetes and has to give herself insulin injections.I had a terrible hangover the next morning.John had a heart attack three years ago.\nSMART Vocabulary: related words and phrases\nBeing & falling ill\nacquire\nbe a martyr to something idiom\nbe green around the gills idiom\nbe hanging idiom\nbe laid up idiom\nbe out of sorts idiom\nbring\nKO\nmartyr\nnot a hundred percent idiom\npick\npick someone/something up\npredisposed\npresent\nrelapse\nserious\nshiver\nsicken\nstrike\nsuccumb\nSee more results »\nhave verb\n(DO)\nA2 [ T ] to perform the action mentioned: have a wash/bath/shower I had a swim. We had a short walk after lunch. I've never done it before but I'd like to have a try (= to try). Why don't you have a rest?\nMore examplesFewer examplesShe likes to have an afternoon nap.May I have a look at your newspaper?\" \"Of course you can.\"I'll bring some food along and we can have a picnic.I had a chat with my boss today about a possible salary increase.We had a dance and afterwards we sat outside and talked.\nSMART Vocabulary: related words and phrases\nActing and acts\n(your) every move idiom\n-ence\nact\nact for someone\nact/do something on your own responsibility idiom\nADL\nagency\nant\nbeat\ner\nexecution\nexploit\nmove\nput your money where your mouth is idiom\nresponsibility\nrole-play\nrot\nstep\nstuff\ntalk\nSee more results »\nhave verb\n(EAT/DRINK)\nA1 [ T ] to eat or drink something: I had prawns and rice for lunch. Can I have a drink of water? When are we having dinner?\nThesaurus: synonyms, antonyms, and examples\nto drinkdrinkWhat would you like to drink?haveI don't let the children have sweet fizzy drinks.sipShe sipped the tea carefully because it was hot.swigHe was swigging milk from the bottle.gulp (down)Stop gulping your water!slurpThe children were eating pizza and slurping lemonade.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto eat foodeatWhat do you want to eat for lunch?haveI'll just have one more piece of chocolate cake.consumeHe consumes vast quantities of bread with every meal.devourThe children devoured a whole packet of biscuits.bolt (down)Don't bolt down your food - you'll make yourself ill!gobble (up/down)The children gobbled their sweets.\nSee more results »\nMore examplesFewer examplesMake sure your hands are clean before you have your dinner.May I show you to your table, sir, or would you prefer to have a drink at the bar first?My father always has a biscuit and a cup of tea at bedtime.Let's go out on Friday - we'll have a curry and then go to the movies.Why don't we have lunch together on Friday?\nSMART Vocabulary: related words and phrases\nEating\nal desko\nbinge\nbinge eating\nbite\nbreak bread idiom\ncram\ndevour\nfeast\nfeast on something\nfeeder\nfeeding\nfinish\ngulp\ninhale\nmainline\npicnic\npig\npig out\npostprandial\npostprandially\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDrinking\nhave verb\n(RECEIVE/ALLOW)\n[ T ] to receive, accept, or allow something to happen: Here, have some more coffee. [ + to infinitive ] My mother's having visitors (to stay) next week.have something back Let me have the book back next week.have someone back In the end they solved their problems and she had him back (= allowed him to come and live with her again).none to be had I looked in all the shops for Worcestershire sauce but there was none to be had (= none that anyone could obtain).won't have it I kept telling him that you were French but he wouldn't have it (= would not accept that it was true). [ + -ing verb ] I won't have those kids running all over my flowerbeds (= I refuse to allow them to do this).\nMore examplesFewer examplesYou would be wise to have the appropriate vaccinations before you go abroad.Let me have your decision by next week.I don't want to diminish her achievements, but she did have a lot of help.I've had a letter from the tax authorities concerning my tax payments.My father wouldn't have any animals in the house.\nSMART Vocabulary: related words and phrases\nGetting, receiving and accepting\nacquirable\nacquire\nacquisition\nawardee\ncarve\ndraw\nearn\nget back\nget out of something\nget/lay/put your hands on someone idiom\nglom onto something/someone\ngo to someone\npocket\nscore\nscrew\nscrew something out of someone\nsecure\nseize\nseize on/upon something\nsnap something up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAllowing and permitting\nhave verb\n(MAKE HAPPEN)\nB1 [ T ] to cause something to happen or someone to do something: [ + past participle ] We're having the house painted next month. [ + infinitive without to ] If you wait, I'll have someone collect it for you. [ + obj + -ing verb ] The film soon had us crying. Gus will have it working in no time.have someone down She had her parents down (= invited them to stay) for a week in the summer.have something out We had the boat out (= went out in the boat) for the first time this week.have someone over/round We often have friends over/round (= invite them to come) on a Saturday night.\nMore examplesFewer examplesMany chemicals have a damaging effect on the environment.This decision will have dire consequences for local people.I took the coat back to the shop to have it altered.Have you had your ears pierced? Oh yes, I can see you have.I haven't had my holiday photos developed yet.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nspark\nspell\nSee more results »\nhave verb\n(SUFFER)\nB1 [ T + past participle ] to suffer something that someone does to you: She had her car stolen (= it was stolen) last week.\nSMART Vocabulary: related words and phrases\nOccurring and happening\nafoot\nasynchronous\nasynchronously\nattend\nattendant\nbe at work idiom\neventuate\nfall into place idiom\nfollow on\ngo hand in hand with something idiom\ngo off\ngo on\ngone\npass\nresynchronize\nroll\nroll around\nshake out\nsucceed\nsupervene\nSee more results »\nhave verb\n(EXPERIENCE)\nA2 [ T ] to experience something: We're having a wonderful time here in Venice. We didn't have any difficulty/problem finding the house. He hasn't been having much luck recently.\nMore examplesFewer examplesI think she's very conscious of being the only person in the office who didn't have a university education.I sometimes have difficulty distinguishing Spanish from Portuguese.I've never had any doubt at all - I know this is the right thing to do.Like so many men, he has problems committing himself to a relationship.She had a strong desire to go back to her home country before she died.\nSMART Vocabulary: related words and phrases\nExperiencing and suffering\n(straight) from the horse's mouth idiom\nafflict\naffliction\nalmost/nearly die of something idiom\nbe a martyr to something idiom\nbe a victim of your own success idiom\nbear\ndepth\nget the short end of the stick idiom\ngo through\ngrip\nhands-on\nhit someone where they live idiom\nhorse\npractical\nrun up against something\nseat-of-the-pants\nsee life idiom\nstricken\ntaste\nSee more results »\nhave verb\n(BABY)\nA2 [ T ] to give birth to a baby: Elaine had a baby girl yesterday. My mother had me at home. be having a baby, twins, etc.\nto be pregnant: I hear his wife's having a baby.\nSee more\nMore examplesFewer examplesI expect they plan to have children in the course of time.Your life changes dramatically when you have a baby.They were so late getting to the hospital, she nearly had her baby in the taxi.Have you heard whether Susan's had the baby yet?My sister-in-law had two sets of twins.\nSMART Vocabulary: related words and phrases\nObstetrics: birth\nafterbirth\nantenatally\nApgar score\nB, b\nbirth centre\nbirth partner\nbirth rate\nbore\nchildbearing\nchildbirth\nhypnobirth\nhypnobirthing\ninduce\nmaternity suite\nmaternity unit\nmatrescence\nposh\npreemie\nstillbirth\nstillborn\nSee more results »\nhave verb\n(SEX)\n[ T not continuous ] mainly UK slang to have sex with someone: He asked me how many men I'd had. Grammar\nHaveHave is an irregular verb. Its three forms are have, had, had. The present simple third person singular is has: …\nHave: formsHave is an irregular verb. Its three forms are have, had, had. The present simple third person singular is has: …\nHave: usesWe use have as a main verb and an auxiliary verb. …\nHave: typical errorWe don’t use have in the third person singular of the present simple: …\nHave as a main verbThe main verb have has lots of uses. …\nHave as an auxiliary verbHave is one of three auxiliary verbs in English: be, do and have. We use have before -ed forms to make the present perfect and past perfect. …\nHave got and haveHave got and have mean the same. Have got is more informal. We use have (got) here to refer to both verbs: …\nNo or not?No and not are the two most common words we use to indicate negation. We use no before a noun phrase: …\nHave something doneWe use have + object + -ed form when we talk about someone doing something for us which we ask or instruct them to do. It emphasises the process/action rather than who performs it: …\nIdioms\nand have done with it\na good time was had by all\nhave it in you\nhave it in for someone\nhave it off\nhave it out with someone\nhave nothing on someone or something\nnot have any of itPhrasal verbs\nhave someone on\nhave (got) something on\nhave something out\nhave someone up\nhave (got) to do something\nA2 to need to or be forced: I have to go to San Francisco tomorrow on business.\nC2 used to say that something must be true: That total has to be right - I've checked it twice.\nSee more\nGrammar\nHave got to and have toHave got to and have to mean the same. Have got to is more informal. We use have (got) to here to refer to both verbs. …\nHave got to and have to: formsHave (got) to comes before the main verb: …\nHave got to and have to: meaningHave (got) to is used to refer to obligations which come from outside the speaker: …\nHave got to and have to: tenseHave got to can only be used in the present. Have to can be used in a variety of forms: …\nhave auxiliary verb\n(PERFECT TENSE)\nAdd to word list\nAdd to word list\nused with the past participle of other verbs to form perfect tenses: I have heard that story before. \"Have we been invited?\" \"Yes, we have.\" Idioms\nhave (just about) had it\nhave had it with someone/something\nhave verb [T]\n(DO)\nus\nYour browser doesn't support HTML5 audio\n/hæv/ present tense has us/hæz, həz, əz/ | past tense and past participle had us/hæd, həd, əd/ to do an action: He didn’t have a birthday party this year. The baby is having her nap.\nus\nYour browser doesn't support HTML5 audio\n/hæv/ present tense has us/hæz, həz, əz/ | past tense and past participle had us/hæd, həd, əd/ Have can also mean eat or drink: We’re going to have lunch.\nus\nYour browser doesn't support HTML5 audio\n/hæv/ present tense has us/hæz, həz, əz/ | past tense and past participle had us/hæd, həd, əd/ To have a baby is to give birth: Glennis had a girl.\nhave verb [T]\n(RECEIVE)\nus\nYour browser doesn't support HTML5 audio\n/hæv/ present tense has us/hæz, həz, əz/ | past tense and past participle had us/hæd, həd, əd/ to receive or accept something, or to allow something to happen: I’ll have some more coffee. I just had a phone call from Judy. I won’t have those kids running through my flower bed.\nhave verb [T]\n(CAUSE)\nus\nYour browser doesn't support HTML5 audio\n/hæv/ present tense has us/hæz, həz, əz/ | past tense and past participle had us/hæd, həd, əd/ to cause something to happen, or to cause someone to do something: We’re having the house painted. She had her parents come to her house for Thanksgiving. We often have friends over.\nhave verb [T]\n(EXPERIENCE)\nus\nYour browser doesn't support HTML5 audio\n/hæv/ present tense has us/hæz, həz, əz/ | past tense and past participle had us/hæd, həd, əd/ to experience something: We had a wonderful vacation. She had her car stolen last week. have a good/great/nice something\nIf you say have a good/great/nice something you are saying that you hope someone enjoys a particular period of time: Thanks for shopping with us, and have a good day! Have a great trip, and drive safely!\nhave verb [T]\n(POSSESS)\nus\nYour browser doesn't support HTML5 audio\n/hæv, həv/ present tense has us/hæz, həz, əz/ | past tense and past participle had us/hæd, həd, əd/ (also have got, us/hævˈɡɑt, həv-/) to own or possess something: We have a dog. Have you got a cold? I’ve got a big nose. Have you got any money on you (= Are you carrying money with you)?\nus\nYour browser doesn't support HTML5 audio\n/hæv, həv/ present tense has us/hæz, həz, əz/ | past tense and past participle had us/hæd, həd, əd/ (also have got, us/hævˈɡɑt, həv-/) Have can also mean to be related to, or to know: Carol has six sisters. I’ve got a friend who could lend us a car.\nus\nYour browser doesn't support HTML5 audio\n/hæv, həv/ present tense has us/hæz, həz, əz/ | past tense and past participle had us/hæd, həd, əd/ (also have got, us/hævˈɡɑt, həv-/) If a store has something, it is available to be bought: While you’re there, see if they have any toothpicks. Note: Have got is used only in the present tense.\nhave verb [T]\n(CONTAIN)\nus\nYour browser doesn't support HTML5 audio\n/hæv, həv/ present tense has us/hæz, həz, əz/ | past tense and past participle had us/hæd, həd, əd/ (also have got, us/hævˈɡɑt, həv-/) to contain or include something: The Chicago area has a population of about eight million. Our house has three bedrooms and two baths. We have a few minutes left before the end of class. Idioms\nhave (got) a hand in something\nhave a (good) head for something\nhave a heart\nhave a screw loose\nhave an ax to grind\nhave an eye for something\nhave another think coming\nhave your cake and eat it too\nhave dibs on something\nhave your eye on something\nMore idioms\nhave your feet on the ground\nhave (got) your hands full\nhave heard of someone/something\nhave (got) your heart set on something\nhave it coming (to you)\nhave it in you\nhave it in for someone\nhave (got) it made\nhave nothing to do with someone/something\nhave nothing to lose\nhave (got) only yourself to blame\nhave seen better days\nhave (more than) your share of something\nhave the last word on something\nhave to do with something\nhave (got) to hand it to someone\nhave what it takes (to do something)\nhave your work cut out for you\nnot have a clue\nnot have a leg to stand on\nnot have the heart (to do something)\nPhrasal verbs\nhave (got) on something\nhave (got) something on someone\nhave (got) on something"}