{"id":174868,"name":"head","type":"noun","us_sound":"hed","us_link":"../audio/h/head.mp3","uk_sound":"hed","uk_link":"../audio/h/ukhead_001.mp3","content":"head noun\n(BODY PART)\nAdd to word list\nAdd to word list\nA1 [ C ] the part of the body above the neck where the eyes, nose, mouth, ears, and brain are: Put this hat on to keep your head warm. He banged his head on the car as he was getting in.nod/shake your head She thought for a while, and then nodded/shook her head (= showed her agreement/disagreement).\nMichael Heim/EyeEm/GettyImages\n[ S ] a person or animal when considered as a unit: Dinner will cost £20 a/per head (= for each person).head count I did a quick head count (= calculated how many people there were). They own a hundred head of cattle (= 100 animals).\n[ S ] a measure of length or height equal to the size of a head: by a head Her horse won by a head.a head Paul is a head taller than Andrew.\nMore examplesFewer examplesI like swimming but I don't like getting my head underwater.Tim had a nasty bump on his head from when he'd fallen over.She twisted her head round so she could see what was happening.He fell asleep as soon as his head touched the pillow.She signified her agreement by nodding her head.\nSMART Vocabulary: related words and phrases\nThe head\nacephalous\nbasilar\nbean\nbonce\nbrachiocephalic\ncranium\nheaded\nheadless\nmicrocephaly\nmulti-headed\nnoddle\nnut\noccipitalis\nocciput\npate\nscalene\nscalenes\nscalp\nskull\ntonsure\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParticular and individual\nMeasurements of length & distance\nhead noun\n(MIND)\nB1 [ C ] the mind and mental abilities: clear head You need a clear head to be able to drive safely.into your head What put that (idea) into your head? (= What made you think that?)out of your head I can't get that tune/that man out of my head (= I cannot stop hearing the tune in my mind/thinking about that man).Use your head! Use your head (= think more carefully)! Control your emotions and think before you speak.a (good) head for Harriet has a (good) head for figures (= she is very good at calculating numbers).a head for heights UK Do you have a head for heights (= are you able to be in high places without fear)?\nMore examplesFewer examplesWhy didn't you use your head and cover the furniture before you started painting?Add up the column of figures in your head and then tell me what the sum is.Her words kept running through my head.She doesn't have an original thought in her head - she just repeats anything that Sara says.I need to get some fresh air to clear my head .\nSMART Vocabulary: related words and phrases\nIntelligence\nacuity\nacumen\nagility\napt\naptness\nbrain\ngumption\nhighbrow\nhorse sense\nhyper-intelligent\nimaginative\npenetrative\nperceptively\npercipient\npercipiently\nperspicacious\nperspicaciously\nprofundity\nwhip-smart\nwisdom\nSee more results »\nhead noun\n(LEADER)\nB1 [ C ] someone in charge of or leading an organization, group, etc.: the head of the History department the head chef his first season as head coach\nA2 [ C ] mainly UK a\nheadteacher UK head boy/girl UK\na boy or girl who often represents his or her school on formal occasions: We are delighted to announce that Dominic Carter will be our next head boy.\nSee more\nMore examplesFewer examplesI think she'll be head of this company in five year's time - I'd stake my reputation on it.May I remind you, children, that I'm the head of the family and I am in charge around here.As the European heads of state gathered, the press were allowed in for a photo session.The Queen is the head of the Church of England.Janet is now a departmental head.\nSMART Vocabulary: related words and phrases\nPeople in charge of or controlling other people\nacephalous\nadministrator\nanti-management\nauthority\nbureaucrat\ncontroller\ncouncil\ncounter-power\ndean\ndeputy\nmanipulator\nmistress\nmovers and shakers\nmulti-headed\nofficer\ntsar\nvice presidency\nvice president\nvicegerency\nvicegerent\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBosses & managers\nTeachers\nhead noun\n(TOP PART)\nC2 [ S ] the top part or beginning of something: the head of the queue the head of the page Diana, the guest of honour, sat at the head of the table (= the most important end of it).\n[ C ] the larger end of a nail, hammer, etc.\n[ C ] the top part of a plant where a flower or leaves grow: a head of lettuce\n[ C ] the layer of white bubbles on top of beer after it has been poured\n[ C ] the upper part of a river, where it begins\n[ C ] the top part of a spot when it contains pus (= yellow liquid)\nMore examplesFewer examplesHer name was printed at the head of the letter.This beer's flat. It's got no head on it.You've hit the nail right on the head.Place the head of the club just behind the ball.He pushed his way to the head of the queue.\nSMART Vocabulary: related words and phrases\nEdges & extremities of objects\napex\napical\napices\nbevel\nborder\nbottom\nbrow\ncap\ncircumference\ncrown\nedge\nextremity\nfoot\npalm-fringed\nperimeter\nperipherally\nperiphery\nrim\nrimless\nspout\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTools\nFlowers - general words\nBeer & cider\nParts of watercourses\nSkin complaints & blemishes\nhead noun\n(COIN SIDE)\nheads [ U ]\nthe side of a coin that has a picture of someone's head on it: Heads won, so our team got to decide who played first.\nSee more\nhead noun\n(DEVICE)\n[ C ] the part of a tape or video recorder (= machine for recording sound or pictures) that touches the tape to record and play music, speech, etc.\nSMART Vocabulary: related words and phrases\nAudio & video equipment\n78\naudiocassette\naudiotape\nbody cam\nboom box\nbox set\ndigital audio tape\nequalizer\nhi-fi\njukebox\nPDC\nradiogram\nstereo\nsubwoofer\ntape\ntweeter\nVCR\nvideo technology\nvideocassette\nwire\nSee more results »\nhead noun\n(GRAMMAR)\n[ C ]\n&#160; language\n&#160; specialized the main part of the phrase, to which the other parts are related Compare\ntail noun (GRAMMAR) specialized\nSMART Vocabulary: related words and phrases\nLinguistic terms & linguistic style\naccentual\naffricate\nallophone\nallophony\nanaphor\ncontextualize\ndowntoner\neasy read\nemphatic\nentailment\netymological\nidiomatic\ninflected language\nparatactically\nparataxis\nphilological\nphilologically\nphilology\npolysemy\nstylistics\nSee more results »\nhead noun\n(LAND)\n[ C ]\n&#160; geography\n&#160; specialized a narrow area of high land that sticks out into the sea: the chalk cliffs around Beachy Head\nSMART Vocabulary: related words and phrases\nGeography: promontories & peninsulas\narm\ncape\nCape Cod\ncauseway\nheadland\nisthmus\npanhandle\npeninsula\npeninsular\npoint\npromontory\nsea stack\nspit\nstack\ntombolo\nGrammar\nHeadsThe head is the most important word in a phrase. All the other words in a phrase depend on the head. Words which are part of the phrase and which come before the head are called the pre-head. Words which are part of the phrase and which come after the head are called the post-head. …\nIdioms\na head of steam\nan old/a wise head on young shoulders\nbe banging, etc. your head against a brick wall\nbe in over your head\nbe off your head\nbite/snap someone's head off\nbury/have your head in the sand\ncan't get your head around sth\ncan't make head nor tail of something\ncome to a head\nMore idioms\ndo someone's head in\nfrom head to toe\na full, good, thick, etc. head of hair\nget it into your thick head\nget your head down\nget something into your head\nget/put your head down\ngive head\ngive your head a shake\ngive someone their head\ngive someone a heads up\ngo over someone's head\ngo to someone's head\nhave a good head on your shoulders\nhave your business, sensible, etc. head on\nhave your head (buried/stuck) in a book\nhave your head in the clouds\nhave your head screwed on (the right way)\nhead in the game\nhead and shoulders above\nhead first\nhead over heels (in love)\nheads I win, tails you lose\nheads or tails?\nheads will roll!\nkeep your head\nkeep your head above water\nkeep your head down\nlaugh, shout, scream, etc. your head off\nover your head\nput their heads together\ntake it into your head to do something\nhead verb\n(GO)\nB2 [ I + adv/prep ] to go in a particular direction: head out of I was heading out of the room when she called me back.head towards We were heading towards Kumasi when our truck broke down.head for He headed straight for (= went towards) the fridge.head back/home I think we ought to head back/home (= return to where we started) now, before it gets too dark.\nMore examplesFewer examplesThey looked as if they were heading for the train station.We're going to stop off in Paris for a couple of days before heading south.The country seems to be heading towards revolution.Head towards the station until you come to a set of traffic lights.They headed north on the M6.\nSMART Vocabulary: related words and phrases\nGeneral words for movement\nbetake\nbudge\nbudge up\ncarry\ncirculate\ndad dancing\ngangway\ngone\nkinetic\nkinetic energy\nkinetically\nlibration\nlocomotion\nmotion\npass\nround\nscoot\nseethe\nshove\nslip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdvancing and moving forward\nhead verb\n(LEADER)\nB2 [ T ] to be in charge of a group or organization: She heads one of Britain's leading travel firms. Judge Hawthorne was chosen to head the team investigating the allegations of abuse.\nMore examplesFewer examplesThe inquiry will be headed by Lord Jones, sometime editor of the 'Daily News'.Professor Norris will head the new research unit.He has been asked to head the official inquiry into police misconduct.She heads the company's publicity department.The management team is headed by Stephen Jones.\nSMART Vocabulary: related words and phrases\nManaging and organizing\nadmin\nadminister\nadministration\nanti-bureaucracy\nbronze command\nfixer\nflabbily\nget up\nget your act together idiom\ngold command\nmobilize\nmount\npaperwork\nparty planner\nparty planning\nproject-manage\nrationalization\nrationalize\nvice-presidential\nwieldy\nSee more results »\nhead verb\n(TOP PART)\nC1 [ T ] to be at the front or top of something: The royal carriage headed the procession. Jo's name headed the list of candidates.\nSMART Vocabulary: related words and phrases\nAhead, in front and beyond\nahead\nahead of\nante\nbe (right) under your nose idiom\nbefore\nbeyond\ndownriver\nfollow\nfollow your nose idiom\nfore\nforward\nfront\nfront end\nfrontally\nlead\nnose\npara\npast\nup\nyonder\nhead verb\n(SPORT)\n[ T ] to hit a ball with your head: Rooney headed the ball into the back of the net.\nSMART Vocabulary: related words and phrases\nFootball/soccer\n18-yard box\n2 3 5\n4 3 2 1\n4 4 2\n4 5 1\nfootball pools\nfooty\nformation\nfoul throw\nfour five one\nfour four two\nfour three two one\nreducer\nrelegation zone\nreserve team\nroute one football\nrow Z\nsweeper\ntreble\nwoodwork\nSee more results »\nPhrasal verbs\nhead for something\nhead off\nhead someone/something off\nhead something off\nhead something up\na person with a particular strong interest or addiction: a crack-head (= someone who depends on the drug crack)\nSMART Vocabulary: related words and phrases\nDrug addiction\nabuser\naddictiveness\nanti-crack\nbuzzed\nbuzzed up\ncold turkey\ncrackhead\ndependency\ndetox\ndruggie\nglue-sniffer\nglue-sniffing\nhabit\nhooked\nhophead\njunkie\npothead\nsmackhead\nsubstance abuser\nsubstance use disorder\nSee more results »\nhead noun\n(BODY PART)\nAdd to word list\nAdd to word list\n[ C/U ] the part of the body that contains the eyes, nose, mouth, ears, and the brain: [ C ] She nodded her head in agreement.\n[ C/U ] A head is also the approximate length of a head used as a measurement: [ C ] Carlos is almost a head taller than Manuel.\nhead noun\n(MIND)\n[ C ] the mind and mental abilities: She has a good head for figures. If you’d just use your head (= think clearly and carefully), you would realize that you are better off living where you are. Someone offered me the ticket, and your name popped into my head.\nhead noun\n(TOP)\n[ C/U ] a position or part at the top, front, or beginning: [ U ] They were early enough to get a place at the head of the line. [ U ] As the guest of honor, he sat at the head of the table (= the more important end).\n[ C/U ] The head of a plant is the top part where a flower or leaves grow: [ C ] I bought two heads of lettuce.\nhead noun\n(LEADER)\n[ C ] someone who leads or is in charge of an organization or group, or this position of leadership: In 1990 he was made head of the engineering division. Idioms\nhead and shoulders above someone/something\nhead over heels (in love)\nhead verb\n(GO)\n[ I ] to go in a particular direction: I was heading out the door when the phone rang. We decided to head back/home (= return to where we started) before it got too dark. fig. He’s headed for trouble if he gets involved with her.\nhead verb\n(LEAD)\n[ T ] to lead or control something: She headed a group that defended the senator against detractors.\nhead verb\n(BE AT TOP)\n[ T ] to be at the top, front, or beginning of something: Currently, her name heads the list of candidates for the job. Phrasal verbs\nhead someone off\nhead something off\nhead up something\nhead adjective [not gradable]\n(MAIN)\nmain or most important: In his first season as head coach, McGuire guided his team to the regional championship.\nAdd to word list\nAdd to word list\na person who is in charge of a team, department, or an organization: Each department head has a great deal of freedom with regard to decision-making. The proposal awaits final approval by a meeting of EU heads of state next month. If you are a single parent, you can reduce your tax liability by filing as a head of household with a dependent child. a head buyer/cashier/trader\none person considered as a unit: cost/price/spend per head The region saw incomes per head fall by an average 4 per cent a year over the past decade. The airline offered maximum compensation of £150 a head to anyone whose flight was disrupted by the strike action.\nbe/get in over your head\nto be involved in something that is too difficult for you to deal with: He denied fraud saying he was a businessman who just got in over his head.\nbury/have your head in the sand\nto refuse to think about a problem or difficult situation that could have unpleasant effects: The dangers of identity theft are clear but many companies still choose to bury their heads in the sand and act only after there has been a security breach.\ncome to a head (also bring sth to a head)\nif a difficult situation comes to a head, or someone brings it to a head, it reaches a stage when someone must take strong action to deal with it: The row came to a head when the US imposed one billion dollars in taxes on a whole range of consumer goods.\nget your head round/around sth\nto manage to understand something: It's hard to get your head round these new tax laws.\nget/keep your head down UK informal\nto put all your effort into finishing a particular task: If I get my head down, I'll be able to finish the report before the end of the day.\nto do or say as little as possible in order to avoid attention: The chairman intends to keep his head down until his disagreement with the serious fraud office is settled.\ngo over sb's head\nto deal with someone at a higher level: He was furious that staff had gone over his head to try and implement departmental changes without his approval.\nto be too difficult for someone to understand: Most of the budget meeting went over my head.\nhave a (good) head for sth\nto be very good at something: She had a good head for business.\nhead on\nif you deal with something head on, you deal with it directly and with determination: Leading corporations are tackling their carbon emissions head on.\nif you compete head on with another business, you offer the same products or services and each try to be more successful than the other: The merger should enable the bank to compete head on with the other major investment institutions.\nheads will roll\nused to say that people are likely to be punished or lose their jobs because of something they have done: Sources close to the bank have denied suggestions that heads will roll following the huge losses reported this week.\nkeep your head above water\nto try to manage a difficult situation, especially when it involves a lot of work or a lack of money: The business has lurched from one financial crisis to another but we have managed to keep our heads above water.\nput our/your/their heads together\nto work together with others to solve a problem or deal with a difficult situation: If we want to remain competitive, we'd better put our heads together and come up with new ways of reaching our market.\ntwo heads are better than one\nused to say that two people working together will achieve more than one person working alone See also\nblock noun\nturn verb\nheads of agreement\nhead start\nheads-up\nhead tax\nhead-to-head adverb\nhead-to-head adjective\n[ T ]\n&#160; HR to lead or manage a team, department, organization, etc.: After five years in the US office, he returns to London to head the finance department.\n[ I ] to move in a particular direction or towards a particular result: be headed for/towards sth The corporate bond market is heading for its worst year in a decade as prices continue to fall. These initial signs of recovery show the company is once again headed in the right direction.\n[ T, passive ] to put a title at the top of a page, column, etc.: The report was headed \"confidential\".\nhead north/south\nFINANCE, STOCK MARKET\n&#160; informal if share prices or currencies head north, they increase in value, and if they head south, they lose value: The job cuts followed significant drops in stock values when the Nasdaq headed south. Phrasal verbs\nhead down\nhead sth off\nhead up"}