{"id":174935,"name":"headline","type":"noun","us_sound":"ˈhed.laɪn","us_link":"../audio/h/usheadg008.mp3","uk_sound":"ˈhed.laɪn","uk_link":"../audio/h/ukhead_022.mp3","content":"Add to word list\nAdd to word list\nB1 a line of words printed in large letters as the title of a story in a newspaper, or the main points of the news that are broadcast on television or radio: The news of his death was splashed in headlines across all the newspapers. the eight o'clock headlines Compare\nbyline (NEWSPAPER) specialized\nMore examplesFewer examplesIt seems that people can't resist titillating headlines, especially if they concern the Royal family.The story was seized on by the tabloid press, who printed it under huge headlines.'I bonked the prince, says sexy Sarah' declared the newspaper headline.The headline read 'Judge raps police'.The newspaper headline was 'Vicar Caught In Sex Romp'.\nSMART Vocabulary: related words and phrases\nNewspapers & magazines: headlines & features\nadvertorial\nadvice column\nadvice columnist\nagony column\nagony uncle\ncomic strip\ncover story\ndateline\ndouble-page\ndouble-page spread\neditorial\nleader\nobituary\nop-ed\npersonal column\npress cutting\nproblem page\npullout\nsplash\nspread\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBroadcasting: programmes & other broadcasts\nGrammar\nNewspaper headlinesA newspaper headline is a very short summary of a news report. It normally appears in large letters above the report. …\nto have something as a headline or as the main story: The story was headlined \"Killer dogs on the loose\".\nto be the main performer at an entertainment event: The band's headlining appearance at the festival could be their last.\nSMART Vocabulary: related words and phrases\nNewspapers & magazines: headlines & features\nadvertorial\nadvice column\nadvice columnist\nagony column\nagony uncle\ncomic strip\ncover story\ndateline\ndouble-page\ndouble-page spread\neditorial\nleader\nobituary\nop-ed\npersonal column\npress cutting\nproblem page\npullout\nsplash\nspread\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBroadcasting in general\nCinema & theatre: actors & performers\na headline amount, number, or rate is the most important one or the one that people notice most: headline rate of interest The credit card company will cut its headline rate of interest to 19.9 percent.headline figure The headline figure of 3.6 percent isn't as bad as it looks if you exclude the effects of oil prices.\nheadline noun [C]\n(LARGE PRINT)\nAdd to word list\nAdd to word list\nwords printed in large letters at the top of a newspaper story that serve as its title\nheadline verb\n(PERFORM)\n[ I/T ] us\nYour browser doesn't support HTML5 audio\n/ˈhed·lɑɪn/ to be the most famous or important performer or speaker to take part in an event: Since last year, she has headlined at least 32 fundraising events.\nheadline verb\n(PROVIDE WORDS AT TOP)\n[ T ] us/ˈhed·lɑɪn/ to provide a newspaper story with a headline: She was judged fourth in a news story headlined: \"New York's 100 Coolest People.\"\nAdd to word list\nAdd to word list\na headline figure, number, or rate includes everything that affects it: If you take the headline figure for personal borrowing of £1,000 bn, it looks a bit scary. The new investment deal offers a headline rate of 6.9% before tax, 5.52% net. Compare\nunderlying"}