{"id":174988,"name":"headroom","type":"noun","us_sound":"ˈhed.ruːm","us_link":"../audio/h/usheadg013.mp3","uk_sound":"ˈhed.ruːm","uk_link":"../audio/h/ukhead_028.mp3","content":"headroom noun [U]\n(SPACE)\nAdd to word list\nAdd to word list\nthe amount of space below a roof, ceiling, or bridge, or below the top of something: It's a small car but there's lots of headroom. The low headroom on the staircase could be a problem.\nMore examplesFewer examplesFor rear passengers there is plenty of width but not much headroom.With this type of loft conversion there will be less headroom, as the slope of the roof is retained in the conversion.The builders of the M6 in the 1960s did not leave enough headroom for boats to go under the motorway. The space inside the tent is good, with decent headroom.Pack the cucumbers into the canning jars, then cover with hot brine leaving 1/2 inch of headroom.\nSMART Vocabulary: related words and phrases\nSpace - general words\nbay\nbox\nchamber\nclearance\nelbow room\nexpanse\nfootprint\nindent\nroom\nspace\nspacial\nspacing\nspacious\nspaciously\nspatially\nstanding room\nsubzone\nvoid\nway\nzone\nSee more results »\nheadroom noun [U]\n(OPPORTUNITY TO GROW)\nbusiness, finance &amp; economics\n&#160; specialized opportunity for doing something, especially opportunity to develop, progress, or grow: headroom for Budgets remain sufficiently large to give the Group headroom for further growth.headroom to Within the plan must be cash flow forecasts that ensure you have headroom to deal with unforeseen shocks such as interest rate rises.\nMore examplesFewer examplesI think it's important to challenge yourself and take on roles that have got some headroom for personal development.Although online advertising is growing slowly, there is still considerable headroom for the company to grow its revenues.If their other costs are going up there's clearly less headroom to subsidize affordable homes.\nSMART Vocabulary: related words and phrases\nOpportunity\nanother/a second bite at/of the cherry idiom\nbe in with a shout idiom\nbest bet idiom\nbig break\nbreak\nfish\nfoot\nhave a few, several, etc. irons in the fire idiom\nhave a field day idiom\nhay\nit's now or never idiom\nlast chance saloon\npass\nplatform\nscope\nshop window\nsmell blood idiom\nsneak peek\nthe American dream\nthe run of something idiom\nSee more results »\nAdd to word list\nAdd to word list\nthe space above your head when you are inside something, esp. a car or other vehicle: There’s not enough headroom to wear a hat."}