{"id":175071,"name":"healthily","type":"adverb","us_sound":"ˈhel.θəl.i","us_link":"../audio/h/usheadg025.mp3","uk_sound":"ˈhel.θəl.i","uk_link":"../audio/h/ukheads015.mp3","content":"healthily adverb\n(HEALTH)\nAdd to word list\nAdd to word list\nin a way that shows a person or living thing is strong and well: Some people are naturally and healthily thin. The trees are able to grow normally and healthily.\nin a way that is good for the health of a person or living thing: Eat healthily and take plenty of exercise. Almonds are delicious on their own, roasted or, less healthily, sugared.\nMore examplesFewer examplesThere are some things that children need to grow healthily.She is plump, but healthily so, and fit.He has achieved a lot in his campaign to get us to feed children healthily.They avoid alcohol and live healthily.Try to lose weight healthily, by exercising more and eating better foods, rather than by extreme dieting.The air has space to circulate healthily around the plant's roots.\nSMART Vocabulary: related words and phrases\nAnimal physiology: fit & healthy\nacrobatically\nagility\nagree with something\namazonian\nathleticism\nbe (as) fit as a fiddle idiom\nglow\nhard/tough as nails idiom\nin the pink idiom\nmatch fitness\nmuscled\nnail\nnon-disabled\non top form phrase\noutdoorsy\nrobust\nstalwart\nthe able-bodied\ntrim\nvirility\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHealth in general\nhealthily adverb\n(REASONABLY)\nin a way that shows reasonable feelings or good judgment: He is loyal to his party, but healthily cynical about politicians. It can be hard to judge one's own actions healthily.\nMore examplesFewer examplesLike all artists, he was healthily egotistical.Young people may need help to healthily manage relationships.Too often, we treat playground boisterousness as deviant rather than healthily normal.\nSMART Vocabulary: related words and phrases\nWise and sensible\nbe a victory for common sense idiom\ncannily\ncanny\nclear-headed\nclear-headedly\njudiciously\nlevel-headed\nlong-sightedness\nmethod\nneat\nresponsibility\nresponsible\nresponsibly\nright-minded\nsagacious\nvictory\nwell advised\nwily\nwisdom\nwise\nSee more results »\nhealthily adverb\n(SUCCESSFULLY)\nin a way that shows success or shows there is enough of something: Revenues are up healthily. The restaurant has a healthily sized seating area.\nMore examplesFewer examplesTheir income has grown healthily.We want to encourage a healthily developing market.\nSMART Vocabulary: related words and phrases\nSuccessful (things or people)\na head of steam idiom\nachiever\nalive\nalpha male\narrive\nascendant\nballer\nhave something in your pocket idiom\nhave the world at your feet idiom\nheavy hitter idiom\nhigh-flyer\nhigh-flying\npocket\nrail\nrepresent\nsuccessful\nsuccessfully\nsuperachiever\nsuperhit\nsuperseller\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlenty and abundant\nSee\nhealthy"}