{"id":175068,"name":"healthy","type":"adjective","us_sound":"ˈhel.θi","us_link":"../audio/h/healthy.mp3","uk_sound":"ˈhel.θi","uk_link":"../audio/h/ukheads016.mp3","content":"healthy adjective\n(HEALTH)\nAdd to word list\nAdd to word list\nA2 strong and well: She's a normal, healthy child. He looks healthy enough.\nshowing that you are strong and well: The walk had given her a healthy glow. a healthy appetite\nA2 good for your health: a healthy diet a good, healthy walk\nMore examplesFewer examplesA good diet and plenty of exercise will help you to keep your body healthy.Fresh fruit and vegetables form an important part of a healthy diet.The children never eat very much, but they seem quite healthy.The population as a whole is getting healthier.A healthy body will be able to fight off the illness naturally without the use of medicine.\nSMART Vocabulary: related words and phrases\nAnimal physiology: fit & healthy\nacrobatically\nagility\nagree with something\namazonian\nathleticism\nbe (as) fit as a fiddle idiom\nglow\nhard/tough as nails idiom\nin the pink idiom\nlimber\nmatch fit\nmatch fitness\nmuscled\nnon-disabled\non top form phrase\nrobust\nrude\nthe able-bodied\ntrim\nvirility\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHealth in general\nhealthy adjective\n(SUCCESSFUL)\nC2 successful and strong: a healthy economy\nSMART Vocabulary: related words and phrases\nSuccessful (things or people)\na head of steam idiom\nachiever\nalive\nalpha male\narrive\nascendant\nballer\nhave something in your pocket idiom\nhave the world at your feet idiom\nhealthily\nheavy hitter idiom\nhigh-flyer\nrail\nrepresent\nsmash\nstorming\nsuccessful\nsuccessfully\nsuperachiever\nsuperhit\nSee more results »\nhealthy adjective\n(NORMAL)\nnormal and showing good judgment: a healthy disrespect for authority\nSMART Vocabulary: related words and phrases\nWise and sensible\nbe a victory for common sense idiom\ncannily\ncanny\nclear-headed\nclear-headedly\njudicious\njudiciously\nlevel-headed\nlong-sightedness\nmethod\nreasoned\nresponsibility\nresponsible\nresponsibly\nright-minded\nto be wise after the event idiom\nvictory\nwell advised\nwily\nwisdom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHealthiness of mind\nRelated word\nhealthily\nAdd to word list\nAdd to word list\nhaving, showing, or encouraging good health: As long as the baby is healthy, I don’t care if it’s a boy or a girl.\nHealthy can mean positive: She had a healthy attitude toward life and was fun to be with.\nSomething is described as healthy if it is financially successful and strong: The real-estate market is much healthier today than it was ten years ago.\nA healthy amount is a large amount: Their business showed a healthy profit in its first year.\nAdd to word list\nAdd to word list\ndeveloping and making money: a healthy business/industry/economy Sound macroeconomic and regulatory policies are essential to a healthy financial sector.\nlarge in amount and showing that a company or economy is successful: healthy orders/sales/profits Bookings on long-haul routes including Heathrow to New York remain healthy.\ngood for your health: healthy eating/living Eating fruit and vegetables is part of a healthy lifestyle. Employees should maintain a healthy balance between work and personal life. healthy foods/meals/snacks\nhealthily adverb\nThe economy should keep growing healthily."}