{"id":175061,"name":"health","type":"noun","us_sound":"helθ","us_link":"../audio/h/health.mp3","uk_sound":"helθ","uk_link":"../audio/h/ukheads012.mp3","content":"Add to word list\nAdd to word list\nA2 the condition of the body and the degree to which it is free from illness, or the state of being well: to be in good/poor health Regular exercise is good for your health. I had to give up drinking for health reasons.ill health He gave up work because of ill health.\nservices and jobs that exist to take care of people's health: The public wants more funding for education and health.health services All families need access to local health services. health professionals/workers a health centre/facility the health minister See also\nenvironmental health\npublic health\nthe condition of something that changes or develops, such as an organization or system: the financial health of the business\nMore examplesFewer examplesThe state of my father's health concerns us greatly.Your health is generally good, but you do have a few minor problems.If you think you can carry on drinking so much without damaging your health, then you're mistaken.They found an injured cat and carefully nursed it back to health .We want clean rivers and lakes, where you can swim without risk to your health.\nSMART Vocabulary: related words and phrases\nHealth in general\nattachment\nconstitutional\nexcess deaths\nexcess mortality\nfunctioning\nhealthful\nhealthfully\nhealthily\nhealthy\nhygienic\nnon-carcinogenic\nnon-medical\npublic health\nsanitarily\nsanitary\nsanitation\nscraping\nshape\nwelfare\nwellness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical treatment: treating & caring for people\nConditions and characteristics\nAdd to word list\nAdd to word list\nthe condition of the body or mind and the degree to which it is free from illness, or the state of being well: Her health was much improved after she started exercising. fig. The health of the economy is still causing concern.\nIf you are in good/poor health, your physical condition is healthy or is not healthy: He’s in excellent health.\nAdd to word list\nAdd to word list\nthe activity or business of providing medical services: They welcomed the government's commitment to extra spending on health and education. Treatment of heart disease and cancer will be a top priority according to a report released by the Department of Health. The governor's plan is by far the most sweeping health reform proposal that any state has attempted recently. health department/official\nthe condition of someone's body or mind, or the state of being well: Increases in the volume of work are damaging the health of some of our top executives. A clean water supply is crucial to public health. health problems/risks/threats\nthe condition of a company, organization, or economy and the degree to which it is successful or makes a profit: In the UK, every retailer's health is measured by its Christmas sales. Layoffs are sometimes necessary for the long-term health of an economy. the financial health of the company\ngive sth a clean bill of health\nto say that an organization or system is in a good financial position or has been operating honestly and legally, after having examined it: Concerns about \"installation procedures\" mean the company cannot be given a clean bill of health.\nto state or announce that a product, place, etc. is safe to use after testing it or examining it: The restaurant has been given a clean bill of health. See also\nenvironmental health"}