{"id":175055,"name":"healing","type":"noun","us_sound":"ˈhiː.lɪŋ","us_link":"../audio/h/usheadg023.mp3","uk_sound":"ˈhiː.lɪŋ","uk_link":"../audio/h/ukheads011.mp3","content":"Add to word list\nAdd to word list\nthe process of becoming well again, especially after a cut or other injury, or of making someone well again : This herb has been used in healing for centuries. Wounds should be covered with a gauze dressing while healing occurs.\nthe process in which a bad situation or painful emotion ends or improves: Healing only begins when the hurt is shared with someone. We have seen much progress, but the healing process is going to take years.\nMore examplesFewer examplesAdequate sleep promotes healing.How do maggots accelerate wound healing? I am here to foster healing in our community.Taking a life to avenge a death does not bring healing to anyone.\nSMART Vocabulary: related words and phrases\nRecovering from illness\nclear (something) up\ncolour\ncorrect\ncurability\ncurably\ncurative\nget over something/someone\ngranulate\nhold\nrecovery\nrehabilitate\nrehabilitation\nrehydrate\nremedial\nremission\nresponsive\nresponsiveness\nself-healing\nsleep\ntherapeutic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming better\nMaking things better\nhelping to make someone well again, especially after a cut or other injury: Amber was thought to have healing powers. They diagnosed all kinds of illnesses and dispensed healing potions. See\nheal\nMore examplesFewer examplesGarlic has been known for its healing properties for more than 5,000 years.One mother rubbed lavender oil nightly onto her son's chest as a healing balm.Hawaiian healing rituals took place there in the 18th century.\nSMART Vocabulary: related words and phrases\nRecovering from illness\nclear (something) up\ncolour\ncorrect\ncurability\ncurably\ncurative\nget over something/someone\ngranulate\nhold\nrecovery\nrehabilitate\nrehabilitation\nrehydrate\nremedial\nremission\nresponsive\nresponsiveness\nself-healing\nsleep\ntherapeutic\nSee more results »"}