{"id":175092,"name":"hearing","type":"noun","us_sound":"ˈhɪr.ɪŋ","us_link":"../audio/h/hearing.mp3","uk_sound":"ˈhɪə.rɪŋ","uk_link":"../audio/h/ukheads023.mp3","content":"hearing noun\n(MEETING)\nAdd to word list\nAdd to word list\n[ C ] an official meeting that is held to collect the facts about an event or problem: A disciplinary hearing will examine charges of serious professional misconduct against three surgeons.(fair) hearing I think we should give him a (fair) hearing (= we should listen to what he wants to say).\nMore examplesFewer examplesHe didn't feel he got a fair hearing in court.Did he give your complaints a sympathetic hearing?There is to be a public hearing next week in the Town Hall.The evidence was submitted at a pre-trial hearing.The hearing will be held behind closed doors.\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\nextrajudicial\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\npleading\npower of attorney\nprecedent\npretrial\nprobate\nthe Webster ruling\nwardship\nwitness to something\nwobbler\nSee more results »\nhearing noun\n(ABILITY)\n[ U ] the ability to hear: He's getting old and his hearing isn't very good.hearing loss He suffered hearing loss from testing aircraft engines.\nSMART Vocabulary: related words and phrases\nThe senses in general\nhyperacute\nhyperaesthetic\nintersensory\nnight vision\nnon-visual\nsensate\nsensately\nsensation\nsense\nsensory\nsensually\nsight\nsmell\nsynaesthesia\nsynesthesia\ntaste\ntouch\nvision\nSee more results »\nable to hear: We wanted to create something that both deaf and hearing audiences could enjoy. Opposite\ndeaf\nSMART Vocabulary: related words and phrases\nUsing the ears\nattend\naurally\nbe all ears idiom\ncatch\ncloth ears\near\nearshot\neavesdrop\neavesdropper\neavesdropping\ngrommet\nhark\nlend\nlend an ear idiom\nmonaural\nmonaurally\noverhear\nprick\nprick (something) up\nsensorineural\nSee more results »\nhearing noun\n(ABILITY TO HEAR)\nAdd to word list\nAdd to word list\n[ U ] the ability to hear sounds: Since he’s gotten older, his hearing isn’t what it used to be.\nhearing noun\n(MEETING)\n[ C ] an official meeting that is held to gather the facts about an event or problem: A Senate subcommittee is holding hearings about the mortgage crisis.\nAdd to word list\nAdd to word list\na meeting of a group of people, for example judges or politicians, to hear the facts relating to a legal problem or subject of public interest before they make a decision about it: hold/schedule a hearing A hearing before Judge L.A. Harris Jr. is scheduled for Wednesday.a Congressional/Senate/committee hearing Senate hearings on the Commission's recommendations will begin next month.a full/preliminary hearing With a preliminary hearing, a defendant gets a chance to see evidence against him or her. a court hearing See also\nconfirmation hearing\ndisciplinary hearing\npublic hearing"}