{"id":175087,"name":"hear","type":"verb","us_sound":"hɪr","us_link":"../audio/h/hear.mp3","uk_sound":"hɪər","uk_link":"../audio/h/ukheads020.mp3","content":"hear verb\n(RECEIVE SOUND)\nAdd to word list\nAdd to word list\nA1 [ I or T ] to receive or become conscious of a sound using your ears: She heard a noise outside. My grandfather is getting old and can't hear very well. You'll have to speak up, I can't hear you. [ + obj + -ing verb ] I heard/I could hear someone calling my name. [ + obj + infinitive without to ] At eight o'clock Jane heard him go out.\nMore examplesFewer examplesCan you hear that strange clicking noise?I could hear someone crying in the next room.She spoke so quietly that I could barely hear her.The human ear cannot hear very high-frequency sounds.We heard some shooting in the night.\nSMART Vocabulary: related words and phrases\nUsing the ears\nattend\naurally\ncatch\ncloth ears\near\nearshot\neavesdrop\neavesdropper\neavesdropping\ngrommet\nhark\nhearing\nlend\nlend an ear idiom\nmonaural\nmonaurally\noverhear\nprick\nprick (something) up\nsensorineural\nSee more results »\nhear verb\n(BE TOLD)\nB1 [ I or T ] to be told information about something: Have you heard the news? If you haven't heard by Friday, assume I'm not coming. [ + question word ] Have you heard what's happened? [ + (that) ] I hear (that) you're leaving.\nMore examplesFewer examplesI don't want to hear about it - it's no concern of mine!He was sad to hear that two of his trusted workers were leaving.I was alarmed to hear that she was coming.I was fascinated to hear about his travels in Bhutan.I'd be interested to hear more about your work.\nSMART Vocabulary: related words and phrases\nFinding and discovering\nascertain\nbreak (fresh/new) ground idiom\nbreakthrough\nbring something to light idiom\ncatch someone red-handed idiom\nflush someone/something out\nfossick\nfound\ngeocache\ngeocaching\npinpoint\nrake\nred-handed\nrediscover\nrediscovery\nrefind\nrefound\nsniff\nsuss\nuncover\nSee more results »\nhear verb\n(LISTEN)\nA2 [ T ] to listen to someone or something with great attention or officially in court: I heard a really interesting programme on the radio this morning. [ + infinitive without to ] I heard the orchestra play at Carnegie Hall last summer. An audience gathered to hear him speak.formal Lord, hear our prayers. The case will be heard (= officially listened to) by the High Court.\nThesaurus: synonyms, antonyms, and examples\nto listen to someone or somethinglistenAre you listening to me? I'm talking to you.hearAn audience gathered to hear him speak.eavesdropHe was eavesdropping on our conversation.listen in onI wish my brother would stop listening in on my phone calls.hear someone outAt least hear me out before you make up your mind.\nSee more results »\nMore examplesFewer examplesA crowd had gathered to hear her speak.Will you rewind the tape so we can hear it again?I heard a good programme on the radio last night.Of all the songs I've heard tonight, that's the best yet.The priest heard his confession.\nSMART Vocabulary: related words and phrases\nUsing the ears\nattend\naurally\ncatch\ncloth ears\near\nearshot\neavesdrop\neavesdropper\neavesdropping\ngrommet\nhark\nhearing\nlend\nlend an ear idiom\nmonaural\nmonaurally\noverhear\nprick\nprick (something) up\nsensorineural\nSee more results »\nGrammar\nHear, see, etc. + object + infinitive or -ingWe can use either the infinitive without to or the -ing form after the object of verbs such as hear, see, notice, watch. The infinitive without to often emphasises the whole action or event which someone hears or sees. The -ing form usually emphasises an action or event which is in progress or not yet completed. …\nHear that, see thatWe use hear that and see that to introduce new pieces of information. When we do this, the verbs hear and see mean ‘understand’ or ‘notice’. We normally use hear when we are thinking of something someone told us, and see when we are thinking about something we read about or saw. We often use the verbs in the present simple and sometimes leave out that: …\nHear or listen (to)?‘Hearing’ is an event; it is something which happens to us as a natural process. ‘Listening’ is an action; it is something we do consciously. …\nIdioms\ncan't hear yourself think\ndo you hear?\nhear tell (of)\nhear wedding bells\nhear, hear!\nI must be hearing things\nnot hear the end/last of something\nwill never hear the end of it\nwon't hear a word (said) against someone/something\nyou could have heard a pin dropPhrasal verbs\nhear from someone\nhave heard of someone/something\nnot hear of something\nhear something of someone\nhear someone out\nhear verb\n(RECEIVE SOUND)\nAdd to word list\nAdd to word list\n[ I/T ] to receive or become aware of sounds with your ears: [ T ] I can’t hear you with the TV on. [ I ] After a long trip on a plane, I don’t hear very well for a few hours.\nhear verb\n(LISTEN)\n[ T ] to listen to what someone is saying or sounds being made: I heard him interviewed on the radio this morning. Have you heard the group’s latest recording?\nhear verb\n(BE TOLD)\n[ I/T ] to be told or informed about: [ T ] Have you heard the news? [ I ] I hadn’t heard about that. [ + (that) clause ] I hear (that) your house is up for sale. [ T ] I’ve heard a lot about you from my sister and am glad to meet you.\nIdiom\nnever hear the end of itPhrasal verbs\nhear someone out\nhear from someone"}