{"id":175326,"name":"heavyweight","type":"noun","us_sound":"ˈhev.i.weɪt","us_link":"../audio/h/usheart024.mp3","uk_sound":"ˈhev.i.weɪt","uk_link":"../audio/h/ukheave009.mp3","content":"Add to word list\nAdd to word list\n[ C or U ] a boxer who is in the heaviest weight group, or this division of boxing weight: He was short for a heavyweight and had only a short reach.heavyweight champion Mike Tyson was heavyweight champion of the world.heavyweight title Ali defeated Sonny Liston in 1964 for the world heavyweight title. at heavyweight He has held world titles at light heavyweight and, briefly, at heavyweight. Compare\nbantamweight\ncruiserweight\nfeatherweight\nflyweight\nlight heavyweight\nlightweight\nmiddleweight\nsuperheavyweight\nwelterweight\n[ C ] a person or thing that is important or serious and that other people notice: Her extraordinary intelligence and speaking ability made her a political heavyweight. Compare\nlightweight adjective (NOT SERIOUS) disapproving\nSMART Vocabulary: related words and phrases\nFighting sports\naikido\nall-in wrestling\narm-wrestling\nbantamweight\nblack belt\nfeint\nfull nelson\ngrappler\ngumshield\nhalf nelson\nhammerlock\nknockout\nleft-hander\npugilistic\npunch-drunk\npunchbag\npuncher\npunching bag\nrope\nwrestler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nImportant people and describing important people\nImportant and essential things\nheavyweight noun [C]\n(BOXING)\nAdd to word list\nAdd to word list\nin boxing, a competitor who weighs more than 175 pounds, or 79.5 kilograms, and is in the heaviest group\nheavyweight noun [C]\n(IMPORTANT PERSON)\nsomeone who has a lot of power in a particular business or activity: a political heavyweight\nAdd to word list\nAdd to word list\na very successful and powerful person or company: In order to promote London as a world financial centre, the Prime Minister will meet with City heavyweights later this week.a political/industry/market heavyweight Market heavyweights will update investors in the first-quarter earnings season. a heavyweight backer/broker See also\nlightweight noun"}