{"id":175308,"name":"heavy","type":"adjective","us_sound":"ˈhev.i","us_link":"../audio/h/heavy.mp3","uk_sound":"ˈhev.i","uk_link":"../audio/h/ukheave008.mp3","content":"heavy adjective\n(WEIGHING A LOT)\nAdd to word list\nAdd to word list\nA2 weighing a lot, and needing effort to move or lift: heavy equipment heavy work/liftinghow heavy How heavy is that box? (= How much does it weigh?)\nThesaurus: synonyms, antonyms, and examples\nweighing more than normalheavyWow, this suitcase is really heavy.weightyThe shelves were full of large, oversized dictionaries and other weighty volumes.weigh a tonMy old laptop weighs a ton compared to this new table. super-heavyThey sell a midsize SUV, but their latest SUV is super-heavy.ultra-heavyShe bought an ultra-heavy motorcycle for long-distance rides.\nSee more results »\nMore examplesFewer examplesThis box is really heavy - can we put it down for a minute?He laboured up the hill with his heavy load.Several pieces of heavy equipment had to be manhandled into the lorry.These books are too heavy for me to carry.In the past, armies used catapults to hurl heavy stones at enemy fortifications.\nSMART Vocabulary: related words and phrases\nThick, dense and heavy\nblocky\ncakey\nchunkily\nchunkiness\nchunky\nclaggy\ndense\ndensely\nheavily\nheaviness\nheftily\nhefty\nlumpen\nponderous\nthicken\nthickening\nthickly\nthickness\nultra-heavy\nweigh\nSee more results »\nheavy adjective\n(TO A GREAT DEGREE)\nB1 (especially of something unpleasant) of very or especially great force, amount, or degree: a heavy blow to the head heavy fighting heavy traffic heavy rain/snow a heavy smoker/drinker a heavy sleeper heavy seas\nsea that is rough with large waves: The ship ran aground in heavy seas.\nSee more\nMore examplesFewer examplesOur armies have come under heavy bombardment.The unusually heavy rain caused flash floods in several mountain villages.Despite incurring heavy losses, the rebels now hold the town and the surrounding hills.Both the armies suffered heavy losses in the battle.The marriage ran into trouble because of her husband's heavy drinking.\nSMART Vocabulary: related words and phrases\nSerious and severe\nacutely\nacuteness\nbe no laughing matter idiom\ncatastrophic\ncatastrophically\nchronic\ncritically\ndire\nfatal\ngrave\ngrievously\nheaviness\nhyperacute\nnon-fatal\nnon-serious\nswingeing\nterminal\nterminally\ntoughness\nutmost\nSee more results »\nheavy adjective\n(SOLID)\nthick, strong, solid, or strongly made: a heavy winter coat a heavy meal (= a large amount of solid food) a big man with heavy features\nHeavy soil is thick and difficult to dig or walk through.\nthick, solid-looking, and not delicate: The sun disappeared behind heavy clouds.\nSMART Vocabulary: related words and phrases\nPhysically strong and powerful\n(as) tough as old boots idiom\nbilly-o\nbrute\nbulletproof\nburly\nimpregnably\nindestructible\nindestructibly\nindustrial-strength\nintensely\nruggedly\nshatterproof\nshockproof\nsinewy\nsouped-up\nstalwart\nvengeance\nviolent\nwashboard stomach\nwith a vengeance idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSoil\nAnimal physiology: fat or well-built\nheavy adjective\n(MACHINES)\nC2 Heavy machines or vehicles that are very large and powerful: heavy artillery/machinery\nSMART Vocabulary: related words and phrases\nBig and quite big\nappreciable\nbaronial\nbigly\nbloated\nboxcar\nbulky\nfullness\ngrandly\ngrowthy\nheaping\nhearty\nheftily\nhefty\npalatially\npumped\nrambling\nroomy\nroyal\nroyally\nthe bigger the better idiom\nSee more results »\nheavy adjective\n(UNPLEASANT)\nold-fashioned slang used to describe something such as a situation that is dangerous or unpleasant: Then the police arrived and things got really heavy.\nSMART Vocabulary: related words and phrases\nSerious and unpleasant\nabominable\nabominably\nabysmal\nabysmally\napocalyptic\nfraught\nfrightful\nfrom hell idiom\nfun\nghastliness\nnoisome\nnot be all fun and games idiom\nnoxiously\nobjectionable\nobjectionably\nunpleasantness\nunpretty\nunspeakable\nunspeakably\nunsupportable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDangerous and harmful\nIdioms\na heavy date\nhave a heavy foot\na heavy heart\nheavy hitter\nbe heavy on someone\nbe/go heavy on something\nheavy with sth\nmake heavy weather of something\nheavy noun [C]\n(STRONG MAN)\nslang a large strong man employed to protect someone else or to frighten other people: Frank always took a couple of heavies along with him when he went collecting his debts.\nSMART Vocabulary: related words and phrases\nProtection and protectors\nadopt\nadoptable\naegis\nanti-shark\nanti-skid\nchaperone\ncustodian\ncybersecurity\ndefence mechanism\nden mother\ndoorkeeper\nelder care\nmuzzle\nprecaution\npreservationist\nsafe space\nsafeguarding\nsafekeeping\nsafety net\nsecurity guard\nSee more results »\nheavy noun [C]\n(BOXER)\ninformal a boxer or wrestler who competes in the heaviest weight group: At that point in his career, there were no great heavies capable of pushing him. Synonym\nheavyweight\nMore examplesFewer examplesHe describes the country's heavies as \"ordinary fighters\", but rates them well ahead of their American counterparts. You take your chances going to the fights, especially to see the heavies, whose bouts sometimes last less than a minute.\nSMART Vocabulary: related words and phrases\nFighting sports\naikido\nall-in wrestling\narm-wrestling\nbantamweight\nblack belt\nfeint\nfull nelson\ngrappler\ngumshield\nhalf nelson\nhammerlock\nleft-hander\npugilist\npugilistic\npunch-drunk\npunchbag\npuncher\npunching bag\nsouthpaw\nwrestler\nSee more results »\nheavy adjective [-er/-est only]\n(WEIGHING A LOT)\nAdd to word list\nAdd to word list\nweighing a lot: The piano’s much too heavy for one person to lift. Bob’s much heavier than the last time I saw him.\nheavy adjective [-er/-est only]\n(SOLID)\nthick, strong, solid, or looking that way: heavy clouds heavy cream It’s too hot today for a heavy meal (= a large, cooked meal that is hard to digest).\nheavy adjective [-er/-est only]\n(GREAT DEGREE)\nof great amount, or degree, or force: heavy snow/rain/fog heavy traffic a heavy workload a heavy sleeper heavy fighting\nAdd to word list\nAdd to word list\nlarger in number or amount than usual: heavy taxes/fines/subsidies Those found to be violating the law could face heavy fines. Salaries and bonuses of directors have been cut by a third after heavy criticism of 'fat-cat' payments. There are worries that the dollar will come under heavy pressure later in the year. a heavy burden/debt/loss heavy demand/selling/investment\ninvolving a lot of work and effort: a heavy workload/schedule\nheavy on sth\nhaving a lot of something: Some faculty members have criticized the board as too heavy on business people and too light on educational experience.\npay a heavy price (for sth)\nto be in a very difficult situation because of a mistake or bad decision that has been made: If we reject the deal, we will pay a heavy price in terms of trade, jobs, and investment."}