{"id":175491,"name":"hedge","type":"noun","us_sound":"hedʒ","us_link":"../audio/h/hedge.mp3","uk_sound":"hedʒ","uk_link":"../audio/h/ukheave019.mp3","content":"hedge noun [C]\n(BUSHES)\nAdd to word list\nAdd to word list\nB2 a line of bushes or small trees planted very close together, especially along the edge of a garden, field, or road: a privet hedge\nRosmarie Wirz/Moment/GettyImages\nMore examplesFewer examplesShe kicked the ball so powerfully that it flew over the hedge.I was sitting in the garden when suddenly my neighbour's head bobbed up from behind the hedge.\nSMART Vocabulary: related words and phrases\nGardening - general words\nallotmenteer\nallotmenteering\naquaponics\narborist\nbed\nhedging\nhomegrown\nhorticultural\nhorticulturally\nhorticulture\nprune\nregraft\nregreen\nrepot\nresod\nweeding\nweedy\nwindow box\nxeriscaping\nyardwork\nSee more results »\nhedge noun [C]\n(PROTECTION)\na way of protecting, controlling, or limiting something: hedge against She'd made some overseas investments as a hedge against rising inflation in this country.\nSMART Vocabulary: related words and phrases\nRange and limits\nall the way to idiom\nambit\nanywhere\nband\nbeyond the bounds of something\ncompass\nfinitude\ngamut\nglass ceiling\nlimit\nlimited\nparametrically\nproviso\nrealm\nrestricted\nscope\nspectrum\nspread\nstretch\nstring\nSee more results »\nhedge noun [C]\n(GRAMMAR)\nlanguage\n&#160; specialized a word or phrase that makes what you say less strong\nSMART Vocabulary: related words and phrases\nLinguistics: sentences & expressions\nadage\nasyndetic\nasyndetically\nasyndeton\nbackchannel\nclause\ncoin\ncomplex sentence\ncompound sentence\nconcessive clause\ndictum\nmotto\noperative\nphrase\nsentence\nslogan\nsubsentence\nthe operative word idiom\nto coin a phrase idiom\nTrumpism\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming and making less strong\nGrammar\nHedges (just)We use hedges to soften what we say or write. Hedges are an important part of polite conversation. They make what we say less direct. The most common forms of hedging involve tense and aspect, modal expressions including modal verbs and adverbs, vague language such as sort of and kind of, and some verbs. …\nIdiom\nlook like/as if you've been dragged through a hedge backwards\n[ T + adv/prep, usually passive ] to limit something severely: be hedged about/around with We've got permission, but it's hedged about/around with strict conditions.\n[ I ] to try to avoid giving an answer or taking any action: Stop hedging and tell me what you really think.\nSMART Vocabulary: related words and phrases\nLimiting and restricting\nanti-libertarian\nboundary\nbox someone/something in\nchain\nchain someone to something\ncripplingly\ncrowd\ncurb\ncurtail\ncurtailment\nkeep (herself) to herself idiom\nkeep something down\nlimit\nlimitation\nlimitative\nstraitly\nstranglehold\nstunt\nsuffocatingly\ntempered\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDigressing and being indirect or evasive\nIdiom\nhedge your bets\nhedge noun [C]\n(BUSHES)\nAdd to word list\nAdd to word list\na line of bushes or small trees planted close together, esp. along the edge of a yard or road\nhedge noun [C]\n(PROTECTION)\na means of protection, control, or limitation: She invested in foreign companies as a hedge against inflation.\nhedge verb [I/T]\n(LIMIT)\nto limit something severely: [ T ] Congressmen were warned against hedging their support for the missile program.\nTo hedge is also to try to avoid giving an answer or taking any action: [ I ] Officials continued to hedge on exactly when the program would begin.\nIdiom\nhedge your bets\nAdd to word list\nAdd to word list\nan investment made in order to reduce the risk of losing money on shares, bonds, etc. that you own, for example, by buying futures (= agreements to sell shares for a particular price at a date in the future) or options (= the rights to buy or sell shares for a particular price within a particular time period): These formulas are devised to tell the bank what kind of hedges to purchase to provide the best possible protection of its assets.a hedge against sth In recent years, investors have also bought gold as a hedge against US dollar weakness. inflation hedges See also\ncurrency hedge\nFINANCE, STOCK MARKET to reduce the risk of losing money on shares, bonds, etc. that you own, for example by buying futures (= agreements to sell shares for a particular price at a date in the future) or options (= the rights to buy or sell shares for a particular price within a particular time period): European airports have been attracting investors keen to hedge long-term pension liabilities. We don't tend to hedge at all - in either stock or bond funds.hedge against sth Companies can hedge against currency movements, but many choose not to.hedge risk/exposure Airbus has hedged enough of its dollar exposure that a major short-term impact is unlikely.\nhedge your bets\nto reduce the risk of failure or of losing money by making sure that you can choose between different possibilities: Some business leaders hedged their bets by donating money to both parties. Futures contracts allow companies in the nuclear sector to hedge their bets against price rises this year, next year or 10 years from now."}