{"id":175525,"name":"hedging","type":"noun","us_sound":"ˈhedʒ.ɪŋ","us_link":"../audio/h/cdo1121ushedg2016.mp3","uk_sound":"ˈhedʒ.ɪŋ","uk_link":"../audio/h/cdo1121ukhedg1808.mp3","content":"hedging noun [U]\n(AVOIDING ANSWER)\nAdd to word list\nAdd to word list\na way of avoiding giving a direct answer or opinion: There has been too much hedging and delay, and not enough action. I notice the hedging in the report, full of \"it could be\" and \"seems\".\nMore examplesFewer examplesAfter years of hedging, officials have admitted low levels of plutonium and other radioactive contaminants in the site's groundwater. Typical politicians never answer questions, always repeat themselves, and say nothing without a lot of hedging.\nSMART Vocabulary: related words and phrases\nDigressing and being indirect or evasive\nbury the lede idiom\ncandy coat\ncandy coating\ncandy-coated\ncircumlocution\ncircumlocutory\nequivocate\nglancingly\ngloss over something\ngo off on a tangent idiom\nhedge\nimplicit\nimplicitly\nindirection\nmealy-mouthed\nmincing\nobfuscate\nobscure\nstray\nveil\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCautious and vigilant\nhedging noun [U]\n(AVOIDING RISK)\nfinance &amp; economics\n&#160; specialized a way of controlling or limiting a loss or risk: This type of hedging protects the trader from getting a margin call, as the second position will gain if the first loses, and vice versa. currency hedging They posted improved profits helped by successful foreign currency hedging.hedging instrument You can protect yourself against future rises in interest rates by means of a hedging instrument known as a forward rate agreement. hedging of bets\nthe act of protecting yourself against loss by supporting more than one possible result or both sides in a competition: This could be seen as more hedging of bets by the electorate.\nSee more\nMore examplesFewer examplesWhen the price of gas spiked, they would have lost money on one end, and made it on the other end, which is what hedging is all about.Without hedging, at current exchange rates the company would lose about €2bn this year.These short investments have served as a useful hedging tool during periods of dramatic market decline.\nSMART Vocabulary: related words and phrases\nStock markets\nalgo\nanti-city\nanti-dilution\nanti-speculation\nanti-speculative\nbond\nbroker\nbull\nbull market\ndead cat bounce\nequity\nfootsie\ninconvertible\ninitial coin offering\nintangible asset\nnon-controlling\nnon-convertible\nrogue trader\nstockbroker\nthe Nikkei index\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCautious and vigilant\nhedging noun [U]\n(BUSHES)\nmainly UK bushes or small trees planted very close together, especially along the edges of a garden, field, or road: One of my favourite parts of the garden is a raised lawn, flanked by two lines of yew hedging. Make the back of the house secure by using prickly hedging or high fencing.\nmainly UK the activity of planting, cutting, or looking after hedging in a garden, field, etc.: He did odd jobs for people such as roofing and hedging. She keeps busy in the garden with pruning, weeding, digging, and hedging.\nMore examplesFewer examplesThere are long rows of vegetables protected by box hedging. Formal clipped hedging makes excellent screening and reduces noise from busy roads.Tents and caravans have fully serviced gravel pitches with neat hedging. Farmers can get government subsidies for such things as new buildings, fencing, hedging, and livestock.\nSMART Vocabulary: related words and phrases\nParts of gardens\narbour\nbed\nborder\nbower\nfernery\ngreen wall\nherbaceous border\nkitchen garden\nlawn\nliving wall\npatio\nperennial border\nraised bed\nrock garden\nrockery\nshrubbery\nterrace\nvertical garden\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBushes & shrubs\nGardening - general words\nAdd to word list\nAdd to word list\nthe activity of reducing the risk of losing money on shares, bonds, etc. that you own, for example, by buying futures (= agreements to sell shares for a particular price at a date in the future) or options (= the rights to buy or sell shares for a particular price within a particular time period): Originally hedge funds took a more traditional approach to hedging: they bought shares they thought would rise in companies they expected to do well. Hedging instruments such as futures contracts are priced in dollars. a hedging policy/strategy/programme"}