{"id":175654,"name":"height","type":"noun","us_sound":"haɪt","us_link":"../audio/h/height.mp3","uk_sound":"haɪt","uk_link":"../audio/h/ukheft_007.mp3","content":"Add to word list\nAdd to word list\nB1 the distance from the top to the bottom of something, or the quality of being tall: The sheer height of New York's skyscrapers is so impressive. She's about average height (= neither short nor tall).\nThesaurus: synonyms, antonyms, and examples\nthe distance from the bottom to the topheightThe exact height of Everest is a matter for debate.tallnessThe tallness of the building makes me dizzy.statureHe was a man of short stature.altitudeThe plane has reached a cruising altitude of 36,000 feet.elevationThe city's elevation is 9,010 feet.\nSee more results »\nB1 the particular distance that something is above a surface: The bullet entered the body at chest height. heights\nhigh places, or the top of hills: afraid of heights Don't go up the tower if you're afraid of heights.\na high level of success: reach the heights of He reached the heights of his profession at the age of 35.\nSee more the height of something\nC2 the time when a situation or event is strongest or most full of activity: August is the height of the tourist season.\nan extreme example of something: the height of fashion\nthe time when you are most successful in what you do: at the height of something She was at the height of her career when he first met her.\nSee more\nMore examplesFewer examplesThe children lined up in order of height.He's always been very sensitive about his height.My little brother is only half my height.We are flying at a height of 9 000 metres.She had fallen, it appeared, from a great height.\nSMART Vocabulary: related words and phrases\nHigh, tall and deep\nabysmal\naltitude\nbottomless\ndeep\ndwarf\nectomorph\nelevated\neye level\nhigher\nlofty\novershadow\nrangy\nrear\nrear above/over something/someone\nstand\ntall\ntallish\ntallness\ntower\ntower above/over someone/something\nSee more results »\nGrammar\nMeasurementsWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nArea: length, width, depth and heightWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nWeight and volumeWe use the verb weigh to measure weight: …\nFrequency, speed, timeWe use many different expressions to describe frequency, speed and time. Here are some of them: …\nAdd to word list\nAdd to word list\nthe distance from the top to the bottom of something, or the quality of being tall: [ C ] The heights of the two towers are equal. [ U ] She’s of average height (= neither unusually short nor tall).\nHeight also refers to the distance that something is above a surface: [ U ] You can adjust the height of the chair with this lever. the height of\nThe height of a condition or event is when it is most full of activity or when it is at its top level of achievement: She was at the height of her career when they met. the height of\nThe height of also means an extreme example of: the height of luxury/power/stupidity"}