{"id":175688,"name":"heir","type":"noun","us_sound":"er","us_link":"../audio/h/air.mp3","uk_sound":"eər","uk_link":"../audio/h/ukaha__020.mp3","content":"Add to word list\nAdd to word list\nC2 [ C ] a person who will legally receive money, property, or a title from another person, especially an older member of the same family, when that other person dies: heir to The guest of honour was the Romanov heir to the throne of all Russia.son and heir Despite having a large family, they still had no son and heir. Compare\nheiress\n[ C usually singular ] someone who now has responsibility for dealing with a problem or situation that existed or was created earlier: heir to The French finance minister is heir to a tradition of central control that goes back to Louis XIV.\n[ C usually singular ] someone who continues to do the work of someone important who has died, or someone who has the same position as the previous person who held that position\nSMART Vocabulary: related words and phrases\nInheriting & bequeathing\nadvance directive\nassign\nbeneficiary\nbequeath\nbequest\ncadger\nexecutor\nheir apparent\nheiress\nheirless\nheirloom\ninherit\ninheritance\npass something down\npatrimony\npond life\npond scum\nprimogeniture\nsettle\ntestate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReplacing and exchanging\nAdd to word list\nAdd to word list\na person who will receive or already has received money or property from another person at the time of that other person’s death: My cousin Robert is the only heir to my uncle’s fortune.\nAdd to word list\nAdd to word list\nLAW the person who legally receives money, property, or possessions from someone who has died: Court documents showed that each heir was entitled to land and shares of stock in the businesses.heir to sth When her father died, she became the sole heir to his £40,000 estate.heir of sth The heirs of the company's founder control about 39% of the business.\nsomeone who becomes the new leader of a large organization or company after the old leader leaves: heir to sb He was a potential heir to retiring CEO Jack Welch."}