{"id":175941,"name":"hell","type":"noun","us_sound":"hel","us_link":"../audio/h/hell.mp3","uk_sound":"hel","uk_link":"../audio/h/ukheft_022.mp3","content":"Add to word list\nAdd to word list\nB2 [ S or U ] an extremely unpleasant or difficult place, situation, or experience: sheer hell Work is sheer hell at the moment. The last few months have been absolute hell. See also\nhellhole informal\ninfernal\nB2 [ S ] (also Hell) in some religions, the place where some people are believed to go after death to be punished for ever for the bad things they have done during their lives: go to hell I'll go to Hell for this. make someone's life hell informal (also make life hell for someone)\nto cause a lot of problems for someone and make them very unhappy: I worked for her for two years and she made my life hell.\nSee more\nMore examplesFewer examplesLiving with her has been pure hell recently.I'd see her in hell before I'd agree to an arrangement like that.It was a living hell for the soldiers out there on the front line.\" Didn't you enjoy teaching, then?\" \"No, it was sheer hell - I'd never be a teacher.\"She had to suffer the hell of giving birth to her dead baby.\nSMART Vocabulary: related words and phrases\nRelgious concepts: Hell\nchthonic\ndamn\ndamnation\ndamned\ndevildom\nfire\nfire and brimstone idiom\nHades\nhellfire\ninfernal\ninfernally\nunderworld\nYou can also find related words, phrases, and synonyms in the topics:\nReligious concepts: life after death\nIdioms\nall hell breaks loose\ncome hell or high water\nfor the hell of it\nfrom hell\ngive someone hell\ngo to hell\ngo to hell and back\ngo to hell in a handcart\nhell for leather\nhell on earth\nMore idioms\nbe hell on wheels\nthere'll be hell to pay\nto hell with someone/something\nwhen hell freezes over\nB2 used to express anger or to add emphasis: Oh hell, I've forgotten my key!what the hell What the hell was that noise?hope in hell We don't have a hope in hell (= we have no hope) of meeting such a tight deadline.\nSMART Vocabulary: related words and phrases\nExpressions of anger\nay\nbally\nbeg\nbiscuit\nblast\nblasted\nbloody\ndickens\ndoggone\ndrat\ndratted\negad\nfie\nflaming\nla\nmarry\nneed\nprecious\nput/stick that in your pipe and smoke it! idiom\nrats\nSee more results »\nIdioms\nannoy, frighten, scare, etc. the hell out of someone\n(as) ... as hell\nbe hell-bent on something\nbeat the hell out of someone\nget the hell out of somewhere\nthe hell someone is/does, etc.\nhell of a\nhell yes/no\nlike hell\nto hell\nMore idioms\nwhat the hell\nhell noun [U]\n(PLACE)\nAdd to word list\nAdd to word list\n(in some religions) the place where some people are believed to go after death to be punished forever for the bad things they have done\nhell noun [U]\n(CONDITION)\nan extremely unpleasant or difficult place, situation, or experience: Holidays are hell for me. We went through hell during the flood (= had an extremely bad experience). Idioms\nthe hell out of\nto hell with someone/something\nhell exclamation\n(EXPRESSION)\nused to express anger, or to give emphasis to an expression: Oh hell, I forgot my keys! Her dad was mad as hell. Note: This may be considered offensive by some people."}