{"id":176020,"name":"hello","type":"exclamation","us_sound":"heˈloʊ","us_link":"../audio/h/hello.mp3","uk_sound":"heˈləʊ","uk_link":"../audio/h/ukheft_029.mp3","content":"Add to word list\nAdd to word list\nA1 used when meeting or greeting someone: Hello, Paul. I haven't seen you for ages. I know her vaguely - we've exchanged hellos a few times.say hello I just thought I'd call by and say hello.a big hello And a big hello (= welcome) to all the parents who've come to see the show.\nA1 something that is said at the beginning of a phone conversation: \"Hello, I'd like some information about flights to the US, please.\"\nsomething that is said to attract someone's attention: The front door was open so she walked inside and called out, \"Hello! Is there anybody in?\"\ninformal said to someone who has just said or done something stupid, especially something that shows they are not noticing what is happening: She asked me if I'd just arrived and I was like \"Hello, I've been here for an hour.\"\nold-fashioned an expression of surprise: Hello, this is very strange - I know that man.\nMore examplesFewer examplesCathy poked her head round the door to say hello.When he said hello, I felt my face turn bright red.Hello - could I speak to Ann, please?After we'd said our hellos, it all went quiet and nobody knew what to do.Oh, hello - what are you doing in here?\nSMART Vocabulary: related words and phrases\nWelcoming, greeting & greetings\nafternoon\nair kiss\naloha\nayup\nbid someone/something adieu\nfive\ng'day\ngod\nhello stranger idiom\nhiya\nhowdy\nlady\nmerry Christmas! idiom\nmind\nmorning\nnamaskar\npleased\npoke\npress the flesh idiom\nwish\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: interjections\nMeeting people\nGrammar\nGreetings and farewells: hello, goodbye, Happy New YearWhen we see someone we know, we usually exchange greetings: …\nSaying helloWhen we see someone we know, we usually exchange greetings: …\nSaying goodbyeWhen we leave people, we usually say something as we leave: …\nAdd to word list\nAdd to word list\nused when meeting or greeting someone: \"Hello, Paul,\" she said, \"I haven’t seen you for months.\" I know her vaguely – we’ve exchanged hellos a few times. Come and say hello to my friends (= meet them).\nHello is also said at the beginning of a telephone conversation.\nHello is also used to attract someone’s attention: She walked into the shop and called out, \"Hello! Is anybody here?\""}