{"id":176094,"name":"help","type":"verb","us_sound":"help","us_link":"../audio/h/help.mp3","uk_sound":"help","uk_link":"../audio/h/ukhellu006.mp3","content":"help verb\n(MAKE EASIER)\nAdd to word list\nAdd to word list\nA1 [ I or T ] to make it possible or easier for someone to do something, by doing part of the work yourself or by providing advice, money, support, etc.: How can I help you? I wonder if you could help me - I'd like some information about flights to New Zealand.help with My dad said he would help with the costs of (= give part of the cost of) buying a house. [ + obj + (to) infinitive ] The $10,000 loan from the bank helped her (to) start her own business. I feel that learning English will help (= improve) my chances of promotion at work. Nothing can help her now (= her situation is too bad for anyone to be able to improve it). See also\nhelpline\nThesaurus: synonyms, antonyms, and examples\nto help someonehelpCan I help you get that?aidThe project is designed to aid poorer countries.assistThe army arrived to assist in the search.collaborateWe collaborated on the project.cooperateSeveral countries are cooperating in the relief effort.benefitThe children have benefited greatly from the new facilities.\nSee more results »\nB2 [ I or T ] If something helps a difficult or painful situation, it improves it or makes it easier or less painful: The morphine didn't seem to help (the pain).\n[ + (to) infinitive ] If something or someone helps to do something, that thing or person is one of several reasons for it happening: help (to) The drought has helped (to) make this a disastrous year for Somalia.\nMore examplesFewer examplesThe college now has a counsellor to help students with both personal and work problems.We've got to enlist some people to help prepare the food.Could I have a glass of water to help these pills go down ?It's kind of you to offer to help.She derived great satisfaction from helping other people.\nSMART Vocabulary: related words and phrases\nHelping and co-operating\nabet\naccommodative\naid\nany port in a storm idiom\nassist\nassist with something\nattend\nbridge\ncarry\nfacilitate\nfacilitation\nfinancial assistance\ngive someone a leg up idiom\ngive/lend someone a helping hand idiom\nrecourse\nrelief\nrun errands idiom\nshare a platform idiom\nsponsor\nstart (something) off\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking things better\nhelp verb\n(STOP YOURSELF)\ncan't/couldn't help\nB1 If you can't/couldn't help something, such as acting in a particular way or making a particular remark, you are/were not able to control or stop it: It was awful, but I couldn't help laughing.\nSee more\nhelp verb\n(GIVE/TAKE)\nB1 [ T ] to give something to someone: help someone to Can I help you to some more soup?\nMore examplesFewer examplesFeel free to help yourself to coffee.\"May I help myself to some more food?\" \"Yes, of course.\"I wish my lodger would ask before helping himself to my food.My daughter just helps herself to anything she fancies from my wardrobe - usually my only good clothes!I'm not sure whether we should be helping ourselves to these snacks - perhaps they're meant for later.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\nafford\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nSee more results »\nhelp yourself B1\nto take something for yourself: \"Might I have some more bread?\" \"Please, help yourself!\"\nThesaurus: synonyms, antonyms, and examples\nto take something from someonetakeHe offered her the microphone but she wouldn't take it.take hold ofGet ready to take hold of the baton as the next runner approaches.snatchHe snatched the letter out of my hands before I could read it.stealThe car was stolen from right outside our house.pinchA thief pinched his wallet and phone.seizeFederal agents seized two computers.\nSee more results »\nSMART Vocabulary: related words and phrases\nTaking and choosing\nadopt\nadopted\nadoption\nappoint\nbags I... idiom\nbe your best bet idiom\ncull\nempanel\nfaute de mieux\nfavoured\nfilterable\ngo for someone\npicker\nRobin Hood\nselect\nselection\nselective\nselectively\nskim\nyou pays your money and you takes your choice/chance idiom\nSee more results »\nGrammar\nHelp somebody (to) doWe use help with or without an object: …\nIdioms\ngive/lend someone a helping hand\nGod help someone\nit can't be helped\nso help me (God)Phrasal verb\nhelp (someone) out\nA2 [ U ] the act of helping another person: Do you need any help with those boxes?help with Her parents gave her some help with her bank loan (= paid some of it). Synonyms\nto someone's aid\nassistance\nrelief\nsuccour UK literary\nsupport (HELP)\nThesaurus: synonyms, antonyms, and examples\nadviceadviceLet me give you some advice.helpI didn't know who to turn to for help.a piece of adviceLet me give you a piece of advice.counselI will miss his wise counsel.guidanceYoung people don't always appreciate the guidance offered by their parents and teachers.counsellingUK Victims of abuse usually need expert counselling.\nSee more results »\nB2 [ S ] something or someone that helps: Having a satnav would be a help.help (to) He was a great help (to me) while my husband was away.\n[ C ] UK old-fashioned someone who is employed to clean and do other small jobs: a home help the help old-fashioned\na person or the people employed to work in someone's home doing cleaning, cooking, caring for children, etc.: He was kind to the help. You needn't bother with that. The help will gather our dishes.\nMore examplesFewer examplesThe earthquake survivors are in desperate need of help.If you can just hold on I'll go and get some help.We really appreciate all the help you gave us last weekend.More help is needed for people on low incomes.If you need any help, please don't hesitate to ask.\nSMART Vocabulary: related words and phrases\nHelping and co-operating\nabet\naccommodative\naid\nany port in a storm idiom\nassist\nassist with something\nattend\nbridge\ncarry\nfacilitate\nfacilitation\nfinancial assistance\ngive someone a leg up idiom\ngive/lend someone a helping hand idiom\nrecourse\nrelief\nrun errands idiom\nshare a platform idiom\nsponsor\nstart (something) off\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHelpers and accomplices\nPeople who help or serve people professionally\nIdiom\nthere's no help for it\nhelp!\nA2 shouted by a person who is asking for someone to come and save them from a dangerous situation\nExamples\n\"Help! I'm drowning!\" \"Don't panic - I'm coming!\"A woman was leaning out of the window shouting, \"Help! Fire!\"\nSMART Vocabulary: related words and phrases\nLinguistics: interjections\naiyo\nattaboy\nattagirl\nauf Wiedersehen\naw shucks\ndoctor\neat your heart out idiom\nfigure\nmazel tov\nmore\nmore power to your elbow! idiom\nneed\nneed I say more? idiom\nperiod\nroll\nthe rest is history idiom\nyou should have seen/heard something/someone idiom\nyou the man! idiom\nyuk\nyum yum\nSee more results »\nhelp verb\n(MAKE EASIER)\nAdd to word list\nAdd to word list\n[ I/T ] to make it possible or easier for someone to do something: [ T ] How can I help you? [ T ] Please help those less fortunate than you are. [ + to infinitive ] Avoiding fatty foods and salt can help to bring down your blood pressure.\n[ I/T ] If something helps a difficult or painful situation, it improves it or makes it easier or less painful: [ T ] Aspirin will help relieve the pain.\n[ I/T ] You shout \"Help!\" in an emergency when you need the immediate support of someone else.\nhelp verb\n(GIVE/TAKE)\n[ T ] to serve something to someone, or to take something for yourself: Help yourself to more cake. Idiom\ncan’t helpPhrasal verb\nhelp (someone) out\nhelp noun [U]\n(ACT OF HELPING)\nthe act of making it possible or easier for someone to do something: Do you need help with those boxes? My parents gave us financial help when we bought our first house.\nAdd to word list\nAdd to word list\nworkers who are employed for a short time during periods when there is a lot of work: We often take on help during the busy season."}