{"id":176584,"name":"hemispheric","type":"adjective","us_sound":"ˌhem.ɪˈsfɪr.ɪk","us_link":"../audio/h/cdo1121ushemi2030.mp3","uk_sound":"ˌhem.ɪˈsfer.ɪk","uk_link":"../audio/h/cdo1121ukhemi1819.mp3","content":"hemispheric adjective\n(BRAIN)\nAdd to word list\nAdd to word list\nanatomy\n&#160; specialized relating to the hemispheres (= halves) of the brain: hemispheric dominance Early injury to the brain may result in a shift of hemispheric dominance for speech. The study examines the relationship between left and right hemispheric functioning in specific psychiatrically disordered populations.\nMore examplesFewer examplesThese results show that hemispheric dominance is based on a sophisticated mechanism. These findings support the idea that direction of gaze may influence asymmetrical hemispheric activation.The patient had bilateral ptosis with right hemispheric lesions. Other variables could also be isolated in order to examine their influence on hemispherical asymmetry.\nSMART Vocabulary: related words and phrases\nThe brain & nervous system\nalexithymia\nallism\nallistic\namygdala\nanterograde\nbrain\ncerebral hemisphere\ncerebration\nCSF\ndepressor\ndura\nencephalic\nencephalon\nmedulla oblongata\nneuroplasticity\nneuroscience\nneuroscientist\nneurotransmitter\nneurotypical\nvagus\nSee more results »\nhemispheric adjective\n(WORLD)\npolitics\n&#160; specialized relating to a hemisphere (= half) of the earth, especially the western half that includes North and South America: He made his first trips to Mexico and Canada and declared that his foreign policy, unlike that of previous presidents, would focus primarily on hemispheric affairs. We used to think pollution could be controlled locally and regionally, and now it is turning into a hemispheric problem.\nMore examplesFewer examplesHe is director of the Council on Hemispheric Affairs, a Latin-America-focused think tank in Washington.Leaders from North, South, and Central America plan to finalize a hemispheric free trade accord.The President attended a 34-nation hemispheric summit in Quebec.At the time he was considered an international, or at least hemispheric, menace.Hemispherical differences, like opposite seasons and solstices, don't faze me in the least.\nSMART Vocabulary: related words and phrases\nInternational relations: international politics & government\naccession\nallied\nAnglo-American\nanti-Stalinist\nbipolar\nconfederacy\nG20\nG7\nGATT\nGeneva Convention\ninternationalism\ninternationalize\noccupied\npariah\nperestroika\nthe G8\nthe new world order\nthe North-South divide\nthe World Trade Organization\nWTO\nSee more results »"}