{"id":177139,"name":"her","type":"pronoun","us_sound":"hɝː","us_link":"../audio/h/her.mp3","uk_sound":"hɜːr","uk_link":"../audio/h/ukhenpe008.mp3","content":"Add to word list\nAdd to word list\nA1 used, usually as the object of a verb or preposition, to refer to a woman, girl, or female animal that has just been mentioned or is just about to be mentioned: If your sister's around, bring her too. I gave her the letter. She's a beautiful horse - how long have you had her? Compare\nhers\nused to refer to a country, a boat, or a car: God bless this ship and all who sail in her.\nMore examplesFewer examplesShe was ill so I sent her some flowers to cheer her up.Rachel ran out of the room and slammed the door behind her.I'd like to find Debbie and talk to her about this.\nSMART Vocabulary: related words and phrases\nLinguistics: personal pronouns\n'em\nhe\nI, i\nit\nnumber one\npersonally\nS, s\ns/he\nshe\nthee\nthem\nthemself\nthey\nthou\nus\ny'all\nyou\nyou-all\nYours truly phrase\nyous\nSee more results »\nGrammar\nPronouns: personal (I, me, you, him, it, they, etc.)We use personal pronouns in place of noun phrases. We often use them to refer back to people and things that we have already identified (underlined): …\nSubject and object pronounsPersonal subject pronouns act as the subject of a clause. We use them before a verb to show who is doing the verb. We do not usually leave out the pronoun: …\nI, meWe use I and me to refer to the speaker or writer. I is the subject form and me is the object form: …\nYouWe use you to refer to the listener or reader. It is both the subject and the object form. You can refer to one person or more than one person. It is usually clear from the context whether you is singular or plural: …\nHe, him; she, herHe, him, she and her are singular third person pronouns. He and him are the masculine forms. She and her are the feminine forms: …\nItWe use it to refer to things: …\nWe, usWe use we and us to refer to different groups of people, but always including the speaker. We and us can refer to the speaker + the listener, or the speaker + other people but not the listener, or people in general including the speaker: …\nThey, themWe use they and them to refer to specific groups of people, things and animals: …\nHe, she, him, her, his, hersIn writing, we can use (s)he, he/she, him/her or his/her to refer to both sexes at the same time. When speaking formally, we say he or she and his or her: …\nbelonging to or connected with a woman, girl, or female animal that has just been mentioned or is known about: I'll see if Louisa will bring her guitar to the party. I don't know why she quit her job. We saw a mother duck with her ducklings.\nbelonging to a country, a boat, or a car: The boat sank with all her crew.\nMore examplesFewer examplesShe spends hours on the phone chatting to her friends.I'm a bit confused. Was that her husband or her son she was with?\nSMART Vocabulary: related words and phrases\nParticular and individual\nbe the very thing idiom\nbiomarker\ncalling card\ncapita\ncertain\nespecially\nindividualistic\nindividualistically\nindividuality\nindividualized\nindividually\nmatter\npeculiarity\nper capita\npersonally\npet\nprivate\nregard\nrespectively\nseparately\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: personal pronouns\nGrammar\nPronouns: possessive (my, mine, your, yours, etc.)We use pronouns to refer to possession and ‘belonging’. There are two types: possessive pronouns and possessive determiners. We use possessive determiners before a noun. We use possessive pronouns in place of a noun: …\nher pronoun\n(POSSESSIVE)\nAdd to word list\nAdd to word list\nbelonging to or connected with the person mentioned; the possessive form of she, used before a noun: Her name is Linda. She met her husband in college.\nher pronoun\n(OBJECTIVE)\nthe female being spoken about, who has already been mentioned; the objective form of she: I saw her yesterday."}