{"id":177284,"name":"here","type":"adverb","us_sound":"hɪr","us_link":"../audio/h/hear.mp3","uk_sound":"hɪər","uk_link":"../audio/h/ukheads020.mp3","content":"Add to word list\nAdd to word list\nA1 in, at, or to this place: I've lived here for about two years. I like it here.from here London is only 50 miles from here.come here Come here - I've got something to show you.over here How long are you over here (= in this country)?\nA2 used at the beginning of a statement to introduce someone or something: Here's Fiona - let me introduce you to her. Here's the book I said I'd lend you.\nA2 used to show that someone has arrived or that something has started: Here they are! We thought you'd never come! Here we are (= we have arrived) - I said it wouldn't take more than half an hour by car. Now that Christmas is here (= has begun), I might as well give up my diet.\nA1 used to say that someone or something that is near you: I don't know anything about this, but I'm sure my colleague here can help you. It says here (= in this piece of writing) that she was born in 1943.\nB2 now: Shall we break here and have a coffee?from here Where do we go/Where do we take it from here? (= What should we do next?) here (you are/go)\nA2 used when giving something to someone: \"Could you pass the sugar, please?\" \"Here you are.\"\nSee more\nMore examplesFewer examplesI'm surprised to see you here.You're not allowed to park here - your car will be towed away .He was here a moment ago but he's wandered off somewhere.It's important that there's always someone here to answer the phone during office hours.I've learned a lot about computers since I started work here.\nSMART Vocabulary: related words and phrases\nPresent\nall over\nappearance\nattend\nattendance\nattendant\nbe in at the kill idiom\nbulk\nfront\nimmanently\nin the flesh idiom\nkick\nkick around\nkill\nknock\npresent\nseropositive\nsit\nsit through something\nsynchronic\nsynchronically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPreceding and introducing\nCloseness in distance and time\nNow\nGrammar\nHere and thereHere and there are adverbs. …\nHere and there: meaningsWhen we use here, it typically refers to the place where the speaker is, and we see the position of people and things from the speaker’s point of view: …\nHere and there with this, that, these, those (demonstratives)We often use here with nouns that have this or these before them, and there with nouns that have that or those before them: …\nHere and there after prepositionsWe can use here and there after prepositions: …\nHere and there in front positionWe can use here and there in front position, with the subject and verb inverted. The most common expressions of this type are here is x, here comes x, there is x, there goes x: …\nHere you are, there you areWe can use here you are and there you are (or, in informal situations, here you go and there you go) when giving something to someone. Here and there have the same meaning in this use: …\nHere it is!There he is!We often use here + subject pronoun + be and there + subject pronoun + be at the moment of finding or meeting someone or something we have been looking for or waiting for: …\nHere I am!People often say that they have arrived or that someone else has arrived using here + subject pronoun + be: …\nHere: on the telephonePeople often use here to identify themselves on the telephone or in voicemail messages: …\nHello there!We often use there in informal situations after hello and hi: …\nIdioms\nbe here for someone\nbe here for something\nthe here and now\nhere and there\nhere goes!\nhere today, gone tomorrow\nhere we go\nhere we go (again)\nhere's to ...\nAdd to word list\nAdd to word list\nin, at, or to this place: I’ve lived here in Atlanta all my life. Please step over here for a minute. It hurts here, just above my ankle.\nHere can be used at the beginning of a statement to call attention to someone or something: Here’s the money I owe you. Here she is now. Idioms\n(right) here and now\nhere and there\nhere goes\nhere to stay\nhere you go\nhere’s to someone/something\nthe here and now"}