{"id":177406,"name":"heritage","type":"noun","us_sound":"ˈher.ɪ.t̬ɪdʒ","us_link":"../audio/h/eus72198.mp3","uk_sound":"ˈher.ɪ.tɪdʒ","uk_link":"../audio/h/ukheres008.mp3","content":"Add to word list\nAdd to word list\nC2 [ U ] features belonging to the culture of a particular society, such as traditions, languages, or buildings, that were created in the past and still have historical importance: cultural heritage These monuments are a vital part of the cultural heritage of South America. Part of our country's heritage has been destroyed.\n[ C or U ] a person's racial, ethnic, religious, or cultural background: I am an American of Persian heritage. They are proud of their Jewish and Palestinian heritages. Historical and government records can help you trace your heritage. See also\ndual heritage\nmixed heritage\nMore examplesFewer examplesThey consider the building to be an important part of region's heritage.A fund has been set up to preserve the town's heritage.Whatever your culture, whatever your heritage, whatever your background, we as a community will support you.\"What's your heritage?\" \"I'm part Scottish and part Chinese.\"\nSMART Vocabulary: related words and phrases\nHistory - general words\na page in/of history idiom\nAge of Exploration\nage of sail\nalternative history\nannal\nantiquarian\nantiquary\nepigraphist\nhistographer\nhistorical\nhistorically\nhistoricity\nhistoriographer\nhistory\nlegacy\nmodern\noral tradition\nrevisionist\nthe Agrarian Revolution\ntime\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBuildings in general\nCustom, tradition & conformity\nrelating to buildings, places, works of art, etc. that are considered to have historical importance for a particular area or for all people: The city has been designated a world heritage site. She is an architect specializing in heritage conservation.\n(of fruit, plants, seeds, or animals) of a traditional or old-fashioned type that was popular in the past: The soup is made from heritage tomatoes, fennel, basil and a little garlic. She keeps heritage chickens and sells their eggs. Synonym\nheirloom\nMore examplesFewer examplesThis free Web-based service provides access to heritage collections of the nation's archives, galleries, libraries, and museums.They promote the country's architectural legacy to attract heritage tourism.The heritage industry has an annual turnover of 25 million pounds.Heritage turkey meat is denser and more flavourful than regular turkey meat. They sell seeds for many varieties of heritage fruit, flowers, and vegetables.\nSMART Vocabulary: related words and phrases\nHistory - general words\na page in/of history idiom\nAge of Exploration\nage of sail\nalternative history\nannal\nantiquarian\nantiquary\nepigraphist\nhistographer\nhistorical\nhistorically\nhistoricity\nhistoriographer\nhistory\nlegacy\nmodern\noral tradition\nrevisionist\nthe Agrarian Revolution\ntime\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBuildings in general\nFruits & seeds & their parts\nBreeds & breeding\nAdd to word list\nAdd to word list\nfeatures belonging to the culture of a particular society, such as traditions, languages, or buildings, which come from the past and are still important: The organization is devoted to preserving our cultural heritage.\nAdd to word list\nAdd to word list\nthe history, traditions, practices, etc. of a particular country, society, or company that exist from the past and continue to be important: Their marketing strategy emphasizes the company's belief in its unique engineering heritage."}