{"id":177522,"name":"hero","type":"noun","us_sound":"ˈhɪr.oʊ","us_link":"../audio/h/hero.mp3","uk_sound":"ˈhɪə.rəʊ","uk_link":"../audio/h/ukheres015.mp3","content":"hero noun [C]\n(PERSON)\nAdd to word list\nAdd to word list\nB1 a person who is admired for having done something very brave or having achieved something great: a war hero Within Australia she was a national hero.accidental hero He became an accidental hero when he unknowingly thwarted a robbery.humorous Graham says he'll take my parents to the airport at four o'clock in the morning - what a hero! Compare\nheroine\nB1 the main character or the main male character in a book or film, who is usually good: the hero of her latest novel Compare\nheroineSee also\nantihero\nsomeone who you admire very much: Humphrey Bogart's my hero - I've seen every one of his movies. Paula Rego is my hero today partly because she dares more as she grows older. Compare\nheroine\nThesaurus: synonyms, antonyms, and examples\na person you admireheroI got to meet my political heroes.heroineShe became a heroine for many young women hoping to enter the medical profession.idolMy idols were the Hollywood actors of the '30s.iconMarilyn Monroe is a cinematic icon.role modelShe has become a reluctant role model for many young people.\nSee more results »\nMore examplesFewer examplesJames Bond was a hero of mine when I was a boy.Perseus was a legendary Greek hero.She is the main character, the hero of the book.During his acting career, he has played all Shakespeare's great tragic heroes.A statue was erected to glorify the country's national heroes.\nSMART Vocabulary: related words and phrases\nHeroes and cowards\nadventurer\nbaby\nchicken\ncoward\ncraven\nfainthearted\nfallen idol\nfighter\nfolk hero\nfrit\nhave-a-go hero\nknight errant\nmarshmallow\npantywaist\npiker\nscaredy-cat\nsuperhero\nsuperheroine\nwimp\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExceptional qualities, things and people\nLiterature\nhero noun [C]\n(FOOD)\nUS a long sandwich filled with cold meat, cheese, salad, etc.: It is the go-to deli for enormous Italian heroes built with fresh, quality ingredients.\nLauriPatterson/iStock/Getty Image Plus/GettyImages\nSMART Vocabulary: related words and phrases\nSandwiches & snacks\navocado toast\nbanh mi\nBLT\nBombay mix\nbreakfast bar\ndevils on horseback\ndouble-decker\nelephant ear\nfairy bread\nfinger chip\nmunchies\nnacho\nnibble\nopen-faced\nopen-faced sandwich\nshrimp chip\nslider\nsloppy joe\nsnack mix\nstacker\nSee more results »\nIdiom\nhero to zero\nAdd to word list\nAdd to word list\na person admired for bravery, great achievements, or good qualities\nliterature The hero is the main character of a story, play, or movie. heroic adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/hɪˈroʊ·ɪk/\nThe ceremony at City Hall honored the heroic acts of firefighters who lost their lives."}