{"id":177632,"name":"herself","type":"pronoun","us_sound":"hɝːˈself","us_link":"../audio/h/herself.mp3","uk_sound":"hɜːˈself","uk_link":"../audio/h/ukherse001.mp3","content":"Add to word list\nAdd to word list\nA2 used to refer to a female object of a verb, that is the same person or animal as the subject of the verb: She kept telling herself that nothing was wrong. My mother would worry herself to death if she knew what I was doing.\nB2 used to emphasize a particular woman, girl, or female animal: She decorated the cake herself. She herself admitted that it was wrong. (all) by herself\nA2 If a woman or girl does something by herself, she does it alone or without help from anyone else: She lives by herself in an enormous house.\nSee more (all) to herself\nfor her use only: Mum's got the house to herself this weekend.\nSee more not be/seem herself (also mainly UK not feel herself)\nnot to be, seem, or feel as happy or healthy as usual: Is Michelle all right? She doesn't seem quite herself at the moment.\nSee more in herself UK informal\nused when describing or asking about a woman's state of mind when she is physically ill: I know she's got back trouble but how is she in herself?\nSee more\nMore examplesFewer examplesShe went shopping to cheer herself up.She was too frightened to go herself, so she sent her son to find out the news.She gave me a signed photograph of herself.She sprayed herself with perfume.\"I'm so glad to see you!\" she said, seating herself between Eleanor and Marianne.\nSMART Vocabulary: related words and phrases\nLinguistics: reflexive forms\nauto\nhimself\nitself\nmyself\nnot be/seem herself phrase\nnot be/seem himself phrase\noneself\nourselves\nper se\nreflexive\nself\nthemself\nthemselves\nthyself\nyourself\nGrammar\nPronouns: reflexive (myself, themselves, etc.)Reflexive pronouns end in -self or -selves. They refer back to the subject forms of personal pronouns (underlined in the example below): …\nReflexive pronouns for same subject and objectWe often use reflexive pronouns when the subject and the object of the verb refer to the same person or thing: …\nReflexive pronouns for emphasisWe can use reflexive pronouns for emphasis: …\nReflexive pronouns + by meaning aloneWe often use reflexive pronouns with by to mean ‘alone’ or ‘without any help’: …\nReflexive pronouns for politenessWe sometimes use reflexive pronouns instead of personal pronouns for politeness, but not as the subject of a clause: …\nIdiom\nkeep (herself) to herself\nAdd to word list\nAdd to word list\nthe female being spoken about, the reflexive form of she: She kept telling herself that nothing was wrong.\nHerself is sometimes used to emphasize a female subject or object of a sentence: She herself was to blame. (all) by herself\nIf a woman or girl does something (all) by herself, she does it alone or without help from anyone: Holly wrote her name all by herself. not herself\nIf a woman or girl is not herself, she is not in her usual mental or physical condition: Janeen hasn’t been herself recently. (all) to herself\nIf a woman or girl has something (all) to herself, she has it for her own use only: She’s got the house all to herself while her husband is away."}