{"id":178168,"name":"hex","type":"noun","us_sound":"heks","us_link":"../audio/h/usheroi023.mp3","uk_sound":"heks","uk_link":"../audio/h/cald4uk0727.mp3","content":"Add to word list\nAdd to word list\nan evil spell, bringing bad luck and trouble: put a hex on informal Someone's put a hex on my computer this morning - it keeps crashing. Children's stories tell of witches who cast hexes and fly on broomsticks. Synonyms\ncurse\njinx\nwhammy\nMore examplesFewer examplesHow can the hex be broken?Witches don't really curse people with hexes by wrinkling their noses.Residents of this community believe she is a witch who can talk to animals and put hexes on anyone who displeases her.\nSMART Vocabulary: related words and phrases\nMagic\nabracadabra\nalchemy\nbewitch\nbezoar\nblack magic\nconjure\nenchantment\nescapology\nevil\nhocus-pocus\nmagical\nmagically\nmugwort\nmystic\nmystical\nthe evil eye idiom\nwhammy\nwhite magic\nwitchcraft\nwizardry\nSee more results »\nto put an evil spell on someone or something in order to bring them bad luck and trouble: I think I've been hexed. The team claimed it lost the competition because it was hexed by psychics hired by its rivals.\nMore examplesFewer examplesAfter the witches hexed her, she left town.The story starts with a village girl stealing a traveller's pearls and being hexed.I once had a patient who believed his wife had been hexing him.\nSMART Vocabulary: related words and phrases\nMagic\nabracadabra\nalchemy\nbewitch\nbezoar\nblack magic\nconjure\nenchantment\nescapology\nevil\nhocus-pocus\nmagical\nmagically\nmugwort\nmystic\nmystical\nthe evil eye idiom\nwhammy\nwhite magic\nwitchcraft\nwizardry\nSee more results »\nshort for\nhexagonal : having a shape with six straight sides: Pry off the circular plastic insert on top of the enclosure and remove the hex nut. You will need a hex wrench or a power tool with hexagonal bits.\nshort for\nhexadecimal : relating to or expressed in a system of counting based on the number 16 rather than the number 10: A hex (hexadecimal) key is a mixture of numbers and letters from AF and 09. All hex digits are required to be lower case.\nSMART Vocabulary: related words and phrases\nGeometrical shapes\n-cornered\ncircularly\ncone\ncongruently\nconic\ncrescent\ncylindrically\nisosceles triangle\npolyhedron\npolytope\nprism\npyramid\nrectangular\nrectangularly\nrhombus\nright triangle\nsemicircle\nsemicircular\nthree-dimensional\ntrapezoid\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNumbering & counting\nComputer concepts"}