{"id":178644,"name":"hide","type":"verb","us_sound":"haɪd","us_link":"../audio/h/hide.mp3","uk_sound":"haɪd","uk_link":"../audio/h/ukhhok_014.mp3","content":"Add to word list\nAdd to word list\nB1 [ I or T ] to put something or someone in a place where that thing or person cannot be seen or found, or to put yourself somewhere where you cannot be seen or found: She used to hide her diary under her pillow. A kilo of heroin was found hidden inside the lining of the suitcase.hide behind I like wearing sunglasses - I feel I can hide behind them.\nThesaurus: synonyms, antonyms, and examples\nto keep someone or something from being seen hideI'll need to hide the sweets so the children don't find them.concealHe did his best to conceal his true feelings from his spouse.secreteThe spies smuggled the films out of the country by secreting them in the lining of their coats.cloakThe proceedings were cloaked in secrecy.\nSee more results »\n[ T ] to prevent something from being seen: He tries to hide his bald spot by sweeping his hair over to one side.\nB1 [ T ] to not show an emotion: She tried to hide her disappointment at not getting the promotion.\nB1 [ T ] If you hide information from someone, you do not allow that person to know it: hide something from someone I feel sure there's something about her past that she's trying to hide from me.\nMore examplesFewer examplesI dye my hair to hide my grey streaks.The cat was hiding under the sofa.The dog was digging a hole to hide its bone in.Jaime hid the letter beneath a pile of papers.A line of trees at the bottom of the garden hid the ugly factory walls.\nSMART Vocabulary: related words and phrases\nHiding and disguising\nbe holed up idiom\nbooby trap\ncamo\ncamouflage\ncamouflaged\ncloak\ndrown\nhole up (somewhere)\nillusion\nillusionistically\nillusively\nillusorily\nsecrete\nshroud\nshut someone/something out\nsidle\nskulk\nsmokescreen\nstash\ntuck\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSecrecy and privacy\nIdiom\nhide your light under a bushelPhrasal verb\nhide out\nhide noun\n(SKIN)\n[ C or U ] the strong, thick skin of an animal, used for making leather\nSMART Vocabulary: related words and phrases\nTanning & leather\nbuckskin\ncalfskin\nchamois\ncowhide\ndubbin\ngoatskin\nkid\nleather\nleatherette\nmock croc\nnappa\nnubuck\npatent\npigskin\nshagreen\nshammy\nsuede\ntanner\ntannery\nvellum\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe skin, hair & bone of non-human animals\nhide noun\n(FOR WATCHING BIRDS/ANIMALS)\n[ C ] UK (US blind) a place where people can watch wild animals or birds without being noticed by them\njacobeukman/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nZoology: ornithology & bird-watching\naerie\nbirdsong\nbirdwatcher\nbirdwatching\neggshell\nfeeding station\nflightless\nflyer\nhover\nincubate\nincubation\nincubator\nornithological\nornithologist\nornithology\ntwitcher\nhide verb [I/T]\n(PREVENT FINDING)\nAdd to word list\nAdd to word list\nto put something or someone in a place where the person or thing cannot be seen or found, or to put yourself somewhere where you cannot be seen or found: [ T ] She used to hide her diary under her pillow. [ I ] Tommy ran and hid behind his dad.\nIf you hide your feelings, you do not show them: [ T ] She tried to hide her disappointment.\nIf you hide information from someone, you do not let that person know it: [ T ] He said nothing is wrong, but I think he’s hiding something. Phrasal verb\nhide out\nhide noun [C/U]\n(SKIN)\nthe strong thick skin of an animal that is used for making leather: [ C ] He began scraping the hide to prepare it for tanning.\nA person’s hide is that person’s self, esp. when in trouble: [ C ] He expects me to save his hide every time he screws up."}