{"id":179431,"name":"hieroglyphic","type":"adjective","us_sound":"ˌhaɪ.rəˈɡlɪf.ɪk","us_link":"../audio/h/cdo0623ushier1817.mp3","uk_sound":"ˌhaɪ.rəˈɡlɪf.ɪk","uk_link":"../audio/h/cdo0623ukhier1810.mp3","content":"Add to word list\nAdd to word list\nin or relating to a system of writing that uses pictures instead of words, especially as used in ancient Egypt: The funerary cones carry the names and titles of the tomb owner in hieroglyphic script. Hieroglyphic clay tablets were found here. Related words\nhieroglyph\nhieroglyphicallyCompare\ndemotic\nhieratic\nMore examplesFewer examplesThe meticulous observations of Egyptologists illuminated the study of hieroglyphic writing.This volume contains a collection of Egyptian texts in hieroglyphic script.The library's grey granite is carved with characters from 120 different hieroglyphic and alphabetical scripts.Hieroglyphic pictograms came after the beginning of abstract writing as we know it.The interesting thing about this inscription is that it's not hieroglyphic, and doesn't correspond to anything we know about ancient languages.\nSMART Vocabulary: related words and phrases\nLettering & alphabets\nall caps\nalphabet\nalphabetical\nalphabetically\nascender\nBraillist\ncamel case\ncopperplate\nhieroglyph\nideogram\nIPA\nLatinized\nmulti-character\nnon-phonetic\npaleographical\npenmanship\nroman\nstenography\ntitle case\nupper case\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAncient history: before 500 AD\n[ C ] a picture or symbol that represents a word: We passed many doorways on either side, each marked with its descriptive hieroglyphic. He handed me a scrap of paper on which was scrawled a little sketch, or perhaps a hieroglyphic. Similar hieroglyphics have been found in southern Arizona. hieroglyphics [ plural ]\na system of writing that uses pictures instead of words, especially as used in ancient Egypt: He learned to write his name in hieroglyphics. For many centuries, nobody could read hieroglyphics. Compare\ndemotic\nhieratic Related word\nhieroglyph\nMore examplesFewer examplesThe dimly lit interior is a maze of spooky stone chambers engraved with hieroglyphics.This room was covered in Mayan hieroglyphics.The Rosetta Stone helped to translate hieroglyphics and tell the story of early Egyptian civilizations.\nSMART Vocabulary: related words and phrases\nSigns, signals and symbols\nbeacon\nbreadcrumb\ncryptanalyst\ndelimiter\ndigital badge\niconography\nideogram\nindicator\nlagging indicator\nleading indicator\nlitmus test\nlogograph\nprompt\nsignificative\nsignifier\nsigning\nSOS\nstatus symbol\nthe all-clear\ntotem pole\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLettering & alphabets\nAncient history: before 500 AD"}