{"id":179412,"name":"hieratic","type":"adjective","us_sound":"ˌhaɪˈræt̬.ɪk","us_link":"../audio/h/cdo0623ushier1816.mp3","uk_sound":"ˌhaɪəˈræt.ɪk","uk_link":"../audio/h/cdo0623ukhier1809.mp3","content":"Add to word list\nAdd to word list\nformal relating to or like priests, or ceremonies performed by priests: He spoke words of power in a hieratic ritual language. She raised both her arms in a hieratic gesture, as if in some kind of blessing. These indigenous traditions are hieratic and they are little known to outsiders.\nlanguage, history\n&#160; specialized in or relating to the ancient Egyptian writing that developed from early hieroglyphics and was used, especially by priests, from around 3200–3000 BCE until the development of demotic in around 650 BCE: The illustration shows fragments of funerary papyri inscribed in hieratic script. None of the new owners of these antiquities was able to read the hieroglyphic, hieratic, and demotic texts with which the monuments were covered. Compare\ndemotic\nhieroglyphic\nMore examplesFewer examplesThe work is similar to Stravinsky's Symphony of Psalms in its hieratic solemnity.The arias were sung with stylized hieratic gestures.Students who wanted to discuss novels and poems heard instead about \"theory,\" often expressed in mysterious, hieratic language.Her beautiful face in this image—hieratic, calm and noble—brings to mind the wonderful figures of the romanesque portal of the cathedral of Chartres.\nSMART Vocabulary: related words and phrases\nReligious leaders & officials\nanti-papal\napostolic\narchbishop\narchbishopric\narchdeacon\nclerically\nconfessor\ncuracy\ncurate\nminister\nministry\nmuezzin\nmullah\nnon-clerical\npriestly\nprimate\nrabbi\nrabbinical\nthe Dalai Lama\nthe priesthood\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReligious ceremonies & prayers\nForms of languages & specialist dialects\nAncient history: before 500 AD\nlanguage, history\n&#160; specialized the form of ancient Egyptian writing that developed from early hieroglyphics and was used, especially by priests, from around 3200–3000 BCE until the development of demotic in around 650 BCE: The extract, probably part of a larger piece copied out for scribal practice, is written in hieratic. Compare\ndemotic\nhieroglyphics\nMore examplesFewer examplesHieratic was always written right to left, and could be written in vertical or horizontal rows, the latter being more common.Different styles of hieratic existed, with major differences between business and literary hieratic.\nSMART Vocabulary: related words and phrases\nForms of languages & specialist dialects\nacrolect\nargot\nbasilect\ncant\ncolloquialism\ndemotic\njournalese\nlegalese\nlingo\nlingua franca\nmetalanguage\nMFL\npidgin\nplain English\nPolari\nrhyming slang\nshibboleth\nslang\nslangily\ntongue\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAncient history: before 500 AD"}