{"id":179564,"name":"highland","type":"adjective","us_sound":"ˈhaɪ.lənd","us_link":"../audio/h/ushideo010.mp3","uk_sound":"ˈhaɪ.lənd","uk_link":"../audio/h/ukhighb005.mp3","content":"Add to word list\nAdd to word list\nin or relating to an area with mountains or hills: Much of central and eastern Brazil is highland plateau. highland springs\n(also Highland) in or relating to the Scottish Highlands (= a mountainous area in the north of Scotland): The groom wore Highland dress tartan. He took a trip to the highland games at Braemar in Scotland. a Highland reel (= a dance) Related word\nhighlands\nMore examplesFewer examplesThe couple met as teenagers in the highland village of Soloma.Melting ice thunders along highland valleys in a torrent of mud and rock.A huge painting of highland cattle hangs on the wall.\nSMART Vocabulary: related words and phrases\nGeography: hills & mountains\nacclivity\nclifftop\ncraggy\nesker\nhighlands\nhillock\nmesa\nmid-ocean ridge\nmotte\nMount Kilimanjaro\nMount Rainier\npinnacle\nscarp\nspur\nsteep\nthe Adirondack Mountains\nthe Alaska Range\nthe Alps\nthe Andes\nvolcano\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTowns & regions: named regions of countries\nan area in the north of Scotland that was one of nine local government regions until 1996 and is now a council area (= an area with its own local government): In Highland, some 83% of the funding of the council is from the Scottish Executive. Officials from the Highland Council have been working closely with local communities.\nMore examplesFewer examplesEight councils, including Glasgow, Highland, and Fife, recycled below 5%. Inverness, 34 miles away, is the administrative capital of the Highland region.He said the fuel tax was damaging the Highland economy.\nSMART Vocabulary: related words and phrases\nTowns & regions: named regions of countries\nAberdeen City\nAberdeenshire\nAffrilachian\nAK\nAL\nEnglish Canadian\nEssex\nfife\nfl.\nMissouri\nMissourian\nMN\nMonmouthshire\nMontana\nStirling\nStirlingshire\nStrathclyde\nSuffolk\nthe Fertile Crescent\nthe Sunbelt\nSee more results »\nA Highland cow is a type of cow, originally bred in Scotland, that has long, thick, brown hair and large horns, and is kept for its meat: The children loved the farm's Highland cows. Herds of shaggy Highland cattle graze in the valley. a Highland bull\nBrianAJackson/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesThe white beaches are empty except perhaps for a stray shaggy-haired Highland cow.Highland cattle graze in the fields.Black was the original dominant colour of the Highland herds before selective breeding was introduced.\nSMART Vocabulary: related words and phrases\nCattle & similar animals\nbison\nbossy\nbovine\nbuffalo\nbull\nbullock\ncalf\ncattle\nFriesian\nGalloway\nheifer\nHolstein\njersey\nNormande\nox\nox-drawn\nshorthorn\nsteer\nstock\ntaurine\nSee more results »"}