{"id":179517,"name":"high","type":"adjective","us_sound":"haɪ","us_link":"../audio/h/hi.mp3","uk_sound":"haɪ","uk_link":"../audio/h/ukhhok_002.mp3","content":"high adjective\n(DISTANCE)\nAdd to word list\nAdd to word list\nA2 (especially of things that are not living) being a large distance from top to bottom or a long way above the ground, or having the stated distance from top to bottom: a high building/mountain high ceilings It's two and a half metres high and one metre wide. The corn grew waist-high (= as high as a person's waist) in the fields.\nThesaurus: synonyms, antonyms, and examples\nhaving a large distance from bottom to tophighThe garden is surrounded by a high wall.tallMount Everest is the world's tallest mountain.loftyThe path winds along the lofty peaks of the Andes.soaringSoaring mountains and lush valleys are every nature enthusiast's dream.\nSee more results »\nMore examplesFewer examplesThe house is encircled by a high fence.I've put the cake on a high shelf where he can't get at it.I love high heels but they're rather impractical.A high wall isolated the house from the rest of the village.The village is perched on top of a high hill.\nSMART Vocabulary: related words and phrases\nHigh, tall and deep\nabysmal\naltitude\nbottomless\ndeep\ndwarf\nectomorph\nelevated\neye level\nhigher\nlofty\novershadow\nrangy\nrear\nrear above/over something/someone\nstand\ntall\ntallish\ntallness\ntower\ntower above/over someone/something\nSee more results »\nhigh adjective\n(ABOVE AVERAGE)\nB1 greater than the usual level or amount: a high level of The job demands a high level of concentration. He suffers from high blood pressure. Antique furniture fetches very high prices these days. She got very high marks in her geography exam. It's very dangerous to drive at high speed when the roads are wet. He's in a high-security prison.\nThesaurus: synonyms, antonyms, and examples\ngreater than the usual level or amounthighHigh temperatures are set to continue into next week.high inThis cereal is high in fibre and nutrients.extremeThey live in extreme poverty.stratosphericHome prices are stratospheric around here!soaringRents are soaring while pay remains steady.\nSee more results »\nhigh in something\nC1 containing a large quantity of something: I avoid foods that are high in fat.\nSee more high standards/principles\nB1 very good or very moral standards: She was a woman of high principles.\nSee more high winds\nfast, strong wind: High winds caused delays on the ferries.\nSee more\nMore examplesFewer examplesChocolate has a high fat content.She had a high temperature and was delirious.Pollution has reached disturbingly high levels in some urban areas.A lot of businesses are being hurt by the current high interest rates.The pollen count is high today, which is bad news for hay fever sufferers.\nSMART Vocabulary: related words and phrases\nBig and quite big\nappreciable\nbaronial\nbigly\nbloated\nboxcar\nbulky\nfullness\ngrandly\ngrowthy\nheaping\nhearty\nheftily\nhefty\npalatially\npumped\nrambling\nroomy\nroyal\nroyally\nthe bigger the better idiom\nSee more results »\nhigh adjective\n(IMPORTANT)\nB2 having power, an important position, or great influence: an officer of high rank\nMore examplesFewer examplesWe've got to change the present system in which high court judges are regarded as somehow untouchable.As the daughter of the president, she enjoys high status among her peers.His father was a high-ranking official in the embassy.She is widely regarded as the high priestess of contemporary dance.At the age of 32, she managed to enter one of the citadels of high fashion.\nSMART Vocabulary: related words and phrases\nImportant people and describing important people\nAugust\naugustly\nbaron\nbe the cat's whiskers idiom\ndoyen\ndoyenne\nexaltedly\nfirst among equals idiom\nFLOTUS\nget over something/someone\nget over yourself! idiom\nguest of honour\nlynchpin\nMister Big\nmogul\nmoment\nmovers and shakers\nMVP\nnabob\nthe big boys\nSee more results »\nhigh adjective\n(SOUND)\nnear or at the top of the range of sounds: I can't reach the high notes.\nThesaurus: synonyms, antonyms, and examples\nat the top of a range of soundhighShe has a very high voice.high-pitchedHe talks to his dog in the most ridiculous high-pitched voice.shrillHe called the dog back with a shrill whistle.reedyHe had a thin, reedy voice.\nSee more results »\nSMART Vocabulary: related words and phrases\nDescribing qualities of sound\naudibly\nboomy\nchocolatey\nchuff\nclomp\ncrackling\near-splitting\nlistenable\nmellifluously\nmelodically\nmelodious\nmelodiously\nmetallically\nraucous\nstaccato\nsymphonically\ntextured\nthready\ntinnily\ntunefully\nSee more results »\nhigh adjective\n(BAD)\nUK (of food) smelling bad and no longer good to eat: This meat is rather high - I'm going to throw it out.\nSMART Vocabulary: related words and phrases\nNot pleasant to eat or drink\n(as) tough as old boots idiom\nbitter\nbitterness\nbland\nchewy\ndishwater\ninsipidly\ninsipidness\nlike dishwater idiom\nmouldy\noverripe\npungent\nstale\nstaleness\nstick to someone's ribs idiom\nstodginess\nstodgy\nunpalatable\nunripe\nwatery\nSee more results »\nhigh adjective\n(MENTAL STATE)\nC2 not thinking or behaving normally because of taking drugs: high on He was high on heroin at the time.\nSMART Vocabulary: related words and phrases\nDrugs - general words\nabstinence\nabstinence-only\nbindle\nbiosimilar\nchase\nmultidrug\nnon-intoxicant\nnon-intoxicating\nnondrug\npeddler\nperformance-enhancing\npill-popping\nsolvent abuse\nspike\nspliff\nsubstance\nsubstance abuse\nwasted\nwhacked\nwiped out\nSee more results »\nGrammar\nHigh or tall?We use high for mountains and for things which are a long way above the ground: …\nMeasurementsWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nArea: length, width, depth and heightWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nWeight and volumeWe use the verb weigh to measure weight: …\nFrequency, speed, timeWe use many different expressions to describe frequency, speed and time. Here are some of them: …\nIdioms\nbe as high as a kite\ncome/get (down) off your high horse\nget on your high horse\nhave it on the highest authority\nhigh and mighty\nhunt/search high and low\nleave someone high and dry\nlive high on/off the hog\ntake the high road\non high\nhigh noun\n(ABOVE AVERAGE)\n[ C ] a higher level than has ever been reached previously: all-time/record high Interest rates have reached an all-time/record high.\nMore examplesFewer examplesThe pass rate in the exams has reached a new high this year.Share prices have soared to a new all-time high in a day of frantic trading on the stock market.The value of the shares hit a new high today.Yields on gas and electricity shares have hit a record high.Viewing figures for the TV show hit a new high last week.\nSMART Vocabulary: related words and phrases\nLarge in number or quantity\nabove and beyond something idiom\namount\nand then some idiom\nanother\nany amount of idiom\nbag\nbillion\nin buckets idiom\nin spades idiom\nincalculable\nincomputable\ninnumerable\npoly\nscore\nshower\nso much so idiom\nsome\nstrength\nsuper-large\nsupererogation\nSee more results »\nhigh noun\n(MENTAL STATE)\n[ C usually singular ] a period of extreme excitement or happiness when you feel full of energy, often caused by a feeling of success, or by drugs or alcohol or a religious experience: Exercise gives you a high.on a high She's been on a high ever since she got her article published in the Times.highs and lows There are lots of highs and lows in this job.\nSMART Vocabulary: related words and phrases\nPleasure and happiness\nabandon\nafterglow\nbeatitude\nbed\nbed of roses idiom\ndelirium\nexaltation\nexultation\nfeast\nfor fun phrase\nfulfilment\nfun\ngoody\njoy\njoyfulness\njoyousness\njubilation\nlike a dog with two tails idiom\nsavour\nstardust\nSee more results »\nhigh noun\n(EDUCATION)\n[ S ] US informal for\nhigh school (when used in the name of a school): I go to Santa Ana High.\nSMART Vocabulary: related words and phrases\nTypes of school\nboarding school\nbusiness school\ncharter school\ncoeducational\ncomp\ncomprehensive\nconservatory\nelementary school\ngrade school\ngymnasium\njunior\npreparatory school\nsecondary school\nselective\nseminary\nsenior high school\nsingle-sex\nspecial school\nsuperschool\ntech\nSee more results »\nGrammar\nMeasurementsWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nArea: length, width, depth and heightWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nWeight and volumeWe use the verb weigh to measure weight: …\nFrequency, speed, timeWe use many different expressions to describe frequency, speed and time. Here are some of them: …\nB1 at or to a large distance from the ground: You'll have to hit the ball quite high to get it over that net. The new jet flew much higher than most planes.\nMore examplesFewer examplesWe saw a condor gliding high above the mountains.The ball rose high above the fielder and fell behind the boundary line.Can you see those goats grazing high in the mountains?He batted the ball high into the air.She twirled her baton high in the air as she led the parade.\nSMART Vocabulary: related words and phrases\nHigh, tall and deep\nabysmal\naltitude\nbottomless\ndeep\ndwarf\nectomorph\nelevated\neye level\nhigher\nlofty\novershadow\nrangy\nrear\nrear above/over something/someone\nstand\ntall\ntallish\ntallness\ntower\ntower above/over someone/something\nSee more results »\nGrammar\nMeasurementsWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nArea: length, width, depth and heightWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nWeight and volumeWe use the verb weigh to measure weight: …\nFrequency, speed, timeWe use many different expressions to describe frequency, speed and time. Here are some of them: …\nhigh adjective [-er/-est only]\n(DISTANCE)\nAdd to word list\nAdd to word list\n(esp. of things that are not living) being a large distance from top to bottom or a long way above the ground, or having the stated distance from top to bottom: Mount Everest is the highest mountain in the world. We had to climb over a wall that was ten feet high.\nhigh adjective [-er/-est only]\n(ABOVE AVERAGE)\ngreater than the usual level: high standards of quality high salaries a high level of concentration She was driving at high speed on a wet road. The companies produce high-quality olive oils.\nSomething's high point is the time when it is the most successful, enjoyable, important, or valuable: The high point of my week is arriving home from work on a Friday evening.\nhigh adjective [-er/-est only]\n(IMPORTANT)\nhaving power, great influence, or an important position: He is an officer of high rank. She has a lot of friends in high places (= in positions of power).\nhigh adjective [-er/-est only]\n(SOUND)\nnear or at the top of the range of sounds: Dog whistles play notes that are too high for human beings to hear.\nhigh adjective [-er/-est only]\n(FEELING HAPPY)\nfeeling extremely happy, excited, or full of energy: He was so high after winning the race that he couldn’t sit still. in high spirits\nSomeone who is in high spirits is extremely happy and enjoying the situation: She was in high spirits after scoring the winning basket. Idioms\n(it’s) high time\nin high gear\nhigh adverb [-er/-est only]\n(AT LARGE DISTANCE)\nat or to a large distance from the ground: The Concorde flies much higher than most airplanes.\nhigh noun\n(HIGH LEVEL)\n[ C ] a higher level than has ever been reached before: Interest rates have reached an all-time high.\nhigh noun\n(HAPPY PERIOD)\n[ C usually sing ] a period of extreme excitement or happiness, when you feel full of energy: There are lots of highs and lows in this job.\nAdd to word list\nAdd to word list\ngreater than the usual level or amount: high interest rates/costs/expenses/pricesa high degree/percentage/proportion The research evidence all indicates a high degree of customer satisfaction with the product.\n[ usually before noun ] in a position of power, importance, or great influence: The firm has been propelled from investment banking's third division to its highest rank.\nbetter than the usual quality or standard: She demanded and achieved high standards from those with whom she worked. The company stresses speed, low cost, and high quality in its products. The community has a stable work force, good jobs and a high quality of life.\na higher level than has been reached previously: Stocks end at new highs for the fourth session in a row.\nhighs and lows\n[ plural ] the times that follow each other when a company, career, investment, etc. is successful and when it is not: All jobs have an element of routine and a cycle of highs and lows. Jonathan, 25, has already seen some of the highs and lows of the business world.\nfrom on high informal\nWORKPLACE from senior people in an organization: If the changes are to be sustainable, they should not merely be imposed upon employees from on high.\nSee also\nhistoric high\nlife-of-contract high\nrecord high\nsession high\nsky-high\nat or to a position of greater importance or influence: As she rose higher in the firm she began to clash with other top executives.\nat or to more than the usual level or amount: Interest rates moved higher, in response to signs of an economic rebound."}