{"id":179571,"name":"highly","type":"adverb","us_sound":"ˈhaɪ.li","us_link":"../audio/h/highly.mp3","uk_sound":"ˈhaɪ.li","uk_link":"../audio/h/ukhighb010.mp3","content":"highly adverb\n(ABOVE AVERAGE)\nAdd to word list\nAdd to word list\nB2 very, to a large degree, or at a high level: highly paid She was offered a highly paid job in finance. a highly profitable line of products For our country to remain competitive, we need a highly-skilled, highly-educated workforce. think/speak highly of someone\nC2 to admire or say admiring things about someone: He's very highly thought of within the company.\nSee more\nMore examplesFewer examplesTobacco is highly addictive.The two men are highly suspicious of one another.The hospital is unable to provide the highly specialized care needed by very sick babies.The Birmingham Royal Ballet has had a highly successful season.Nursing is a highly skilled job.\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabsolutely\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\nhighly adverb\n(IMPORTANT)\nin an important or influential (= having a lot of influence) position: highly placed According to one highly placed source, the prime minister had threatened to resign over this issue.\nSMART Vocabulary: related words and phrases\nImportant people and describing important people\nAugust\naugustly\nbaron\nbe the cat's whiskers idiom\ndoyen\ndoyenne\nexaltedly\nfirst among equals idiom\nFLOTUS\nget over something/someone\nget over yourself! idiom\nguest of honour\nlynchpin\nMister Big\nmogul\nmoment\nmovers and shakers\nMVP\nnabob\nthe big boys\nSee more results »\nhighly adverb\n(AT HIGH LEVEL)\nAdd to word list\nAdd to word list\nvery, to a large degree, or at a high level: a highly paid job We need a highly skilled, highly educated workforce.\nhighly adverb\n(IN IMPORTANT POSITION)\nin an important or influential position: The statement was made by a highly placed official.\nAdd to word list\nAdd to word list\nvery, to a large degree, or at a high level: The firm was highly profitable and had a strong balance sheet. It is an able, young and highly motivated workforce.highly educated/qualified/skilled Technical experts, highly trained chemists, engineers, technicians and operators help ensure that all the company's facilities meet high standards of safety.\nin a position that is important or that has a lot of influence: One highly-placed source said that a wide range of bids had gone in."}