{"id":179573,"name":"highlight","type":"verb","us_sound":"ˈhaɪ.laɪt","us_link":"../audio/h/highlight.mp3","uk_sound":"ˈhaɪ.laɪt","uk_link":"../audio/h/ukhighb008.mp3","content":"Add to word list\nAdd to word list\nB2 to attract attention to or emphasize something important: The report highlights the need for improved safety.be highlighted in The spelling mistakes in the text had been highlighted in green. Synonyms\nemphasize\nexaggerate\nforeground\noverplay\noverstate\nspotlight Opposites\ndownplay\nminimize\nunderstate\nMore examplesFewer examplesThe Republicans were quick to highlight the Democrats' proposed tax increases in their campaign literature.He took a gun through baggage control to highlight the lax security.The moon highlighted the shadowy forms of the hills.The accident highlights the need for new safety measures.The documentary highlighted systematic failings within the department.\nSMART Vocabulary: related words and phrases\nStressing & emphasizing\naccentuate\naccentuation\nall day long idiom\nbelieve\ndeadass\ndrive/hammer something home idiom\nexactly\ninsistence\ninsistency\ninsistently\nintensely\nlike blazes idiom\nmisemphasis\npercent\nram\nstress\nthemselves\nvaunt\nwork/laugh/freeze, etc. your arse off idiom\nwork/laugh/freeze, etc. your ass off idiom\nSee more results »\nhighlight noun\n(BEST PART)\nB2 [ C ] the best or most exciting, entertaining, or interesting part of something: highlights of Highlights of the match will be shown after the news.\nSMART Vocabulary: related words and phrases\nGood and excellent things\nbadass\nbe the best thing since sliced bread idiom\nbeatification\nbeaut\nbeauty\nbunch\nflagship\ngem\nhumdinger\njewel\njim-dandy\nking\nlulu\npeach\nscreamer\nsleeping beauty\nstandout\nthe jewel in the crown idiom\nthe real deal\nthe Rolls-Royce of something idiom\nSee more results »\nhighlight noun\n(HAIR)\n[ C usually plural ] a narrow strip of hair on a person's head that has been made a lighter colour than the surrounding hair\nenergyy/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nHairdressing\nbarber's pole\nbewigged\nbraid\ncolourist\ndip dye\nfoil\nfrost\ngel\nhairdressing\nhairstylist\nhenna\nloose\nperoxide\nscalp\ntexture\ntint\ntong\ntonsorial\ntrim\nwigged\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHairstyles\nhighlight noun\n(BEST PART)\nAdd to word list\nAdd to word list\n[ C ] the best, most important, or most interesting part: The highlight of our trip to New York was going to the top of the Empire State Building.\nhighlight noun\n(BRIGHT AREA)\n[ C usually pl ] a bright or lighter-colored area on the surface of something, esp. on a painting\nhighlight verb [T]\n(EMPHASIZE)\nto attract attention to or emphasize something important: The report highlights the need for increased funding.\nAdd to word list\nAdd to word list\nto attract attention to something important or to emphasize it: highlight concerns/problems/risks The study highlighted rural problems such as falling farm incomes and development pressures.highlight the fact that sth She highlighted the fact that growing numbers of people are looking for their money to be invested in a more socially responsible way.highlight the need for sth Intimidation attacks by both sides yesterday highlighted the need for peace.\nto mark text on paper or a computer screen with a colour to emphasize it: Immediately after the meeting it's helpful to highlight important points in your notes.\n[ C ] the best or most interesting part of something: the highlight of sth What has been the highlight of your career and what has been the low point?\n[ C, usually plural ] the most important detail or information in a document, etc.: highlights from sth The following are highlights from the agreement struck between the airline and the Air Line Pilots Association."}