{"id":179670,"name":"hijack","type":"verb","us_sound":"ˈhaɪ.dʒæk","us_link":"../audio/h/hijack.mp3","uk_sound":"ˈhaɪ.dʒæk","uk_link":"../audio/h/ukhighb015.mp3","content":"Add to word list\nAdd to word list\nto take control of an aircraft or other vehicle during a journey, especially using violence: Two men hijacked a jet travelling to Paris and demanded $125,000.\ndisapproving to take control of or use something that does not belong to you for your own advantage: He resents the way his ideas have been hijacked by others in the department.\nSMART Vocabulary: related words and phrases\nTerrorism & political crime\n9/11\nanti-hijacking\nanti-terrorism\nanti-terrorist\nbioterrorism\ncounter-terrorist\ncounterterrorism\ncrime against humanity\nfalse flag\nhigh treason\nnarcoterrorism\nsedition\nseditiously\nskyjack\nskyjacker\nskyjacking\nterror\ntradecraft\ntreason\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nForgery\nCopying and copies\nRelated word\nhijacker\nan occasion when someone uses force to take control of an aircraft or other vehicle: The hijack ended with the release of all the plane's passengers unharmed. He’s a leading suspect in the hijacking of the jetliner.\nSMART Vocabulary: related words and phrases\nTerrorism & political crime\n9/11\nanti-hijacking\nanti-terrorism\nanti-terrorist\nbioterrorism\ncounter-terrorist\ncounterterrorism\ncrime against humanity\nfalse flag\nhigh treason\nnarcoterrorism\nsedition\nseditiously\nskyjack\nskyjacker\nskyjacking\nterror\ntradecraft\ntreason\nSee more results »\nAdd to word list\nAdd to word list\nto force someone to give you control of a vehicle, aircraft, or ship that is in the middle of a trip: Gunmen tried to hijack their truck.\nSomeone who hijacks someone else’s ideas or plans uses those ideas and claims to have created them: The movie hijacks some of its style from \"Blade Runner.\" hijacking noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/ˈhɑɪˌdʒæk·ɪŋ/\n[ U ] He’s a leading suspect in the hijacking of the jetliner.\nAdd to word list\nAdd to word list\nto take control of something, such as another person's plan, a system, or a meeting for your own advantage: The association is annoyed that its campaign has been hijacked by pin-striped PR men.\nIT to take control of a computer belonging to someone else without their permission, especially for illegal purposes: Hundreds of the department's powerful computers were hijacked by hackers, who used them to send spam email."}