{"id":179935,"name":"himself","type":"pronoun","us_sound":"hɪmˈself","us_link":"../audio/h/himself.mp3","uk_sound":"hɪmˈself","uk_link":"../audio/h/ukhimal003.mp3","content":"himself pronoun\n(MALE)\nAdd to word list\nAdd to word list\nA2 used to refer to a male object of a verb that is the same person or animal as the subject of the verb: He'd cut himself shaving. Most nights he would cry himself to sleep.\nB2 used to emphasize a particular man, boy, or male animal: Did you want to talk to the chairman himself, or could his personal assistant help you? Tom was going to buy a bookcase, but in the end he made one himself. (all) by himself\nA2 If a man or boy does something by himself, he does it alone or without help from anyone else: Little Timmy made that snowman all by himself.\nSee more (all) to himself\nfor his use only: Johnny's got the apartment to himself next week.\nSee more not be/seem himself (also mainly UK not feel himself)\nnot to be, seem, or feel as happy or as healthy as usual: Is Tom all right? He doesn't seem quite himself this morning.\nSee more in himself\nUK informal used when describing or asking about a man's state of mind when he is physically ill: He's well enough in himself - he just can't shake this cold off.\nSee more\nMore examplesFewer examplesHow can he afford to buy himself a brand new car?He wrapped a robe around himself before answering the door.He saw himself reflected in the shop window.He put his hands on the side of the pool and pulled himself out of the water.Simon's looking very pleased with himself today.\nSMART Vocabulary: related words and phrases\nLinguistics: reflexive forms\nauto\nherself\nitself\nmyself\nnot be/seem herself phrase\nnot be/seem himself phrase\noneself\nourselves\nper se\nreflexive\nself\nthemself\nthemselves\nthyself\nyourself\nhimself pronoun\n(ANY GENDER)\nold-fashioned used to refer to an object of a verb that is the same person or animal as the subject of the verb, when referring to a person or animal whose gender is not known or not considered to be important: Any fool can teach himself to type. When a student needs to leave the classroom, he must sign himself out. Note: Many people consider this use to be offensive and prefer to use themselves instead. This can sometimes mean changing other words in the sentence: When a student needs to leave the classroom, they must sign themselves out. Itself can be used for animals.\nSMART Vocabulary: related words and phrases\nLinguistics: reflexive forms\nauto\nherself\nitself\nmyself\nnot be/seem herself phrase\nnot be/seem himself phrase\noneself\nourselves\nper se\nreflexive\nself\nthemself\nthemselves\nthyself\nyourself\nGrammar\nPronouns: reflexive (myself, themselves, etc.)Reflexive pronouns end in -self or -selves. They refer back to the subject forms of personal pronouns (underlined in the example below): …\nReflexive pronouns for same subject and objectWe often use reflexive pronouns when the subject and the object of the verb refer to the same person or thing: …\nReflexive pronouns for emphasisWe can use reflexive pronouns for emphasis: …\nReflexive pronouns + by meaning aloneWe often use reflexive pronouns with by to mean ‘alone’ or ‘without any help’: …\nReflexive pronouns for politenessWe sometimes use reflexive pronouns instead of personal pronouns for politeness, but not as the subject of a clause: …\nIdiom\nkeep to himself\nAdd to word list\nAdd to word list\nthe male being spoken about; the reflexive form of he: He bought himself a new coat.\nHimself is sometimes used to emphasize a male subject or object of a sentence: I got to meet the president himself.\nHimself is also used to refer to a person whose sex is not known: I hope nobody’s hurt himself. Note: Some people find this use of him to be offensive. (all) by himself\nIf a man or boy does something (all) by himself, he does it alone or without help from anyone else: Jamie made that snowman all by himself. not himself\nIf a man or boy is not himself, he is not in his usual mental or physical condition: Hugh hasn’t been himself since the accident. (all) to himself\nIf a man or boy has something (all) to himself, he has it for his own use only: He’s got the house to himself tonight."}