{"id":180074,"name":"hip","type":"noun","us_sound":"hɪp","us_link":"../audio/h/hip.mp3","uk_sound":"hɪp","uk_link":"../audio/h/ukhimal018.mp3","content":"hip noun [C]\n(BODY PART)\nAdd to word list\nAdd to word list\nB2 the area below the waist and above the legs at either side of the body, or the joint that connects the leg to the upper part of the body: This exercise is designed to trim your hips and stomach. The skirt was a bit tight across the hips.\nPhotographer, Basak Gurbuz Derman/Moment/GettyImages\nMore examplesFewer examplesThe hip joint is a ball-and-socket joint.She has a rheumatic hip.Her hip has been troublesome for quite a while, and she'll probably need surgery on it.His hip had to be x-rayed to see if it was forming properly.With a wiggle of her hips, she pulled up the trousers.\nSMART Vocabulary: related words and phrases\nThe human torso\n-bellied\n-chested\nabs\naxilla\nbread basket\nbreast\nchest\ncoeliac\ndiaphragm\nflank\ngroin\npot\nshoulder\nspare tyre\nthoracic\nthorax\numbilicus\nvisceral muscle\nwaisted\nwaistline\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBone structures\nhip noun [C]\n(FRUIT)\nmainly UK a\nrose hip\nSMART Vocabulary: related words and phrases\nTypes of fruit\nackee\nalligator pear\nalpine strawberry\namla\naçaí\ncooker\ncooking apple\ncopra\ncrab apple\ncranberry\nlongan\nloquat\nlychee\nmajhool date\nmandarin\nrose hip\nsalmonberry\nsaskatoon\nsatsuma\nsatsuma plum\nSee more results »\nfashionable: The bars in the old part of the town are frequented by hip young students.\nThesaurus: synonyms, antonyms, and examples\nfashionablefashionableShe's so fashionable.in fashionTighter trousers for men are back in fashion.inShort jackets are in this season.coolHe was wearing a pair of cool sunglasses.hipWe went to the hip new club in town.trendyHe likes trendy clothes and modern furniture.\nSee more results »\nSMART Vocabulary: related words and phrases\nModern & fashionable\nbe (all) the rage idiom\nbe having a moment idiom\nbe the last word in something idiom\nfoppishly\nfunky\nfuturistic\nfuturistically\nget with the programme idiom\npeacock\nshabby chic\nsleekly\nsleekness\nsmartly\nthe avant-garde\nultra-modern\nultra-progressive\nultra-slick\nultra-sophisticated\nup to date\nà la mode\nSee more results »\nhip, hip, hooray/hurray!\nan expression that is called out, often by a group of people at the same time, to express approval of someone: Three cheers for the bride and groom! Hip, hip, hooray!\nSee more\nhip noun [C]\n(BODY PART)\nAdd to word list\nAdd to word list\nthe part on either side of the body where the legs are attached to the upper part of the body, or either of the joints at the pelvis (= bowl-shaped bones) where the legs are attached: Arthritis is causing pain and stiffness in your hips.\nhip adjective\n(KNOWING)\nknowing a lot about what the most modern fashions are, esp. in music, social behavior, and styles of clothes\nAdd to word list\nAdd to word list\nabbreviation for Home income plan: in the UK, an arrangement in which someone receives a regular income from the equity in their home (= its value if it were sold and any loans were paid back): Generally, you have to be 65 or over and own a house worth £60,000 to qualify for a Hip, but rules vary from firm to firm."}