{"id":181848,"name":"hipster","type":"noun","us_sound":"ˈhɪp.stɚ","us_link":"../audio/h/eus13834.mp3","uk_sound":"ˈhɪp.stər","uk_link":"../audio/h/epd14105.mp3","content":"hipster noun\n(FASHIONABLE PERSON)\nAdd to word list\nAdd to word list\n[ C ] informal someone who is aware of and influenced by the most recent ideas and fashions: In the past, scooters were ridden mostly by hipsters who considered them cute and fun. The coffee bar's clientele was mostly local professionals, downtown hipsters, and academics.\nSMART Vocabulary: related words and phrases\nModern & fashionable\nbe (all) the rage idiom\nbe having a moment idiom\nbe the last word in something idiom\nfoppishly\nfunky\nfuturistic\nfuturistically\nget with the programme idiom\nshabby chic\nsleekly\nsleekness\nsmartly\nsmartness\nthe avant-garde\nultra-progressive\nultra-slick\nultra-sophisticated\nup to date\nup-to-the-minute idiom\nà la mode\nSee more results »\nhipster noun\n(CLOTHES)\nhipsters [ plural ]\nmainly UK (US usually hipster underwear) underwear that fits around or reaches as far as the hips and not up to the waist: Hipsters are a good compromise between low-rise underwear and high-waisted knickers.\nUK old-fashioned (US old-fashioned hiphuggers) trousers that fit around or reach as far as the hips and not up to the waist: She was wearing a pair of light blue denim hipsters.\nSee more\nhipster adjective\n(FASHIONABLE)\ntypical of or enjoyed by people who are aware of the most recent ideas and fashions: The town has plenty of galleries, bohemian cafes, and hipster bars these days. I loved the restaurant's cool decor — very hipster but in a nice way.\nMore examplesFewer examplesThe movie has a great hipster soundtrack.It was US bloggers who helped her find success, after the British media found her too hipster at first.\nSMART Vocabulary: related words and phrases\nModern & fashionable\nbe (all) the rage idiom\nbe having a moment idiom\nbe the last word in something idiom\nfoppishly\nfunky\nfuturistic\nfuturistically\nget with the programme idiom\nshabby chic\nsleekly\nsleekness\nsmartly\nsmartness\nthe avant-garde\nultra-progressive\nultra-slick\nultra-sophisticated\nup to date\nup-to-the-minute idiom\nà la mode\nSee more results »\nhipster adjective\n(OF CLOTHES)\n[ before noun ] (of clothing) fitting around or reaching up as far as the hips and not the waist: Skinny little T-shirts and hipster jeans look terrible on me. The Fifties-style bikinis come in flattering designs, including hipster briefs.\nMore examplesFewer examplesTailored hipster trousers look elegant worn with a silk shirt.They offer a huge selection of underwear ranging from sporty cotton hipster shorts to sexy lace knickers.The collection featured military details such as epaulets on the shoulders and hipster belts.\nSMART Vocabulary: related words and phrases\nStyle & appearance of clothes\naesthetic\nalterable\nanti-fur\nAran\nbackless\nfloor-length\nflouncy\nfoppishly\nform-fitting\nFrench tuck\nribbed\nribby\nruche\nruched\nruck (something) up\nvoop neck\nwaisted\nwashable\nwasp waist\nwasp-waisted\nSee more results »"}