{"id":181895,"name":"hire","type":"verb","us_sound":"haɪr","us_link":"../audio/h/hire.mp3","uk_sound":"haɪər","uk_link":"../audio/h/ukhire_001.mp3","content":"Add to word list\nAdd to word list\nB1 UK (US rent) to pay to use something for a short period: How much would it cost to hire a car for the weekend? You could always hire a dress for the ball if you can't afford to buy one.\nB2 to employ someone or pay someone to do a particular job: I was hired by the first company I applied to. [ + to infinitive ] We ought to hire a public relations consultant to help improve our image.\nMore examplesFewer examplesPoor families don't have enough money to hire good lawyers.I thought we might hire a motorboat and take a trip round the bay.It costs £1000 a week to hire the yacht, plus a £120 refundable deposit.We hired a magician to entertain the children.Would it be very expensive to to hire bicycles for the week?\nSMART Vocabulary: related words and phrases\nRenting & hiring\naccount\ncharge account\ncharter\nchartered\ncredit account\ndeposit\nhire purchase\nhire something/someone out\nhp\ninstallment plan\nlayaway\nlease\nlessee\nlessor\nrent\nrental\nthe never-never\nYou can also find related words, phrases, and synonyms in the topics:\nApplying for a job\nPhrasal verb\nhire something/someone out\nhire noun\n(THING)\n[ U ] UK an arrangement to use something by paying for it: car hire The price includes flights and car hire.hire car The price includes flights, accommodation, and a hire car for the week. for hire There's a camping shop in town that has tents for hire (= available to be hired) at £30 a week. Compare\nrent\nrental\nSMART Vocabulary: related words and phrases\nRenting & hiring\naccount\ncharge account\ncharter\nchartered\ncredit account\ndeposit\nhire purchase\nhire something/someone out\nhp\ninstallment plan\nlayaway\nlease\nlessee\nlessor\nrent\nrental\nthe never-never\nhire noun\n(PERSON)\n[ C ] mainly US a person to whom a company has recently given a job: She's our latest hire.\nSMART Vocabulary: related words and phrases\nEmployees & colleagues\nalum\nalumna\nalumnae\nalumni\nalumnus\ncompatriot\ncontractor\nemployee\ngirl\ngoonda\nhireling\nnon-management\nnon-managerial\noffice politics\noffice spouse\noppo\nwage earner\nworker\nworking man/woman/person\nworkmate\nSee more results »\nAdd to word list\nAdd to word list\nto start to employ someone: You ought to hire a lawyer to handle your taxes.\nan employee: Those retiring will be replaced by new hires.\nAdd to word list\nAdd to word list\nHR to employ someone in a permanent job: Increased business means that the company will need to hire 15 new sales staff.hire sb as sth A supervisor noticed her potential and hired her as a trading trainee.be hired by sb/sth Employees hired by a public agency after July 1 will automatically be enrolled in the new contribution plan. Managers are given a free hand in hiring and firing employees.\nHR to pay a person or company to do a particular job for a short period of time: We will hire a contractor to consider what can be done that is cost effective.\nCOMMERCE\n&#160; mainly UK ( US rent) to pay to use something for a short period of time: They hired a billboard in a prominent position on Oxford Street to promote the event.\nPhrasal verbs\nhire sb/sth out\nhire yourself out\n[ U ]\n&#160; COMMERCE\n&#160; mainly UK ( US rental) an arrangement in which someone pays to use something for a short period: car/equipment/plant hire Prices include return flights and car hire. There are plenty of cars available for hire. a hire business/company/firm\n[ C ]\n&#160; HR a person who a company or organization employs in a permanent job: additional/fresh/new hires Three-quarters of the debt-collection industry's new hires quit after just three months."}