{"id":181961,"name":"his","type":"determiner","us_sound":"hɪz","us_link":"../audio/h/his.mp3","uk_sound":"hɪz","uk_link":"../audio/h/ukhire_006.mp3","content":"his determiner\n(MALE)\nAdd to word list\nAdd to word list\nA1 belonging to or connected with a man, boy, or male animal that has just been mentioned or is known about: \"Jo's got a new boyfriend.\" \"Oh really? What's his name?\" The bull tossed his horns.formal Did Chris tell you about his winning some money in the lottery?\nMore examplesFewer examplesPaul clicked his fingers to attract the waiter's attention.We can't stop Tom climbing out of his cot.The officer commanded his men to shoot.I don't know how he can afford a new car on his salary.She sold the house even though it was against his wishes.\nSMART Vocabulary: related words and phrases\nLinguistics: possessive forms\nhers\nits\nmine\nmy\nour\nours\nS, s\nthe\ntheir\ntheirs\nthine\nthy\nus\nyer\nyour\nyours\nhis determiner\n(ANY GENDER)\nold-fashioned belonging to or connected with a person or animal that has just been mentioned and whose gender is not known or not considered to be important: Anyone who drives his car at 100 miles an hour is asking for trouble. What a cute dog! What's his name? Note: Many people consider this use offensive and prefer to use their instead. This can sometimes mean changing other words in the sentence: People who drive their cars at 100 miles an hour are asking for trouble.Its can be used for animals.\nSMART Vocabulary: related words and phrases\nLinguistics: possessive forms\nhers\nits\nmine\nmy\nour\nours\nS, s\nthe\ntheir\ntheirs\nthine\nthy\nus\nyer\nyour\nyours\nGrammar\nPronouns: possessive (my, mine, your, yours, etc.)We use pronouns to refer to possession and ‘belonging’. There are two types: possessive pronouns and possessive determiners. We use possessive determiners before a noun. We use possessive pronouns in place of a noun: …\nA1 the one(s) belonging to or connected with a man, boy, or male animal that has just been mentioned or is known about: Mark just phoned to say he'd left his coat behind. Do you know if this is his? He introduced us to some colleagues of his. His is the office directly ahead of you, at the far end of the corridor.\nSMART Vocabulary: related words and phrases\nLinguistics: possessive forms\nhers\nits\nmine\nmy\nour\nours\nS, s\nthe\ntheir\ntheirs\nthine\nthy\nus\nyer\nyour\nyours\nGrammar\nPronouns: possessive (my, mine, your, yours, etc.)We use pronouns to refer to possession and ‘belonging’. There are two types: possessive pronouns and possessive determiners. We use possessive determiners before a noun. We use possessive pronouns in place of a noun: …\nAdd to word list\nAdd to word list\nbelonging to or connected with the person mentioned; the possessive form of he, often used before a noun: Joe left his car parked with the lights on. Isn’t this Kevin’s umbrella? I think it’s his.\nHis is also used to refer to a person whose sex is not known: Anyone who drives his car that fast is asking for trouble. Note: Some people find this use of his to be offensive."}