{"id":182165,"name":"historical","type":"adjective","us_sound":"hɪˈstɔːr.ɪ.kəl","us_link":"../audio/h/historical.mp3","uk_sound":"hɪˈstɒr.ɪ.kəl","uk_link":"../audio/h/ukhire_014.mp3","content":"Add to word list\nAdd to word list\nB1 connected with studying or representing things from the past: Many important historical documents were destroyed when the library was bombed. She specializes in historical novels set in 18th-century England.\nused to describe prices, values, etc. in the past: The table compares historical exchange rates for five different currencies.\nused to describe crimes that were committed in the past: A man was arrested as part of an investigation into allegations of historical child abuse dating back to the 1980s.\nMore examplesFewer examplesIt is a rather grey, colourless city, with few interesting sights or historical monuments.Bitter historical enmities underlie the present violence.The book is a work of fiction and not intended as a historical account.She's an avid reader of historical novels.The photos are of immense historical value.\nSMART Vocabulary: related words and phrases\nHistory - general words\na page in/of history idiom\nAge of Exploration\nage of sail\nalternative history\nannal\nantiquarian\nantiquary\nepigraphist\nheritage\nhistographer\nhistoric\nhistorically\nhistoricity\nhistory\nlegacy\nmodern\nnon-historical\nrevisionist\nthe Agrarian Revolution\ntime\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCrime - general words\nRelated word\nhistoricallyGrammar\nHistoric or historical?Historic means ‘important or likely to be important in history’: …\nAdd to word list\nAdd to word list\nconnected with the study or representation of things from the past: The library has an important collection of historical documents. historically adverb us\nYour browser doesn't support HTML5 audio\n/hɪˈstɔr·ɪk·li, -ˈstɑr-/\nMany of the historically accurate costumes created for the show will eventually be in museums.\nAdd to word list\nAdd to word list\nused to describe past prices or values: The company offers real-time and historical information on stocks, options, commodities, futures, indices, and currencies. Historical data show the clear link between income tax rates and the size of domestic government spending. historically adverb\nIn addition to strong yields, growers saw prices at historically high levels."}