{"id":182159,"name":"history","type":"noun","us_sound":"ˈhɪs.t̬ɚ.i","us_link":"../audio/h/history.mp3","uk_sound":"ˈhɪs.tər.i","uk_link":"../audio/h/ukhire_016.mp3","content":"history noun\n(PAST EVENTS)\nAdd to word list\nAdd to word list\nA2 [ C or U ] (the study of or a record of) past events considered together, especially events of a particular period, country, or subject: I studied modern European history at college. American historyhistory of Annie's decided to write a history of electronic music.life history I only asked him for a cigarette, but two hours later he'd told me his whole life history.\n[ U ] informal something that happened or ended a long time ago and is not important now, or a person who is not important now, although they were in the past: ancient history Last year's report is ancient history and totally irrelevant to the current situation. \"What about Dan - are you still seeing him?\" \"Oh, he's history.\"\nMore examplesFewer examplesOur guide told us a lot about the history of the castle.He is the author of two books on French history.Throughout history, people have been intrigued by the question of whether there is intelligent life elsewhere in the universe.The fall of the Berlin Wall marked the dawn of a new era in European history.He knows a lot about the history of this area, so he is often asked to speak at local clubs and societies.\nSMART Vocabulary: related words and phrases\nHistory - general words\na page in/of history idiom\nAge of Exploration\nage of sail\nalternative history\nannal\nantiquarian\nantiquary\nepigraphist\nheritage\nhistographer\nhistoric\nhistorical\nhistorically\nhistoricity\nlegacy\nmodern\nnon-historical\nrevisionist\nthe Agrarian Revolution\ntime\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSubjects & disciplines\nIn the past\nhistory noun\n(PARTICULAR RECORD)\nC1 [ C usually singular ] something that has been done or experienced by a particular person or thing repeatedly over a long period: have a history of Her family has a history of heart problems.history of There's a long history of industrial disputes at the factory.credit history He has a good credit history (= a good record of paying money that he owes).\nSMART Vocabulary: related words and phrases\nEvents and occurrences\n-athon\nback story\nbe (all) part of life's rich tapestry/pageant idiom\nbenefit\nbinge\ncar wash\ndate night\nedition\nepiphenomenon\nepisode\nevent\ngoings-on\noccurrence\npast\nproceedings\nreoccurrence\nsaga\nspree\nsynchronicity\nthing\nSee more results »\nIdiom\nmake history\nhistory noun\n(PAST EVENTS)\nAdd to word list\nAdd to word list\n[ C/U ] (the study of) past events considered together, esp. events or developments of a particular period, country, or subject: [ U ] I’m taking a course in American history. [ C ] I’m reading a history of jazz (= a book that describes the development of this music).\nhistory noun\n(REPEATED HAPPENINGS)\n[ C usually sing ] something that has been done or experienced by a particular person or thing many times over a long period: Our family has a history of diabetes.\nAdd to word list\nAdd to word list\na record of past events relating to a particular person or company: This is the 50th consecutive month of uninterrupted job growth, the longest in the nation's history. No one else in the Bank's long history has climbed all the way up the ladder. When a person applies for a bank account or credit card, their credit history can be tracked. career/employment/medical history\na record of actions or events that have happened often over a period of time: a history of sth The company has had a history of difficult management-union relations."}