{"id":182243,"name":"hit","type":"verb","us_sound":"hɪt","us_link":"../audio/h/hit.mp3","uk_sound":"hɪt","uk_link":"../audio/h/ukhire_020.mp3","content":"hit verb\n(TOUCH)\nAdd to word list\nAdd to word list\nA2 [ T ] to move your hand or an object onto the surface of something so that it touches it, usually with force: Teachers are not allowed to hit their pupils. This type of glass won't shatter no matter how hard you hit it.hit something with something She hit her thumb with the hammer.\nThesaurus: synonyms, antonyms, and examples\nto hit someone or somethinghitShe was expelled for hitting another pupil.whackShe whacked the water with her paddle.bashThe swinging door bashed him in the face.strikeShe had been struck on the head with a golf ball.beatHe was cruel to his dog and beat it with a stick.punchHe punched me in the stomach.\nSee more results »\nB1 [ T ] to touch something with sudden force: They were going about 60 kilometres an hour when their car hit the tree.be hit in One journalist was hit in the leg by a stray bullet.hit something on something That new shelf in the bathroom is too low - I just hit my head on it.\nMore examplesFewer examplesI've got a bruise where I hit my leg against the corner of the table.A stone hit the window and cracked the glass.I was only teasing him and suddenly he lashed out at me and hit me in the face.The car skidded off the road, hit a tree and overturned.Just try to concentrate on hitting the ball.\nSMART Vocabulary: related words and phrases\nHitting and beating\nat-risk\nbang away\nbang someone up\nbasher\nbashing\nbunch\nbutt\nfetch\ngut punch\nhammer\nhead-butt\nhell\nkick\nmess\nswing at someone\nswing for someone\ntan someone's hide idiom\ntar\nwallop\nwhop\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHitting against objects accidentally and colliding\nhit verb\n(EFFECT)\nB2 [ T ] to have an unpleasant or negative effect on a person or thing: Production has been badly hit by the strike. Demand for transatlantic flights has been hit by fears of terrorist attacks.\nC2 [ T ] If an idea or thought hits you, you suddenly think of it: That's when it hit me that my life would never be the same again.\nMore examplesFewer examplesShe opened the window and I was hit by an icy blast of air.Small businesses have been worst hit by the recession.These new tax arrangements will hit everyone, but especially middle-income families.I've been having lots of short nights lately and today the lack of sleep has suddenly hit me.He tries to pretend nothing has happened, but then reality hits him and it's very hard.\nSMART Vocabulary: related words and phrases\nDamaging and spoiling\nadulterate\nadulterated\nadulteration\napplecart\nat-risk\nbutcher\neat\neat away at something\nerode\nflaw\nfoul\nfoul (something) up\nqueer\nrain on someone's parade idiom\nrampage\nravage\nravages\nseismic\nsour\nwreck\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThinking and contemplating\nhit verb\n(SHOOT)\n[ T often passive ] to shoot at or bomb a place or person, causing damage or injury: Two schools were hit during the air raid. He was hit in the neck by a bullet from a sniper. Try to hit the middle of the target.\nMore examplesFewer examplesThe bullet hit him and he crumpled into a heap on the floor.Three soldiers were killed by friendly fire when a mortar bomb hit their truck.90 percent of the projected missiles will hit their target.He was hit by a ricochet from a stray bullet.I had four shots but I didn't even hit the target.\nSMART Vocabulary: related words and phrases\nDetonation & bombardment\naerial bombardment\naerial photograph\nair raid\nairstrike\nblanket bombing\ndetonate\ndetonation\ndetonator\ndirect hit\ndive-bomb\ngo off\nguidance\nloose\npepper something with something\npetrol bomb\nprime\nrefire\nsaturation bombing\nshell\nshoot\nSee more results »\nhit verb\n(REACH)\nC1 [ T ] to arrive at a place or position: If we turn left at the next junction, we should hit the main road after five miles or so.\nC1 [ T ] to succeed in reaching or achieving something: Our profits hit an all-time high of $20 million last year. I just can't hit (= sing) those high notes like I used to.\nMore examplesFewer examplesThe dollar has hit an all-time low against the Japanese yen.It should be about six o'clock when we hit Birmingham.The prime minister's opinion poll ratings have hit rock bottom.Madonna's new single hit the charts today at number 3.If you keep going in this direction, you will hit the coast eventually.\nSMART Vocabulary: related words and phrases\nArriving, entering and invading\nannex\nannexation\nbe on the scene idiom\nbeen\nbreak\nbreak someone in\ningress\ninterloper\nintrude\nintrusion\ninvade\njump\nland\nrock up\nroll up! idiom\nscene\nset foot in somewhere idiom\nshow up\ntrespass\nturn\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSucceeding, achieving and fulfilling\nhit verb\n(SUCCESS)\nhit it off informal\nB2 to like someone and become friendly immediately: hit it off with I didn't really hit it off with his friends.\nSee more\nhit verb\n(ATTACK)\n[ T ] mainly US slang to kill someone: Three drug dealers were hit in the city over the weekend.\nSMART Vocabulary: related words and phrases\nKilling\n-cide\nabattoir\nanti-suicide\nassisted suicide\nbutchery\nclaim someone's life idiom\ncommit\nculpable homicide\ndeadly\nexterminate\nliquidate\nmisery\nmortal\nneutralization\nneutralize\nnon-fatal\noverlie\npoison\nsacrifice\nwring\nSee more results »\nhit verb\n(SCORE)\n[ T ] in cricket, to score runs: Walsh hit 10 fours and two sixes in his fourth one-day century. Yesterday, he faced 74 balls and hit nine fours and two sixes.\n[ T ] in baseball, to hit the ball with a particular result : He hit a career-high 17 home runs last year. In her first at bat, she hit a single.\n[ T ] in baseball, to have a particular batting average (= a number that represents how often a player successfully hits the ball compared to the number of times they have a chance to hit the ball): He hit .372 with 6 home runs, 14 RBIs, and 15 runs scored.\nMore examplesFewer examplesShe hit a six to reach her century.Ramirez hit his second homer of the night to cut the lead to 4–2.Gomez hit a pop fly to the shortstop.He hit .521 as a senior and was named the state's player of the year.\nSMART Vocabulary: related words and phrases\nWinning, losing & scoring in sport\naet\nagainst the run of play idiom\nblow someone away\nboss\nbreak your duck idiom\nclose-run\nconcede\ndraw\nequalizer\npromedios\npull\npull back\nreel something off\nrelegation zone\nromp\nscore\nshutout\nstraight\nstrike\ntreble\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBaseball & rounders\nCricket\nIdioms\nhit someone between the eyes\nhit someone where it hurts\nhit home\nhit the books\nhit the bottle\nhit the ceiling/roof\nhit the deck\nhit the ground running\nhit the hay/sack\nhit the headlines\nMore idioms\nhit the jackpot\nhit the nail on the head\nhit the road\nhit the spot\nhit a wall\nhit the wall\nnot know what hit you\nPhrasal verbs\nhit back\nhit on someone\nhit on/upon something\nhit out\nhit someone up\nhit noun [C]\n(SUCCESS)\nB1 a thing or person that is very popular or successful: The Beatles had a string of number-one hits in the 1960s. Your cake was a real hit at the party - everyone commented.greatest hits They've just released an album of their greatest hits (= their most successful songs).\nThesaurus: synonyms, antonyms, and examples\nsomeone or something that becomes popular, wealthy, or has achieved a lotsuccessThe new TV series was a wild success. a roaring successHer third album was a roaring success and went platinum.hitDinner was a hit with the kids.triumphThe court verdict was a triumph for all abuse victims.winWhat can we do to get a win out of this situation?\nSee more results »\nMore examplesFewer examplesThe Beatles' first hit was 'Love Me Do'.Her last film was a surprise box-office hit.The new album contains some carefully-wrought new songs and a number of familiar hits.He had a string of top-20 hits during the 80s.We'll take a nostalgic look at the musical hits of the 60s.\nSMART Vocabulary: related words and phrases\nSuccessful (things or people)\na head of steam idiom\nachiever\nalive\nalpha male\narrive\nascendant\nballer\nhave something in your pocket idiom\nhave the world at your feet idiom\nhealthily\nheavy hitter idiom\nhigh-flyer\nrail\nrepresent\nsmash\nstorming\nsuccessful\nsuccessfully\nsuperachiever\nsuperhit\nSee more results »\nhit noun [C]\n(INTERNET)\nB2 a request to use a web page on the internet that is then counted to calculate the number of people looking at the page: Our page had 243 hits this week.\nSMART Vocabulary: related words and phrases\nInternet terminology\n.plc.uk\n2FA\n2SV\nabove/below the fold idiom\naddress bar\naffiliate link\nhybrid\ninternet-enabled\ninterweb\nIP\nkeyboard warrior\nlanding page\nping\npodcast\nservice provider\ntweeter\ntweetstorm\ntwitterati\nTwitterer\ntwittering\nSee more results »\nhit noun [C]\n(TOUCH)\nthe act of hitting something or someone, or an occasion when something or someone hits you: hit on She gave him a hit on the head which knocked him flying.\nin baseball, when the batter (= person trying to hit the ball) safely reaches first base after hitting the ball\nSMART Vocabulary: related words and phrases\nHitting and beating\nat-risk\nbang away\nbang someone up\nbasher\nbashing\nbunch\nbutt\nfetch\ngut punch\nhammer\nhead-butt\nhell\nkick\nmess\nswing at someone\nswing for someone\ntan someone's hide idiom\ntar\nwallop\nwhop\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBaseball & rounders\nhit noun [C]\n(SHOOT)\nan occasion when something that has been thrown, dropped, shot, etc. at a place or object reaches that place or object: direct hit The rebel headquarters took a direct hit from a bomb during the attack. I scored a hit on my second shot.\nSMART Vocabulary: related words and phrases\nDetonation & bombardment\naerial bombardment\naerial photograph\nair raid\nairstrike\nblanket bombing\ndetonate\ndetonation\ndetonator\ndirect hit\ndive-bomb\ngo off\nguidance\nloose\npepper something with something\npetrol bomb\nprime\nrefire\nsaturation bombing\nshell\nshoot\nSee more results »\nhit noun [C]\n(ATTACK)\nmainly US slang an act of murder: He was the victim of a mafia hit.\nSMART Vocabulary: related words and phrases\nMurder & attempted murder\nasphyxiation\nassassinate\nassassination\nassassination attempt\nattempt\nbutcher\ndrive-by\ngenocidal\ngenocide\ngun someone down\nholocaust\nhomicide\npolish\npolish something off\npop off\nput someone to the sword idiom\nregicide\nslaughter\nsmother\nsnuff\nSee more results »\nIdiom\nbe a hit with someone\nhit verb [T]\n(TOUCH FORCEFULLY)\nAdd to word list\nAdd to word list\npresent participle hitting | past tense and past participle hit to touch quickly and forcefully, with the hand or an object: Don’t hit your little brother! They were throwing rocks, and one of the rocks hit a window and broke it. She must have fallen asleep, and the car hit a tree.\npresent participle hitting | past tense and past participle hit If something hits part of your body, or you hit it, you come up against it by accident: He’s so tall he keeps hitting his head when he goes through a doorway.\npresent participle hitting | past tense and past participle hit Someone who is hit by a bullet or explosive weapon is injured by it: One journalist was hit in the leg by a stray bullet.\nhit verb [T]\n(HAVE EFFECT)\npresent participle hitting | past tense and past participle hit to have an unpleasant or negative effect on a person or thing: Commuters are going to be hit hard by the rise in gasoline prices.\npresent participle hitting | past tense and past participle hit infml If an important fact hits you, you suddenly understand the meaning of it: It just hit me that once she leaves, I may never see her again.\nhit verb [T]\n(ARRIVE AT)\ninfml present participle hitting | past tense and past participle hit to arrive at a place, position, or state: The company’s profits hit an all-time high last year.\nhit verb [T]\n(BASEBALL)\nto make a thrown baseball move within the playing area by touching it with a bat (= stick): Rodriguez hit a high fly ball that was caught by the shortstop. Idioms\nhit home\nhit it off (with someone)\nhit the books\nhit the deck\nhit the ground running\nhit the jackpot\nhit the nail on the head\nhit the road\nhit the roof\nhit the sack\nMore idioms\nhit the skids\nsomething hits the spot\nPhrasal verbs\nhit back\nhit on someone\nhit on/upon something\nhit up someone\nhit noun [C]\n(SUCCESS)\nsomeone or something that is very popular or successful: The musical is one of the biggest hits on Broadway.\nhit noun [C]\n(BASEBALL)\na base hit: Jason had three hits in four times at bat.\nhit noun [C]\n(FORCEFUL TOUCH)\nthe act of hitting someone or something, or an occasion when someone or something is hit: The hospital took a direct hit from a bomb.\nAdd to word list\nAdd to word list\n[ I or T ] to have an unpleasant or negative effect on someone or something : Rising fuel costs hit industrial and rural areas worst. Companies tend to be slow to lay off employees when hard times hit, but they are quicker to cease hiring.be hit by sth Oil firms have been hit by a 10% increase in petroleum tax.be hit with sth A tractor made in the United States and shipped to Chile is hit with $25,000 in tariffs and duties.\n[ T ] to reach a particular level or amount, especially a very high or very low one: Sales hit $300 million within the first three years.hit an all-time/a record high/low Last week property shares hit a record low. The company is very capable of hitting its targets well ahead of schedule.\n[ T ] informal to experience a difficult situation or stop making progress with something: Talks between the bosses and the union yesterday hit a major setback. The project began smoothly, but then we began to hit some problems.\nhit the market/shops/shelves\ninformal to become available for people to buy: Although the toys are only just now hitting the market, a huge advertising campaign has been in place for several months.\nbe hit hard/be hard hit (by sth)\nto be badly affected by something: Car makers were among the hardest hit as consumers bought fewer vehicles last month. The area has been hit hard by job losses in textiles and furniture.\nhit a wall\nto reach a point at which no more progress can be made: The energy bill is expected to hit a wall in the Senate, where Republicans have enough votes to block it.\nhit bottom\ninformal to reach an extremely low level: The U.S. economy is beginning to show signs that it is hitting bottom and that a turnaround could get underway later this year.\nhit it big\ninformal to become very successful: The company hit it big when they received an order for three commercial satellites.\nhit the buffers\nmainly UK informal to suddenly stop being successful or stop happening: The main worry is that the economy might hit the buffers. Their plans to become one of the world's largest telecoms firms has hit the buffers.\nhit the ground running\ninformal to immediately work hard and successfully at a new activity: Companies often expect staff to hit the ground running.\nhit the headlines\nto receive a lot of attention in news reports: He hit the headlines when he sold a million shares at £5.80 a share.\nhit the jackpot\nto achieve financial success: They need a licensing deal to a big drug company before judging if their biotech venture has hit the jackpot.\nhit the wall US\nto be a financial failure: The question mark is whether the company is going to hit the wall. Phrasal verbs\nhit back\nhit sb up (for sth)/hit sb for sth\na thing or person that is very popular or successful: a hit with sb/sth The Mexican restaurant is a huge hit with locals, who swear by the Mexican pizzas and fried bread dishes. Plans call for doubling both the workforce and production if the vehicles prove a hit.\nE-COMMERCE, MARKETING a visit to a particular website on the internet, which is then counted to calculate the number of people who see the website: attract/get/receive hits The site typically gets an average of about 400,000 hits a day.\nsomething that has an unpleasant or negative effect on a person or thing: a hit to sth Investors are worried about the direct hit to consumer confidence. For some businesses, the financial hit was substantial.\ntake a hit\nto be badly affected by a difficult situation or problem: Consumer spending accounts for more than two-thirds of the nation's economic activity, so when consumers take a hit, so does the economy.\nto have to pay an unusual cost: The company recently took a hit to the tune of $4 million in health insurance costs."}