{"id":182244,"name":"hitch","type":"noun","us_sound":"hɪtʃ","us_link":"../audio/h/hitch.mp3","uk_sound":"hɪtʃ","uk_link":"../audio/h/ukhire_021.mp3","content":"hitch noun [C]\n(PROBLEM)\nAdd to word list\nAdd to word list\na temporary difficulty that causes a short delay: technical hitch Due to a slight technical hitch the concert will be starting half an hour late.without a hitch The ceremony went off without a hitch.\nThesaurus: synonyms, antonyms, and examples\na problemproblemWhat's the problem here?difficultyThe company is having some financial difficulties at the moment.troubleWe've had a lot of trouble with the new computer system.hitchThe ceremony went without a hitch.glitchWe've had a few technical glitches, but I'm confident we'll be ready on time.hurdleGetting a work permit is only the first hurdle.\nSee more results »\nMore examplesFewer examplesIt should all be so simple, but there's a hitch.After a few hitches at the start, the project went smoothly.There was a last-minute hitch inflating the giant model birthday cake.\nSMART Vocabulary: related words and phrases\nDifficult things and people\na (heavy) cross to bear idiom\nalbatross\nball and chain\nbane\nbe dead meat idiom\nbe in the clear idiom\nbump\nequation\nhindrance\nhot potato\nimpediment\nincubus\nmarathon\nnut\nstumbling block\nteaser\nteething troubles\nthorn in your flesh/side idiom\ntie someone up\ntwist\nSee more results »\nhitch noun [C]\n(FASTENING)\na particular type of knot: A hitch is a knot used to tie a rope to a fixed object. There are many different hitches, such as a barrel hitch, a boom hitch, a cow hitch and a pipe hitch. See also\nclove hitch\nhalf hitch\na device for fastening one thing to another, for example for fastening a caravan (= a wheeled vehicle for sleeping in) to a car: The unit can be mounted to most bikes with a special hitch. trailer hitches for large travel trailers\nMore examplesFewer examplesA Palomar knot is a hitch used for securing a fishing line to a lure, snap or swivel.A simple mathematical theory of hitches has been proposed.He tied a rope to the Jeep's trailer hitch.10 to 15 percent of the trailer weight should rest on the hitch to reduce swaying.\nSMART Vocabulary: related words and phrases\nFastening and tying\nanchor\nbale\nbe locked together idiom\nbelay\nboard something up\nbolt\nbound\nbowline\nhalf hitch\nharness\nhobble\nhogtie\nknotted\nstake\nstrap someone in\nstrap something up\nstrop\ntack\ntape something up\ntether\nSee more results »\nhitch verb\n(RIDE)\nhitch a lift/ride informal\nto get a free ride in someone else's vehicle as a way of travelling: They hitched a lift to Edinburgh from a passing car.\nSee more\nhitch verb\n(FASTEN)\n[ T usually + adv/prep ] to fasten something to another thing by tying it with a rope or using a metal hook: be hitched to The horses were hitched to a shiny, black carriage.hitch something (on)to something We just need to hitch the trailer (on)to the car and then we can go.\nSMART Vocabulary: related words and phrases\nFastening and tying\nanchor\nbale\nbe locked together idiom\nbelay\nboard something up\nbolt\nbound\nbowline\nhalf hitch\nharness\nhobble\nhogtie\nknotted\nstake\nstrap someone in\nstrap something up\nstrop\ntack\ntape something up\ntether\nSee more results »\nPhrasal verb\nhitch something up\nhitch noun [C]\n(DIFFICULTY)\nAdd to word list\nAdd to word list\na difficulty or troubling fact esp. in a situation that is generally positive: I finally did get a job offer that sounded perfect – the only hitch was the low salary. The taping at Channel 4 went off without a hitch (= perfectly).\nhitch verb [T]\n(RIDE)\nto get a free ride in someone else’s road vehicle as a way of traveling: Nancy hitched a ride with her husband’s cousin.\nhitch verb [T]\n(FASTEN)\nto fasten something to another thing, such as a vehicle: We just need to hitch the trailer to the car and then we can go.\nAdd to word list\nAdd to word list\na difficulty, usually one that is unexpected: a legal/technical hitch The airline has been plagued by technical hitches and staff shortages. The steady ascent of the company's profits continued without a hitch for an impressive 26 quarters.\nhitch your fortunes/future/wagon to sth/sb\nto rely on something or someone to bring you success: The former oil industry investor has hitched his wagon to renewable energy."}