{"id":182320,"name":"hoard","type":"verb","us_sound":"hɔːrd","us_link":"../audio/h/hoard.mp3","uk_sound":"hɔːd","uk_link":"../audio/h/ukhive_013.mp3","content":"Add to word list\nAdd to word list\nto collect large amounts of something and keep it for yourself, often in a secret place: During the siege people began hoarding food and supplies. There would be enough food on a daily basis if people were not hoarding. Synonym\nstash informal\nto keep a large number of things that are not needed or have no value, because you are suffering from a mental condition: She hoarded dirty bottles, old newspapers, broken appliances, even plastic bags from cereal boxes. Psychiatrists are not sure what makes a person start hoarding.\nMore examplesFewer examplesI was hoarding candles in case of a power cut.If there is talk of shortages, consumers might just start hoarding.His bungalow is crammed with tons of hoarded junk.He stopped taking his medication and started hoarding again.\nSMART Vocabulary: related words and phrases\nKeeping and storing things\nappropriate\naside\nbank\nbogart\ncapacitance\ncling\ndump\nkept\nlay\nlay something aside\nlay something down\nlay something in\nlodge\nmaintain\nstash\nstockpile\nstockpiling\nstorage\nstore\ntrap\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMental illnesses\nRelated word\nhoarder\na large amount of something that someone has saved and hidden: hoard of We found a huge hoard of tinned food in the basement. Synonyms\ncache\nstash\nSMART Vocabulary: related words and phrases\nMasses and large amounts of things\naccumulation\nany number of things idiom\narmload\nbacklog\nbolus\nflood\nfoam\nlion\nlogjam\nmany\nmotherlode\nmulti-million\npile\nstack\nthe lion's share idiom\ntsunami\nwave after/upon wave idiom\nwedge\nwelter\nwodge\nSee more results »\nAdd to word list\nAdd to word list\nto collect a large supply of something, more than you need now, often because you think you will not be able to get it later: Many people hoarded food in wartime.\nAdd to word list\nAdd to word list\nECONOMICS, FINANCE to collect a lot of money or objects, sometimes secretly: A financial crisis can cause people to hoard. When oil prices rise, the tendency to hoard gold also rises.\nECONOMICS, FINANCE a large amount of money or objects that someone has collected, sometimes secretly: They found a hoard of dollar bills in the suspect's attic. The company has a vast cash hoard that just keeps on growing."}