{"id":182324,"name":"hoarding","type":"noun","us_sound":"ˈhɔːr.dɪŋ","us_link":"../audio/h/ushippo026.mp3","uk_sound":"ˈhɔː.dɪŋ","uk_link":"../audio/h/ukhive_015.mp3","content":"hoarding noun\n(BOARD)\nAdd to word list\nAdd to word list\n[ C ] UK (US billboard) a very large board on which advertisements are shown, especially at the side of a road: an advertising hoarding\nThomas Grass/The Image Bank/GettyImages\n[ C ] UK a temporary fence, usually made of boards, put around an area, especially one where people are building\nImage Source/GettyImages\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ncustomer relationship management\ndetoxify\ndifferentiator\ndogfooding\nflyer\no.n.o.\non-brand\noverexpose\noverexposure\noverhype\ntout\nunadvertised\nunbilled\nunbranded\nunmarketable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRoads: lights, signs & markings on roads\nParts of buildings: fences & rails\nhoarding noun\n(KEEPING)\n[ U ] the act of collecting large amounts of something and keeping it for yourself, often in a secret place: The food shortages have been exacerbated by hoarding.\n[ U ] a mental condition that makes someone want to keep a large number of things that are not needed or have no value: compulsive hoarding Compulsive hoarding can leave no space for someone to clean, cook, socialize, or even sleep in a bed. Hoarding is often linked with depression and anxiety.\nMore examplesFewer examplesHe was accused of food hoarding.She called for legal measures against the hoarding of antibiotics and other drugs.Hoarding can be very severe when the hoarder does not recognize there is a problem.Residents exhibited behaviours ranging from aimless wandering and hoarding to more serious signs of dementia, depression, and psychosis.\nSMART Vocabulary: related words and phrases\nKeeping and storing things\nappropriate\naside\nbank\nbogart\ncapacitance\ncling\ndump\nkept\nlay\nlay something aside\nlay something down\nlay something in\nlodge\nmaintain\nstash\nstockpile\nstockpiling\nstorage\nstore\ntrap\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMental illnesses\nAdd to word list\nAdd to word list\n[ C ]\n&#160; MARKETING\n&#160; UK a very large sign in a public place on which advertisements are shown: advertising hoardings A number of buildings have been demolished, with hoardings put up around the empty spaces. Compare\nbillboard\n[ U ]\n&#160; ECONOMICS, FINANCE the act of collecting and storing a lot of money or objects, sometimes secretly: In the uncertain economic climate, cash hoarding is understandable. Compare\ndishoarding"}