{"id":182687,"name":"holdback","type":"noun","us_sound":"ˈhoʊld.bæk","us_link":"../audio/h/cdo1121ushold2056.mp3","uk_sound":"ˈhəʊld.bæk","uk_link":"../audio/h/cdo1121ukhold1844.mp3","content":"holdback noun [C]\n(MONEY)\nAdd to word list\nAdd to word list\npart of an amount of money that is not paid in a particular situation: The invoice price does not reflect the holdback, a discount the dealer gets from the manufacturer.\nMore examplesFewer examplesFiscally conservative lawmakers believe the 13 percent increase in spending is to blame for today's budget holdbacks. The holdback policy is designed to ensure property owners have enough money to make storm repairs but save the agency from overpaying on claims.$265,000 was deposited into a construction holdback account.The statute creates a scheme of payments and holdbacks as the project proceeds. These holdbacks accumulate and become a fund which is then a source of recovery in the event that someone is not paid.\nSMART Vocabulary: related words and phrases\nAmounts of money\nbank\nbounty\nbuck\ncapital\ncircumstance\ncoin\nfisc\nfloat\nliving wage\nmeans\nmoney supply\npayout\npool\nslush fund\nsub\nsum\nsurplus\ntrough\nwherewithal\nyour daily bread idiom\nSee more results »\nholdback noun [C]\n(OBJECT)\nan object designed to hold something such as a curtain in place, so it does not close or fall: Curtain holdbacks are fitted on the wall beside the headboard.\nSiraphol/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesShutters should be attached with hinges and should have holdbacks fixed at the bottom. Another alternative is to drape fabric back over specially designed hold-back hooks in brass or chrome.\nSMART Vocabulary: related words and phrases\nPins, clips, hooks & pegs\nalligator clip\nbanana clip\nbarb\nbinder clip\nbodkin\nBulldog Clip\nclip-on\ncrocodile clip\ndrawing pin\nfishhook\nhair claw\nhair slide\nhook\nneedle\npeg\nsafety pin\nstaple\nthumbtack\ntiepin\ntuning peg\nSee more results »"}