{"id":182697,"name":"holding","type":"noun","us_sound":"ˈhoʊl.dɪŋ","us_link":"../audio/h/ushoaxe022.mp3","uk_sound":"ˈhəʊl.dɪŋ","uk_link":"../audio/h/ukhobno030.mp3","content":"Add to word list\nAdd to word list\nsomething that you own such as shares in a company or buildings, or land that you rent and farm: To ensure security the investment fund has holdings in many companies.\nSMART Vocabulary: related words and phrases\nMortgages & real estate\nblockbusting\nbrick\nbricks and mortar idiom\nBTL\nbuy-to-let\nchain\nequity\nlandlady\nletting\nmortgagee\nplanning blight\nreal estate broker\nreal estate office\nRealtor\nrealty\nrealty office\nrefinance\nremortgage\nrepo\nrepossess\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStock markets\nIn football, if a midfield player has a holding role, their main job is to help the defence rather than attack an opponent's goal: Without a holding midfielder, the two centre backs can be left exposed.\nSMART Vocabulary: related words and phrases\nFootball/soccer\n18-yard box\n2 3 5\n4 3 2 1\n4 4 2\n4 5 1\nfootball pools\nfooty\nformation\nfoul throw\nfour five one\nfour four two\nfour three two one\nreducer\nrelegation zone\nreserve team\nroute one football\nrow Z\nsweeper\ntreble\nwoodwork\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral terms used in ball sports\nAdd to word list\nAdd to word list\nassets such as property, shares, or cash that a government, company, or person owns: holding in sth The government announced that it would replace its gold reserves with holdings in dollars, euros and yen. Foreign central banks might reduce their holdings of American Treasury bonds. cash/stock/property, etc. holdings\nthe amount of a company's shares that a person or organization owns: holding in sth He is considering selling his 28% holding in the company.increase/raise/build up a holding The Chairman bought a further 80,000 shares, increasing his holding to 20.3%.reduce/cut a holding The sale is part of a plan by the Dutch state to reduce its holding in the former government-controlled group.\nHoldings [ plural ]\nused in the names of some holding companies: TEC Holdings has been in existence since 2007.\nSee also\ncross-holding\nhand-holding"}