{"id":182683,"name":"hold","type":"verb","us_sound":"hoʊld","us_link":"../audio/h/hold.mp3","uk_sound":"həʊld","uk_link":"../audio/h/ukhobno026.mp3","content":"hold verb\n(SUPPORT)\nAdd to word list\nAdd to word list\nA2 [ T ] to take and keep something in your hand or arms: Can you hold the bag while I open the door? He was holding a gun.hold someone's hand The little girl held her mother's hand.hold someone in something He held her in his arms. [ + obj + adj ] Could you hold the door open, please?hold something out Rosie held out an apple for the horse.hold something up All those who agree, please hold up your hand (= raise your arm).\nThesaurus: synonyms, antonyms, and examples\nto hold someone or somethingholdCan you hold this for a moment?claspHe reached out to clasp her hand.gripThe baby gripped my finger with her tiny hand.clutchSilent and pale, she clutched her mother's hand.clingOne little girl was clinging onto a cuddly toy.hang onThe child was hanging on to her mother's skirt.\nSee more results »\n[ T ] to support something: Will the rope be strong enough to hold my weight?be held on Each wheel is held on with four bolts.be held together The parts are held together with glue. hold hands\nA2 When two people hold hands, one person holds the other person's hand, especially to show that they love each other: They walked along holding hands.\nSee more\nMore examplesFewer examplesYou have to hold my hand when we cross the road.Polly and Susie were having a squabble about who was going to hold the dog's lead.Suddenly he drew a knife and held it to my throat.Would you mind holding the door open for me, please?The screws that hold the bed together had loosened.\nSMART Vocabulary: related words and phrases\nHaving in your hands\nahold\narm\nchokehold\nclasp\nclench\ncling\ncup\ndandle\ngrasp\ngrip\nhand in hand idiom\nhandle\nhang\nhang on\nhang/hold on like grim death idiom\nnurse\nonto\npurchase\nseize\ntaken\nSee more results »\nhold verb\n(CONTAIN)\nB1 [ T not continuous ] to contain or be able to contain something: This jug holds exactly one pint. One bag won't hold all of the shopping - we'd better take two. Computers can hold huge amounts of information.\n[ T not continuous ] If you say that the future holds something, you mean that that thing will happen: Who can tell what the future holds?\n[ T not continuous ] to have a particular quality: She's very religious, so death holds no fear for her.\nMore examplesFewer examplesIt used to hold paper bags, but gradually came to be used for magazines.That vase isn't big enough to hold all these flowers.Will the room hold a hundred people?The container held a gallon of soup.We knew the chest held a lot of gold jewellery.\nSMART Vocabulary: related words and phrases\nIncluding and containing\nabsorptive capacity\naccessibly\nall in\nassimilable\nassimilate\ncarry\nconcern\ndrag\ndraw\nEDI\nEDIB\nembody\nembracingly\nencompass\nincorporation\ninvolve\nnumber someone/something among someone/something\nO, o\npack something in\nplug\nSee more results »\nhold verb\n(CONTROL)\nC1 [ T ] to have something, especially a position or money, or to control something: He currently holds the position of technical manager. The bank holds large reserves of gold. Despite incurring heavy losses, the rebels now hold the town and the surrounding hills.\nMore examplesFewer examplesHe holds a 40 percent stake in the company.As chairman of the association, he held office for over 20 years.She's held the post for 13 years.He holds several company directorships.Who holds the copyright on this article?\nSMART Vocabulary: related words and phrases\nHaving and owning - general words\nacquire\nacquisition\nattach\nattach something to something\nbe endowed with something idiom\nbearer\ncarry\nholder\nlay\nlord/master/mistress/king/queen of all you survey idiom\nmake something (all) your own idiom\nmistress\nnot/never want for anything idiom\nrevert\nrevert to something\nshared ownership\nstake\nstake something out\nsurvey\nthey've\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nControlling and being in charge\nhold verb\n(IN A COMPETITION)\nB2 [ T ] to have a particular position in a competition: hold the record She holds the world record.hold the lead They held the lead until the 89th minute.\nSMART Vocabulary: related words and phrases\nWinning, losing & scoring in sport\naet\nagainst the run of play idiom\nblow someone away\nboss\nbreak your duck idiom\nclose-run\nconcede\ndraw\nequalizer\npromedios\npull\npull back\nreel something off\nrelegation zone\nromp\nscore\nshutout\nstraight\nstrike\ntreble\nSee more results »\nhold verb\n(KEEP)\nC1 [ T ] to keep something, especially when it might have been lost: I asked the shop to hold the dress for me until this afternoon.hold someone's attention/interest You have to be a fairly good speaker to hold an audience's attention/interest.\nB2 [ T ] to keep someone in a place so that they cannot leave: hold someone in custody The police are holding several people in custody (= at the police station) for questioning. [ + obj + noun ] The terrorists held him hostage for 18 months.be held prisoner I was held prisoner in a tiny attic room.\nMore examplesFewer examplesThe hostages are being held as a bargaining chip by terrorist organizations.The three men were held hostage for two days by masked gunmen.His verbal pyrotechnics could hold an audience spellbound.The terrorists were holding several British diplomats captive.The police are holding several people in custody for questioning.\nSMART Vocabulary: related words and phrases\nKeeping and storing things\nappropriate\naside\nbank\nbogart\nbuffer\ncapacitance\ncling\ndump\nkeep (something/someone) back\nkept\nlay something aside\nlay something down\nlay something in\nlodge\nstandby\nstash\nstockpile\nstockpiling\nstorage\ntrap\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPutting people in prison\nArresting & charging\nhold verb\n(MAKE HAPPEN)\nB1 [ T ] to have something such as a meeting or an election: Could we hold a meeting to discuss this tomorrow afternoon? The election will be held on 8 August. I find it's almost impossible to hold a sensible conversation with her.\nMore examplesFewer examplesThey frequently hold conferences at that hotel.Dr Clark holds a clinic on Tuesday mornings.They held a dinner to celebrate his retirement.The president held an emergency meeting to discuss military strategy with his defence commanders yesterday.The director is holding auditions next week for the major parts.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nspark\nspell\nSee more results »\nhold verb\n(CONTINUE)\n[ I or T ] to cause to stay or continue in the same way as before: Let's hope our good luck holds. I hope the repair holds until we get the car to a garage.holds true The old adage that money talks still holds true (= is still true). The government is committed to holding exports at their present level. The ship/aircraft held its course.\nSMART Vocabulary: related words and phrases\nContinue & last\n(it's) business as usual idiom\nbash on\ncarry (something) on\ncease\ncont.\ncontd\necho\nimmortally\nin the making idiom\ninsist on doing something\nisochronous\nleg\nprotract\nprotraction\npush ahead\npush on\nrun on\nsoldier\nspan\nspin\nSee more results »\nhold verb\n(BELIEVE)\n[ T not continuous ] to have an idea or opinion: hold an opinion You are perfectly entitled to hold that opinion, but I disagree with you.hold a belief Some people still hold the belief that unemployment is the result of laziness. hold someone responsible\nto believe that someone is responsible for something or should be blamed for it: You sold it to me, so if it breaks I'll hold you responsible.hold someone responsible for something I hold them responsible for a lot of things that happened. hold someone/something to be something\nformal to believe someone or something to be something: She was held to be guilty of theft. People who believe in ghosts sometimes hold them to be souls that could not find rest after death. We hold these truths to be self-evident, that all men are created equal.\nSMART Vocabulary: related words and phrases\nBelieving\naccept\nallegedly\narticle of faith\nascribe something to something\nascription\nbelief\ncredit\ndeluded\nevidently\nfeel it in your bones idiom\ngive someone the benefit of the doubt idiom\ngospel\nrecognize\nroom for doubt idiom\nsee something in someone/something\nseeing is believing idiom\nself-deceit\nself-deceiving\nstock\nword\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDuty, obligation and responsibility\nhold verb\n(DELAY)\n[ I or T ] to wait, or to stop something temporarily: They've decided to hold all future deliveries until the invoice has been paid.hold your breath How long can you hold your breath (= stop breathing)? Will you hold my calls for the next half hour please?hold (the line) She's on the phone at the moment - will you hold (the line) (= wait on the phone until she can speak to you)?\nSMART Vocabulary: related words and phrases\nDelaying and wasting time\nado\nbusywork\nbuy time idiom\ncarry something over\ndally\ngridlock\ninefficiency\ninefficiently\nkept\nkick\nkick something into the long grass idiom\npigeonhole\npush\nraincheck\nretard\nretardation\nset someone back (something)\nshelve\nspin\nstall\nSee more results »\nhold verb\n(NOT INCLUDE)\n[ T ] US If you ask someone to hold something, you do not want them to include it: I'd like a ham sandwich on rye, hold the lettuce.\nSMART Vocabulary: related words and phrases\nExcluding\nacid-free\napart\naside\nbar\nbar none idiom\nbarring\ncount\ndiscount\nexclude\nexcluding\nexclusion\nexclusionist\nexclusively\nnegative\non/from the sidelines idiom\nostracism\nostracize\notherwise\nout of it idiom\nstand-alone\nSee more results »\nIdioms\ncan't hold a candle to\ncan't hold your drink\ncan't hold your water\ndon't hold your breath\nhold all the cards\nhold court\nhold down a job\nhold everything!\nhold the floor\nhold (down) the fort\nMore idioms\nhold your head (up) high\nhold your horses\nhold it!\nhold the key\nhold your nose\nhold on\nhold your own\nhold the phone\nhold the reins\nhold the road\nhold still\nhold sway\nhold that thought\nhold your tongue\nhold true\nhold water\nthere is no holding someone (back)\nPhrasal verbs\nhold it/that against someone\nhold back\nhold someone/something back\nhold something back\nhold someone/something down\nhold something down\nhold forth\nhold off\nhold someone off\nhold on\nMore phrasal verbs\nhold onto someone/something\nhold onto/on to something\nhold out\nhold something out\nhold out for something\nhold out on someone\nhold something over\nhold someone over\nhold someone to something\nhold up\nhold someone/something up\nhold something up\nhold something up as something\nnot hold with something\nhold noun\n(SUPPORT)\nB2 [ S or U ] the act of holding something or someone, or the way you do this: hold on Keep a tight hold on your tickets.lose hold of Don't worry if you lose hold of the reins - the horse won't wander off. See also\nfoothold (ROCK CLIMBING)\nhandhold\ntoehold (IN ROCK) catch/get/grab/take hold of something/someone\nB2 to start holding something or someone: He took hold of one end of the carpet and tugged.\nSee more\n[ C ] in fighting sports, a position in which one person holds another person so that they cannot move\n[ C ] a place to put the hands and feet, especially when climbing\nMore examplesFewer examplesWithout saying a word, she took hold of my arm and marched me off to the headmaster's office.She relinquished her hold on the steering wheel.He got hold of the money legally, without resort to violence.He caught hold of my arm.He took hold of the plant's root and pulled.\nSMART Vocabulary: related words and phrases\nHaving in your hands\nahold\narm\nchokehold\nclasp\nclench\ncling\ncup\ndandle\ngrasp\ngrip\nhand in hand idiom\nhandle\nhang\nhang on\nhang/hold on like grim death idiom\nnurse\nonto\npurchase\nseize\ntaken\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFighting sports\nMountaineering & rock climbing\nhold noun\n(CONTROL)\nC2 [ S ] power or control over something or someone: strong hold on/over Their company has a strong hold on/over the computer market.\nSMART Vocabulary: related words and phrases\nLimiting and restricting\nanti-libertarian\nboundary\nbox someone/something in\nchain\nchain someone to something\ncripplingly\ncrowd\ncurb\ncurtail\ncurtailment\nkeep (herself) to herself idiom\nkeep something down\nlimit\nlimitation\nlimitative\nstraitly\nstranglehold\nstunt\nsuffocatingly\ntempered\nSee more results »\nhold noun\n(MUSIC)\n[ C ]\n&#160; music\n&#160; specialized in a piece of music, when a note or rest (= a period of silence between notes) is held for longer than usual: Holds and pauses are indicated using a symbol called a fermata. See also\nfermata\nSMART Vocabulary: related words and phrases\nTechnical music terms\naccidental\nadagio\naleatory\nandante\nantiphonal\narpeggio\narr.\ncadence\ngiusto\ngroove\nharmonic\nharmonic progression\nharmony\nlegato\nsyncopated\nsyncopation\ntempered\ntempo\ntimbre\ntime signature\nSee more results »\nhold noun\n(DELAY)\non hold\nC1 If you are on hold when using the phone, you are waiting to speak to someone: Mr Briggs is on hold.\nC1 If an activity is on hold, it has been intentionally delayed: Everything's on hold again because of the bad weather.\nSee more\nhold noun\n(SPACE)\n[ C ] the space in a ship or aircraft in which goods are carried\nSMART Vocabulary: related words and phrases\nParts of ships & boats\nabaft\nbilge water\nboathook\nboiler room\nbowline\ncleat\nescape hatch\nkeel\npaddle\nperiscope\npropeller\nprow\nrigging\nspar\nsteerage\nstem\nstrop\nsun deck\nsuperstructure\ntopsail\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAir travel: parts of aeroplanes\nIdioms\nget hold of\nno holds barred\ntake hold\nhold verb\n(TAKE FIRMLY)\nAdd to word list\nAdd to word list\n[ I/T ] to take and keep something in your hand or arms: [ T ] The nurse held the child in her arms. [ I ] Hold tight (= firmly) to the railing.\n[ I/T ] If you hold your nose, you press your nose tightly between thumb and finger to close it. hold hands\nWhen two people hold hands, each one takes the other person’s hand in his or her hand, esp. to show affection.\nhold verb\n(MOVE AWAY)\n[ always + adv/prep ] to move something away from your body: [ M ] Rosie held an apple out to the horse. [ M ] Close your eyes and hold out your hands. [ M ] All those who agree, please hold your hand up.\nhold verb\n(KEEP IN PLACE)\n[ always + adv/prep ] to keep something in a particular place or position: [ M ] Could you hold the door open for me, please? [ M ] I can’t fasten this skirt unless I hold my stomach in (= keep it tight with my muscles so that it does not stick out). [ M ] Each wheel is held on by/with four bolts. [ M ] Individual parts are held together with glue. [ I ] Hold still (= Do not move)!\nhold verb\n(CONTINUE)\n[ I/T ] to continue or cause to continue in the same way as before: [ I ] If the weather holds, we can go sailing. [ T ] The ship held its course. [ T ] She seemed to hold the note she was singing for more than a minute. holds true\nIf something holds true, it continues to be true: Einstein’s theories still hold true today.\nhold verb\n(DELAY)\n[ I/T ] to stop something from happening, or to delay something temporarily: [ T ] How long can you hold your breath?\n[ I/T ] Someone on the telephone who asks you to hold wants you to wait until that person or someone else can speak to you: [ I ] Her line is busy, would you like to hold?\n[ I/T ] If you hold something that is usually included in food, you do not include it: [ T ] I’d like a salad, but hold the dressing.\nhold verb\n(CONTAIN/SUPPORT)\n[ T ] to support or contain something or be able to contain or support it: This bottle holds exactly one pint. Modern computers can hold (= store) huge amounts of information. Will the rope be strong enough to hold the weight? holds promise\nIf something holds promise, it is likely to be successful: The new drug holds promise for relieving chronic pain.\nhold verb\n(CONTROL)\n[ T ] to keep control or possession of something: His speech held the audience’s attention for over an hour. He was held prisoner for three days. After many days of fighting, the rebels now hold the town. The champion held the lead until the last lap.\n[ T ] If someone who committed a crime is held, that person is kept guarded in a police station.\n[ T ] If you hold a job or a financial account, you have it: He currently holds the position of managing editor. She holds three different accounts with the same bank.\nhold verb\n(CAUSE TO HAPPEN)\n[ T ] to organize or cause a meeting, election, or social event to happen: The election will be held on the 8th of November. We’re holding our annual New Year’s Day party again.\nhold verb\n(BELIEVE)\n[ T ] to believe an idea or opinion to be correct, or to state that something is true: He holds unpopular views on many subjects. I hold him responsible for the damage to my car. [ + that clause ] Murphy’s law holds that if anything can go wrong, it probably will. Idioms\nhold it\nhold your own\nhold the fort\nhold your tongue\nhold water\nnot hold a candle to someone/somethingPhrasal verbs\nhold something against someone/something\nhold someone to something\nhold back (something)\nhold down something\nhold down something\nhold forth\nhold off (something)\nhold on\nhold on/tight\nhold onto something\nMore phrasal verbs\nhold out\nhold out something\nhold out for something\nhold out on someone\nhold over something/someone\nhold together (something)\nhold up\nhold up someone/something\nhold up someone/something\nhold up something/someone\nhold noun\n(FIRM SUPPORT)\n[ U ] the act of taking and keeping something in your hand or arms, or the way you do this: Don’t lose hold of the dog’s leash. If you can get/grab/take hold of that end of the box, I’ll take this end and we’ll lift it.\nhold noun\n(DELAY)\non hold\nIf something is on hold, it is intentionally delayed: The space launch is on hold until the weather clears.\nIf you are on hold when using the telephone, you are waiting to speak to someone: His line is busy – can I put you on hold?\nhold noun\n(CONTROL)\n[ U ] control or power over something or someone: The team is strengthening its hold on first place. She has a strong hold on her daughters.\nhold noun\n(SPACE)\n[ C ] the space in a ship or aircraft where goods are carried\nhold noun\n(POSITION IN SPORTS)\n[ C ] (in some sports) a position in which one person prevents another from moving: In karate, beginners learn several simple holds.\nAdd to word list\nAdd to word list\n[ T ] to have something, especially a position or money, or to control something: hold power/control The CEO holds power only as long as the directors approve of his methods.hold a stake/an interest/shares The bank holds an interest in the real estate company.hold a position/job/post Before taking his present post, he held the position of chief financial regulator.hold a mortgage/loan She holds the mortgage, so she has the right to foreclose on the property.hold the rights to sth Who holds the rights to screen these games?hold a patent The world's largest biotech firm holds patents on the DNA sequences of thousands of varieties of grain.\n[ T ] to keep something, especially when it might be needed in the future: Accountants recommend holding records for more than seven years. Ten seats are being held for the chief executives.hold stocks/supplies We hold large stocks of all these items, and are generally able to guarantee next-day delivery.\n[ T ]\n&#160; FINANCE to keep money or an investment, and not sell it: We'll hold the bonds until the resale market improves. For these stocks, the recommendation is: Hold! See also\nbuy-and-hold\n[ T ] to contain or be able to contain a number of people or things: Each container can hold 500 pounds of cargo. The auditorium is designed to hold 1,000 people.\n[ T ]\n&#160; MEETINGS to make an event, especially a meeting, happen: hold a meeting/conference/conference call The software development conference is scheduled to be held in San Francisco in April.\n[ I or T ]\n&#160; FINANCE to stay, or make something stay, at the same level as before: hold a rate/price/tax The Federal Reserve held interest rates at 3%. The Chancellor is expected to hold capital gains tax at its present rate. The markets held steady, despite the report of higher inflation.\n[ T ]\n&#160; LAW to make a judgment in a court of law: A superior court judge held that the plaintiff had no legal claim to royalties.\n[ I or T ]\n&#160; COMMUNICATIONS to wait when you are phoning until you can talk to the person that you want to speak to: He'll answering another call right now. Can you hold? Please hold the line. I'll try to connect you.\nhold all the cards\nto be in a strong position when you are competing with someone else, because you have all the advantages: Management holds all the cards when it comes to the negotiations over job cuts.\nhold the floor\nMEETINGS to speak in a formal situation, such as at a conference or meeting: Martin held the floor for almost an hour.\nhold down the fort (UK hold the fort)\nWORKPLACE to deal with a situation, or do someone's job, while they are away: She went off on vacation, leaving me to hold down the fort. Will you hold the fort while I go for lunch?\nhold your ground\nto keep or defend an opinion or an idea, even when other people do not agree with you: We'll hold our ground until they accept our changes to the contract.\nhold sb's hand\nto help someone to do something, especially when it is a new or difficult task: A call center technician held my hand as he talked me through installing the hardware. You shouldn't really need your boss to hold your hand any longer.\nhold office\nGOVERNMENT, POLITICS to have a position of authority, especially in government: A president can only hold office for two terms of four years each. Things were not very different when the previous government held office.\nhold your own\nto continue to be in a strong or fairly strong position, even when there are difficulties: hold your own against sb/sth They held their own against heavily marketed overseas brands.\nhold the purse strings\nto control when and how money is spent: Head office holds the purse strings, and we'll need approval to buy any new equipment.\nhold the reins\nto be in control of something: He currently holds the reins at one of the fastest growing mobile communications businesses in the country.\nhold sth in reserve\nto keep something until a time when it is needed for a particular purpose: Four million additional tons of grain are held in reserve each month.\nhold sway\nformal to have control or influence over someone or something: Party leaders held sway over the hearings.\nhold title\nPROPERTY to have or control the rights to land, buildings, or other property: hold title to sth She held title to the property and all mineral rights.\nhold (its) value\nto not fall in price: The older models haven't held value as much as collectors anticipated. Phrasal verbs\nhold back\nhold sb/sth back\nhold back on sth\nhold sth down\nhold off\nhold on\nhold on to/onto sth/sb\nhold out for sth\nhold sth over\nhold up\nMore phrasal verbs\nhold sth up\nhold sb/sth up\n[ S ] power or control over someone or something: a hold over sb/sth With the new law, Congress strengthened its hold over mortgage rates.a hold on sth They're keeping their strong hold on the smartphone market. a strong/tight hold keep/tighten/lose your hold\n[ C or U ]\n&#160; STOCK MARKET a suggestion that someone should not sell the shares that they own in a company, but that they should not buy any new shares: Analysts changed \"buys\" to \"holds\" after the annual report appeared. We have recently downgraded our recommendation for the Forest Group to \"Hold\". See also\nhold rating\n[ C ]\n&#160; BANKING a delay by a bank to prevent money from being taken from an account: It took three days for the hold on the payment to be cleared.\n[ C ]\n&#160; TRANSPORT the place on a ship or aircraft where goods are carried: Inspectors examined the hold to look for stowaways.\non hold\nnot being done now, but perhaps being done later: Any new building has been put on hold until the economy improves.\nnot changing or moving: The dollar is on hold at the same level it was at a year ago.\nCOMMUNICATIONS waiting for someone to return to or to begin a phone conversation: Technical support had me on hold for 20 minutes while they researched my question. I'll just put you on hold while I ask my manager about this.\ntake hold\nto start to have an effect: New stimulus funds took hold in time to keep unemployment low."}