{"id":182729,"name":"holiday","type":"noun","us_sound":"ˈhɑː.lə.deɪ","us_link":"../audio/h/holiday.mp3","uk_sound":"ˈhɒl.ə.deɪ","uk_link":"../audio/h/ukholdu003.mp3","content":"Add to word list\nAdd to word list\nA1 [ C or U ] UK (UK informal holidays); (UK informal hols); (US vacation) a time when someone does not go to work or school but is free to do what they want, such as travel or relax: a camping/skiing holidayfor your holiday Have you decided where you're going for your holiday(s) this year?on holiday Patricia is on holiday next week. How many days' holiday do you get with your new job?summer holiday We thought we'd go to France for our summer holiday.school holiday Surely the school holidays start soon.\nB1 [ C ] an official day when you do not have to go to work or school: a public holiday St Patrick's Day is a holiday in Ireland.\nUK a time when you are allowed not to make a regular payment such as a mortgage payment (= money that has been lent to buy a house, paid back regularly): payment holiday The flexible features of this mortgage allow the borrower to make overpayments and take payment holidays. repayment holiday We arranged a flexible business loan with a two year capital repayment holiday which gave us the breathing space we needed.mortgage holiday Struggling homeowners were handed more support as the UK's biggest banks agreed to offer a mortgage holiday to those unable to meet payments. holidays\n[ plural ] US the time at the end of December and beginning of January each year that includes Christmas, Hanukkah, and New Year : We were at home for the holidays.\nMore examplesFewer examplesAfter all that hard work, you deserve a holiday.The Caribbean is a popular holiday destination.Give me a call when you get back from holiday.You can win a holiday for two in the south of France just by answering three simple questions.We can't really afford foreign holidays.\nSMART Vocabulary: related words and phrases\nTourism & holidays\nair bridge\nair corridor\namenity kit\naparthotel\nawayday\ncaravanning\necotourism\nescape\nhigh season\nlayover\nmini-break\npackage tour\nphrase book\npost-holiday\nput something up\nranger station\nsightsee\nstopover\ntourism\ntourist trap\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTime off\nBorrowing & lending\nSpecific periods of time\nGrammar\nHoliday and holidaysHoliday as a singular noun commonly refers to a specific day or event: …\nto take a holiday: holiday in My parents are holidaying in Spain this year.\nSMART Vocabulary: related words and phrases\nTourism & holidays\nair bridge\nair corridor\namenity kit\naparthotel\nawayday\ncaravanning\necotourism\nescape\nhigh season\nlayover\nmini-break\npackage tour\nphrase book\npost-holiday\nput something up\nranger station\nsightsee\nstopover\ntourism\ntourist trap\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTime off\nGrammar\nHoliday and holidaysHoliday as a singular noun commonly refers to a specific day or event: …\nAdd to word list\nAdd to word list\na day for celebration when many people are allowed to stay away from work or school: a national holiday\nCdnBr A holiday is a vacation.\nAdd to word list\nAdd to word list\n[ C ] UK ( US vacation) a time when you are away from home, and can relax, visit new places, etc.: go on holiday Are you going away on holiday this year? Online holiday sales are up 28% compared with the same period last year. a holiday company holiday insurance\n[ C ]\n&#160; HR\n&#160; UK (also holidays [ plural ]); ( US vacation) a time when someone does not go to work but is free to do what they want, such as travel or relax: My PA does most of my work when I'm on holiday. She had already used all her holiday entitlement. holiday pay the summer holidays How many days of vacation do you get a year?\n[ C ] an official day when most people do not go to work and schools, banks and many businesses are closed: Wall Street was closed for a public holiday. May 1 is a holiday in many countries.\nthe holidays [ plural ] (US also the holiday season [ S ])\nthe period between late December and early January that includes Christmas, Hanukkah, and New Year: Online sales were buoyant during the holidays.\n[ C ]\n&#160; FINANCE\n&#160; UK a time when you do not have to pay something that you usually have to pay: take a holiday from sth If you are in financial difficulties, ask your bank whether you can take a holiday from interest repayments. a tax/contribution/mortgage holiday See also\nbank holiday\ncontribution holiday\nnational holiday\npackage holiday\npublic holiday"}