{"id":183044,"name":"home","type":"noun","us_sound":"hoʊm","us_link":"../audio/h/home.mp3","uk_sound":"həʊm","uk_link":"../audio/h/ukholdu027.mp3","content":"home noun\n(HOUSE/APARTMENT)\nAdd to word list\nAdd to word list\nA1 [ C or U ] the house, apartment, etc. where you live, especially with your family: The senator has two homes - an apartment in Washington and a house in Colorado. He was living on the streets for three months, and his home was a cardboard box.at home Call me at home after four o'clock.stay at home women who decide to stay at home and look after their childrenleave home He left home (= stopped living with his parents) when he was 23.set up home UK More and more couples are setting up home together without getting married.\n[ C ] a house, apartment, etc. when it is considered as property that you can buy or sell: luxury/starter homes\n[ C ] the type of family you come from: We had a happy home.broken home children from a broken home (= from a family in which the parents had separated)\nC1 [ C ] a place where people or animals live and are cared for by people who are not their relations or owners: a children's home/an old people's home/a dogs' homein a home He spent his early years in a home.\nMore examplesFewer examplesHe was shot dead outside his home.Her home is in the east of France.I'd like to wish you every happiness in your new home.Storms caused power cuts in hundreds of homes last night.The police found a vital clue to the girl's disappearance in a wooded area near her home.\nSMART Vocabulary: related words and phrases\nHome\nabode\naccommodation\nan Englishman's home is his castle idiom\nbolthole\ncrib\ndomestically\ndoorstep\nfold\ngaff\ngive something/someone houseroom phrase\nhabitation\nhangout\nlodging\nnest\nnon-domestic\nnon-home\npad\npremises\nrabbit hutch\nroof\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFamily: relations in general\nhome noun\n(ORIGIN)\nA1 [ C or U ] someone's or something's place of origin, or the place where a person feels they belong: I live in London, but my home (= where I was born) is in Greece.feel like home I was actually born in New Zealand, but I've lived in Hong Kong for so long that it feels like home now.\nMore examplesFewer examplesHer home is the east of France.After you've gained some experience teaching abroad you can come home and get a job.The advertising campaign will try to hammer home the message that excessive drinking is a health risk.She is riding the fastest horse and is certain to romp home.When one engine stopped, we had to turn round and fly home.\nSMART Vocabulary: related words and phrases\nHome\nabode\naccommodation\nan Englishman's home is his castle idiom\nbolthole\ncrib\ndomestically\ndoorstep\nfold\ngaff\ngive something/someone houseroom phrase\nhabitation\nhangout\nlodging\nnest\nnon-domestic\nnon-home\npad\npremises\nrabbit hutch\nroof\nSee more results »\nhome noun\n(COUNTRY)\n[ C or U ] your own country or your own area: She loves France, but she misses home.at home At home we call this \"lardy cake\".back at home UK I wonder what they're doing back at home. be/play at home\nIf a sports team are/play at home, they play on their own sports field: They lost at home to the Jags but still made the playoffs.\nSee more\nMore examplesFewer examplesTheir performance was nothing to write home about.Thousands of people turned out to welcome the England team home.I stayed in Montreal for two weeks then flew home.The team playing at home had a big advantage.The diplomats have been sent home because their embassy has become a nest of spies and espionage.\nSMART Vocabulary: related words and phrases\nCountries, nationalities & continents: country & nation\nbirthright citizenship\nbody politic\nBRICS\ncitizen\ncompatriot\ndenaturalize\ndomestic\ndomestically\ndual\nfatherland\ninternationalism\nnative\nnaturalization\nnon-country\nnon-domestic\nnon-indigenous\nnon-national\noverseas\nstatehood\nstateless\nSee more results »\nhome noun\n(BASEBALL)\n[ C usually singular ] informal another word for\nhome plate : Garcia rounded third base and ran towards home. When he reached home, all his teammates were there to mob him.\nSMART Vocabulary: related words and phrases\nBaseball & rounders\naround the horn idiom\nbag\nball\nballgame\nballplayer\nbase hit\nbases\nbeat\nbottom\nchopper\nflare\nfoul\nglove\nhomer\nsafe\nsecond base\nshag\nshortstop\nslider\nthe World Series\nSee more results »\nGrammar\nHouse or home?We use the noun house to refer to a building: …\nIdioms\nbe/feel at home\nhome from home\nmake yourself at home\nat or to your house or the place where you live: be home Don't worry, I'll be home soon.US I'm sorry, he's not home right now.home alone mainly US The kids were home alone.go home She decided to give up and go home.come home He came home as the dawn was breaking.take someone/something home Josh was tired so we took him home. I took home a couple of books to read.bring someone/something home I'll bring everyone home after the party.get home When you get home late you don't feel like cooking.make it home I hope you made it home safely last night? stay home mainly US women who decide to stay home and care for their children\nin or to the country or area where you come from: come home We pray all our troops will come home safely.back home mainly US I wonder what they're doing back home.US Back home we call this jelly.\nSMART Vocabulary: related words and phrases\nHome\nabode\naccommodation\nan Englishman's home is his castle idiom\nbolthole\ncrib\ndomestically\ndoorstep\nfold\ngaff\ngive something/someone houseroom phrase\nhabitation\nhangout\nlodging\nnest\nnon-domestic\nnon-home\npad\npremises\nrabbit hutch\nroof\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCountries, nationalities & continents: country & nation\nIdioms\nbe home and dry\nbe home free\nbring something home (to someone)\ncome home to someone\ndrive/hammer something home\nhome adjective [before noun]\n(RELATING TO HOME)\nrelating to the house, flat, etc. where someone lives: home ownership home improvements/maintenancemainly US home prices\ndone at home, or intended to be used at home: home cooking home-brewed beer a home computer my home telephone number\nrelating to your family or your life at home: His home life is affecting his work. students who have a difficult home situation\nSMART Vocabulary: related words and phrases\nHome\nabode\naccommodation\nan Englishman's home is his castle idiom\nbolthole\ncrib\ndomestically\ndoorstep\nfold\ngaff\ngive something/someone houseroom phrase\nhabitation\nhangout\nlodging\nnest\nnon-domestic\nnon-home\npad\npremises\nrabbit hutch\nroof\nSee more results »\nhome adjective [before noun]\n(COUNTRY)\nconnected with or done in your own country: home country/market His books were a success in his home country/market, but failed to find an audience abroad.\nSMART Vocabulary: related words and phrases\nCountries, nationalities & continents: country & nation\nbirthright citizenship\nbody politic\nBRICS\ncitizen\ncompatriot\ndenaturalize\ndomestic\ndomestically\ndual\nfatherland\ninternationalism\nnative\nnaturalization\nnon-country\nnon-domestic\nnon-indigenous\nnon-national\noverseas\nstatehood\nstateless\nSee more results »\nhome adjective [before noun]\n(SPORTS)\nrelating to the place where a team is based and plays a lot of its games: the home team/side a home ground a home match/gameUK the home strip (= clothing worn by a team when they play a home match) home advantage (= the improved chance of success that playing at home gives to a team)\nSMART Vocabulary: related words and phrases\nCompetitions, & parts of competitions\nbathing beauty\nbe a game of two halves idiom\nbeauty contest\nbeauty pageant\nbenefit match\ncompetition\ndebate\nelimination tournament\nhead-to-head\nnon-major\nomnium\non your marks, get set, go! idiom\npeloton\npostgame\npre-meeting\npro-am\nquiz\nspelling bee\nstarter\nunder starter's orders idiom\nSee more results »\nhome noun [C/U]\n(HOUSE)\nAdd to word list\nAdd to word list\na structure in which a person lives, esp. a house or apartment: [ U ] Phone me at home after four o’clock. [ C ] We have a country home and a city home.\nA home also refers to the family that lives together there: [ C ] a happy home\nA home is also a place where a group of people live who need special care: [ C ] a nursing home\nYour home address is the address of the place where you live. Note: \"House\" is the more usual word for a building that one family lives in. The word \"home\" also refers to the life that goes on in that building.\nhome noun [C/U]\n(ORIGIN)\na place of origin, or the place where a person belongs: [ C ] Australia is the home of the kangaroo. [ U ] I’ve lived here for two years, but it still doesn’t feel like home. at home\nWhen you are at home in a place or situation, you are comfortable and relaxed there: She’s beginning to feel at home in her new job. Go into the living room and make yourself at home. Idiom\nhome free\nhome adjective [not gradable]\n(IN HOUSE)\ndone or made in the place where you live: home cooking\nFor a sports team, home refers to the city or the building or stadium where that team usually plays: a home game\nhome adverb [not gradable]\n(TOWARD HOUSE)\nto or toward the place where you live: going home\nAdd to word list\nAdd to word list\nECONOMICS relating to your own country, not a foreign country: The company decided it was over-dependent on the home market, and struck out abroad. See also\ndomestic\nused to describe the place where a company has its main offices or factories: Previously, European airlines could only fly to the US from the carrier's home country.\nCOMMERCE relating to the home, not business: equipment for home use home audio equipment\nrelating to the place where you live: Please send the paperwork to my home address. Home delivery is free if you spend more than £100.\ntake home (also bring home)\nto earn a particular amount of money after tax has been subtracted from your pay: She takes home $3000 per month. See also\nat-home\nin-home\ntake-home noun"}