{"id":183157,"name":"homer","type":"noun","us_sound":"ˈhoʊ.mɚ","us_link":"../audio/h/cdomiscushome0117.mp3","uk_sound":"ˈhəʊ.mər","uk_link":"../audio/h/cdo1119ukhome0514.mp3","content":"homer noun [C]\n(BASEBALL)\nAdd to word list\nAdd to word list\nUS informal short for\nhome run : a point scored in baseball when you hit the ball, usually out of the playing field, and are able to run around all the bases at one time to the starting base: hit a homer That season he hit 43 homers.\nMore examplesFewer examplesHe went out and hit two homers.Ruth's agent had agreed to donate the bat used for Ruth's first homer of the season.Every player with 200 or more homers has a dot on the map at his birthplace.\nSMART Vocabulary: related words and phrases\nBaseball & rounders\naround the horn idiom\nbag\nball\nballgame\nballplayer\nbase hit\nbases\nbottom\nchopper\nfarm\nflare\nfoul\nglove\nliner\nsafe\nsecond base\nshag\nshortstop\nslider\nthe World Series\nSee more results »\nhomer noun [C]\n(JOB)\nScottish English informal a job that a skilled worker, such as a house painter or a hairdresser (= a person who cuts people's hair), does for a private customer in the customer's home, especially when they do this in addition to their main job and without telling their employer or the tax authorities: I am a fully qualified joiner looking for homers in the Renfrewshire area.\nMore examplesFewer examplesThis group is for local tradesmen looking for homers.\nSMART Vocabulary: related words and phrases\nBuilding: construction work & workers\nbanksman\nblaster\nbreak ground idiom\nbrick\nbrick something up\nelectrician\nerection\nflip\nfound\nglazier\nreface\nrefurb\nrefurbish\nrefurbished\nrefurbishment\nthatcher\ntiler\nwell built\nworkman\nwright\nSee more results »\nin baseball, to hit a home run (= a point scored in baseball when you hit the ball, usually out of the playing field, and are able to run around all the bases at one time to the starting base): He became the oldest man to homer in an All-Star Game. He homered eight times in 12 games.\nMore examplesFewer examplesThey were the only father and son to homer in the same game.He homered just twice in his final 23 games.It marked the second time this season Ramirez has homered in consecutive games.\nSMART Vocabulary: related words and phrases\nBaseball & rounders\naround the horn idiom\nbag\nball\nballgame\nballplayer\nbase hit\nbases\nbottom\nchopper\nfarm\nflare\nfoul\nglove\nliner\nsafe\nsecond base\nshag\nshortstop\nslider\nthe World Series\nSee more results »"}