{"id":183500,"name":"homophony","type":"noun","us_sound":"hɑːˈmɑː.fə.ni","us_link":"","uk_sound":"həˈmɒf.ən.i","uk_link":"","content":"homophony noun [U]\n(MUSIC)\nAdd to word list\nAdd to word list\nmusic\n&#160; specialized music in which only one tune or part is played or sung, or in which several parts are played or sung in harmony (= with different notes being played or sung at the same time) with the main melody, and often also in the same rhythm: At moments of homophony, the singers sounded almost like a magnificent organ. Homophony is probably the commonest choral texture of all, and has been used in all periods.\nMore examplesFewer examplesEach part is so busy with different rhythmic movements that the simple directness of homophony is lost.Slight differences in note-lengths give an illusion of a richer polyphonic texture and relieve the sameness of homophony. It is often sufficient to break the homophony in one voice, only to give this added touch of interest.\nSMART Vocabulary: related words and phrases\nTypes of music\nAfrobeat\nAfrobeats\nambient music\nanthemic\natonal\ndownbeat\ndrum and bass\ndubstep\nearly music\neasy listening\njazz\nKrautrock\nLatinization\nLatinize\nLatinized\nsymphonic\nsymphonically\ntechno\ntonal\ntorchy\nSee more results »\nhomophony noun [U]\n(LANGUAGE)\nlanguage\n&#160; specialized the fact of words having the same pronunciation, but a different meaning, or a different spelling and meaning: The traditional pun is based on homophony. Homophony is common among verb forms: past participles often have the same phonetic form as infinitives. Related words\nhomophone\nhomophonicCompare\nhomography\nhomonymy\nMore examplesFewer examplesThe company name, Joost, is pronounced like \"juiced\" - I do not know whether the homophony is deliberate.The writer offers a complicated and implausible explanation for the homophony of \"balmy\" and \"barmy\".The word \"gofer\" for an assistant, originally based on the command \"go for this, go for that\", becomes more amusing because of its homophony with \"gopher\", a small busy rodent.\nSMART Vocabulary: related words and phrases\nLinguistics: terminology & vocabulary\nabbreviated form\naccommodation\nalphabetic\nAmericanism\nAnglicism\nantonym\nantonymous\nbuzzword\ncognate\ncoinage\nhomographic\nhomography\nhomonymic\nhomonymy\nhomophonic\nproductive\nproductively\nreceptive\nreceptively\nreferent\nSee more results »"}