{"id":183682,"name":"honest","type":"adjective","us_sound":"ˈɑː.nɪst","us_link":"../audio/h/honest.mp3","uk_sound":"ˈɒn.ɪst","uk_link":"../audio/h/ukhomon012.mp3","content":"Add to word list\nAdd to word list\nB1 telling the truth or able to be trusted and not likely to steal, cheat, or lie: She's completely honest. I'd like you to give me an honest answer/your honest opinion. He had an honest face (= he looked like he could be trusted). Opposite\ndishonest\nThesaurus: synonyms, antonyms, and examples\nmorally rightgoodShe is a good woman who goes out of her way to help others.virtuousI believe that humans are, despite their flaws, capable of virtuous conduct.righteousHe refused to stray from the righteous path.honestHe was a hardworking, honest family man who was only trying to do his duty.upstandingI’m sure most of them are honest, upstanding members of society.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\ntelling the truth and able to be trustedhonestThe new MP was refreshingly honest with her constituents.straightJust be straight with her and tell her how you feel.sincereHe's so sincere that you know exactly where you stand with him. truthfulAre you being truthful with me?\nSee more results »\nMore examplesFewer examplesBe honest now - do you think this dress is too young for me?I wasn't entirely honest with him, I admit, but I didn't actually tell him any lies.To be brutally honest, you look fat in that dress.She has an honest, open face.I didn't know she would be there - that's the honest truth.\nSMART Vocabulary: related words and phrases\nHonesty, openness & sincerity\nabove board\nanti-corruption\nartless\nartlessly\nartlessness\nhonestly\nin\nin all honesty/seriousness/truthfulness idiom\nin good faith idiom\nintegrity\njoking apart/aside idiom\nsincerely\nskinny\nspotless\nsqueaky-clean\nstainless\nstraight arrow idiom\nthe straight and narrow idiom\ntransparency\nupright\nSee more results »\nIdioms\nhonest (to God/goodness)\nmake an honest living\nmake an honest woman (out) of someone\nto be honest (with you)\nAdd to word list\nAdd to word list\n(of a person) truthful or able to be trusted; not likely to steal, cheat, or lie, or (of actions, speech, or appearance) showing these qualities: an honest man an honest answer To be honest (= To tell the truth), I didn’t like the movie."}