{"id":183747,"name":"honour","type":"noun","us_sound":"ˈɑː.nɚ","us_link":"../audio/h/honor.mp3","uk_sound":"ˈɒn.ər","uk_link":"../audio/h/ukhonor003.mp3","content":"honour noun\n(RESPECT)\nAdd to word list\nAdd to word list\nB2 [ U ] a quality that combines respect, being proud, and honesty: a man of honour We fought for the honour of our country. in honour of someone/something\nB2 in order to celebrate or show great respect for someone or something: a banquet in honour of the president be/feel honour bound to do something (also be/feel honour-bound to do something)\nto feel you must do something because it is morally right, even if you do not want to do it: I felt honour bound to tell him the truth. do someone the honour of doing something formal\nto make someone proud and happy by doing or being something: Would you do me the honour of accompanying me to the New Year Ball? Your/His/Her Honour formal\nthe way to address or refer to a judge: Yes, Your Honour. The case was dealt with by Her Honour Judge Kirkham.\nMore examplesFewer examplesIt's an honour to have you here today, Mr President.Great honour attaches to winning this award.The party was held in honour of Vivienne Westwood, that doyenne of British fashion.It's an honour to meet you Sir.He felt that his honour was at stake.\nSMART Vocabulary: related words and phrases\nMorality and rules of behaviour\nantisocial\nantisocially\nbaseness\nbiocentric\nbioethicist\nethic\nethical\nethically\nethicist\nethos\nliberty\nmotto\nprecept\nprinciple\nprincipled\npropriety\nscript\nthe rights and wrongs idiom\nthe ways of the world idiom\nwork ethic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShowing respect and admiration\nPolite expressions\nJudges & juries\nhonour noun\n(REWARD)\n[ C ] a reward, prize, or title that publicly expresses admiration or respect: She received an honour for her services to the community. The honours were the personal gift of the Queen. See also\nmilitary honours\nSMART Vocabulary: related words and phrases\nPrizes, rewards and medals\n(the/a pot of gold at) the end of the rainbow idiom\nAcademy Award\naward\nbemedalled\nblue ribbon\nbooby prize\nbronze\ngong\ngrab bag\nGrammy\nhand something out\nOscar\nplatinum disc\nprize\nPulitzer Prize\nrainbow\nstake\nthe golden boot\nthe wooden spoon\nVC\nSee more results »\nhonour noun\n(EDUCATION)\nhonours\na university course or degree that is at a higher level than an ordinary one: He graduated with a second-class honours degree in physics. Normally a student would graduate at the age of 22 after a four-year honours course. See also\njoint honours with honours\nIf you complete a school or university qualification with honours, you achieve a high standard: She graduated with honours in June 1970.\nSMART Vocabulary: related words and phrases\nUniversity & college education\nacademe\nacademia\nanti-university\nbeadle\nbusiness school\ngrad\ngraduate\nhall\nhall of residence\nOxbridge\nOxon\nPanhellenic\npass degree\npoly\nthe groves of academe idiom\nuni\nuniversity\nunselective\nvice chancellor\nwarden\nSee more results »\nhonour noun\n(GOLF)\n[ S ] in golf, the fact of being the first player to hit the ball for a particular hole: He had the honour on the tee at the long 12th and hit his best drive. If I happen to win a hole, she offers me the honour at the next tee.\nMore examplesFewer examplesHaving the honour, she drove first on the second hole.The player with the honour played their shot and then marked their card.\nSMART Vocabulary: related words and phrases\nGolf\nbogie\ncaddy\nclip\ncrazy golf\ncut\ndriver\ndump\nfade\nfore\nfringe\ngolf\ngolf ball\noutdrive\nouthit\nround\nslice\ntap in\ntee (something) up\ntee someone off\nwood\nSee more results »\nhonour noun\n(PLAYING CARD)\n[ C ] a picture card, or a ten in the game of bridge (= card game for four players who play in pairs): Rather than start with a low card, many players prefer to lead their top honour. She had a long string of hearts including the top honour cards.\nMore examplesFewer examplesHe had two honour cards in each of spades, diamonds, and clubs.The honour led might make a difference to which card you put down.Your opening bid of two hearts shows a six-card suit to include one of the top three honours.\nSMART Vocabulary: related words and phrases\nCard games\nall in\nbidding\nblackjack\nbridge\nbusted flush\ncanasta\ncard sharp\ndeal\ndiamond\nflush\njack\npool\nqueen\nre-raise\nrebid\nrecut\nrookie card\nsolitaire\nspade\nstraight\nSee more results »\nIdioms\nbe on your honour\ndo the honours\nhonour verb [T]\n(RESPECT)\nC1 to show great respect for someone or something, especially in public: be honoured for He was honoured for his bravery.formal We are honoured (= proud and happy) to have you here tonight. I would be honoured to meet him.\nTo honour a promise or agreement is to do what you said you would: They decided not to honour an existing order for aircraft.\nMore examplesFewer examplesChildren need to be taught to honour other people's opinions.The treaty honours the rights of both nations.The press nowadays seems incapable of honouring anyone's privacy.There actually is a rule about not blocking the front entrance, but no one honours it.The fund was set up to honour the memory of Joe's grandmother, a tireless social campaigner.\nSMART Vocabulary: related words and phrases\nShowing respect and admiration\nadmiration\nadmire\nadmiring\nadmiringly\napproving\napprovingly\nforelock\nfreedom\nfulsome\nfulsomely\nfulsomeness\nglorify\ngrovelling\npay your respects idiom\nphilogyny\nput someone on a pedestal idiom\nregild\nrespectfully\nretire a number idiom\nworshipful\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking & breaking promises & commitments\nhonour verb [T]\n(REWARD)\nto give someone public praise or a reward: be honoured with He was honoured with a knighthood.\nSMART Vocabulary: related words and phrases\nPraising and applauding\nacclaim\nacclamation\naccolade\nadulate\nadulation\ncomplimentary\ndispatch\nenthronement\neulogistic\neulogistically\neulogize\neulogy\nhail\novation\npaean\npanegyric\npanegyrical\npanegyrist\nrave\nslap\nSee more results »\nAdd to word list\nAdd to word list\nto do what you promised or agreed to do: honour an agreement/contract/deal All existing contracts will be honoured. honour a commitment/pledge/promise\nto allow a cheque, ticket, etc. to be used: The bank was contractually obliged to honour the cheque even when this put the account into the red.\nto pay money owed: to honour a claim/debt\n[ U ] respect that people have for a person or an organization: The world's top investment banks are competing for the honour and income that comes from winning these contracts.a badge of honour A high credit rating is a badge of honour for the treasuries of developed economies.\n[ C ] a reward, prize, or title that expresses admiration or respect: be awarded/receive an honoura great/high/huge honour She has been awarded one of the highest honors in business and technology by the US government.\nhonours [ plural ] UK ( abbreviation hons, also Hons)\na level of university qualification that is a higher standard than the basic level: an honours degree to graduate with honours\nYour Honour UK (US Your Honor)\nLAW\n&#160; formal the title of respect used when speaking to a judge: \"I object, Your Honour\", he said. See also\nguest"}