{"id":183786,"name":"hoodoo","type":"noun","us_sound":"ˈhuː.duː","us_link":"../audio/h/cdo0318ushood2346.mp3","uk_sound":"ˈhuː.duː","uk_link":"../audio/h/cdo0216hooduk0954.mp3","content":"hoodoo noun\n(MAGIC)\nAdd to word list\nAdd to word list\n[ U ] a set of magical beliefs and practices that originally belonged to West Africans brought to North America and the Caribbean as slaves, which are linked to the religion of voodoo: Haitian folklore told tales of dead people whose bodies were awakened by hoodoo. Compare\nvoodoo\n[ C or U ] informal bad luck that affects someone for a long time, or something that is believed to cause this: Might this be the year that the team finally ends its hoodoo? Some believe there's a hoodoo over England whenever we play Australia at Lord's cricket ground.\n[ U ] informal a magical or mysterious power over other people: He thought this was some sort of feminine hoodoo.\nSMART Vocabulary: related words and phrases\nMagic\nabracadabra\nalchemy\nbewitch\nbezoar\nblack magic\nconjure\nenchantment\nescapology\nevil\nhex\nmagical\nmagically\nmugwort\nmystic\nmystical\nthe evil eye idiom\nwhammy\nwhite magic\nwitchcraft\nwizardry\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGood luck and bad luck\nhoodoo noun\n(ROCK)\n[ C ] US a vertical piece of rock that has been made into an interesting shape by wind, water, etc.: The trail winds through a landscape of hoodoos and sandstone cliffs.\nMore examplesFewer examplesWe cycle past hoodoos and vermilion cliffs. Boulder caps are perched on many of the tapering hoodoos.These hoodoos at one time were at the bottom of a lake.\nSMART Vocabulary: related words and phrases\nGeology - general words\nAnthropocene\nanticline\nauriferous\nbiozone\ncarboniferous\ncementation\ncontinental crust\ncontinental plate\ngeologically\ngeomorphic\ngully erosion\nhenge\nHolocene\npetrographically\npetrography\npetrological\npetrologically\npetrology\nPrecambrian\nrockfall\nSee more results »"}