{"id":183827,"name":"hook","type":"noun","us_sound":"hʊk","us_link":"../audio/h/hook.mp3","uk_sound":"hʊk","uk_link":"../audio/h/ukhonor015.mp3","content":"hook noun [C]\n(DEVICE)\nAdd to word list\nAdd to word list\nB2 a curved device used for catching or holding things, especially one attached to a surface for hanging things on: a coat/picture hook a boat hook a fish hook\ncoffeekai/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesWe'll have to screw a hook into the wall.Could you put some hooks in the garden shed, for us to hang the tools on?\nSMART Vocabulary: related words and phrases\nPins, clips, hooks & pegs\nalligator clip\nbanana clip\nbarb\nbinder clip\nbobby pin\nbodkin\nBulldog Clip\nclip-on\ncrocodile clip\ndrawing pin\nfishhook\nhair claw\nhair slide\nneedle\npeg\npushpin\nsafety pin\nstaple\nthumbtack\ntuning peg\nSee more results »\nhook noun [C]\n(HIT)\nin boxing, a hard swinging hit made with a bent elbow: We were taught three punches: the jab, the double jab and the right hook. See also\nhook shot\nin cricket, a hit made by swinging the bat across the front of the body to hit a ball that comes up from the ground towards your shoulders or head: She mistimed a hook and was caught. See also\nhook shot\nin golf, an uncontrolled shot where the ball flies to the left for a right-handed player or to the right for a left-handed player: He hit a massive hook out to the right. See also\nhook shot\nSMART Vocabulary: related words and phrases\nFighting sports\naikido\nall-in wrestling\narm-wrestling\nbantamweight\nblack belt\nfeint\nfull nelson\ngrappler\ngumshield\nhalf nelson\nhammerlock\nleft-hander\npugilist\npugilistic\npunch-drunk\npunchbag\npuncher\npunching bag\nsouthpaw\nwrestler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGolf\nCricket\nhook noun [C]\n(SONG)\na repeated part of a song or piece of music that is particularly pleasing and easy to remember: It has to be a great song, with a great hook, great lyrics, and a great melody.\nSMART Vocabulary: related words and phrases\nWords meaning parts of things\nback end\nbifurcation\nbiomarker\ncartridge\nchunk\nelement\nmodularity\nmodularized\nmodularly\nmodule\nmoiety\nmulti-branched\npanel\npiece\nsnatch\nsub\nsub-sector\nsubscale\nsubscience\nsubsection\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMusical pieces\nIdioms\nby hook or by crook\nfall for something hook, line, and sinker\nget your hooks into someone/something\noff the hook\nhook verb\n(FASTEN)\n[ T ] to fasten something with a hook, hang something on a hook, or catch something with a hook: He hooked the trailer (= joined it with a hook) to his car. How many salmon did you hook (= catch) this afternoon? She hooked the shoe (= lifted it with a hook) out of the water.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconverge\nconvergence\ncor\ncross-Channel\ncumulate\njointed\njunction\nkludge\nknit\nknock\nunified\nunify\nunion\nunseparated\nwad\nSee more results »\nhook verb\n(HAVE SEX)\n[ I ] US informal to have sex for money\nhook verb\n(HIT)\n[ T ] in golf, to hit the ball in an uncontrolled way so that it flies to the left for a right-handed player : She hooked the ball into the lake. He hooked his drive through trees at the second hole.\n[ T ] in cricket, to hit a ball that bounces high by swinging the bat across the front of the body: He was hit on his right wrist while attempting to hook a short ball. He hooked a bouncer for six.\nSMART Vocabulary: related words and phrases\nGolf\nbogie\ncaddy\nclip\ncrazy golf\ncut\ndriver\nfade\nfore\nfringe\ngolf\ngolf ball\noutdrive\nouthit\nround\nslice\nstiff\ntap in\ntee (something) up\ntee someone off\nwood\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCricket\nPhrasal verbs\nhook up\nhook (someone/something) up (to something)\nAdd to word list\nAdd to word list\na curved device used for catching hold of something or for hanging something on: Hang your coat on one of the hooks in the hall. I need to change the hook on my fishing line. Idiom\nhook, line, and sinker\nto use something like a hook, or to put something so that it is supported at one end and hangs: She hooked her arm through his. He hooked his cane over the back of the chair.\nTo hook fish means to catch them on hooks: We hooked some bass. Phrasal verbs\nhook up\nhook up something\nAdd to word list\nAdd to word list\nMARKETING something that is used to attract customers' attention, and encourage them to buy a product or service: Special deals on bestsellers are used as hooks to sell volumes from publishers' back catalogues.\nbe on the hook (for sth/to do sth) US informal\nto owe money or be legally responsible for something: The cleanup plan called for the companies, which are on the hook for cleanup costs, to dredge contaminated sediments from the river. If the investment company fails, they are on the hook to pay the loan.\noff the hook\nhaving escaped from a difficult situation or punishment: be/get off the hook Don't think you're off the hook on taxes just because you were paid in cash.get/let sb off the hook The minister was last night under fire for letting the big banks off the hook.\nMARKETING to attract someone's attention or encourage them to buy a product or service: Financial marketers know that money-off deals hook customers and keep them loyal. Once people have tried this product, they will be hooked for life.\nIT to connect a machine to a power supply, or to another machine: hook sth to sth The high-speed digital connector is used to hook all kinds of devices to your computer. Phrasal verbs\nhook (sth) into sth\nhook up (with sb/sth)\nhook sb up (with sb/sth)\nhook (sth) up"}