{"id":183960,"name":"hop","type":"verb","us_sound":"hɑːp","us_link":"../audio/h/hop.mp3","uk_sound":"hɒp","uk_link":"../audio/h/ukhoove002.mp3","content":"Add to word list\nAdd to word list\nC2 [ I ] to jump on one foot or to move about in this way: I tried to hop on my good foot while holding onto Jim.\nThesaurus: synonyms, antonyms, and examples\nto jumpjumpThe kids jumped up and down when they heard we were going to Disneyland.leapThe deer leaped out of the forest.boundHe bounded on stage, punching the air with both fists.launch yourselfShe rocked back and forth on her skis before launching herself down the slope.bounceThe kids were bouncing happily on the trampoline.hopI stubbed my toe and hopped to the kitchen to get some ice.\nSee more results »\nC1 [ I + adv/prep ] informal to go somewhere quickly or to get into or out of a vehicle quickly: We hopped over to Bruges for the weekend. I hopped on the bus at the traffic lights.\nC2 [ I ] If a small animal, bird, or insect hops, it moves by jumping on all or two of its feet at the same time: The rabbit/bird hopped across the grass.\nMore examplesFewer examplesCan you hop on your left leg?The children were hopping around the playground.\nSMART Vocabulary: related words and phrases\nJumping\na hop, skip, and a jump idiom\nbound\ncaper\nclear\nfrisk\nhurdle\njump\nlaunch\nleap\noutjump\noutleap\npile\npile on/onto (someone)\npounce\nskip\nvault\nYou can also find related words, phrases, and synonyms in the topics:\nHurrying and doing things quickly\nBoarding and alighting from modes of transport\nIdioms\nhop it\nhopping mad\nhop noun\n(JUMP)\n[ C ] a short jump by a person on one foot, or by a small animal, bird, or insect on all or two of its feet at the same time: With his feet tied together he could only move in little hops.\nThai Yuan Lim/EyeEm/GettyImages be a short hop informal\nto be a short distance, especially by plane: Rio to São Paulo is just a short hop by plane.\nSee more\nSMART Vocabulary: related words and phrases\nJumping\na hop, skip, and a jump idiom\nbound\ncaper\nclear\nfrisk\nhurdle\njump\nlaunch\nleap\noutjump\noutleap\npile\npile on/onto (someone)\npounce\nskip\nvault\nhop noun\n(PLANT)\nhops [ plural ]\nthe dried fruits of a climbing plant, used to give a bitter flavour to beer: Almost 80% of the nation's hops are grown in this area.\nSee more\nIdioms\ncatch someone on the hop\na hop, skip, and a jump\nrelating to hops: a hop plant\nSMART Vocabulary: related words and phrases\nCrop plants & economic plants\nbeet\nblack mustard\nbrassica\nbreadstuff\ncanola\ncrown vetch\ncrucifer\nfat hen\nfield corn\nflax\nmangelwurzel\nmanioc\nmesquite\nmulti-line\nneep\nSudan grass\nsugar beet\nsugar cane\nsweetcorn\ntall fescue\nSee more results »\nAdd to word list\nAdd to word list\nto make small jumps on one or two feet, or to move along in this way: [ I ] A bird hopped across the lawn. [ T ] Nikki hopped the fence (= jumped over it). [ I ] fig. Come on, hop in (= get in), I’ve got plenty of room in the car. hop noun [ C ] us\nYour browser doesn't support HTML5 audio\n/hɑp/\nfig. It’s just a short hop to Pittsburgh by plane."}