{"id":183968,"name":"hoped","type":"verb","us_sound":"hoʊp","us_link":"../audio/h/hope.mp3","uk_sound":"həʊp","uk_link":"../audio/h/ukhoove003.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nhope\nA2 to want something to happen or to be true, and usually have a good reason to think that it might: I'm hoping for an interview next week. [ + (that) ] She's hoping (that) she won't be away too long. I hope (that) she'll win. We have to hope and pray (that) the operation will go well. [ + to infinitive ] They hope to visit us next year. It's good news, I hope. \"Will you be at the meeting tomorrow?\" \"I hope not/so\". Compare\nwish verb (HOPE)\nMore examplesFewer examplesI hope they get the punishment they deserve.What do you hope to gain from the course?I was hoping to leave work early today.She is hoping to get a loan from her bank to help her out of her financial predicament.Maggie sends her love and hopes you'll feel better soon.\nSMART Vocabulary: related words and phrases\nHoping and hopefulness\nappealingly\nboosterish\nboosterism\ncautious\ncautiously\nfancy\nglass\nhopeful\nhopefully\nhopefulness\nill\nit's an ill wind (that blows nobody any good) idiom\nla-la land\npin your hopes on something/someone idiom\npipe dream\nplease God idiom\nPollyanna\npositiveness\ntrust\nwing\nSee more results »\nGrammar\nExpect, hope or wait?We use expect to say that we believe that something will happen. We use expect in the following main patterns: …\nExpectWe use expect to say that we believe that something will happen. We use expect in the following main patterns: …\nHopeWe use hope when we do not know whether something will happen or not but we want it to happen. We use hope in the following patterns: …\nWaitWe use wait when we refer to letting time pass because we are expecting that something is going to happen. We use wait in the following main patterns: …\nExpect, hope or wait: typical errorsWe don’t use wait or wait for to say that we believe that something will happen. We use expect: …\nHopeHope is a verb and a noun. …\nHope as a verbAfter hope, we often use present verb forms even when there is reference to the future: …\nHope as a nounWe can use hope as a countable noun: …\nIdioms\nhope against hope\nhope for the best"}