{"id":183967,"name":"hope","type":"verb","us_sound":"hoʊp","us_link":"../audio/h/hope.mp3","uk_sound":"həʊp","uk_link":"../audio/h/ukhoove003.mp3","content":"Add to word list\nAdd to word list\nA2 to want something to happen or to be true, and usually have a good reason to think that it might: hope for I'm hoping for an interview next week. [ + (that) ] She's hoping (that) she won't be away too long.hope (that) I hope (that) she'll win.hope and pray (that) We have to hope and pray (that) the operation will go well. [ + to infinitive ] They hope to visit us next year. It's good news, I hope.hope not/so \"Will you be at the meeting tomorrow?\" \"I hope not/so\". Compare\nwish verb (HOPE)\nMore examplesFewer examplesI hope they get the punishment they deserve.What do you hope to gain from the course?I was hoping to leave work early today.She is hoping to get a loan from her bank to help her out of her financial predicament.Maggie sends her love and hopes you'll feel better soon.\nSMART Vocabulary: related words and phrases\nHoping and hopefulness\nappealingly\nboosterish\nboosterism\ncautious\ncautiously\nglass\nhopefully\nhopefulness\nill\nit's an ill wind (that blows nobody any good) idiom\nla-la land\nlife-affirming\npipe dream\nplease God idiom\nPollyanna\npositive\npositiveness\npositivism\ntrust\nwing\nSee more results »\nGrammar\nExpect, hope or wait?We use expect to say that we believe that something will happen. We use expect in the following main patterns: …\nExpectWe use expect to say that we believe that something will happen. We use expect in the following main patterns: …\nHopeWe use hope when we do not know whether something will happen or not but we want it to happen. We use hope in the following patterns: …\nWaitWe use wait when we refer to letting time pass because we are expecting that something is going to happen. We use wait in the following main patterns: …\nExpect, hope or wait: typical errorsWe don’t use wait or wait for to say that we believe that something will happen. We use expect: …\nHopeHope is a verb and a noun. …\nHope as a verbAfter hope, we often use present verb forms even when there is reference to the future: …\nHope as a nounWe can use hope as a countable noun: …\nIdioms\nhope against hope\nhope for the best\nB1 something good that you want to happen in the future, or a confident feeling about what will happen in the future: hope for What are your hopes and dreams for the future?hope of Is there any hope of getting financial support for the project? [ + that ] Is there any hope that they will be home in time? Young people are growing up in our cities without any hope of finding a job.dash your hopes His reply dashed (= destroyed) our hopes.pin (all) your hopes on someone/something They have pinned (all) their hopes on (= they are depending for success on) their new player.live in hope She's very ill, but there's still hope/we live in hope (= we think she might be cured).beyond/past hope The situation is now beyond/past hope (= unlikely to produce the desired result).give up hope We never gave up hope (= stopped hoping) that she would be found alive.a glimmer/ray of hope The letter offered us a glimmer/ray of (= a little) hope.in the hope that I didn't phone until four o'clock in the hope that you'd be finished.not hold out much hope of I don't hold out much hope of getting (= I don't expect to be able to get) a ticket. Synonyms\naim (INTENTION)\nambition\naspiration (HOPE)\ndream (HOPE)\ngoal (AIM)\nintent formal or specialized\nintention\nobject (PURPOSE)\nobjective\ntarget (AIM)\nThesaurus: synonyms, antonyms, and examples\nsomething you want to do or achieveaimOur aim in protesting is to raise awareness of the unfairness of the system.goalMy goal in life has always been to be financially independent.objectiveOne of my objectives for this year is to increase sales.targetIf you meet your sales targets you will receive a generous bonus.dreamWhen I was growing up my dream was to perform in front of millions of people.hopeMy hope is that there will be some kind of positive outcome to this process.\nSee more results »\nMore examplesFewer examplesWe still haven't given up hope of finding her alive.The latest violence has destroyed any remaining hopes for an early peace agreement.The hope is that this area will develop into a vibrant commercial centre.The doctors gave him more powerful drugs in the hope that he might recover.There is still some hope that the economic blockade will work and make military intervention unnecessary.\nSMART Vocabulary: related words and phrases\nHoping and hopefulness\nappealingly\nboosterish\nboosterism\ncautious\ncautiously\nglass\nhopefully\nhopefulness\nill\nit's an ill wind (that blows nobody any good) idiom\nla-la land\nlife-affirming\npipe dream\nplease God idiom\nPollyanna\npositive\npositiveness\npositivism\ntrust\nwing\nSee more results »\nGrammar\nHopeHope is a verb and a noun. …\nHope as a verbAfter hope, we often use present verb forms even when there is reference to the future: …\nHope as a nounWe can use hope as a countable noun: …\nIdioms\nhope over experience\nnot have a hope in hell\nAdd to word list\nAdd to word list\nthe feeling that something desired can be had or will happen: [ U ] We never entirely gave up hope. [ U ] This research offers hope of developing better ways to treat cancer. [ C ] He had hopes of being chosen for the leading part in the play.\nto express the feeling or wish that something desired will happen: [ I ] I’m hoping the company gives us a bonus this year. [ + to infinitive ] We hope to see you soon. [ + (that) clause ] I hope (that) his plane won’t be delayed."}