{"id":184273,"name":"horror","type":"noun","us_sound":"ˈhɔːr.ɚ","us_link":"../audio/h/horror.mp3","uk_sound":"ˈhɒr.ər","uk_link":"../audio/h/ukhorri009.mp3","content":"Add to word list\nAdd to word list\nB2 [ U ] an extremely strong feeling of fear and shock, or the frightening and shocking character of something: in horror The crowd cried out in horror as the car burst into flames.fill someone with horror The thought of speaking in front of so many people fills me with horror.to your horror I then realized to my absolute horror, that I had forgotten the present.horror of What the book does convey very successfully is the horror of war. horrors [ plural ]\nthings that are very shocking or frightening: The population now faces the horrors of starvation.\nSee more\n[ U ] frightening films, TV programmes, books, etc., often with stories about unnatural things happening, for example dead people coming to life: With horror, bigger budgets don't necessarily mean better movies. In the genre of horror, the character of the monster represents all the dark and horrible qualities of humanity. See also\nhorror film\nhorror movie\nhorror story\n[ C ] informalUK a child who behaves very badly: little horror Her youngest boy is a little horror.\nMore examplesFewer examplesFew journalists have managed to convey the full horror of the situation.We watched in horror as they pulled the bodies from the wreckage.The prospect of parenthood filled her with horror.The true horror of the accident did not become clear until the following morning.Local people regard this idea of a motorway through their village with horror.\nSMART Vocabulary: related words and phrases\nFear & phobias\nacrophobia\naerophobia\nagoraphobic\naquaphobia\narachnophobia\nbogie\ncatastrophize\ncold sweat\ndread\nhomophobia\nhomophobic\nhydrophobia\nhydrophobic\nIslamophobia\nmisophonia\nmortal\nscare\nwillie\nxenophobe\nxenophobically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of film, play, book etc.\nIdioms\nhave a horror of something\nhorror of horrors\nused especially in news reports to describe something extremely unpleasant and shocking: Three friends lost their lives in a horror smash as they returned from a trip to the beach. He was just 16 when he stumbled across the horror scene after a violent row ended with his mum killing his dad. See also\nhorror show\nSMART Vocabulary: related words and phrases\nSerious and unpleasant\nabominable\nabominably\nabysmal\nabysmally\napocalyptic\nfraught\nfrightful\nfrom hell idiom\nfun\nghastliness\nnoisome\nnot be all fun and games idiom\nnoxiously\nobjectionable\nobjectionably\nunpleasantness\nunpretty\nunspeakable\nunspeakably\nunsupportable\nSee more results »\nAdd to word list\nAdd to word list\na strong feeling of fear, shock, or disgust, or an event that produces such a feeling: [ C ] the horrors of war [ U ] People cried out in horror as they watched the building burn."}