{"id":184461,"name":"hospitality","type":"noun","us_sound":"ˌhɑː.spɪˈtæl.ə.t̬i","us_link":"../audio/h/eus72258.mp3","uk_sound":"ˌhɒs.pɪˈtæl.ə.ti","uk_link":"../audio/h/ukhorsi014.mp3","content":"Add to word list\nAdd to word list\nC1 the act of being friendly and welcoming to guests and visitors: The local people showed me great hospitality.\nfood, drink, entertainment, etc. that an organization provides for guests or business partners: The restaurant guide is independent and we do not accept any free hospitality.corporate hospitality The company's guests are entertained in the corporate hospitality area.\nthe work or business of providing food and drink, entertainment, hotels, etc. for customers: I worked in hospitality for many years, including a busy hotel in Wellington. Jobs in the leisure and hospitality sector will continue to grow.\nMore examplesFewer examplesWith their characteristic hospitality, they opened their house to over 50 guests.They said we should stay another night, but I didn't want to take advantage of their hospitality.She said that politicians should not accept hospitality from corporate interests or private donors.Most of her friends work in hospitality so they tend to have unsociable hours.The pandemic was absolutely disastrous for hospitality.\nSMART Vocabulary: related words and phrases\nFriendly\naffability\naffable\naffably\naffiliative\nagreeableness\nconversable\nconvivial\nconviviality\nconvivially\ncordial\nhospitable\nhospitably\ninseparable\nintimacy\nsugar and spice idiom\nsweet-natured\nsweet-tempered\nsweetness\nthe human touch\ntogetherness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFood - general words\nDrinks - general words\nTourism & holidays\nAdd to word list\nAdd to word list\nkindness and friendly behavior, esp. to guests: Thank you for your hospitality.\nAdd to word list\nAdd to word list\nMARKETING the food, drink, entertainment, etc. that an organization provides for guests or customers: He has promoted the magazine with the provision of very generous hospitality at party conferences. The marketing director has hired a hospitality suite at the stadium for today's rugby game. See also\ncorporate hospitality\nCOMMERCE the group of businesses such as hotels, bars, and restaurants that provide food, drink, or a place to sleep: We offer high-quality training for people working in hospitality, leisure, and tourism.\nfriendly and welcoming behaviour towards guests or customers: The atmosphere and hospitality of the smaller office made a great impression on all of our customers."}