{"id":184712,"name":"household","type":"noun","us_sound":"ˈhaʊs.hoʊld","us_link":"../audio/h/household.mp3","uk_sound":"ˈhaʊs.həʊld","uk_link":"../audio/h/ukhouse004.mp3","content":"Add to word list\nAdd to word list\nB2 a group of people, often a family, who live together: By the 1960s, most households had a TV. household chores household expenses household waste Compare\nfamily\nhome noun\nMore examplesFewer examplesThe insurance doesn't cover you for household items.I do all my household accounts on computer.No household security devices are proof against the determined burglar.Britain produces 20 million tons of household waste each year.\nSMART Vocabulary: related words and phrases\nFamily: relations in general\nanti-family\naunt\nauntie\nbaby daddy\nbiologically\nfatherhood\nfilial\nfilially\nfirst cousin\nfraternal\nkinswoman\nkith and kin\nlong-lost\nloved one\nmaiden aunt\nrelationship\nrelative\nremoved\nsecond cousin\nsib\nSee more results »\nAdd to word list\nAdd to word list\na group of people, often a family, who live together: She became part of his household. Idiom\na household name\nAdd to word list\nAdd to word list\na group of people, often a family, who live together in a house or flat: There are now on average 2.5 people per household in the state. a high-income/low-income/middle-income household I sometimes wonder how my wife and I manage as a single-income household. High-technology products are hard to sell to households where the head of the household is over 60 years of age.\nrelating to a house or flat and the people who live there: Public housing tenants are required to pay 30 per cent of their household income for rent. It's no surprise that household debt is rising.household bills/expenditure/spending The average annual household expenditure for food was $2,030.\nused to describe something that is used in the home: a household appliance/item/producthousehold consumption/use Over the last two decades, household water consumption per head in London has increased by 22%."}