{"id":184795,"name":"housing","type":"noun","us_sound":"ˈhaʊ.zɪŋ","us_link":"../audio/h/housing.mp3","uk_sound":"ˈhaʊ.zɪŋ","uk_link":"../audio/h/ukhouse021.mp3","content":"housing noun\n(HOMES)\nAdd to word list\nAdd to word list\nC1 [ U ] buildings for people to live in: There's a shortage of cheap housing in the region.\nMore examplesFewer examplesThe city is building new housing for the elderly.My main concern about moving to London is the cost of housing.There's very little moderately priced housing in this area.They opened a shelter to provide temporary housing for the city's homeless.\nSMART Vocabulary: related words and phrases\nHouses & homes\nA-frame\nADU\naffordable housing\nalmshouse\napartment\ndorm\ndormitory\ndosshouse\nduplex\nefficiency\nmultifamily\nNissen hut\nnon-housing\nold people's home\npalace\ntower block\ntown house\ntownhouse\ntract house\ntrap house\nSee more results »\nhousing noun\n(CASE, COVER)\n[ C ] a case or covering that surrounds a machine or part of a machine: The engine appeared to be intact except for the loss of its housing. The underwater cable housings must be able to resist corrosion from salt water.\nMore examplesFewer examplesThe bulbs last longer than filament bulbs and need less bulky housings.The first thing you notice about this monitor is the strange shape of the housing, which narrows sharply behind the screen. One of the engines visible in the wreckage on television yesterday appeared to have a gaping hole in its housing.\nSMART Vocabulary: related words and phrases\nMachines - parts\nair compressor\nair filter\naxle\ncogwheel\ncompressor\nconsole\ncontrol panel\ncontroller\ncowl\nguard\ninstrumentation\njet\nplunger\nregulator\nslide\nsplit pin\nstepney\nuniversal joint\nvee belt\nwheel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCoverings and layers\nGeneral and miscellaneous containers\nAdd to word list\nAdd to word list\nbuildings that people live in, or the providing of places for people to live: affordable/expensive housing\nAdd to word list\nAdd to word list\n[ U ]\n&#160; PROPERTY buildings for people to live in, used especially when talking about their price or condition: provide/build housing There was a need to provide housing for workers in the new industries.rented/private housing 55% of respondents live in rented housing and 30% are owner-occupiers.affordable/cheap/low-cost housing Lack of access to affordable housing is a problem for young people in the area.\n[ U ]\n&#160; PROPERTY the process of providing places for people to live: The post will suit someone who is currently working in housing or urban planning. a housing committee/department/officer\n[ C ] a hard cover used to protect a vehicle or machine: The rotary engine housing prevents scuffing.\nSee also\nsocial housing"}