{"id":184833,"name":"how","type":"adverb","us_sound":"haʊ","us_link":"../audio/h/how.mp3","uk_sound":"haʊ","uk_link":"../audio/h/ukhouse028.mp3","content":"Add to word list\nAdd to word list\nA2 in what way, or by what methods: How do we get to the town from here? How did you hear about the concert? How does this machine work? How do you plan to spend your holiday?how to Roz doesn't know how to ride a bicycle. It all depends on how you look at it. I don't care about fashion, I dress how I please. I was horrified to hear about how (= the way) she had been treated.how can/could How can/could he be so stupid? I don't know how anyone could think that way.\nA2 used to ask about someone's physical or emotional state: How is your mother? How are you feeling this morning?\nA1 used in questions that ask what an experience or event was like: How was your flight?how do you find How did you find the lecture? (= did you think it was good)?how do you like How did you like the concert (= did you enjoy it)?how far She didn't say how far it is (= what the distance is) to her house.how long How long are you going to be (= what amount of time are you going to spend) in the bathroom?how many Do you know how many (= what number of) people are coming?how much How much does this cost (= what is its price)?how old How old is his daughter (= what age is she)? \"Can you lift this case?\" \"It depends on how heavy it is.\" Do you remember how (= the fact that) we used to see every new film as soon as it came out?\nB1 used for emphasis: I can't tell you how pleased I am (= I am very pleased) that you came. How (= it is very) nice to see you! \"She paid for everything.\" \"How (= that was very) generous.\" how strange, stupid, weird, etc. is that? C2 informal\nused to emphasize that something is strange, stupid, etc.: She let me go on the yacht. How cool is that?\nSee more how are you?\nA1 used to ask someone if they are well and happy: \"Hi, Lucy, how are you?\" \"Fine, thanks, how are you?\"\nSee more how are things? informal (also how's everything?); (also how's it going?)\nused as greetings: I haven't seen you for ages, Carol. How are things?\nSee more how do you mean?\nused when you want someone to explain what they have just said: \"I think we need to reconsider our position.\" \"How do you mean?\"\nSee more how's that?\nused when asking if something you have done for someone is satisfactory: Let me put a cushion behind your back. How's that?\nSee more and how! informal\nused to show that you feel the same way as someone or agree with them: \"I'll be so glad when this project is finished.\" \"And how!\"\nSee more\nMore examplesFewer examplesYour house is always so neat - how do you manage it with three children?She used to lie awake at night worrying about how to pay the bills.\"Well, \" he began, \"I don't quite know how to tell you this.\"Notes on how to use this dictionary can be found at the beginning of the book.We do not know exactly how life first began.\nSMART Vocabulary: related words and phrases\nLinguistics: question words & expressions\namirite\nblaze\ndevil\nextent\nhow about...? idiom\nhow, what, why, etc. on earth... idiom\nin God's/heaven's name idiom\nquestion tag\ntrick\nwhat the blazes...? idiom\nwhat's something in aid of? idiom\nwhat's that (all) about (then)? idiom\nwhat's the score? idiom\nwhenever\nwhere\nwherefore\nwhich\nwhy\nworld\nyes\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: very & extreme\nGrammar\nExclamationsWe use exclamations to express surprise or shock or a strong emotion about something. The type of phrase or clause associated with exclamations is called exclamative. …\nWhat …!We can use what + noun phrase ((+ verb) (+ tag)): …\nHow …!We often use how followed by an adjective only: …\nExclamatives with interrogative formWe sometimes make an exclamation using interrogative (question) word order: …\nHowThe adverb how most commonly means ‘in what way’ or ‘to what extent’. …\nHow is …? or What is … like?We use How is …? to ask about someone’s general health or about the condition or state of something, or how people experience something: …\nHowever, whatever, whichever, whenever, wherever, whoeverIf we add -ever to wh-words like how, what, which, when, where and who, we change their meaning. …\nIdioms\nhow about...?\nhow about that?\nhow come?\nhow do you do?\nhow do you do\nhow's you?\nAdd to word list\nAdd to word list\nin what way or state, to what amount or degree, or for what reason: How do we get to the interstate highway from here? How did you hear about the concert? How is your mother? How did you like the movie? How much does this cost? How old is his daughter? She didn’t say how far it is to her house. How long are you going to be at the gym?\nHow is sometimes used for emphasis: How nice to see you! How are you?\nHow are you? is used as a greeting: \"Hi, how are you?\" \"Fine, thanks, how are you?\" How are things? (also How’s everything?); (How’s it going?)\nHow are things?,How’s everything?, and How’s it going? are informal greetings: Hi Deb! How's it going? How do you do?\nHow do you do? is a formal greeting: \"I’m Jack Stewart.\" \"How do you do, I’m Angela Black.\" Idioms\nhow about something\nhow come something happened\nhow dare you do something\nthe way or condition in which: Do you know how this machine works? [ + to infinitive ] Roz doesn’t know how to ride a bicycle. I was horrified to hear about how she had been treated."}