{"id":184848,"name":"however","type":"adverb","us_sound":"ˌhaʊˈev.ɚ","us_link":"../audio/h/however.mp3","uk_sound":"ˌhaʊˈev.ər","uk_link":"../audio/h/ukhouse030.mp3","content":"however adverb\n(DEGREE)\nAdd to word list\nAdd to word list\nB2 despite whatever amount or degree: However hungry I am, I never seem to be able to finish off a whole pizza. If Emma likes something she'll buy it however much it costs. I'll see you after the show and give you £20 for the tickets, or however much (= whatever) they cost.\nMore examplesFewer examplesHe is unlikely to succeed in getting his bill through Congress, however worthy it is.If you're an ostrich about your debts, you're only going to make matters worse: it would be much better to take your head out of the sand and face facts, however unpleasant.You have to sit the exams, however much you don't feel like doing them.However much I respect him, I can't agree with him on this occasion.I mustn't have any more chocolate, however much I feel like it.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a contrast\nagain\nany way you slice it idiom\nat any rate idiom\nat least idiom\nbest\nbut\ndisjunctive\ngiven\nhand\nin the face of something idiom\nin the teeth of something idiom\nmight\nnevertheless\nonly\nrate\nslice\nspite\nthough\ntooth\nwhen\nSee more results »\nhowever adverb\n(WAY)\nused to express surprise: However did you manage to get him to agree to that?\nC2 in whatever way: However you look at it, it's still a mess. You can do it however you like, it really doesn't matter.\nMore examplesFewer examplesHowever did you get that sofa through the door?We'll cook your steak however you like it.However did you manage to persuade Steve to come?However much you offered me, I'm not going to sell it.However much you disagree with him, it's hard not to find him charming.\nSMART Vocabulary: related words and phrases\nLinguistics: question words & expressions\namirite\nblaze\ndevil\nextent\nhow about...? idiom\nhow, what, why, etc. on earth... idiom\nin God's/heaven's name idiom\nquestion tag\ntrick\nwhat the blazes...? idiom\nwhat's something in aid of? idiom\nwhat's that (all) about (then)? idiom\nwhat's the score? idiom\nwhen\nwhenever\nwhere\nwherefore\nwhich\nwhy\nworld\nSee more results »\nhowever adverb\n(DESPITE THIS)\nA2 despite this: This is one possible solution to the problem. However, there are others. There may, however, be other reasons that we don't know about.\nMore examplesFewer examplesAlthough it's been a very difficult year for British business, there are, however, one or two items of good news to brighten the economic picture a bit.She was highly creative and talented; success, however, remained elusive for her.The garden is beginning to look more respectable - there's lots more work to be done, however.However, the team could still get through to the quarter-final round if they play their best from now on.I'm afraid Tim can't join our Cub group until he's eight. However, we'll put his name on the waiting list.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a contrast\nagain\nany way you slice it idiom\nat any rate idiom\nat least idiom\nbest\nbut\ndisjunctive\ngiven\nhand\nin the face of something idiom\nin the teeth of something idiom\nmight\nnevertheless\nonly\nrate\nslice\nspite\nthough\ntooth\nwhen\nSee more results »\nhowever adverb [not gradable]\n(DEGREE)\nAdd to word list\nAdd to word list\nto whatever amount or degree: However fast we drive, we’re not going to get there in time. If Emma likes something she’ll buy it, however much it costs.\nhowever adverb [not gradable]\n(WAY)\nin whatever way: However you look at it, it’s still a mess.\nhowever adverb [not gradable]\n(DESPITE)\ndespite this; nevertheless: There may, however, be other reasons that we don’t know about.\nhowever conjunction\n(WAY)\nin whatever way: You can do it however you like, it really doesn’t matter."}