{"id":184975,"name":"huddle","type":"verb","us_sound":"ˈhʌd.əl","us_link":"../audio/h/huddle.mp3","uk_sound":"ˈhʌd.əl","uk_link":"../audio/h/ukhowit028.mp3","content":"Add to word list\nAdd to word list\nto come close together in a group, for example because it is cold: huddle round Employees huddled round television sets at the company headquarters.huddle together It was so cold that we huddled together for warmth.\nto sit or stand in a bent position with your arms and legs close to your body, especially because of cold or fear: huddle (up) Sophie was so frightened by the noise of the fireworks that she huddled (up) in a corner of the room.\nmainly US to discuss something privately in a small group: huddle with After huddling with advisors, the president gave a speech. We spoke to Democratic lawmakers who are huddling on this issue on Capitol Hill tonight.\nMore examplesFewer examplesEveryone huddled around the fire to keep warm.Resident Loree Wilkinson, 39, and her children, ages 6 and 9, huddled in a basement and prayed as the tornado passed overhead.Inside the bars, weary locals huddle.Men huddle in twos and threes, talking about this and that.\nSMART Vocabulary: related words and phrases\nForming groups (of people)\nalienated\nbe ranged against/with something/someone\nclass reunion\ncluster\ncrowd\ncrowd around (someone/something)\nfederalization\nflock\nform\ngather\nincestuousness\nrally\nrange\nregather\nregroup\nreunion\nround\nround something/someone up\nthe assembled company\nthrong\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReturning to a place\nDebate & discussion\na small group of people or things that are close together: in a huddle A small group of people stood in a huddle at the bus stop.huddle of The campsite comprises a huddle of tents on a bend in the river. go/get into a huddle\nto get into a group in order to talk secretly: The judges went into a huddle to decide the winner.\nSee more\na group formed by the members of a sports team in order to have a discussion, before they separate and continue to play: I called a huddle and said, \"We're going to do something different this time.\"\nMore examplesFewer examplesThe typical book launch involves a huddle of people milling about a room with, perhaps, a few gushing words from the editor.The village is no more than a huddle of old farmsteads and chalets. There is a photo of him in a huddle with Ronald Reagan.The last time religious leaders and the government got into a huddle, they emerged with a deal.Jess called her teammates into a huddle and said \"Let's go out and win this thing.\"\nSMART Vocabulary: related words and phrases\nGroups of people\nalliance\nan\nanti-gang\nassemblage\nbaby boomer\nfirst people\nflashmob\nflock\nfocus group\nfoursome\nline (someone) up\nmafia\nmob\nposse\npublic\nquaternity\nrabble\nretinue\nsquad\nsyndicate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAmerican football\nAdd to word list\nAdd to word list\nto come close together in a group, or to hold your arms and legs close to your body, esp. because of cold or fear: Everyone huddled around the fire to keep warm. huddle noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈhʌd·əl/\nThe football players formed a huddle."}