{"id":185023,"name":"hug","type":"verb","us_sound":"hʌɡ","us_link":"../audio/h/hug.mp3","uk_sound":"hʌɡ","uk_link":"../audio/h/ukhuffi004.mp3","content":"Add to word list\nAdd to word list\nB1 to hold someone close to your body with your arms, usually to show that you like, love, or value them: Have you hugged your child today? They hugged each other when they met at the station.hug someone/something tightly Emily hugged her teddy bear tightly to her chest.hug your knees She sat on the floor hugging her knees (= with her knees bent up against her chest and her arms around them).hug something to someone Whenever I travel in the city I make sure I hug my handbag tightly to me.\nThesaurus: synonyms, antonyms, and examples\nto hold someone or somethingholdCan you hold this for a moment?claspHe reached out to clasp her hand.gripThe baby gripped my finger with her tiny hand.clutchSilent and pale, she clutched her mother's hand.clingOne little girl was clinging onto a cuddly toy.hang onThe child was hanging on to her mother's skirt.\nSee more results »\nto stay very close to something or someone: The road hugs the coast for several miles, then turns inland. This type of car will hug (= not slide on) the road, even in the wettest conditions. a figure-hugging dress\nliterary to keep something that makes you feel better or pleases you private or secret: hug something to yourself I hugged the idea to myself all through dinner.\nMore examplesFewer examplesThey were sitting outside in the car, kissing and hugging each other.At this wonderful news, the whole family ran together and hugged.The little girl sat hugging her teddy bear.She has a habit of hugging a cushion while she's watching TV.He hugged me so hard that I could hardly breathe.\nSMART Vocabulary: related words and phrases\nShowing affection\naffectionate\naffectionately\naw\nbear hug\ncanoodle\nchuck\ncwtch up to someone\ndemonstratively\ndemonstrativeness\nembrace\nembracingly\nfall into someone's arms idiom\nmake something/someone out\nman hug\nmwah\nnurse\nosculate\nspoon\nsqueeze\nto hold/clutch/clasp/take someone/something to your bosom idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCloseness in distance and time\nSecrecy and privacy\nB1 the act of holding someone or something close to your body with your arms: give someone a big hug Come here and give me a big hug.hugs and kisses We always exchange hugs and kisses when we meet. Synonyms\nclinch\nembrace\nsqueeze\nPhotoAlto/Odilon Dimier/Brand X Pictures/GettyImages\nMore examplesFewer examplesShe threw her arms round me, and gave me a hug.Can I have a hug before you go?Hey - cheer up! I think you need a hug.We were too sad to talk, but we gave each other a comforting hug.At the end of the holiday, there were hugs all round before the two families parted company.\nSMART Vocabulary: related words and phrases\nShowing affection\naffectionate\naffectionately\naw\nbear hug\ncanoodle\nchuck\ncwtch up to someone\ndemonstratively\ndemonstrativeness\nembrace\nembracingly\nfall into someone's arms idiom\nmake something/someone out\nman hug\nmwah\nnurse\nosculate\nspoon\nsqueeze\nto hold/clutch/clasp/take someone/something to your bosom idiom\nSee more results »\nAdd to word list\nAdd to word list\nto hold someone or something close to your body with your arms, esp. to show affection: [ T ] Maria hugged her dog. [ T ] As the verdict of not guilty was announced, he leaped up and hugged his lawyer. [ T ] fig. Some fish hug (= stay close to) the bottom of the lake. hug noun [ C ] us\nYour browser doesn't support HTML5 audio\n/hʌɡ/\nMy little boy always gets a kiss and a hug before he goes to bed."}