{"id":185134,"name":"human","type":"adjective","us_sound":"ˈhjuː.mən","us_link":"../audio/h/human.mp3","uk_sound":"ˈhjuː.mən","uk_link":"../audio/h/ukb03178.mp3","content":"Add to word list\nAdd to word list\nB1 being, relating to, or belonging to a person or to people as opposed to animals: human body The human body is composed of about 60 percent water.human remains They found some remains which were thought to be human.human suffering Victory in the war was achieved at the cost of great human suffering.fit for human consumption The inspector declared the meat fit for human consumption (= in good enough condition for people to eat).\nhaving the qualities, faults, and feelings that people have, as opposed to gods, animals, or machines: only human Of course I make mistakes, I'm only human. When he laughs it makes him seem more human. It's very human to have regrets about the past.\nMore examplesFewer examplesThe Red Cross's primary concern is to preserve and protect human life.The human ear cannot hear very high-frequency sounds.The reason for the disaster was engine failure, not human error.In a world where men and machines coexist, what does it mean to be truly human?He writes with enough insight to convince us that even the greatest scientists are also touchingly human.\nSMART Vocabulary: related words and phrases\nHumans, apes & monkeys\nanthropo-\nanthropoid\nape\nbaboon\nbonobo\ngreat ape\nhominid\nhominin\nhomo\nHomo sapiens\nlemur\nloris\nmacaque\nmandrill\nmankind\nring-tailed lemur\nsapient\nsilverback\nsimian\nspider monkey\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking mistakes\nWeakness and vulnerability\nExpressing and showing feelings\nB1 a person: The greatest damage being done to our planet today is that being done by humans. Compare\nHomo sapiens specialized\nman noun (PEOPLE)\nMore examplesFewer examplesIt may be feasible to clone humans, but is it ethical?Can the right to live ever be denied to any human?I don't believe that human beings are innately evil.He's a despicable human being!Every human being has the right to freedom from oppression.\nSMART Vocabulary: related words and phrases\nHumans, apes & monkeys\nanthropo-\nanthropoid\nape\nbaboon\nbonobo\ngreat ape\nhominid\nhominin\nhomo\nHomo sapiens\nlemur\nloris\nmacaque\nmandrill\nmankind\nring-tailed lemur\nsapient\nsilverback\nsimian\nspider monkey\nSee more results »\nAdd to word list\nAdd to word list\nof or typical of people: the human body Of course I make mistakes, I’m only human (= not perfect). The accident was due to human error (= a person’s mistake).\nAdd to word list\nAdd to word list\nrelating to people: Most of the problems were caused by human error, poor communication and staffing issues. The new regulations would improve labour conditions and protect human welfare.\na person: Industrial waste can pose a serious threat to humans and the environment."}