{"id":185435,"name":"hunger","type":"noun","us_sound":"ˈhʌŋ.ɡɚ","us_link":"../audio/h/hunger.mp3","uk_sound":"ˈhʌŋ.ɡər","uk_link":"../audio/h/ukhunch012.mp3","content":"hunger noun\n(NEED FOR FOOD)\nAdd to word list\nAdd to word list\nB1 [ U ] the feeling you have when you need to eat: satisfy your hunger I can't believe that that enormous meal wasn't enough to satisfy your hunger.faint from/with hunger By about nine o'clock she started to feel faint from/with hunger.hunger pangs I often suffer from hunger pangs (= strong feelings of needing something to eat) in the middle of the afternoon.\nB2 [ U ] a situation in which the body does not have enough food: die of hunger All over the world, people die of hunger every day.\nMore examplesFewer examplesAfter three days, we felt an agonizing, gnawing hunger.I don't know why I'm eating more - it's not hunger, it's just greed!We hadn't eaten since yesterday and the hunger pangs were getting harder to ignore.It revolts me to know that the world spends so much money on arms when millions are dying of hunger.Hundreds of refugees collapsed from hunger and thirst.\nSMART Vocabulary: related words and phrases\nHungry & thirsty\n(I'm so hungry), I could eat a horse idiom\nanti-hunger\nappetite\nbe gasping idiom\ncannibalism\neat\nfood poverty\nhunger striker\nhungrily\nhungry\nparched\nsmack your lips idiom\nstarvation\nthirst\nthirstily\nthirsty\nunderfed\nundernourished\nvoraciousness\nvoracity\nSee more results »\nhunger noun\n(DESIRE)\nC1 [ S or U ] a strong wish or desire: hunger for Despite some difficult times, he never lost his hunger for adventure/knowledge/success.\nSMART Vocabulary: related words and phrases\nFeelings of desire\nappetite\ncaprice\ncarnality\ncarnally\ncompulsion\ndream\nentitled\nhankering\nimpulse\nimpulse buy\nimpulse buying\nimpulsion\nthirst\nurge\nvaulting\nwhim\nwhimsy\nwish\nyearning\nyen\nSee more results »\nhunger noun [U]\n(FOOD)\nAdd to word list\nAdd to word list\nthe uncomfortable or painful feeling in your stomach caused by the need for or lack of food: Mother Teresa devoted her life to fighting hunger in the poorest parts of the world.\nhunger noun [U]\n(DESIRE)\na strong wish or desire: a hunger for adventure/power\nto want something very much: She had always hungered for a starring role in a musical."}