{"id":185446,"name":"hungry","type":"adjective","us_sound":"ˈhʌŋ.ɡri","us_link":"../audio/h/hungry.mp3","uk_sound":"ˈhʌŋ.ɡri","uk_link":"../audio/h/ukhunch015.mp3","content":"hungry adjective\n(NEEDING FOOD)\nAdd to word list\nAdd to word list\nA1 wanting or needing food: feel/be hungry By four o'clock I felt/was really hungry. The children are always hungry when they get home from school. There are too many hungry people (= people without enough to eat) in the world.go hungry She often goes hungry herself (= does not eat) so that her children can have enough to eat.hungry work Digging the garden is hungry work (= makes you feel hunger).\nThesaurus: synonyms, antonyms, and examples\nwanting or needing foodhungryBy dinner time we all felt really hungry.starvingIs there anything to eat? I'm starving!starvedUS He ate so quickly, like he was starved.famishedAfter that long workout, I'm absolutely famished.ravenousHe's going through a growth spurt, so he's just ravenous.\nSee more results »\nMore examplesFewer examplesI think it's a sin to waste food, when so many people in the world are hungry.I was hoping there'd be some food - I'm a bit hungry.The kids kept on about how hungry they were, so their father gave them some biscuits to shut them up.The baby had a feed an hour ago, so she can't be hungry.When our cat is hungry, she starts clawing at my legs.\nSMART Vocabulary: related words and phrases\nHungry & thirsty\n(I'm so hungry), I could eat a horse idiom\nanti-hunger\nappetite\nbe gasping idiom\ncannibalism\neat\nfood poverty\nhunger\nhunger striker\nhungrily\nparched\nsmack your lips idiom\nstarvation\nthirst\nthirstily\nthirsty\nunderfed\nundernourished\nvoraciousness\nvoracity\nSee more results »\nhungry adjective\n(WANTING)\nC2 having a strong wish or desire for something: hungry for She was so hungry for success that she'd do anything to achieve it. Journalists were hungry for details.\nSMART Vocabulary: related words and phrases\nWanting things\nache for something\nacquisitive\nambitious\nambitiously\nangle for something\ndesperate\nexpense\nfancy\nhave your eye on something idiom\nhunger\nhunger after/for something\nhungrily\npine\nset your heart on something/doing something idiom\nset your sights on something idiom\nshook\nshopping list\nsight\nsomeone's heart's desire idiom\nstraw\nSee more results »\nRelated word\nhungrily\nhaving a strong wish or desire for the stated thing: power-hungry politicians\nSMART Vocabulary: related words and phrases\nWanting things\nache for something\nacquisitive\nambitious\nambitiously\nangle for something\ndesperate\nexpense\nfancy\nhave your eye on something idiom\nhunger\nhunger after/for something\nhungrily\npine\nset your heart on something/doing something idiom\nset your sights on something idiom\nshook\nshopping list\nsight\nsomeone's heart's desire idiom\nstraw\nSee more results »\nhungry adjective\n(NEEDING FOOD)\nAdd to word list\nAdd to word list\nfeeling the need to eat because there has been a period of time when you have not eaten: The children are always hungry when they get home from school. They were poor and often went to bed hungry (= did not get enough to eat at night).\nhungry adjective\n(EAGER)\nhaving a strong desire; eager: Kim is so hungry for success that she’ll do anything to achieve it.\nAdd to word list\nAdd to word list\nhaving a great need or wish for the stated thing: capital-/cash-/money-hungryenergy-/power-hungry The energy-hungry transportation sector was weak . Many of its investors had been expecting the acquisition-hungry bank to move overseas for its next big deal.\nhaving a great need or wish for something: hungry for sth Analysts said investors were hungry for any information that could point the market in a direction. We need to attract fresh talent and show the world that we are hungry for success."}