{"id":185474,"name":"hunt","type":"verb","us_sound":"hʌnt","us_link":"../audio/h/hunt.mp3","uk_sound":"hʌnt","uk_link":"../audio/h/ukhunch021.mp3","content":"hunt verb [I or T]\n(CHASE)\nAdd to word list\nAdd to word list\nB1 to chase and try to catch and kill an animal or bird for food, sport, or profit: Some animals hunt at night.hunt for When lion cubs are young, the mother stays with them while the father hunts for food. Jack and Charlie like to hunt/go hunting (= chase and kill animals for sport) at weekends. Cats like to hunt mice and birds.be hunted for Elephants used to be hunted for the ivory from their tusks.\nin Britain, to chase and kill animals, especially foxes, using dogs and riding on horses\nMore examplesFewer examplesWolves hunt in groups known as packs.These animals sleep in the day and hunt at night.So why do people still go hunting - is it the thrill of the chase?The owl hunts mice and other small mammals, and sometimes other birds.He's a great fan of blood sports - he hunts and shoots and so on.\nSMART Vocabulary: related words and phrases\nHunting & fishing\nangler\nangling\nanti-hunt\nanti-hunter\nanti-hunting\nbarb\nfisher\nfisherman\nfishhook\nfishing line\nfishing rod\nfly fishing\noutfish\noverfishing\npiscatory\npoach\npoaching\nquarry\nravening\nwhaler\nSee more results »\nhunt verb [I or T]\n(SEARCH)\nB2 to try to find something or someone: I've hunted all over the place, but I can't find that book.hunt for They are still hunting for the missing child.hunt high and low for I've hunted high and low (= looked everywhere) for my gloves. Police are hunting the terrorists who planted the bomb.hunt something out I'll try and hunt out (= find) those old photographs for you.house-/job-hunting They have spent months house-/job-hunting (= looking for a house/a job). Synonyms\nlook (SEARCH)\nsearch\nseek (SEARCH) formal\nThesaurus: synonyms, antonyms, and examples\nto search for somethingsearchI've searched everywhere and can't find my passport.lookShe was looking in her handbag for a pen.huntI've hunted all over the place but I can't find that book.rummageHe rummaged through his pockets, looking for his keys.ferret outThe inspector general has broad powers to ferret out fraud on the state and local level.combPolice combed the area for evidence.\nSee more results »\nMore examplesFewer examplesSoldiers were dispatched to hunt for the leaders of the uprising.Police are hunting for a man who was seen running away from the murder scene.The children got up early to hunt for Easter eggs in the garden.I hunted everywhere for my keys, and then I found them still in the door!Could you all hunt through your desk drawers, in case the envelope was accidentally put away there.\nSMART Vocabulary: related words and phrases\nSearching\n-seeking\nbeachcomb\nbeachcomber\nbeachcombing\nbody search\nbounty hunter\ndivine\nkeep your/an eye out for someone/something idiom\nleave no stone unturned idiom\nmanhunt\nmudlark\nmudlarking\nscout\nscratch\nseek someone/something out\nseeker\nshake\nshake someone down\nshakedown\ntroll\nSee more results »\nPhrasal verb\nhunt someone/something down\nhunt noun\n(SEARCH)\nC1 [ C usually singular ] a search for something or someone: After a long hunt we finally found a house we liked.hunt for The hunt for the injured climber continued throughout the night.on the hunt for Police are on the hunt (= searching) for the kidnappers.the hunt is on for The hunt is on (= the search has started) for the Mayor's successor.\nMore examplesFewer examplesOur hunt for a new tenant ended when she replied to the advert.The hunt for a successor will begin immediately.The hunt for the stolen painting is focusing on known criminals.How's the house hunt going?She embarked on a hunt for a suitable replacement.\nSMART Vocabulary: related words and phrases\nSearching\n-seeking\nbeachcomb\nbeachcomber\nbeachcombing\nbody search\nbounty hunter\ndivine\nkeep your/an eye out for someone/something idiom\nleave no stone unturned idiom\nmanhunt\nmudlark\nmudlarking\nscout\nscratch\nseek someone/something out\nseeker\nshake\nshake someone down\nshakedown\ntroll\nSee more results »\nhunt noun\n(CHASE)\n[ C ] the activity of people chasing wild animals in order to kill them: go on a fox/deer hunt As the story begins, three young men are preparing to go on a fox/deer hunt.\n[ C ] in the UK, a group of people who meet regularly in order to chase and kill animals, especially foxes: They are members of the local hunt.\nMore examplesFewer examplesHe spent a day accompanying a local fox hunt as an observer.The hounds waited for a signal from the master of the hunt.He is a regular member of the local hunt.A landowner has the right to ask the hunt to keep off his or her land.On Boxing Day, many hunts traditionally take place around the country.\nSMART Vocabulary: related words and phrases\nHunting & fishing\nangler\nangling\nanti-hunt\nanti-hunter\nanti-hunting\nbarb\nfisher\nfisherman\nfishhook\nfishing line\nfishing rod\nfly fishing\noutfish\noverfishing\npiscatory\npoach\npoaching\nquarry\nravening\nwhaler\nSee more results »\nhunt verb [I/T]\n(CHASE)\nAdd to word list\nAdd to word list\nto chase or search for a wild animal or bird with the intention of killing or catching it for food, sport, or profit: [ I ] He hunts every weekend. [ T ] Cats like to hunt mice and birds.\nhunt verb [I/T]\n(SEARCH)\nto search for something or someone: [ I ] I’ve hunted everywhere for the missing keys. Phrasal verb\nhunt someone down\nhunt noun [C]\n(CHASE)\na chase or search for a wild animal or bird with the intention of killing or catching it: a deer hunt\nhunt noun [C]\n(SEARCH)\na search for something or someone: The hunt for the injured climber continued through the night."}