{"id":185568,"name":"hurrying","type":"verb","us_sound":"ˈhɝː.i","us_link":"../audio/h/hurry.mp3","uk_sound":"ˈhʌr.i","uk_link":"../audio/h/ukhurly007.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nhurry\nA2 to move or do things more quickly than normal or to make someone do this: Hurry or you'll be late. [ + to infinitive ] She hurried to answer the phone. I refuse to be hurried into a decision (= to be forced to make a decision too quickly). After spending her lunch hour shopping, she hurried back (= returned quickly) to work. I hate to hurry you, but I have to leave in a few minutes.UK Don't hurry your food (= don't eat it too quickly).\nThesaurus: synonyms, antonyms, and examples\nto move fastspeedHe ran back to his car and sped off.raceShe raced over and hugged me.flyShe flew across the room just in time to stop the baby falling off the chair.beltUK Traffic was belting along the motorway.tearA fire truck came tearing down the road.streakBullets streaked across the sky.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto runrunShe saw him running down the street.sprintI had to sprint to catch the bus.jog\"What do you do to keep fit?\" \"I jog and go swimming.\"raceHe raced up the stairs to answer the phone.rushEveryone rushed to the door when the alarm went off.dashHe dashed out the door after the dog.\nSee more results »\nMore examplesFewer examplesCome on - we're going to be late if you don't hurry!If we hurry, there's still a chance we could catch the plane.Clutching the money to his chest, he hurried to the bank.She gathered the children up and hurried into the house.The owner of the vehicle came hurrying along and turned off the car alarm.\nSMART Vocabulary: related words and phrases\nHurrying and doing things quickly\naccelerate\nacceleration\nagainst the clock idiom\nagainst time/the clock idiom\nalacrity\nbash\ndispatch\nget a move on idiom\nget a wiggle on idiom\ngrab-and-go\ngrease\nhacky\nprecipitately\nprompt\npromptly\npromptness\nquickie\nrattle something off\nstroke\ntear\nSee more results »\nPhrasal verb\nhurry (someone/something) up"}