{"id":185554,"name":"hurry","type":"verb","us_sound":"ˈhɝː.i","us_link":"../audio/h/hurry.mp3","uk_sound":"ˈhʌr.i","uk_link":"../audio/h/ukhurly007.mp3","content":"Add to word list\nAdd to word list\nA2 to move or do things more quickly than normal or to make someone do this: Hurry or you'll be late. [ + to infinitive ] She hurried to answer the phone.be hurried into I refuse to be hurried into a decision (= to be forced to make a decision too quickly).hurry back After spending her lunch hour shopping, she hurried back (= returned quickly) to work. I hate to hurry you, but I have to leave in a few minutes.UK Don't hurry your food (= don't eat it too quickly).\nThesaurus: synonyms, antonyms, and examples\nto move fastspeedHe ran back to his car and sped off.raceShe raced over and hugged me.flyShe flew across the room just in time to stop the baby falling off the chair.beltUK Traffic was belting along the motorway.tearA fire truck came tearing down the road.streakBullets streaked across the sky.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto runrunShe saw him running down the street.sprintI had to sprint to catch the bus.jog\"What do you do to keep fit?\" \"I jog and go swimming.\"raceHe raced up the stairs to answer the phone.rushEveryone rushed to the door when the alarm went off.dashHe dashed out the door after the dog.\nSee more results »\nMore examplesFewer examplesCome on - we're going to be late if you don't hurry!If we hurry, there's still a chance we could catch the plane.Clutching the money to his chest, he hurried to the bank.She gathered the children up and hurried into the house.The owner of the vehicle came hurrying along and turned off the car alarm.\nSMART Vocabulary: related words and phrases\nHurrying and doing things quickly\naccelerate\nacceleration\nagainst the clock idiom\nagainst time/the clock idiom\nalacrity\nbash\ndash\nget a move on idiom\nget a wiggle on idiom\ngrab-and-go\ngrease\nhacky\nprompt\npromptly\npromptness\nquickie\nrattle something off\nrattle through something\nstroke\ntear\nSee more results »\nPhrasal verb\nhurry (someone/something) up\nB1 the need to move or do things more quickly than normal: in a hurry We left in such a hurry that we forgot our tickets.in any/no hurry \"Can you wait a few minutes?\" \"Yes, I'm not in any hurry/I'm in no hurry (= I can wait).\"in a hurry to Are you in a hurry (= wanting) to leave? What's (all) the hurry (for)/Why (all) the hurry? (= Why are you acting or moving so quickly?)(great) hurry \"I'll let you have this back next week.\" \"That's all right, there's no (great) hurry/there isn't any (great) hurry (= no need to do it quickly).\"\nMore examplesFewer examplesSorry, I can't talk to you now - I'm in a desperate hurry.We left in a hurry and I must have left my keys behind.Hey, there's no need to push! What's your hurry?In our hurry to get to school on time, Dan left his packed lunch behind.Tom was clearly in a hurry to finish the meeting and get to the canteen.\nSMART Vocabulary: related words and phrases\nHurrying and doing things quickly\naccelerate\nacceleration\nagainst the clock idiom\nagainst time/the clock idiom\nalacrity\nbash\ndash\nget a move on idiom\nget a wiggle on idiom\ngrab-and-go\ngrease\nhacky\nprompt\npromptly\npromptness\nquickie\nrattle something off\nrattle through something\nstroke\ntear\nSee more results »\nAdd to word list\nAdd to word list\nto move or act quickly, or to cause someone to move or act quickly: [ I ] We have to hurry if we’re going to make it there in time. [ T ] I hurried the kids through their breakfasts. Idiom\nhurry up and do somethingPhrasal verb\nhurry up\nthe need to move or act more quickly than normal: We’ve got plenty of time – what’s the hurry (= Why hurry)? He’s in a hurry to get to a meeting (= wants to get there quickly). I’m in no hurry for the book (= I do not need it back quickly)– keep it as long as you want."}