{"id":185577,"name":"hurt","type":"verb","us_sound":"hɝːt","us_link":"../audio/h/hurt.mp3","uk_sound":"hɜːt","uk_link":"../audio/h/ukhurly008.mp3","content":"Add to word list\nAdd to word list\nA2 to feel pain in a part of your body, or to injure someone or cause them pain: Tell me where it hurts. My head hurts. She says that her ear hurts her. Emma hurt her back when she fell off her horse.seriously/badly hurt Several people were seriously/badly hurt in the explosion.\nThesaurus: synonyms, antonyms, and examples\nto cause painhurtMy leg hurts.acheMy legs are still aching from my run yesterday.throbMy head throbbed.stingHis cheeks stung from the aftershave he'd just put on.smartThe smoke was thick, making her eyes smart.rubThe clothing is cleverly stitched to prevent the seams rubbing anywhere.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto hurt someone physicallyhurtI hurt my arm climbing over the fence.injureThe bomb killed ten people and injured many more.woundHe was wounded so badly in the attack that doctors said he might never walk again.maimThe atrocities have killed or maimed thousands of people.tortureThe guards were accused of torturing prisoners.stabHe was fatally stabbed with a kitchen knife.\nSee more results »\nB1 to cause emotional pain to someone: She criticized my writing quite severely and that hurt. He was badly hurt by the end of his marriage.\nThesaurus: synonyms, antonyms, and examples\nto hurt someone emotionallyhurtI'm sorry, I didn't mean to hurt you.hurt someone’s feelingsDon't say anything - you'll hurt her feelings.upsetI'm sorry the news upset you.woundHe had wounded her pride more than she would ever have admitted.painIt pains me to admit it, but there's nothing I can do to change the situation.grieveIt grieved him that he had been the cause of all the bitterness.\nSee more results »\nto cause harm or difficulty: A lot of businesses are being hurt by the current high interest rates.seriously hurt These allegations have seriously hurt her reputation.never hurt Hard work never hurt anyone (= does no one any harm).informal One more drink won't hurt (= won't cause any harm).\nMore examplesFewer examplesGranny says if she stands (up) for a long time her ankles hurt.\"My finger hurts,\" wailed the child.My throat is so sore that it really hurts when I swallow.The lights are too bright in here - they're hurting my eyes.It was an innocent remark, I didn't mean to hurt his feelings.\nSMART Vocabulary: related words and phrases\nPain & painful\n-racked\naches and pains\nachy\nagonizing\nanalgesia\nbe murder on something idiom\nbrain freeze\ncluster headache\ndull\nexcruciating\ngrief\nneuralgia\npain reliever\npainlessly\npang\nprick\nrawness\nsting\nstitch\nthrob\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking people sad, shocked and upset\nDamaging and spoiling\nIdioms\nit doesn't hurt/never hurts to do something\nit wouldn't hurt you to do something\nB1 injured or in pain: Let me help you up. Are you hurt?get hurt Put that knife away before someone gets hurt.\nB1 upset or unhappy: I feel very hurt by what you said. \"That was very unkind,\" he said in a hurt voice.\nMore examplesFewer examplesI heard about the accident. Is anyone hurt?He fell off the stage but he's all right - it was only his pride that got hurt!Reports say that ten children and two teachers are hurt, but none seriously.She is suffering from hurt feelings after a fierce encounter with the boss this morning.The creature was hurt and distressed and had to be handled with caution.\nSMART Vocabulary: related words and phrases\nPain & painful\n-racked\naches and pains\nachy\nagonizing\nanalgesia\nbe murder on something idiom\nbrain freeze\ncluster headache\ndull\nexcruciating\ngrief\nneuralgia\npain reliever\npainlessly\npang\nprick\nrawness\nsting\nstitch\nthrob\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFeeling sad and unhappy\nemotional pain: The hurt after a relationship breaks up can be awful.deep hurt Her brave smile concealed a deep hurt.\nThesaurus: synonyms, antonyms, and examples\nemotional painpainDivorce can cause a lot of pain and suffering.hurtThe hurt caused by the break-up was almost unbearable.griefAfter his death, her grief was unbearable.heartacheAfter all the tears and heartache, there is light at the end of the tunnel.heartbreakMany of us have known our share of heartbreak.\nSee more results »\nSMART Vocabulary: related words and phrases\nSadness and regret\naw\nbe/weigh on your conscience idiom\nbitter\nblack dog\nbreastbeating\ncry\ndistress\nfeel bad idiom\ngloominess\nglumness\ngroan\nguilt\nprick\nprick someone's conscience idiom\nregretful\nregretfully\nremorse\nrepentant\nwrench\nwretchedness\nSee more results »\nAdd to word list\nAdd to word list\nto feel pain, or to cause pain or injury to yourself or someone else: [ I ] Tell me where it hurts. [ I ] My leg hurts. [ T ] Stop! You’re hurting me! [ T ] Emilio hurt his back when he fell off a ladder.\nTo hurt also means to cause harm or difficulty: [ T ] A lot of businesses are being hurt by high interest rates. [ T ] His lack of experience may hurt his chances of getting the job.\nTo hurt someone can also mean to make someone upset or unhappy: [ T ] I didn’t mean to hurt your feelings. Idiom\nit doesn’t hurt to do something\nfeeling pain or being upset: I saw you fall – are you hurt? Naomi was hurt by your criticism.\nemotional pain: It’s a hurt that he has tried all his life to heal."}