{"id":178447,"name":"hyaline","type":"noun","us_sound":"ˈhaɪ.ə.lɪn","us_link":"../audio/h/cespus000495.mp3","uk_sound":"ˈhaɪ.ə.lɪn","uk_link":"../audio/h/cespuk000495.mp3","content":"Add to word list\nAdd to word list\nany substance that is transparent or almost transparent: A liver biopsy showed a surprising amount of hyaline within the hepatocytes.\na transparent substance found in cartilage and the eye that is produced when tissue breaks down: In the early state of the foetus, cells are held together by a substance called hyaline.\nSMART Vocabulary: related words and phrases\nSubstances & structures in the body\nabductor\naccessorius\nadductor\nadenoid\nagonist\nglomerulus\nGnRH\ngonadotropin\ngracilis\ngrey matter\norigin\noxytocin\npapilla\npapillary\nparietal\nventriculus\nvesica\nvesical\nvesicle\nvestibular\nSee more results »\nused to describe a transparent substance in the body, especially in the eye and in cartilage (= strong tissue found in joints): This technique stimulates hyaline cartilage growth over the damaged articular surface.hyaline layer The hyaline layers were dissolved from the egg surfaces. Synonym\nhyaloid\nMore examplesFewer examplesPremature delivery carries a small risk for the development of hyaline membrane disease.The cartilage, which only partly surrounds the auditory tube, is hyaline near its junction with the bone.Excess plasma proteins may form hyaline droplets.The presence of a gelatinous hyaline layer surrounding the eggs has been observed in some species. Typically, muscle fibres contain nonhyaline and dense hyaline deposits of various shapes and sizes.\nSMART Vocabulary: related words and phrases\nTransparent\nclear\ncrystal\ncrystal clear idiom\ncrystalline\ndiaphanous\ndiaphanously\nfilminess\nfilmy\nimpenetrable\nlimpid\nliquid\nopacity\nopaquely\npellucid\nthinly\ntranslucence\ntranslucent\ntranslucently\ntransparency\ntransparent\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSubstances & structures in the body"}