{"id":178543,"name":"hybrid","type":"noun","us_sound":"ˈhaɪ.brɪd","us_link":"../audio/h/hybrid.mp3","uk_sound":"ˈhaɪ.brɪd","uk_link":"../audio/h/ukhurly027.mp3","content":"hybrid noun [C]\n(MIXTURE)\nAdd to word list\nAdd to word list\na plant or animal that has been produced from two different types of plant or animal, especially to get better characteristics: The garden strawberry is a large-fruited hybrid.hybrid of The animal looks like a hybrid of a zebra and a horse.\nsomething that is a mixture of two very different things: hybrid of His work is an interesting hybrid of popular and classical music.\nSMART Vocabulary: related words and phrases\nGenetics\nadenine\nanaphase\nautosomal\nautosomally\nautosome\ngenetic fingerprinting\ngenomic\ngenomics\ngermline\ngermplasm\nhalf-breed\nheredity\nheterozygous\nhomozygous\npanmictic\npanmixia\nparthenogenetic\nPatau syndrome\npaternally\nrecessive\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nVariety and mixtures\nConnecting and combining\nhybrid noun [C]\n(VEHICLE)\na vehicle with an engine that uses both petrol and another type of energy, usually electricity: Most car manufacturers now offer hybrids.\n(also hybrid bike) a bicycle that has a mixture of features of different specialized bicycles, so that it works well in a range of conditions: You can rent hybrids, racers, or mountain bikes. A hybrid bike is a good choice for commuting.\nMore examplesFewer examplesHybrids aren't the only alternative to conventional gas-powered engines. When you drive a hybrid, you start thinking more about how you brake and accelerate.I am a weekend mountain-biker but have been thinking about getting a hybrid for riding to work.The website will help you find the ideal bike, be it a hybrid, racer, mountain or folding bike.\nSMART Vocabulary: related words and phrases\nRoad vehicles in general\nairboard\nall-terrain vehicle\namphibian\nATV\nautorickshaw\ncraft\ndiesel\nHEV\nHOV\nhoverboard\nhybrid electric vehicle\nmotor vehicle\nmotorcade\nnon-motorized\nrover\nsnow groomer\nsnowcat\ntransportation\nvehicle\nvehicular\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBicycles\nhybrid adjective\n(MIXTURE)\ncombining two different things: hybrid mix His choreography is described as \"a hybrid mix of mime and circus tricks\".\nused to describe a plant or animal that has been produced from two different types of plant or animal: Researchers began developing hybrid agricultural crops to maximize productivity.\nMore examplesFewer examples\"Dance is a hybrid activity,\" he says, \"both sport and art.\"The hybrid aircraft can fly like a plane and take off and land like a helicopter. They went on a sort of hybrid adventure holiday/fitness camp.This seed produced lower yield when compared with hybrid canola grown from certified seed.\nSMART Vocabulary: related words and phrases\nVariety and mixtures\nall manner of something idiom\nalphabet soup\nassorted\nassortment\nbiodiverse\nhotchpotch\nhybridize\nhybridized\nit takes all sorts (to make a world) idiom\njumble\nnon-segregated\nodds and ends\nof every stripe/of all stripes idiom\npanoply\npatchwork\nsyncretism\nthis\nthis and that idiom\nvariety is the spice of life idiom\nvariously\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nConnecting and combining\nGenetics\nhybrid adjective\n(VEHICLE)\nused to describe a vehicle with an engine that uses both petrol and another type of energy, usually electricity: hybrid car A hybrid car could save you hundreds of pounds at the petrol pump.hybrid vehicle The law will allow hybrid vehicles to use carpool lanes on motorways.\nMore examplesFewer examplesI applaud the company's initiative to add hybrid trucks to its fleet of delivery vehicles.Both companies plan to offer hybrid SUVs by the end of the year.Toyota came out with a four-wheel-drive hybrid minivan.He is now proud to be driving his own hybrid cab.\nSMART Vocabulary: related words and phrases\nRoad vehicles in general\nairboard\nall-terrain vehicle\namphibian\nATV\nautorickshaw\ncraft\ndiesel\nHEV\nHOV\nhoverboard\nhybrid electric vehicle\nmotor vehicle\nmotorcade\nnon-motorized\nrover\nsnow groomer\nsnowcat\ntransportation\nvehicle\nvehicular\nSee more results »\nhybrid adjective\n(USING INTERNET)\nused to describe a way of working that involves sometimes being physically present and sometimes working at a distance using the internet: Hybrid teaching combines traditional in-class teaching with online teaching. A hybrid parliament was introduced, with a few MPs present but most contributing to debates remotely. See also\nhybrid learning\nMore examplesFewer examplesA hybrid approach to course delivery combines face-to-face classroom instruction with online activities. Temporary arrangements to enable hybrid (virtual and physical) proceedings in the House of Commons were agreed in April 2020.During the pandemic “hybrid scrutiny” was introduced to the House of Commons, with most MPs contributing to debates remotely.\nSMART Vocabulary: related words and phrases\nInternet terminology\n.plc.uk\n2FA\n2SV\nabove/below the fold idiom\naddress bar\naffiliate link\ninternet café\ninternet-enabled\ninterweb\nIP\nkeyboard warrior\nlanding page\nping\npodcast\nservice provider\ntweeter\ntweetstorm\ntwitterati\nTwitterer\ntwittering\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of education\nUK politics: legislation & law-making\nAdd to word list\nAdd to word list\nbiology a plant or animal that has been produced from two different types of plant or animal\nA hybrid is also anything that is a mixture of two or more things: The architecture is a hybrid of classical and modern styles.\nA hybrid vehicle is one that is able to operate using either of two fuels: US automakers are wrestling with how much to invest in hybrid gas-electric cars.\nAdd to word list\nAdd to word list\nsomething that is a combination of two different things, so it has qualities relating to both of them: a hybrid car/vehicle/engine Under the hybrid plan, the employee contributes payments to his retirement fund along with the government."}