{"id":180109,"name":"hype","type":"noun","us_sound":"haɪp","us_link":"../audio/h/hype.mp3","uk_sound":"haɪp","uk_link":"../audio/h/ukhydra022.mp3","content":"Add to word list\nAdd to word list\na situation in which something is advertised and discussed in newspapers, on television, etc. a lot in order to attract everyone's interest: media hypehype around/surrounding There's been a lot of hype around/surrounding his latest film. I've been put off reading the book by all the hype. Compare\nballyhoo old-fashioned slang\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ncustomer relationship management\ndetoxify\ndifferentiator\ndogfooding\nflyer\no.n.o.\non-brand\noverexpose\noverexposure\noverhype\ntout\nunadvertised\nunbilled\nunbranded\nunmarketable\nSee more results »\nto repeatedly advertise and discuss something in newspapers, on television, etc. in order to attract everyone's interest: be hyped as It's being hyped as the musical event of the year.\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ncustomer relationship management\ndetoxify\ndifferentiator\ndogfooding\nflyer\no.n.o.\non-brand\noverexpose\noverexposure\noverhype\ntout\nunadvertised\nunbilled\nunbranded\nunmarketable\nSee more results »\nPhrasal verb\nhype someone up\nAdd to word list\nAdd to word list\ninformation that makes something seem very important or exciting: The big-name, big-money New York art world is full of hype.\nto make something seem more exciting or important than it is: No sports event is more hyped than the Super Bowl.\nAdd to word list\nAdd to word list\nadvertising, news reports, and public praise for a new product or service, which is used to make people excited about buying or trying it: marketing/advertising/media hypehype around/surrounding/about sth After the e-commerce explosion and the hype around the business-to-consumer model came the business-to-business model.\n(also hype sth up) to advertise or praise something a lot in newspapers, on television, online, etc. in order to make people excited about it and want to buy or try it: Over-enthusiastic followers hyped this company to the moon and now sales are failing to match those heady expectations. Europe was hyped up as the place to invest last year. hyped adjective\nNext month's launch is likely to be one of the most hyped events of the year."}