{"id":180203,"name":"hyperbolic","type":"adjective","us_sound":"ˌhaɪ.pɚˈbɑː.lɪk","us_link":"../audio/h/ushydro006.mp3","uk_sound":"ˌhaɪ.pəˈbɒl.ɪk","uk_link":"../audio/h/ukhydra028.mp3","content":"hyperbolic adjective\n(SPEECH)\nAdd to word list\nAdd to word list\nformal relating to a way of speaking or writing that makes someone or something sound bigger, better, more, etc., than they are: hyperbolic rhetoric He wrote in very hyperbolic terms. See\nhyperbole\nMore examplesFewer examplesThe film was a hyperbolic and exuberant drama-documentary of gangster rituals, amorality, and violence.Don't use hyperbolic marketing language to describe your novel to a publisher.The hyperbolic New York City developer was in Chicago to go over the design of a proposed residential tower.\nSMART Vocabulary: related words and phrases\nExaggerating & playing down\nbloviate\nblow something out of proportion idiom\ncartoonish\ncartoonishly\ncatastrophize\nfulsome\ngo overboard idiom\ninflated\nmake a mountain out of a molehill idiom\nmake little of something idiom\nmake much of something idiom\nmake something of something/someone\nmeal\nmildly\nminimization\nOTT\nprotest too much idiom\nromanticize\ntrivialize\nunderplay\nSee more results »\nhyperbolic adjective\n(CURVE)\nmathematics\n&#160; specialized involving a curve whose ends continue to move apart from each other: The spacecraft are all travelling in unusual hyperbolic curves. Comets don't have regular orbits; they can come in in a hyperbolic orbit. See\nhyperbola\nMore examplesFewer examplesThe hyperbolic plane has been described as a surface where space curves away from itself at each point and expands.The selected mathematical example here is a hyperbolic graph. The painting will be displayed in its original hyperbolic shape.\nSMART Vocabulary: related words and phrases\nGeometry: bends, loops & curves\nanfractuous\narc\ncoil\nconic\ncurl\ncurve\ndogleg\nfishhook\nhelically\nhelix\nhyperbola\nkink\nloop\nparabola\npeaked\nspline\ntight\nturn\nwhorl\nwraparound\nSee more results »"}