{"id":182035,"name":"hysterical","type":"adjective","us_sound":"hɪˈster.ɪ.kəl","us_link":"../audio/h/hysterical.mp3","uk_sound":"hɪˈster.ɪ.kəl","uk_link":"../audio/h/ukhypot005.mp3","content":"Add to word list\nAdd to word list\nC1 unable to control your feelings or behaviour because you are extremely frightened, angry, excited, etc.: Calm down, you're getting hysterical. The police were accused of hysterical over-reaction. hysterical laughter (= uncontrolled laughter)\ninformal extremely funny: His last film was hysterical.\nThesaurus: synonyms, antonyms, and examples\ncausing laughterfunnyShe told me a funny story about Max.amusingI gave her an article that I thought she would find amusing.humorousShe wrote a humorous account of her teenage years.hilariousIt's the most hilarious comedy on television.hystericalI've just read his autobiography - it's absolutely hysterical.\nSee more results »\nMore examplesFewer examplesI suspect the doctor thought I was just another hysterical female, getting all worked up about nothing.She rang up in a hysterical state, saying that her husband had slapped her.All right, calm down, don't get hysterical. There's a lot of blood, but actually it's not that serious.There was a predictably hysterical reaction from the press when the news was announced.The victim's wife was hysterical with grief and had to be sedated.\nSMART Vocabulary: related words and phrases\nBecoming too excited and easily upset\nado\nant\nantsy\nat the end of your tether idiom\nbe in a whirl idiom\nfebrile\nhave a weak stomach idiom\nhave ants in your pants idiom\nhave thin/thick skin idiom\nhigh-strung\nhighly strung\nhysterics\nlather\nnot for the squeamish idiom\novereager\novereagerness\noversensitive\noverwrought\nunrestful\nworked up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMental illnesses\nHumour & humorous\nRelated word\nhysterically\nAdd to word list\nAdd to word list\nunable to control your emotions or behavior because you are very frightened, excited, etc.: Calm down, you’re getting hysterical. She broke into hysterical laughter (= laughter that is uncontrollable). infml That joke was hysterical (= extremely amusing). hysterically adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/hɪˈster·ɪk·li/\nGillian was laughing/crying hysterically."}