{"id":250302,"name":"obeyed","type":"verb","us_sound":"oʊˈbeɪ","us_link":"../audio/o/eus75090.mp3","uk_sound":"əʊˈbeɪ","uk_link":"../audio/o/ukoak__022.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nobey\nB2 [ I or T ] to act according to what you have been asked or ordered to do by someone in authority, or to behave according to a rule, law, or instruction: The soldiers refused to obey (orders). to obey the rules of international law See also\nobedient\nThesaurus: synonyms, antonyms, and examples\nto obey someone or somethingobeyChildren must obey their parents.followAll religions guide youths to follow the teachings of elders and parents.complyThere are serious penalties for failure to comply with the regulations.observePeople must observe the law.adhere toThey failed to adhere to the terms of the agreement.abide byPlayers must abide by the referee's decision.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\naccording to the law, rules, etc.according toIf we do not act according to the rules laid down for such cases, there will be chaos.in line withWhat she did was not always completely in line with the law.in accordance withThe council has not acted in accordance with its obligations.obeyIf they don't obey the rules, they will be asked to leave.followWe are obliged to follow the law in this matter.\nSee more results »\n[ T ] to behave according to a scientific principle: Falling objects obey the law of gravity.\n[ T ] If your body or part of your body does not obey you, it does not work in the way it should: She was so tired her legs just wouldn't obey her any longer.\nMore examplesFewer examplesHe hated being in the army because he had to obey commands.With careful training, a dog will obey its master completely.The role of the police is to ensure that the law is obeyed.Have you been obeying the rules?He was disciplined for failing to obey orders.\nSMART Vocabulary: related words and phrases\nObeying & breaking the law\nabide\nabide by something\nadhere\nadhere to something\nafoul\nbad actor\nbuck\ncommission\ncomply\ndisobey\nenforcer\nfall foul of something idiom\ngo by the book\nguiltiness\nhold someone to something\ninfraction\ninfringement\nobservance\nshalt\nviolation\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOccurring and happening\nInability and awkwardness"}