{"id":250353,"name":"obfuscation","type":"noun","us_sound":"ˌɑːb.fəˈskeɪ.ʃən","us_link":"../audio/o/usnymph019.mp3","uk_sound":"ˌɒb.fʌsˈkeɪ.ʃən","uk_link":"../audio/o/ukoak__024.mp3","content":"Add to word list\nAdd to word list\n[ C or U ] the act of making something less clear and less easy to understand, especially intentionally, or an instance of this: They accused the White House of obstruction and obfuscation. She criticized the company's deliberate obfuscation of its finances. Myths, obfuscations, and lies have long enshrouded the disgraced leader.\n[ U ] the act of putting false or confusing information on the internet, especially using special software, in order to stop search engines being able to collect information about you: Obfuscation gets you used to the idea that you do not have to provide real information about yourself. Obfuscation does not actually curtail online tracking.\n[ U ]\n&#160; computing\n&#160; specialized the act of creating computer code (= instructions used to program computers) that is difficult for humans to understand, in order to reduce the code size and hide it from other people: Obfuscation is a technique by which code is transformed into a form that is semantically the same as the original program, but is difficult to extract meaning from. Obfuscation will drastically reduce the size of the file, so data transfers between server and client will be fast. See also\nencryption Related word\nobfuscate\nMore examplesFewer examplesShe was horrified by his lies and obfuscation.Fighting your way through the bureaucratic obfuscation that surrounds the help available is no easy task.More delays and obfuscation can be expected from the government.\nSMART Vocabulary: related words and phrases\nDigressing and being indirect or evasive\nbury the lede idiom\ncandy coat\ncandy coating\ncandy-coated\ncircumlocution\ncircumlocutory\nequivocate\nglancingly\ngloss over something\ngo off on a tangent idiom\nhedge\nhedging\nimplicit\nimplicitly\nmealy-mouthed\nmincing\nobfuscate\nobscure\nstray\nveil\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHiding and disguising"}