{"id":250381,"name":"object","type":"noun","us_sound":"ˈɑːb.dʒɪkt","us_link":"../audio/o/eus75092.mp3","uk_sound":"ˈɒb.dʒɪkt","uk_link":"../audio/o/ukoak__028.mp3","content":"object noun\n(THING)\nAdd to word list\nAdd to word list\nB1 [ C ] a thing that you can see or touch but that is not usually a living animal, plant, or person: a solid/material/physical object a collection of precious objects Several people reported seeing a strange object in the sky.\nMore examplesFewer examplesA new baby will automatically curl its fingers round any object it touches.Look, there's a strange object in the sky!Make sure you bend your knees when you're picking up heavy objects.Boxwood is used for making small carved objects and tool handles.I like objects to be both functional and aesthetically pleasing.\nSMART Vocabulary: related words and phrases\nObjects - general words\naffair\nAmericana\nartefact\nblank\ncolumn\nconversation piece\ncurio\nentity\nephemera\nextrusion\nforensics\ngewgaw\nnon-abstract\nphenomenon\npiece\nshape\nsnow globe\nsuch and such\ntchotchke\nthing\nSee more results »\nobject noun\n(GRAMMAR)\nB1 [ C ]\n&#160; language\n&#160; specialized (written abbreviation obj) a noun or noun phrase that is affected by the action of a verb or that follows a preposition: In the sentence \"I like ice cream\", \"ice cream\" is the object of the verb \"like\".\nMore examplesFewer examplesThe verb \"give\" can take two objects.A transitive verb needs to have an object.\nSMART Vocabulary: related words and phrases\nLinguistics: grammatical terms\nablative\napposition\nappositive\nappositively\nattributively\ncollocate\nconcord\ndative\nfeminine\ngenitive\ninflected\nnominal\npost-modifier\npostposition\npostpositional\npostpositive\npostpositively\nquantifier\nsingular\nsyntax\nSee more results »\nobject noun\n(PURPOSE)\nC1 [ C usually singular ] a reason for doing something, or the result you wish to achieve by doing it: The object of their expedition was to discover the source of the River Nile. Synonyms\naim (INTENTION)\nambition\naspiration (HOPE)\ndream (HOPE)\ngoal (AIM)\nhope\nintent formal or specialized\nintention\nobjective\ntarget (AIM) the object of the exercise\nthe result that is wanted from an activity: In today's session, the object of the exercise is to improve your interpersonal skills.\nSee more\nSMART Vocabulary: related words and phrases\nGoals and purposes\naffordance\nambition\navail\ncause\ndedicated\ndeflect\ndream\neye\nit's the thought that counts idiom\nkey performance indicator\nKPI\nmoonshot\nobjective\npoint\ntarget\ntarget setting\nthought\ntowards\nundedicated\nundirected\nSee more results »\nobject noun\n(CAUSE)\n[ C usually singular ] someone or something that causes particular feelings in or actions by others: He became an object of ridicule among the other workers.\nSMART Vocabulary: related words and phrases\nMotives and reasons\nautotelic\ncauseless\ndrive\nfirst principles\nfrom a place of idiom\nground\nhidden agenda\nimpulse\ninclination\njustification\nmainspring\nmotivation\nmotive\nname\npeg\nplace\nshould\nwherefores\nwhy\nSee more results »\nGrammar\nObjectsAn object is one of the five major elements of clause structure. The other four are subject, verb, adjunct and complement. …\nDirect objectsA direct object shows who or what the action of the verb affects: …\nIndirect objectsAn indirect object is usually a person or an animal. The indirect object (underlined) receives or is affected by the direct object (in bold). An indirect object always needs a direct object with it and always comes before the direct object: …\nVerbs and objectsSome verbs (often called transitive verbs) need an object to complete their meaning. Some verbs (often called intransitive verbs) do not take an object. Some verbs need both a direct object and an indirect object. Some verbs can take a wh-clause or a that-clause as an object. …\nVerb patterns: with and without objectsSome verbs always need an object. These are called transitive verbs. Some verbs never have an object. These are called intransitive verbs. Some verbs can be used with or without an object. These are called transitive (with an object) and intransitive (without an object) uses of the verbs. …\nVerbs: transitive and intransitive usesSome verbs always need an object. These are called transitive verbs. Some verbs never have an object. These are called intransitive verbs. Some verbs can be used with or without an object. These are called transitive (with an object) and intransitive (without an object) uses of the verbs. …\nVerbs with direct and indirect objectsSome verbs take two objects, a direct object and an indirect object. The indirect object is the person or thing that receives the direct object. The indirect object (underlined in the examples) comes before the direct object (in bold): …\nVerbs followed by a direct object and a prepositional phrase of time or placeSome verbs take a direct object and a prepositional phrase of time or place: …\nVerbs followed by a direct object and an -ed clauseSome verbs can be followed by a direct object (underlined) and a clause containing the -ed form of a verb: …\nVerbs followed by a wh-clause as direct objectMany verbs which can be followed by a that-clause can also be used with a clause beginning with who, what, when, where, which, whose, why or how as the direct object. We call these wh-clauses (underlined in the examples below): …\nIndirect object versus prepositional complementWhen we talk about someone receiving something, we can express it using the typical word order: indirect object (io) + direct object (do). …\nIdiom\nbe no object\nB2 to feel or express opposition to or dislike of something or someone: Would anyone object if we started the meeting now? He objects to the label \"magician\". No one objected when the boss said it was time to go home.\nThesaurus: synonyms, antonyms, and examples\nto disagree with something by speaking or fighting against itopposeVillagers opposed plans to widen the carriageway.objectNo one objected to the decision.defyA few workers defied the decision to strike and went in to work.speak out againstMore and more people are speaking out against this unpopular law.stand out againstMore people are standing out against the corruption of the local government. declare againstUK She declared against the new airport.\nSee more results »\nMore examplesFewer examplesA couple of people objected to the proposal, but the vast majority approved of it.Religious traditionalists objected to theories of evolution being taught in schools.Local tradesmen are objecting to plans for big new out-of-town shopping centre.He objected to the fact that the documents weren't available before the meeting.She objects to being called his assistant.\nSMART Vocabulary: related words and phrases\nOpposing & against\nad hominem\nadversarial\nalienate\nalienated\nantagonistic\nanti-boycott\nantithetical\nconverse\ndiscordant\ninsurgent\nlark\nman the barricades idiom\nnimby\nnimbyism\nnon-confidence\nprotest\nraise\nresistant\nversus\nvirulent\nSee more results »\nobject noun [C]\n(THING)\nAdd to word list\nAdd to word list\na thing that can be seen, held, or touched, usually not a living thing: Distant objects look blurry to me.\nobject noun [C]\n(PURPOSE)\na purpose or aim of some effort or activity: The object of the game of chess is to checkmate your opponent.\nobject noun [C]\n(particular person or thing)\nthe particular person or thing to which others direct thoughts, feelings, or actions: The court has been the object of recent criticism.\nobject noun [C]\n(GRAMMAR)\ngrammar a noun, pronoun, or noun phrase that represents the person or thing toward which the action of a verb is directed or to which a preposition relates: In the sentence, \"Give the book to me,\" \"book\" is the direct object of the verb \"give,\" and \"me\" is the indirect object.\nobject verb\n(OPPOSE)\nto feel or express opposition, dislike, or disapproval: [ I ] I don’t think anyone will object to leaving early. [ + that clause ] She objected that the price was too high.\nAdd to word list\nAdd to word list\na thing that you can see and hold: He seeks ingenious design solutions for everyday objects such as telephones and cutlery.\nsomething you are planning to do or the result you hope to achieve: Their object is to produce something that will be able to compete with the market leader. The object of the exercise is to improve your interpersonal skills.\nIT a piece of data and the instructions that a computer or a computer specialist needs to work with the data and use it with other software to build programs\nobjects [ plural ]\nCOMMERCE the purpose of a business and the products or services it says it provides: What are the organization's stated objects?\ndefeat the object\nto prevent you from achieving the result you were hoping for: The balance transfer deal to this card completely defeats the object because any money you save will be cancelled by the higher interest on new purchases.\nmoney is no object\nused to say that someone has enough money not to worry about how much something costs: The fundraising event is aimed at people for whom money is no object.\nto say that you disagree with something or disapprove of it: His attorneys asked for more time to file pleadings and U.S. prosecutors did not object.object to sth If the City does not like the impact on borrowing costs, it can hardly object to the tax reforms. Several members of the board strongly objected to the proposed merger.object that Some unions object that company profit-sharing schemes merely hold down basic pay."}