{"id":250409,"name":"objective","type":"noun","us_sound":"əbˈdʒek.tɪv","us_link":"../audio/o/eus75096.mp3","uk_sound":"əbˈdʒek.tɪv","uk_link":"../audio/o/ukobjec003.mp3","content":"Add to word list\nAdd to word list\nB2 something that you plan to do or achieve: Her main/prime objective now is simply to stay in power. Can the sales team achieve/meet its financial objectives? Synonyms\naim (INTENTION)\nambition\naspiration (HOPE)\ndream (HOPE)\ngoal (AIM)\nhope\nintent formal or specialized\nintention\nobject (PURPOSE)\ntarget (AIM)\nThesaurus: synonyms, antonyms, and examples\nsomething you want to do or achieveaimOur aim in protesting is to raise awareness of the unfairness of the system.goalMy goal in life has always been to be financially independent.objectiveOne of my objectives for this year is to increase sales.targetIf you meet your sales targets you will receive a generous bonus.dreamWhen I was growing up my dream was to perform in front of millions of people.hopeMy hope is that there will be some kind of positive outcome to this process.\nSee more results »\nMore examplesFewer examplesOur main objective is to improve the company's productivity.My sole objective is to make the information more widely available.The project's objectives were adumbrated in the report.The government's training policy, he claimed, was achieving its objectives.We need to identify the best ways of attaining our objectives.\nSMART Vocabulary: related words and phrases\nGoals and purposes\naffordance\nambition\navail\ncause\ndedicated\ndeflect\ndream\neye\nit's the thought that counts idiom\nkey performance indicator\nKPI\nmoonshot\npoint\npoodle\ntarget\nthought\ntowards\nundedicated\nundirected\nunfocused\nSee more results »\nB2 based on real facts and not influenced by personal beliefs or feelings: an objective and impartial report I can't really be objective when I'm judging my daughter's work. Opposite\nsubjective\nSMART Vocabulary: related words and phrases\nUnbiased or impartial\nbalanced\ndisinterest\ndisinterested\ndisinterestedly\ndisinterestedness\nequitable\nequitably\nequity\nimpartial\nimpartiality\nimpartially\nneutral\nneutrally\nnon-aligned\nnon-alignment\nnon-intervention\nobjectively\nunbiased\nunprejudiced\nSee more results »\nRelated words\nobjectively\nobjectivity\nobjective adjective\n(FAIR OR REAL)\nAdd to word list\nAdd to word list\nnot influenced by personal beliefs or feelings; fair or real: an objective opinion\nobjective adjective\n(GRAMMAR)\n[ not gradable ]\n&#160; grammar having or relating to the case (= form) of a noun, pronoun, or adjective used to show that a word is the object of a verb\nobjective noun [C]\n(AIM)\nsomething that you aim to do or achieve: long-term objectives His main objective this semester is to improve his grades.\nAdd to word list\nAdd to word list\nsomething that you are planning to do or achieve: agree/establish/set objectives Management must set clear objectives that everyone subscribes to.achieve/meet/reach your objectives Investing globally enhances the fund's ability to meet its primary objective.key/main/primary/principal objective The primary investment objective of the account is to maximize after-tax returns.long-term/short-term objective The company failed to meet its short-term objective of expanding into Asia. business/company/performance objectives financial/investment/strategic objectives Compare\naim noun See also\nmanagement by objectives\nnot influenced by personal feelings or beliefs: be objective about sth One of the biggest problems in a celebrity case is being able to select jurors who can be objective about it.objective criteria/evidence/opinion Analysts produced objective evidence that the world was heading for a global recession. an objective account/assessment/report"}