{"id":250477,"name":"obligate","type":"verb","us_sound":"ˈɑːb.lɪ.ɡeɪt","us_link":"../audio/o/cdo0623usobli2741.mp3","uk_sound":"ˈɒb.lɪ.ɡeɪt","uk_link":"../audio/o/cdo0623ukobli2746.mp3","content":"Add to word list\nAdd to word list\nto force someone to do something, or to make it necessary for someone to do something: The law obligates financial institutions to make monthly reports on large transactions. The contract obligated them to pay hundreds of pounds monthly to a private recruiting firm. Our financial advice service is free, impartial, and does not obligate you in any way. Related word\nobligatedSynonym\noblige\nMore examplesFewer examplesThere are probably state laws that would obligate you to have a licence.The only conclusion I could come to was that public relations obligated them to do it.Some local politicians feared that the gesture might obligate the city financially in the future.\nSMART Vocabulary: related words and phrases\nCausing somebody to act\narm-twisting\nbludgeon\nbounce someone into something\nbulldoze\nbully\ncoercion\nforcible\nforcibly\nhold someone to ransom idiom\nimpel\nimpose\nrailroad\nram something down someone's throat idiom\nram something into someone\nransom\nreduce\nreduce someone to something\nreimpose\nslap\nsqueeze\nSee more results »\nneeding to do something or to have particular conditions in order to live: Horses are obligate nasal breathers during exercise. As obligate parasites, viruses are dependent on their hosts.\ncertain to have something, such as a gene (= a part of the DNA in a cell that controls the physical development, behaviour, etc. of an individual plant or animal and is passed on from its parents): She is an obligate carrier, absolutely certain to carry the gene.\nMore examplesFewer examplesLike all cats, the cougar is an obligate carnivore, feeding only on meat.Such complicated life cycles pose a problem for obligate parasites.Many animals are obligate hermaphrodites.This highlighted their mother as an obligate gene carrier.\nSMART Vocabulary: related words and phrases\nAnimal & plant biology - general words\nabiotic\nanatomical\nanatomically correct\nanti-Darwinian\nanti-Darwinism\nbiologist\nDarwinian\nDarwinism\nDarwinist\nentomological\nentomologist\nmorph\nnaturalist\npoisonous\nprimary producer\nprimitively\nprokaryote\npseudopod\nrecolonization\nzoology\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGenetics\nAdd to word list\nAdd to word list\nto make someone feel morally or legally forced to do something: I’m in favor of obligating welfare recipients to do more. obligated adjective us\nYour browser doesn't support HTML5 audio\n/ˈɑb·ləˌɡeɪ·t̬ɪd/\n[ + to infinitive ] I felt obligated to speak up and defend my friend’s reputation.\nAdd to word list\nAdd to word list\nLAW to force someone to do something: be obligated to do sth The company was obligated to make compensation for damages.obligate sb/sth to do sth The law doesn't obligate districts to enroll older students.be legally/morally obligated Employers are legally obligated to inform employees about benefits. Compare\noblige\nFINANCE to officially state that money will be used to pay for something: The centre is authorized to obligate funds.obligate funds/money/$20 million, etc. for sth The agency has obligated $388 million for specific recovery projects in the area."}