{"id":250483,"name":"obligation","type":"noun","us_sound":"ˌɑː.bləˈɡeɪ.ʃən","us_link":"../audio/o/eus75099.mp3","uk_sound":"ˌɒb.lɪˈɡeɪ.ʃən","uk_link":"../audio/o/ukobjec010.mp3","content":"Add to word list\nAdd to word list\nB2 [ C or U ] the fact that you are obliged to do something: [ + to infinitive ] If you have not signed a contract, you are under no obligation to (= it is not necessary to) pay them any money. You have a legal obligation to (= the law says you must) ensure your child receives an education.\n[ C ] something that you must do: I don't have time to do his work for him - I have too many obligations as it is.\nMore examplesFewer examplesBeach operators do not have a legal obligation to provide against injury or drowning.One has an obligation to one's friends.It's her moral obligation to tell the police what she knows.Are you under a contractual obligation to any other company?You have a legal obligation to inform the police about the crash.\nSMART Vocabulary: related words and phrases\nDuty, obligation and responsibility\naccountable\naccountable to someone\naccountably\nanswer for something\nbear\nbrother\nfail\nfall to someone\nfiefdom\ngotta\nhad better/best do something idiom\nhat\nought to\nowe someone a living idiom\npass the buck idiom\npay your dues idiom\npigeon\nportfolio\nsomeone's answer to someone/something idiom\nstick\nSee more results »\nAdd to word list\nAdd to word list\nsomething that a person feels morally or legally forced to do: [ C ] The government has an obligation to assist relief efforts. [ U ] You can just look – you’re under no obligation to buy.\nAdd to word list\nAdd to word list\n[ C or U ] a legal or moral duty to do something: a legal/moral obligationan obligation to do sth There is a legal obligation to publish accounts. We have an obligation to generate value for our shareholders.an obligation to sb Under bankruptcy law, the company has an obligation to creditors.be under (an) obligation You are under no obligation to accept damaged goods.\nobligations [ plural ]\nthings that you must do or pay because of a law, rule, agreement, etc.: impose/place obligations on sb The law imposes certain obligations on public authorities.fulfil/meet your obligations He has fulfilled the obligations of his current contract.contractual/financial/statutory obligations Failure to meet contractual obligations may result in legal action.\nwithout obligation\nCOMMERCE, LAW used to say that someone can look at or try a product or service without having to buy it: Auction houses will usually examine and place a price on your item without obligation. This mortgage advice is completely free and without obligation.\nSee also\ntax obligation"}