{"id":250684,"name":"observation","type":"noun","us_sound":"ˌɑːb.zɚˈveɪ.ʃən","us_link":"../audio/o/eus75118.mp3","uk_sound":"ˌɒb.zəˈveɪ.ʃən","uk_link":"../audio/o/ukobsce010.mp3","content":"observation noun\n(WATCHING)\nAdd to word list\nAdd to word list\nB2 [ U ] the act of observing something or someone: close observation of nature/human nature/animal behaviour The police are keeping the suspect under observation. She was admitted to hospital for observation (= so that doctors could watch her and see if anything was wrong with her).\nSMART Vocabulary: related words and phrases\nUsing the eyes\naccommodate\naccommodation\nall eyes are on someone/something idiom\nastigmatic\nbeholder\ncorner\ndiscern\nfix\nglare\nglass\npenetrating\nperceive\nre-sight\nrest on someone/something\nresurvey\nrubbernecking\nscope\nsighting\nspot\ntab\nSee more results »\nobservation noun\n(NOTICING)\nB2 [ U ] the fact that you notice or see something: She has remarkable powers of observation (= is very good at noticing things).\nC1 [ C ] formal a remark about something that you have noticed: The book is full of interesting observations on/about the nature of musical composition. May I make an observation?\nThesaurus: synonyms, antonyms, and examples\nsomething you say or write that expresses an opinioncommentThe MP could not be reached for comment.remarkHis controversial remarks about race were widely reported.statementIn a statement released earlier today, the team denied allegations of cheating.declarationThe sovereign made a formal declaration of war. observationShe makes some interesting observations about human nature in her book. commentaryI love that sports announcer's commentary - it's always so funny!\nSee more results »\nSMART Vocabulary: related words and phrases\nUsing the eyes\naccommodate\naccommodation\nall eyes are on someone/something idiom\nastigmatic\nbeholder\ncorner\ndiscern\nfix\nglare\nglass\npenetrating\nperceive\nre-sight\nrest on someone/something\nresurvey\nrubbernecking\nscope\nsighting\nspot\ntab\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRemarks & remarking\nobservation noun\n(REMARK)\nAdd to word list\nAdd to word list\n[ C ] a remark made about something you have noticed: She made an interesting observation about the poet’s intentions.\nobservation noun\n(EXAMINE)\n[ C ]\n&#160; science the recorded information that results from studying a scientific event\nobservation noun\n(WATCH)\n[ U ] the act of watching something or someone carefully: He was admitted to the hospital for observation after complaining of chest pains.\nobservation noun\n(NOTICE)\n[ U ] the ability to notice something or someone: He has remarkable powers of observation."}