{"id":250695,"name":"observed","type":"verb","us_sound":"əbˈzɝːv","us_link":"../audio/o/eus75120.mp3","uk_sound":"əbˈzɜːv","uk_link":"../audio/o/ukobsce012.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nobserve\nobserve verb [T]\n(WATCH)\nB2 formal to watch carefully the way something happens or the way someone does something, especially in order to learn more about it: The role of scientists is to observe and describe the world, not to try to control it. [ + question word ] He spent a year in the jungle, observing how deforestation is affecting local tribes. Children learn by observing adults.\nMore examplesFewer examplesIn Istanbul, East and West fuse together in a way that is fascinating to observe.The satellite will observe objects that are particularly interesting astronomically.Some scientists believe that there is about ten times as much matter in the universe as astronomers have observed.The research project has been observing changes in the local population.Security guards are able to observe the car park using CCTV.\nSMART Vocabulary: related words and phrases\nUsing the eyes\naccommodate\naccommodation\nall eyes are on someone/something idiom\nastigmatic\nbeholder\ncast\ncorner\ndiscern\nfix\nglare\npenetrating\nperceive\nre-sight\nrest on someone/something\nresurvey\nrubbernecking\nscope\nsighting\nspot\ntab\nSee more results »\nobserve verb [T]\n(NOTICE)\nC1 formal to notice or see: Jack observed a look of anxiety on his brother's face. [ + question word ] The guards failed to observe who delivered the package. [ + that ] In all these films one observes that directors are taking a new interest in Native American culture. [ + infinitive without to ] A teacher observed her climb over the gate.\nThesaurus: synonyms, antonyms, and examples\nto say somethingsayWhen I say your name, raise your hand.utterShe barely uttered a word all morning.they sayThey say the house is haunted.it is saidIt is said that a chain is only as strong as its weakest link.stateUnion members stated that they were unhappy with the proposal.remarkHe remarked that she was looking thin.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto see somethingseeI can see for miles from up here.noticeI noticed a crack in the ceiling.perceiveBill perceived a tiny figure in the distance.observeA teacher observed her climbing over the gate.spotWe managed to spot a leopard.catch sight ofWe looked for the bird and caught sight of it just as it flew off.\nSee more results »\nMore examplesFewer examplesDid you observe the make of the vehicle?The inspectors observed some irregularities in his tax return.Did you observe anything unusual about his appearance?Scientists have been observing variations in the thickness of the ozone layer.She observed a parking space next to the entrance to the building.\nSMART Vocabulary: related words and phrases\nUsing the eyes\naccommodate\naccommodation\nall eyes are on someone/something idiom\nastigmatic\nbeholder\ncast\ncorner\ndiscern\nfix\nglare\npenetrating\nperceive\nre-sight\nrest on someone/something\nresurvey\nrubbernecking\nscope\nsighting\nspot\ntab\nSee more results »\nobserve verb [T]\n(SAY)\nformal to make a remark about something: [ + speech ] \"I've always found German cars very reliable,\" he observed. [ + that ] She observed that it would soon be time to stop for lunch.\nSMART Vocabulary: related words and phrases\nSaying & uttering\n(your) every word idiom\nadd\ncome out with something\nfall from something\nfind your voice idiom\nget in\nin your own words idiom\nintone\nloud\nobserve\nphrase\nquoth\nsaid\nsay\nspoken\nstring\ntalk sense idiom\nthink\nverbalize\nvolunteer\nSee more results »\nobserve verb [T]\n(OBEY)\nC2 formal to obey a law, rule, or custom: People must observe the law. Nobody should be an exception. The old people in the village still observe the local traditions. Do you observe Passover?\nThesaurus: synonyms, antonyms, and examples\nto obey someone or somethingobeyChildren must obey their parents.followAll religions guide youths to follow the teachings of elders and parents.complyThere are serious penalties for failure to comply with the regulations.observePeople must observe the law.adhere toThey failed to adhere to the terms of the agreement.abide byPlayers must abide by the referee's decision.\nSee more results »\nSMART Vocabulary: related words and phrases\nObeying & breaking the law\nabide\nabide by something\nadhere\nadhere to something\nafoul\nbad actor\nbuck\ncommission\ncomply\ndisobey\nenforcer\nfall foul of something idiom\ngo by the book\nguiltiness\nhold someone to something\ninfraction\ninfringement\nobservance\nshalt\nviolation\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCustom, tradition & conformity\nRelated words\nobservable\nobservably"}