{"id":250916,"name":"obvious","type":"adjective","us_sound":"ˈɑːb.vi.əs","us_link":"../audio/o/eus75134.mp3","uk_sound":"ˈɒb.vi.əs","uk_link":"../audio/o/ukobsti020.mp3","content":"Add to word list\nAdd to word list\nB1 easy to see, recognize, or understand: [ + (that) ] It's obvious (that) she doesn't like him. They have a small child so for obvious reasons they need money. I know you don't like her, but do you have to make it so obvious? Am I stating the obvious (= saying what everyone already knows)? There is no obvious solution.\nThesaurus: synonyms, antonyms, and examples\neasy to see, recognize, or understandobviousIt's obvious that she's upset.clearIt was clear that he was unhappy.apparentHer joy was apparent to everyone.plainHis disappointment was plain to see.evidentThe company president was impressed by her evident ambition.manifestHis manifest lack of interest has provoked severe criticism.\nSee more results »\nMore examplesFewer examplesWhen it was obvious the company was going bankrupt, the government ordered all their assets to be frozen.Would you quickly look over these figures for me and see if there are any obvious mistakes?It is obvious that sweeping changes are needed in the legal system.If we view the problem from a different angle, a solution may become more obvious.His speech was inarticulate and it was obvious he had been drinking.\nSMART Vocabulary: related words and phrases\nApparent and obvious\n(from) under your nose idiom\napparent\nbe (as) plain as the nose on your face idiom\nbe (right) under your nose idiom\nbe etched somewhere idiom\nbe writ large idiom\nflagrantly\nforegone conclusion\nglaring\nglaringly\nI need hardly do something idiom\nobtrude\npalpable\npalpably\nparallax\npatently\nperceivable\nsqueaky\nstand/stick out a mile idiom\nwritten all over someone's face idiom\nSee more results »\nAdd to word list\nAdd to word list\neasily seen, recognized, or understood: an obvious solution For obvious reasons, he needs to find work soon."}