{"id":250936,"name":"occasion","type":"noun","us_sound":"əˈkeɪ.ʒən","us_link":"../audio/o/eus75135.mp3","uk_sound":"əˈkeɪ.ʒən","uk_link":"../audio/o/ukobsti022.mp3","content":"Add to word list\nAdd to word list\nB2 a particular time, especially when something happens or has happened: We met on several occasions to discuss the issue. I've heard him be rude to her on a number of occasions. I seem to remember that on that occasion he was with his wife.\nB1 a special or formal event: Sara's party was quite an occasion - there were over a hundred people there. At the wedding he sang a song specially written for the occasion. I have a suit but I only wear it on special occasions. The coronation of a new king is, of course, a historic occasion. Congratulations on the occasion of your wedding anniversary.\nformal an opportunity or reason for doing something or for something to happen: The 200th anniversary of Mozart's death was the occasion for hundreds of special films, books and concerts. An occasion may arise when you can use your knowledge of French. The bride took/used the occasion to make a short speech. on occasion\nC2 sometimes, but not often: He has, on occasion, made a small mistake.\nMore examplesFewer examplesI'd like to thank everyone concerned for making the occasion run so smoothly.Is this an appropriate occasion to discuss finance?The funeral was a sombre occasion.As it was such a special occasion, she permitted herself a small glass of champagne.Her dress was too showy for such a formal occasion.\nSMART Vocabulary: related words and phrases\nPoints in time\nanytime\nas\nas and when idiom\ndownstream\nduring\nhour\nif\nif and when idiom\njuncture\nlast\nlater\nmidstream\nmidway\nmoment\none\nposterior\nthe last minute idiom\ntime\nunder the wire idiom\nwire\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCelebrations, parties & special occasions\nEvents and occurrences\nOpportunity\nRarely & infrequently\nIdiom\nhave occasion to do something\nto cause something: Her refusal occasioned a lot of trouble. [ + two objects ] The case occasioned the authorities a lot of worry/The authorities were occasioned a lot of worry by the case.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nreactivate\nrealization\nrealize\nreattribute\nreawaken\nrender\nseed\nspark\nSee more results »\noccasion noun\n(PARTICULAR TIME)\nAdd to word list\nAdd to word list\n[ C ] a particular time when something happens: Sarah loves dressing up for special occasions. She has lied on several occasions. This meeting provides an occasion (= a suitable time) to discuss the issues facing our school.\noccasion noun\n(REASON)\n[ U ] a reason or cause: I’ve never had occasion to worry about my children’s school work. Idiom\non occasion"}