{"id":251035,"name":"occupation","type":"noun","us_sound":"ˌɑː.kjəˈpeɪ.ʃən","us_link":"../audio/o/eus75140.mp3","uk_sound":"ˌɒk.jəˈpeɪ.ʃən","uk_link":"../audio/o/ukobsti030.mp3","content":"occupation noun\n(JOB)\nAdd to word list\nAdd to word list\nA2 [ C ] a person's job: In the space marked \"occupation\" she wrote \"police officer\". Occupations experiencing shortages will need an average of 47% more graduates to meet demand.\nThesaurus: synonyms, antonyms, and examples\na jobjobShe got a job as a lab assistant.occupationPlease fill in your name, age, and occupation.postThere's a post for a lecturer open in my department. positionShe's applied for a part-time editing position.appointmentThere are going to be several new appointments in the department this year.careerShe's had a very successful career in marketing.\nSee more results »\noccupation noun\n(ACTIVITY)\nC1 [ C ] a regular activity or hobby: It seems to me his favourite occupation is eating. Running a house is a full-time occupation.\nSMART Vocabulary: related words and phrases\nWork, working and the workplace\nact as something\nall work and no play (makes Jack a dull boy) idiom\nassignment\nbandh\nbe at work idiom\ngrind\nhoop\nhot-desking\nhotelling\nhousekeeping\nin the line of duty idiom\ninduction\nindustry\nlabour\nslave\nslog\nslouch\nspadework\nsubtask\nsweat\nSee more results »\noccupation noun\n(CONTROL)\nC2 [ U ] a situation in which an army or group of people moves into and takes control of a place: the Italian occupation of Ethiopia The US had planned to continue the occupation for another year.\nSMART Vocabulary: related words and phrases\nAttacking & invading\naggressor\nambush\nbeleaguer\nbeleaguered\nbesiege\nblitz\nblitzkrieg\ncyberbullying\ncyberwarfare\nfalse flag\nforay\ngoing-over\nhard power\nhit and run\nkamikaze\npre-emption\nprivateer\nraid\nreconquer\nreconquest\nSee more results »\noccupation noun\n(USING A BUILDING)\n[ U ] the fact of living in or using a building: All the houses will be fit for occupation next month. The director has not been provided with living accommodation by reason of his office, and any occupation of the property by him is purely incidental. Compare\nhabitation\nSMART Vocabulary: related words and phrases\nLiving or sleeping somewhere\nabide\nco-resident\nco-residential\ndomiciled\ndwell\ninhospitable\ninhospitably\nlive in\nlive in sin idiom\nlive out\nlodge\npopulate\nrepopulate\nrepopulation\nreside\nresidence\nresidency\nsettle\nslum\ntenancy\nSee more results »\noccupation noun\n(JOB)\nAdd to word list\nAdd to word list\n[ C ] fml a person’s job: He listed his occupation on the form as \"teacher.\"\n[ C ] fml An occupation is also a regular activity: Sailing was his favorite weekend occupation.\noccupation noun\n(CONTROLLING FORCE)\n[ U ] the act of controlling a foreign country or region by armed force: the occupation of France during World War II\nAdd to word list\nAdd to word list\n[ C ] the job or type of job that a person has: full-time/main occupation She lists her main occupation as 'property developer'.current/previous occupation He returned to his previous occupation as a teacher. Please state your name, age, and occupation.\n[ U ]\n&#160; PROPERTY\n&#160; formal an occasion when someone moves into and starts using a building: The apartment is available for occupation in April. The company is entitled to exclusive occupation of the premises. See also\nservice occupation"}