{"id":251507,"name":"odds","type":"noun","us_sound":"ɑːdz","us_link":"../audio/o/eus75157.mp3","uk_sound":"ɒdz","uk_link":"../audio/o/ukodd__007.mp3","content":"Add to word list\nAdd to word list\nC1 the probability (= how likely it is) that a particular thing will or will not happen: If you drive a car all your life, the odds are that you'll have an accident at some point. There are heavy odds against people succeeding in such a bad economic climate. What are the odds on him being (= do you think he will be) re-elected? The overall odds of winning a lottery prize are 1 in 13. The odds are stacked against a woman succeeding (= it is not likely that a woman will succeed) in the business.\nThesaurus: synonyms, antonyms, and examples\nthe chance of something happeningchanceThere's a good chance he'll resign.probabilityWhat's the probability of winning?oddsWhat are the odds that she takes him back?likelihoodThe treaty increases the likelihood that the cease-fire will hold.possibilityThere's a distinct possibility I won't be able to make it to the pub tonight.\nSee more results »\nin gambling (= the activity of risking money guessing the result of something), a probability expressed as a number: The odds against my horse winning (= that it will not win)/on my horse winning (= that it will win) are a hundred to one. The odds that the US entrant will win the race are ten to one.\nMore examplesFewer examplesBookmakers are offering punters odds of 6-1 on the horse Red Devil winning the race.What are the odds on him winning the title for the third year running?The bookmakers aren't offering very good odds on a draw.The odds have shortened from 10-1 to 5-1.The odds against you winning such a competition are enormous.\nSMART Vocabulary: related words and phrases\nStatistics\nactuarial\nasymmetric\nbackground variable\ncategorical variable\ncentral tendency\ncontextual variable\nentropic\nentropically\nentropy\nGaussian distribution\nhomoscedasticity\nidentifiability\nmedian\nquantile\nresponse variable\nstandard deviation\nstat\nstatistic\nstatistically\nstochastic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPossible and probable\nGambling & bookmaking\nIdioms\nagainst (all) the odds/against all odds\nbe at odds\nmake no odds\nover the odds\nAdd to word list\nAdd to word list\nthe likelihood that a particular thing will or will not happen: She was sick yesterday, so the odds are she won’t be in today. Idiom\nat odds (with someone/something)\nAdd to word list\nAdd to word list\nthe odds of something happening are how probable it is that it will happen: the odds are against sth At the moment it seems the odds are against a deal.the odds are on sth/in sth's favour They are so evenly matched, the odds are on a draw.the odds are good/strong The odds are good that the country's transformation will proceed smoothly.good/better odds People retiring today have better odds than ever of living a long healthy life. the odds are slim/long Given the poor economic climate, the odds of success are slim.\nhow probable something is, expressed as a pair of numbers or a percentage, for example when betting : good/bad odds We think 6 to 2 are good odds.the odds are ... against/in favour of sth The odds are 100-1 against him getting the job.the odds of sth happening For taxpayers with incomes above $100,000 the odds of being audited in 2006 were 1 in 59.\nbe at odds (with sb/sth)\nto disagree with someone: She and her boss are at odds over the issue of training. On this issue, Britain is at odds with the rest of the EU.\nif two things are at odds, they are very different and cannot both be correct: These findings are at odds with our research. Management's and shareholders' interests seem to be at odds.\nagainst the odds/against all odds\nused to say that someone has achieved something or succeeded despite this being very unlikely: Against all odds, she won the case.\nthe odds are against sb/in sb's favour\nsomeone is unlikely/likely to succeed: In a case like this, the odds are against the defendant.\nover the odds UK informal\nmore than something is really worth: They paid way over the odds for their new offices."}