{"id":251697,"name":"odour","type":"noun","us_sound":"ˈoʊ.dɚ","us_link":"../audio/o/eus75160.mp3","uk_sound":"ˈəʊ.dər","uk_link":"../audio/o/ukodd__014.mp3","content":"odour noun [C or U]\n(smell)\nAdd to word list\nAdd to word list\nC2 a smell, often one that is unpleasant: Inside the room there was the unmistakable odour of sweaty feet. Aroma preference is largely influenced by our body odour. Synonyms\nniff UK informal\npong UK informal humorous\nreek informal\nstench\nstink informal\nThesaurus: synonyms, antonyms, and examples\na smellsmellWhat's that terrible smell?aromaThe delicious aroma of fresh bread wafted out of the bakery.fragranceI adore the delicate fragrance of roses.perfumeThe perfume of the flowers filled the room.scentShe smelled the sweet scent of the lilies.odourUK There was the unmistakable odour of sweaty feet.\nSee more results »\nMore examplesFewer examplesWe detected a faint diesel odour in the accommodation during our visit. She had smelt the stale odour of drink on her mother's breath.The room smelt stale and musty with the pungent odour of the fat tallow candles placed on the desk.\nSMART Vocabulary: related words and phrases\nSmells & smelling\nacridly\nanosmic\naromatic\nbergamot\ndeodorize\ndeodorizing\nfetid\nfragrant\nmalodorous\nminging\nodourless\npiny\npungency\npungently\nrankly\nredolence\nredolent\nscented\nsniff\nstink\nSee more results »\nodour noun [C or U]\n(quality)\nliterary a particular quality that can be noticed: The odour of hypocrisy hung about everything she said. Lieberman said the article had an odour of anti-Semitism.\nMore examplesFewer examplesHe has an odour of sanctity about him.There's something too worthy about them - an odour of the New Woman.This is one of the most vigorous and progressive corners of the labor movement - and yet it somehow carries the odour of a fading religious sect.\nSMART Vocabulary: related words and phrases\nConditions and characteristics\n-ance\n-ibility\nability\nadverse conditions\nage\nambience\nappearance\ncharacter\ngood/bad karma idiom\nhave it in you idiom\nhood\nhumanity\npresentation\nrespect\nshape\ntrait\ntrappings\nunaffiliated\nundercurrent\nvibe\nSee more results »"}