{"id":251829,"name":"of","type":"preposition","us_sound":"əv","us_link":"../audio/o/eus75163.mp3","uk_sound":"əv","uk_link":"../audio/o/ukodd__024.mp3","content":"of preposition\n(POSSESSION)\nAdd to word list\nAdd to word list\nA1 used to show possession, belonging, or origin: a friend of mine the president of the United States employees of the company the colour of his hair a habit of mine that revolting dog of hers the love of a good woman the complete plays of (= written by) Lorca\nMore examplesFewer examplesThose seats are reserved for senior members of the club.He was elected Member of Parliament for Rushcliffe.What's the name of that plant?Sean doesn't like the smell of garlic.Troops shot dead the leader of the rebels in an attack last night.\nSMART Vocabulary: related words and phrases\nBelongings and possessions\naccoutrements\nasset\nbelongings\ncapital assets\nchattel\neffect\nestate\nin the name of something idiom\nlost property\nlost property office\nlost-and-found\nmaterially\npersonal property\npersonalty\npossession\nproperty\nresource\nstuff\nswag\nthing\nSee more results »\nof preposition\n(AMOUNT)\nA1 used after words or phrases expressing amount, number, or a particular unit: a kilo of apples loads of food hundreds of people most of them none of them both of us a third of all people a speck of dust a drop of rain\nMore examplesFewer examplesDo all of us agree on the matter?He broke the world record by a tenth of a second.Some of the players are not performing as well as they could.I bought her a bunch of flowers for her birthday.She failed the exam because she got two of the questions wrong.\nSMART Vocabulary: related words and phrases\nGeneral words for size and amount\n-sized\namount\nbulk\ncontent\nelement\nextent\nfootprint\ngood things come in small packages idiom\nhaul\nlevel\nlot\nmeasure\nmuch\norder\npercent\nquantity\nquota\nration\nsmall-scale\nstrong\nSee more results »\nof preposition\n(CONTAINING)\nA1 containing: a bag of sweets a bottle of beer a book of short stories a class of idiots\nMore examplesFewer examplesI'll have a cup of coffee please.He gave two bags of old clothes to the charity shop.She smokes two packets of cigarettes a day.He dropped a jar of peanut butter onto the floor.The family looked through an album of old photographs.\nSMART Vocabulary: related words and phrases\nIncluding and containing\nabsorptive capacity\naccessibly\nall in\nassimilable\nassimilate\ncarry\nconcern\ndrag\ndraw\nEDI\nEDIB\nembody\nembracingly\nencompass\nincorporation\ninvolve\nnumber someone/something among someone/something\nO, o\npack something in\nplug\nSee more results »\nof preposition\n(POSITION)\nA2 used in expressions showing position: the top of his head the back of your dress on the corner of the street the front of the queue I've never been north of Philadelphia.\nMore examplesFewer examplesHe hit the ball over the top of the trees.They have recently painted the front of the house yellow.He built a shed at the bottom of the garden.The accident left him with a scar on the side of his face.Use the index in the back of the book.\nSMART Vocabulary: related words and phrases\nPlaces and locations\nanatopism\ncapital\ncoign of vantage\ncore\ndirection\ndrop-in\nfar from the madding crowd idiom\nhill\nmadding\nmakerspace\nMecca\nmulti-location\nmulti-site\nsituation\nspot\nstation\nstronghold\nsubsite\ntechnology park\nvenue\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDirection of motion\nof preposition\n(TYPICAL)\ntypical or characteristic of: She has the face of an angel. That guy's got the personality of a dead fish!\nMore examplesFewer examplesHe's got the mental age of a three-year-old.That was a stroke of genius.She has all the attributes of a great player.He has the patience of a saint.She plays the piano with the skill of a professional.\nSMART Vocabulary: related words and phrases\nTypifying, illustrating and exemplifying\nanalogy\narchetypal\narchetypically\nbe someone all over idiom\nbetoken\ncharacterize\ninstance\ninstantiate\nmirror\nMr\nMrs\nstereotype\nsum\nsum (something/someone) up\nsummation\nsymbolic\nsymbolization\nsymptom\nterritory\ntoken\nSee more results »\nof preposition\n(DAYS)\nA1 used to refer to a particular date in a month: the eleventh of March the first of the month\nMore examplesFewer examplesMy birthday's on the fifth of July.Today is the first of April.Employees get paid on the last day of each month.The book is published on the tenth of September.\nSMART Vocabulary: related words and phrases\nDays & times of day\nafternoon\nafternoons\nall day\nam\narvo\nhappy hour\nhigh noon\nhour\nin broad daylight idiom\nin the dead of night/winter idiom\nnocturnally\nnoon\nnoontime\no'clock\noffice hours\nthe witching hour\nwee small hours\nwhite night\nwine o'clock\nworkday\nSee more results »\nof preposition\n(MADE OF)\nmade or consisting of; having: dresses of lace and silk plates of gold and silver a land of ice and snow a woman of great charm a subject of very little interest\nMore examplesFewer examplesThe barman made a cocktail of vodka and fruit juices.He wore a coat of many colours.The car was a wreck of twisted metal after the collision.A feeling of great sadness came over him.The captain inspired a sense of pride in his team.\nSMART Vocabulary: related words and phrases\nComprising and consisting of\nbe\ncompose\ncomposition\ncompositional\ncompositionally\ncomprise\nconsist in something\nconsist of something\nconstituent\nconstitute\nconstitution\nconstitutive\nform\nfrom\nmake\nmake something up\nmulti-component\nYou can also find related words, phrases, and synonyms in the topics:\nHaving and owning - general words\nof preposition\n(WITH ADJECTIVES/VERBS)\nused to connect particular adjectives and verbs with nouns: fond of swimming sick of his excuses scared of spiders\nMore examplesFewer examplesI'm bored of this game.Paul is scared of heights.He's very sure of himself.He was wary of dogs since he was bitten as a child.I'm tired of your complaining.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words joining words or phrases with similar or related meanings\nand/or phrase\nanyhoo\nanyhow\nanyways\nconcatenate\nconjunctive\nconjunctively\nergo\nhereby\nI mean idiom\nless\nmean\nslash\nso\nthe thing is idiom\nthere\ntherefore\nthing\nwhat\nwith that idiom\nSee more results »\nof preposition\n(JUDGMENT)\nB2 used after an adjective when judging someone's behaviour: It was mean of you to mention her weight. Thank you so much for my present. How thoughtful of you.\nMore examplesFewer examplesIt was careless of him to leave the door open.It was sweet of her to tidy up afterwards.It was reckless of her not to take precautions.It was very heroic of him to dive into the cold water.They agreed that it was naughty of him not to have asked permission.\nSMART Vocabulary: related words and phrases\nJudgments and analyses\nanalysis\nanatomy\nappraisal\nappraisee\nassessment\ncognizable\nconstruction\nforensics\nimpact assessment\nimpact statement\ninterpretation\njob evaluation\nprognosticate\nprognostication\nrap\nrating\nre-evaluation\nre-review\nvalue judgment\nverdict\nSee more results »\nof preposition\n(RELATING TO)\nC1 about; relating to: Speaking of Elizabeth, here she is. One of the advantages of travelling by train is being able to read. Let us consider the events of the last five months. Of her childhood we know very little.formal And what of (= tell me about) young Adrian? How is he?\nMore examplesFewer examplesGood luck in the exam. I'll be thinking of you.He bought a map of the area so that he wouldn't get lost.Going to the gym is not my idea of fun.I think you've got the wrong impression of Tony.Andrew didn't think much of the film, but I liked it.\nSMART Vocabulary: related words and phrases\nRegarding and concerning\nabout\napply to\napropos\napropos of something\naround\nconnection\ncover\ndeal with someone\ndepartment\nhereof\nin respect of something idiom\nin the brain/looks department idiom\ninto\nrange\nsay\nsomething\nthereof\ntowards\nvis-à-vis\nwise\nSee more results »\nof preposition\n(THAT IS/ARE)\nthat is/are: the problem of homelessness a rise of two percent in inflation the skill of negotiating the difficulty of bringing up twins the pain of separation At the age of six she could read a newspaper.\nMore examplesFewer examplesIt was one of the advantages of being tall.The students didn't understand the aim of the exercise.He was taught the importance of wearing a helmet when cycling.What is the meaning of that symbol?He discovered the pleasure of gardening after he retired.\nSMART Vocabulary: related words and phrases\nExisting and being\naccount for something\nalive\nbe\nbe a thing idiom\nbeen\nestate\nexistentially\nextant\nfound\nhave legs idiom\nhood\nlie in\nliving\nrun\nspring up\nthey're\nthing\nthingness\nviability\nwe're\nSee more results »\nof preposition\n(DONE TO)\ndone to: the massacre of hundreds of innocent people the oppression of a nation the destruction of the rain forest\nMore examplesFewer examplesA crowd had gathered the watch the demolition of the building.The agreement marked the creation of a new state.The newspapers reported the sacking of the manager.The photos show the abuse of prisoners.We watched the changing of the guard at Buckingham Palace.\nSMART Vocabulary: related words and phrases\nActing and acts\n(your) every move idiom\n-ence\nact\nact for someone\nact/do something on your own responsibility idiom\nADL\nagency\nant\nbeat\ner\nexecution\nexploit\nmove\nput your money where your mouth is idiom\nresponsibility\nrole-play\nrot\nstep\nstuff\ntalk\nSee more results »\nof preposition\n(FELT BY)\nfelt or experienced by: the suffering of millions the anguish of the murdered child's parents\nMore examplesFewer examplesTo the delight of the supporters, the team equalized in the last minute.The joy of the new parents was obvious to everyone.The company's results confirmed the confidence of the board.The singer fell off stage, much to the amusement of the crowd.The teacher had earned the respect of the class.\nSMART Vocabulary: related words and phrases\nExperiencing and suffering\n(straight) from the horse's mouth idiom\nafflict\naffliction\nalmost/nearly die of something idiom\nbe a martyr to something idiom\nbe a victim of your own success idiom\nbear\ndepth\nget the short end of the stick idiom\ngo through\ngrip\nhands-on\nhit someone where they live idiom\nhorse\npractical\nrun up against something\nseat-of-the-pants\nsee life idiom\nstricken\ntaste\nSee more results »\nof preposition\n(THROUGH)\nB1 through; having as the cause: He died of cancer. I didn't have to go there - I did it of my own free will. I want to know how it happened because it certainly didn't happen of itself.\nMore examplesFewer examplesHe later died of his wounds.She went of her own accord. No one asked her to go.I'm tired of teaching. I'm going to look for a new job.You did that out of spite.He acted out of respect for his parents.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which introduce a cause or reason\nas\ncase\ncourtesy\ncuz\ndint\ndue\nexcept\nexcept that idiom\nherein\ninasmuch as\ninsofar as\nlight\nnecessarily\nnow\nsince\nthat\nthing\nview\nwhat\nwith a view to doing something idiom\nSee more results »\nof preposition\n(COMPARING)\nA2 used when comparing related things: I liked the green one best of all . Worst of all was the food! He's the best looking of the three brothers. I think that of all his books it's my favourite.\nMore examplesFewer examplesOf all the places we visited, New Zealand was the most amazing.Crete is the largest of the Greek islands.The Eiffel Tower is the most famous of all Paris's landmarks.In my opinion, it's the best of all the novels he's written.The blue whale is the largest of all the animals.\nSMART Vocabulary: related words and phrases\nComparing and contrasting\nanalogy\nantithesis\napple\nas against idiom\nbalance something against something\ncomparative\ncompetitive\ncompetitively\ncontradistinction\ncontrast\ncontrastive\nmeasure\nmutatis mutandis\nnext\nnonrelative\nperspective\nrelative\nrelativity\nshame\nstack\nSee more results »\nof preposition\n(TIME)\nUS used in saying what the time is: It's ten (minutes) of five (= ten minutes before five o'clock).\nMore examplesFewer examplesIt's twenty five of four.We got there at five of nine.\nSMART Vocabulary: related words and phrases\nDays & times of day\nafternoon\nafternoons\nall day\nam\narvo\nhappy hour\nhigh noon\nhour\nin broad daylight idiom\nin the dead of night/winter idiom\nnocturnally\nnoon\nnoontime\no'clock\noffice hours\nthe witching hour\nwee small hours\nwhite night\nwine o'clock\nworkday\nSee more results »\nof preposition\n(SEPARATE FROM)\nused in expressions showing distance from something in place or time: We live within a mile of the school. She came within two seconds of beating the world record.\nMore examplesFewer examplesThe firm is within a week of going bankrupt.Does she live within walking distance of her parents?The game was much enlivened when both teams scored within five minutes of each other.The city was within range of the enemy missiles.I came within an inch of losing my life on the rocks below.\nSMART Vocabulary: related words and phrases\nDistant in space and time\n(in) the middle of nowhere idiom\nafar\nafield\nall/the four corners of the world/earth idiom\nanywhere\nas far as the eye can/could see idiom\ndistance\neye\nfarthest\nfrom afar\nfurther\nfurthermost\nlight years away idiom\nmiddle\nremote\nremotely\nremoteness\nultra\nultra-distant\nwide\nSee more results »\nof preposition\n(LOSS)\nused in expressions showing loss: They were robbed of all their savings. I feel I've been deprived of your company.\nMore examplesFewer examplesThey robbed the company of £2 million.A last-minute injury robbed me of my place on the team.She was desolated at the loss of her sister.In hospital, she felt stripped of all her dignity.He was stripped of his knighthood after he was convicted of stealing from the company.\nSMART Vocabulary: related words and phrases\nTaking things away from someone or somewhere\nappropriate\nbear away\nconfiscate\nconfiscation\ncream something/someone off\ndebug\ndrain\nexpropriate\nexpropriation\nextractive\nget off\nimpound\nrelieve\nroot something/someone out\nrout someone out\nseize\nshelf\nstripping\nsuck\nsweep\nSee more results »\nof preposition\n(DURING)\nold-fashioned during: I like to relax with a pipe of an evening.\nSMART Vocabulary: related words and phrases\nSimultaneous and consecutive\naccompanied by someone/something\naccompaniment\naccompany\nall the while idiom\nalong\nfly\ngo along\nheavy rotation\nin parallel idiom\nin rotation idiom\nin tandem idiom\nminute\nprocess\nsimultaneously\nsimultaneousness\nsoon\nstep\nstraight\nsuccessive\nturn\nSee more results »\nGrammar\nOfOf is a preposition. …\nPossessive ’sWe use apostrophe s (’s), also called possessive ’s, as a determiner to show that something belongs to someone or something: …\nPossessives with ofWe can talk about possession using the pattern: noun phrase + of + possessive pronoun: …\n’s or of or either?There are some general rules about when to use ’s and when to use of but there are many cases where both are possible: …\nPossession: typical errorsWe don’t use ’s with plural nouns: …\nIdiom\nof all people/things/places\nof preposition\n(POSSESSION)\nAdd to word list\nAdd to word list\nused to show possession, belonging, or origin: She is a friend of mine. The color of his tie matches his suit. Have you read the novels of John Updike?\nof preposition\n(CONTAINING)\ncontaining or consisting of: a bag of groceries a book of short stories a forest of pine trees a bunch of grapes\nof preposition\n(AMOUNT)\nused after words or phrases expressing amount, number, or a particular unit: a drop of rain two pounds of potatoes hundreds of people\nof preposition\n(POSITION)\nused in expressions showing position: I left the book on top of my desk. I’ve never been north of Montreal.\nof preposition\n(RESULT)\nresulting from or having to do with: the joy of family the fear of failure\nof preposition\n(RELATING TO)\nabout, or relating to: Speaking of Elizabeth, here she is. There’s a chapter on the use of herbs for medicinal purposes.\nof preposition\n(CAUSED BY)\nused to show the cause of something: He died of a heart attack. Penny is frightened of spiders. I’m tired of all this criticism.\nof preposition\n(THAT IS/ARE)\nthat is/are: Sales tax of 7% is included in the price. She could read by the age of five.\nof preposition\n(COMPARING)\nused when comparing related things: He’s the oldest of three brothers. Of all his films, this one is my favorite.\nof preposition\n(DONE TO)\ndone to or involving: the destruction of the rain forests the graduation of the class of 2001\nof preposition\n(DISTANCE FROM)\nused in expressions showing distance from something in place or time: We live within a mile of the school. She came within two seconds of beating the world record.\nof preposition\n(TIME)\nused in saying what the time is: It’s ten (minutes) of five (= ten minutes before five o’clock).\nof preposition\n(DAYS)\nused to describe a particular day: the eleventh of March the first of the month"}