{"id":251833,"name":"off","type":"adverb","us_sound":"ɑːf","us_link":"../audio/o/eus75164.mp3","uk_sound":"ɒf","uk_link":"../audio/o/ukodd__025.mp3","content":"off adverb\n(AWAY FROM)\nAdd to word list\nAdd to word list\nB1 away from a place or position, especially the present place, position, or time: He drove off at the most incredible speed. Keep the dog on the lead or he'll just run off. Someone ran off with (= took) my pen. She's off to Canada next week. I saw her off (= said goodbye) at the station. Finals are so far off that I'm not even thinking about them yet.UK I'm off now - see you tomorrow.UK If we can get off (= leave) early tomorrow morning we'll avoid most of the traffic.\nMore examplesFewer examplesWhen we heard she'd got the job, we all went off for a celebratory drink.The horses set off at a canter.The dog trotted off to bury its bone.I'm jetting off to New Zealand next week.The gang drove off, with the police in hot pursuit.\nSMART Vocabulary: related words and phrases\nDistant in space and time\n(in) the middle of nowhere idiom\nafar\nafield\nall/the four corners of the world/earth idiom\nanywhere\nas far as the eye can/could see idiom\ndistance\neye\nfarthest\nfrom afar\nfurther\nfurthermost\nlight years away idiom\nmiddle\nremote\nremotely\nremoteness\nultra\nultra-distant\nwide\nSee more results »\noff adverb\n(REMOVED)\nA2 used with actions in which something is removed or removes itself from another thing: Take your jacket off. One of my buttons has come off. She had all her hair cut off.\nMore examplesFewer examplesTwo of his fingers were chopped off in the accident.I hope these bloodstains will clean off my shirt.Take your clothes off and get in the bath.He licked the chocolate off his fingers.The parcel had only been loosely wrapped, and the paper had come off.\nSMART Vocabulary: related words and phrases\nTaking things away from someone or somewhere\nappropriate\nbear away\nconfiscate\nconfiscation\ncream something/someone off\ndebug\ndrain\nexpropriate\nexpropriation\nextractive\nget off\nimpound\nrelieve\nroot something/someone out\nrout someone out\nseize\nshelf\nstripping\nsuck\nsweep\nSee more results »\noff adverb\n(NOT OPERATING)\nA2 (especially of machines, electrical devices, lights, etc.) not operating because of not being switched on: Make sure the computers are all off before you go home. Turn/Switch the light/engine/television off.\nMore examplesFewer examplesAt the top of the hill I switched off the engine and we just coasted down the other side.Switch off the electric current before touching that machine.I can turn the television off if you find it a distraction.Please turn mobile phones off in the library.This sort of heater turns off at the mains.\nSMART Vocabulary: related words and phrases\nMachines - not functioning\nact up\nbalky\nblooey\nbreak down\nbroken\nbrokenness\nbrownout\nburn out\ndowntime\nflat\nmalfunction\noutage\nseize up\nshort circuit\nshot\nshudder\nshut\nshut (something) down\nshut (something) off\nshutdown\nSee more results »\noff adverb\n(LESS MONEY)\nB1 (of money) taken away from the original price: You can get some money off if you pay cash. There's 40 percent off this week on all winter coats. There was $40 or $50 off most jackets in the store.\nMore examplesFewer examplesThis coupon allows you to claim 10% off all DVDs.I'll knock £20 off if you pay by cash.She asked for some money off because the book was slightly damaged.There's up to 50% off everything in our massive sale which starts next week.The card entitles you to 30% off all rail fares.\nSMART Vocabulary: related words and phrases\nPrice decreases\nbargain\nbear market\nbearish\nbearishly\ncloseout\nconcessional\ncouponer\ncouponing\ndeflate\ndeflation\ndepreciate\ndevalue\ndrop off\nfreeze\nknock off (something)\nmark something down\noverdiscount\npost-devaluation\nprojected value\nspiral\nSee more results »\noff adverb\n(NOT AT WORK)\nA2 not at work; at home or on holiday: I'm going to take/have some time off to work on my house. She was off sick last week. He's off at the moment - can I get him to call you back?\nMore examplesFewer examplesIf you can get some time off work, we could finish the decorating.I need to get it finished before Friday because I'm off next week.He asked the boss if he could have some time off.How much time do you get off?She's been off since Monday with a cold.\nSMART Vocabulary: related words and phrases\nTime off\nabsenteeism\nadministrative leave\nbank holiday\nBoxing Day\ncareer break\ncomp time\nescape\ngardening leave\nhartal\nhols\nlegal holiday\nmaternity leave\nnon-work\nparental leave\nshore leave\nsick\nsick day\nsick leave\nsickie\nskive\nSee more results »\noff adverb\n(SEPARATED)\nin such a way as to be separated: The police have shut/closed off all streets leading to the city. The area in the park where the kids play is fenced off for safety reasons.\nMore examplesFewer examplesThe pitch has been roped off to stop people from walking over it.They've cordoned off the whole area because of a suspected bomb.The scene of the crime has been closed off by the police.She marked off the amount of fabric she needed.An area of the factory has been sealed off while the asbestos is removed.\nSMART Vocabulary: related words and phrases\nSeparating and dividing\napheresis\natomize\nbifurcate\nbifurcation\nbisect\ndissociate\ndissociate yourself from something\ndissociation\ndisunion\ndisunite\nparcel something out\npartible\nperiodization\nperiodize\npolarize\nunbridgeable\nunforked\nunjoined\nuntangle\nwheat\nSee more results »\noff adverb\n(COMPLETELY)\nin such a way as to be completely absent, especially because of having been used or killed: It says on the bottle that it kills off all known germs. It'll take some time before she manages to pay off all her debts. The good thing about exercise is that it burns off calories. Between us we managed to finish off several bottles of wine.\nMore examplesFewer examplesHe could spar well enough but he couldn't seem to finish off his opponents.The decorating is as good as finished - I just need to finish off the painting.In a normal winter, the frost penetrates deeply enough to kill off insect eggs in the soil.Running is an excellent way to burn off excess calories.Things are back to normal now that we've paid off all our debts.\nSMART Vocabulary: related words and phrases\nUnavailable and inaccessible\nbooked up\nbusy\nbusy signal\ndiscontinued\nengaged\nimpenetrability\nimpenetrable\ninsusceptible\nirrecoverable\nirrecoverably\nlost\nout-of-pocket\npocket\nspoken for\ntie\ntie someone up\nunaccounted for\nunavailability\nunavailable\nunsusceptible\nSee more results »\noff adverb\n(GET RID OF)\nin such a way as to get rid of something: We went out for a while to walk off some of our dinner. He's gone to sleep off a headache. There's no point in getting upset about what he said - you just have to laugh it off.\nSMART Vocabulary: related words and phrases\nRemoving and getting rid of things\nabandonment\nbanish\nbe scattered to the four winds idiom\nbin\ncast someone/something aside/away/off\ndumping\nerase\nevacuate\nevacuation\nexorcism\nexpunge\nexpurgate\nshrug\nshrug something off\nshuck\nshuck something off\nshuffle something off\nsling\ntoss\nturf\nSee more results »\noff adverb\n(IN COMPETITION)\n(also -off) used to form nouns referring to a situation in which two or more people or teams compete against each other to see who is the winner: the BBC series, the Great British Bake Off Audience applause determines the winner of each dance-off.\nSMART Vocabulary: related words and phrases\nLinguistics: morphology & parts of words\n-athon\naffix\naffixation\nagglutinate\nagglutinative\nanalytic\nion\nism\nlibfix\nmonomorphemic\nmonosyllabic\nmorpheme\nmorphological\npolysyllabic\nsuffix\nsyllabify\nsynthetic\nthat'd\nthat'll\nthat's\nSee more results »\nIdioms\nbe/go off on one\noff with something\noff preposition\n(AWAY FROM)\nB1 down or away from a place, position, or time, especially the present place, position, or time: There was a \"Keep off the grass\" sign. All the berries had dropped off the tree. He fell off his bike. We're still a long way off our target of $30,000. I hope she knows where to get off (= leave) the bus/train. How far off finishing the project are we? (= How much more is there to do?)UK We've been working on the flat for six months now but we're still a long way off finishing.UK We're not far off (= we are quite near) London now.\nMore examplesFewer examplesI've gone off seafood after I was sick the last time I had it.She's much better now, and she's off the medication.I'm going off Richard. He's so arrogant these days!It was enough to make anyone go off fast food.I went off meat after I saw that documentary.\nSMART Vocabulary: related words and phrases\nMoving downwards\nbase jumping\ncascade\ndescend\ndive\ndownwardly\ndrop/fall/sink like a stone idiom\nfall\nfall down\nflop\ngo down\nparachute\npronate\npronation\nput\nput something/someone down\nrain (something) down\nset\nset something down\nspiral\ntouch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSpending time & time passing\nDistant in space and time\noff preposition\n(REMOVED)\nB1 used with actions in which something is removed or removes itself from another thing: I can't get the lid off this jar. Has anyone taken a book off my desk? Could you cut me a small piece off that big white cheese? Take your feet off that seat, young man! I don't like taking money off you (= asking you for money)! Get off me! (= Stop touching me!)not standard I got the knife off of him before he ran away.\nSMART Vocabulary: related words and phrases\nRemoving and extracting\nablate\nabstract\nabstraction\nbowdlerization\nbowdlerized\ndrain\nextraction\nfish something out\ngouge something out\ngrapeseed\nirremovable\nirremovably\nscoop\nslice\nslice something off\nsnowploughing\nsuck\nsuck someone/something dry idiom\ntake something away\nwipe\nSee more results »\noff preposition\n(NOT LIKING)\nnot liking or taking something or someone: He's been off his food ever since he had the stomach upset. She's well enough to be off the medicine now. She's been off drugs for a year now.UK The doctor says he can come off the tablets.UK I used to love coffee but I've gone off it (= stopped liking it) recently.\nSMART Vocabulary: related words and phrases\nNot liking\nabhor\nabide\nabominate\nanti-American\nanti-British\ncivil\ncup\ndeplore\ndespise\ndetest\ndisdain\ndisdainful\ngo off\nmisanthropic\nmisanthropically\nnon-fan\nnot be someone's cup of tea idiom\nnot go much on something idiom\nshy\ntire\nSee more results »\noff preposition\n(NEAR TO)\nB2 near to: He lives just off the main road. It's an island off the east coast of Spain.\nSMART Vocabulary: related words and phrases\nCloseness in distance and time\na hair's breadth idiom\na stone's throw idiom\nabout\nanywhere\nanywhere near idiom\napproachable\naround\nfloat\nfloat around\nhand to hand idiom\nhard by\nhere\nproximately\nproximity\nroof\nround the corner idiom\nshadow\nshout\nspit\nstep\nSee more results »\noff adjective\n(STOPPED)\nC2 [ after verb ] (of an arranged event) stopped or given up: The wedding's off - she's decided she's too young to settle down.informal It's all off (= the relationship is over) between Kim and Mike.\nThesaurus: synonyms, antonyms, and examples\nto cancel somethingcancelSorry, I have to cancel our plans tonight.call offThe game has been called off because of the weather.offThe meeting's off because James is ill.scrapWe've scrapped our plans for a trip to France.suspendThe ferry service has been suspended for the day because of bad weather.postponeWe've postponed the wedding until next year.\nSee more results »\nMore examplesFewer examplesThe game's off, due to a waterlogged pitch.Lack of interest led to the event being called off.The search for survivors has been called off.Tomorrow's game has been called off because of the bad weather.The search was called off for the sailors who disappeared in the storm.\nSMART Vocabulary: related words and phrases\nCancelling and interrupting\nadjourn\nadjourn to somewhere\narrest\ncall someone/something off\ncancellable\ndiversion\nhalt\nin midstream idiom\ninterrupt\nkick\nkick something into touch idiom\nrain\nscratch\nscrub\nshut\nshut (something) off\nsuspend\nsuspensive\ntake a break\nuncancelled\nSee more results »\noff adjective\n(PROVIDED FOR)\nhaving a particular amount or number, especially of money: Andrew must be so well-off (= rich) by now. I think they're fairly badly-off (= poor) now that David has lost his job.UK I'm quite well off for (= have a lot of) sweaters.UK How are you off for money? (= do you have enough?)\nSMART Vocabulary: related words and phrases\nRich and wealthy\nadvantaged\naffluence\nbankability\nbazillionaire\nbe rolling in it idiom\ncomfortably\nfat\nfilthy\nget-rich-quick\nMidas\nnot be short of a bob or two idiom\nprosperity\nself-supporting\nsit\nsolvent\nultra-rich\nwealthily\nwell endowed\nwell heeled\nwell off\nSee more results »\noff adjective\n(BELOW USUAL LEVEL)\nbelow the usual standard or rate: I'm having an off day today - I just can't seem to do anything right!\nSMART Vocabulary: related words and phrases\nQuite good, or not very good\nacceptable\nacceptably\nadequacy\nadequate\nadequately\nhalf decent\niffy\nimpure\nindifferent\nindifferently\npassably\npatchily\npatchiness\npatchy\npresentably\nspotty\nthe/your average bear idiom\nunspectacular\nup to scratch idiom\nweedy\nSee more results »\noff adjective\n(BAD)\nB2 [ after verb ] mainly UK (of food and drink) no longer fresh or good to eat or drink because of being too old: This milk smells off. I'd better eat this cheese before it goes off.\nMore examplesFewer examplesDo you think this meat is off?The milk has gone off because you left it out of the fridge.That bacon look off to me.The fruit will go off quickly if it's not stored at the right temperature.That cheesecake must have already been off when you bought it.\nSMART Vocabulary: related words and phrases\nNot pleasant to eat or drink\n(as) tough as old boots idiom\nbitter\nbitterness\nbland\nchewy\ndishwater\ninsipidly\ninsipidness\nlike dishwater idiom\nmouldy\noverripe\npungent\nstale\nstaleness\nstick to someone's ribs idiom\nstodginess\nstodgy\nunpalatable\nunripe\nwatery\nSee more results »\noff adjective\n(NO LONGER SERVED)\n[ after verb ] UK (of food in a restaurant) not available at that particular time: I'm sorry, sir, the salmon is off.\nSMART Vocabulary: related words and phrases\nFood - general words\naliment\nbed\nbowl of something\nbox scheme\ncarb\ndelicacy\nfarm box\nfast casual\nfast food\nfayre\nfood\ngrub\nmouthful\nnon-food\nnosh\nperishables\nportion\nproduce box\nsustenance\nwhole food\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnavailable and inaccessible\noff adjective\n(RUDE)\n[ after verb ] UK informal not thinking or worrying about other people's feelings; rude: He didn't even call her on her birthday - I thought that was a bit off.\nSMART Vocabulary: related words and phrases\nRude and cheeky\ncheekily\ncheekiness\ncheeky\nchurlishly\nchurlishness\ncoarsely\nfruity\ngall\ngraceless\nincivility\nindelicate\nobnoxiously\nobnoxiousness\noffensively\noffensiveness\npertly\npresume\nscatological\nunpleasant\nunprintable\nSee more results »\nthe off\nthe act of leaving somewhere: Are we ready for the off, then? from the off\nfrom the beginning, when someone first starts to do something or a process first starts: She and I got on well right from the off. I found the new car easy to drive from the off. From the off he had me convinced that I had no choice but to help him. Was he violent from the off, or was this just a moment of madness?\nSMART Vocabulary: related words and phrases\nArrivals and departures\nadmittance\nadvent\napproach\narr.\narrival\nbourne\ncheck\nconnection\ndeparture\ndescent\ndestination\nentry\neta\ngain admittance\ngoing\ninflux\ninvasion\nmisconnect\nmisconnection\noutflow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBeginnings and starts\nto kill someone: They offed him and dumped his body in the swamp.\nSMART Vocabulary: related words and phrases\nMurder & attempted murder\nasphyxiation\nassassinate\nassassination\nassassination attempt\nattempt\nbutcher\ndrive-by\ngenocidal\ngenocide\ngun someone down\nholocaust\nhomicide\npolish\npolish something off\npop off\nput someone to the sword idiom\nregicide\nslaughter\nsmother\nsnuff\nSee more results »\noff adjective, adverb [not gradable]\n(NOT OPERATING)\nAdd to word list\nAdd to word list\n(esp. of a machine, electrical device, light, etc.) not operating because it is not switched on: Was the computer on or off when you left? Turn the engine off.\noff adjective, adverb [not gradable]\n(NOT AT)\nnot at work or school, esp. being at home or on vacation: I’m going to take a week off to work on my house. I’m off next week. The kids get off early from school today. off duty\nTo be off duty is to not be working, usually because you have finished work for the day: She goes off duty at midnight. An off-duty police officer on his way home interrupted a crime in progress.\noff adjective, adverb [not gradable]\n(BELOW USUAL LEVEL)\nbelow the usual standard or rate: Sales have been off this month. He’s a good tennis player but had an off day and lost in straight sets. They took 10% off (= below the usual price) because I paid in cash.\noff adjective, adverb [not gradable]\n(STOPPED)\n(of an arranged event) stopped or given up in advance: Last night’s baseball game was called off because of rain. Idioms\noff balance\noff the beaten path\noff preposition, adjective, adverb [not gradable]\n(AWAY FROM)\naway from a place or position, esp. the present place or position: He drove off at high speed. She’s off to Canada next week. The sign says, \"Keep off the grass.\"\noff preposition, adverb [not gradable]\n(REMOVED)\nused with actions in which something is removed or removes itself from another thing: I think I’ll take my jacket off. I can’t get the lid off this jar. He fell off his bike. Did you leave the phone off the hook (= not put back in such a way that a call is ended)?\noff preposition, adverb [not gradable]\n(FAR AWAY)\nfar away in time or space: Graduation is still a long way off. That’s not the right answer, but you’re not far off.\noff preposition\n(NEAR TO)\nnear to: The island is just off the coast of Florida.\noff adverb [not gradable]\n(TAKEN AWAY)\nin such a way as to be taken away or removed, esp. because of having been used or killed: to pay off debts Exercise burns off fat. They were all killed off by disease.\noff adverb [not gradable]\n(CLOSED)\nin such a way as to be separated: to mark off 10 feet The children’s play area is fenced off for safety reasons."}