{"id":251877,"name":"offered","type":"verb","us_sound":"ˈɑː.fɚ","us_link":"../audio/o/eus75171.mp3","uk_sound":"ˈɒf.ər","uk_link":"../audio/o/ukoffen005.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\noffer\noffer verb\n(AGREE TO GIVE)\nA2 [ I or T ] to ask someone if they would like to have something or if they would like you to do something: [ + two objects ] I feel bad that I didn't offer them any food/offer any food to them. She was offered a job in Paris. Can I offer you (= would you like) a drink? \"Would you sell me that painting?\" \"What are you offering (= what will you pay) for it?\" [ + to infinitive ] My father offered to take us to the airport. [ + speech ] \"I'll do the cooking,\" he offered.\n[ T ] (also offer up) to say a prayer or make a sacrifice (= an act of killing or giving up something) to a god: Dear Lord, we offer up our prayers...\nMore examplesFewer examplesDon't offer him a cigarette, he's trying to give up.He flashed a smile and offered to buy me a drink.It wasn't me who offered to go, it was Charlotte.\"Would you sell me that painting?\" \"What are you offering for it?\"You can't offer such a low salary to someone who is so highly skilled - it's insulting.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\nafford\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReligious ceremonies & prayers\noffer verb\n(PROVIDE)\nB1 [ T ] to provide or supply something: It's an organization that offers free legal advice to people on low incomes. It says in the guide that this area offers some of the best walks in England. [ + two objects ] We are now offering you the chance to buy the complete set of pans at half price. Did he offer any explanation for his strange behaviour? It doesn't have much to offer as a town - its shops are fairly poor and there's only one cinema.\nThesaurus: synonyms, antonyms, and examples\nto give something to someonegiveGive me that dirty plate.offerYour doctor should be able to offer advice.provideThis booklet provides useful information about local services.supplyThe lake supplies the whole town with water.donateFour hundred dollars has been donated to the school book fund.\nSee more results »\nMore examplesFewer examplesWhat childcare facilities does your company offer?The car offers value for money, comfort and dependability.Their flimsy tent offered little protection against the severe storm.The major banks are offering cashback deals of up to £5000 on their mortgages.In medieval times the sapphire was believed to offer protection to its wearer.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\nafford\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nSee more results »\nGrammar\nOffersWhen we offer, we ask someone if they would like to have something or if they would like us to do something for them. We usually say yes, please or no, thanks when we reply to offers. …"}