{"id":251875,"name":"offer","type":"verb","us_sound":"ˈɑː.fɚ","us_link":"../audio/o/eus75171.mp3","uk_sound":"ˈɒf.ər","uk_link":"../audio/o/ukoffen005.mp3","content":"offer verb\n(AGREE TO GIVE)\nAdd to word list\nAdd to word list\nA2 [ I or T ] to ask someone if they would like to have something or if they would like you to do something: [ + two objects ] I feel bad that I didn't offer them any food/offer any food to them. She was offered a job in Paris. Can I offer you (= would you like) a drink? \"Would you sell me that painting?\" \"What are you offering (= what will you pay) for it?\" [ + to infinitive ] My father offered to take us to the airport. [ + speech ] \"I'll do the cooking,\" he offered.\n[ T ] (also offer up) to say a prayer or make a sacrifice (= an act of killing or giving up something) to a god: Dear Lord, we offer up our prayers...\nMore examplesFewer examplesDon't offer him a cigarette, he's trying to give up.He flashed a smile and offered to buy me a drink.It wasn't me who offered to go, it was Charlotte.\"Would you sell me that painting?\" \"What are you offering for it?\"You can't offer such a low salary to someone who is so highly skilled - it's insulting.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\nafford\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReligious ceremonies & prayers\noffer verb\n(PROVIDE)\nB1 [ T ] to provide or supply something: It's an organization that offers free legal advice to people on low incomes. It says in the guide that this area offers some of the best walks in England. [ + two objects ] We are now offering you the chance to buy the complete set of pans at half price. Did he offer any explanation for his strange behaviour? It doesn't have much to offer as a town - its shops are fairly poor and there's only one cinema.\nThesaurus: synonyms, antonyms, and examples\nto give something to someonegiveGive me that dirty plate.offerYour doctor should be able to offer advice.provideThis booklet provides useful information about local services.supplyThe lake supplies the whole town with water.donateFour hundred dollars has been donated to the school book fund.\nSee more results »\nMore examplesFewer examplesWhat childcare facilities does your company offer?The car offers value for money, comfort and dependability.Their flimsy tent offered little protection against the severe storm.The major banks are offering cashback deals of up to £5000 on their mortgages.In medieval times the sapphire was believed to offer protection to its wearer.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\nafford\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nSee more results »\nGrammar\nOffersWhen we offer, we ask someone if they would like to have something or if they would like us to do something for them. We usually say yes, please or no, thanks when we reply to offers. …\nA2 the act of asking if someone would like to have something or if they would like you to do something: \"If you like I can help out.\" \"That's a very kind offer.\" I must say the offer of two weeks in Hawaii is very tempting.informal One day I'll take you up on (= accept) that offer. make an offer C2 (also put in an offer)\nto say officially that you would like to buy something, especially a house, at a particular price: They were asking €180,000 for the apartment, so I put in an offer of €170,000.\nSee more\nB1 a reduction in the usual price of sth, usually for a short period: Don't miss out on our latest offer. on offer B2\navailable to be bought or used: We were amazed at the range of products on offer.\nSee more on (special) offer B1 UK\nIf goods in a shop are on (special) offer, they are being sold at a lower price than usual: Strawberries were on special offer today so I bought loads of them.\nSee more under offer UK\nIf a house is under offer, someone has already suggested a particular price at which they would be willing to buy it: Two of the houses had already sold and a third was under offer.\nSee more\nMore examplesFewer examplesWe will send you written confirmation of our offer shortly.This offer is available exclusively to our established customers.She was lured into the job by the offer of a high salary.The company has been pursuing Holton for some time, but so far he has rejected all their offers.A majority of staff voted to accept the offer of an 8% pay rise.\nSMART Vocabulary: related words and phrases\nSuggestions & proposals\nabout\napproach\nbounce something off someone\ncan't\nco-sponsor\nco-sponsorship\ndrop\nif you take my meaning idiom\nimplication\nmake noises idiom\nmaybe\nmover\nnod\nnomination\nput ideas into someone's head idiom\nput someone to something idiom\nput something in\nput something up\nput something/someone forward\nsuggest\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrice decreases\nGrammar\nOffersWhen we offer, we ask someone if they would like to have something or if they would like us to do something for them. We usually say yes, please or no, thanks when we reply to offers. …\noffer verb\n(AGREE TO GIVE)\nAdd to word list\nAdd to word list\n[ I/T ] to ask someone if he or she would like to have something or would like you to do something: [ T ] She was offered a new job. [ T ] Can I offer you (= Would you like) something to drink? [ I ] My father offered to take us to the airport.\noffer verb\n(PROVIDE)\n[ T ] to provide or supply something: The organization offers free legal advice to low-income people. He offered excuses but no real explanation.\nAdd to word list\nAdd to word list\nto ask someone if they would like to have something or if they would like you to do something: offer sb sth They offered me a key role on the project.offer sb a job/promotion She was offered a job in Singapore but turned it down.offer sb a chance/opportunity The cable provider offers advertisers the chance to buy ads that run only in specific neighborhoods.offer sth to sb The airline company offers cheap flights to airline staff.offer to do sth Some grain dealers were offering to buy cash grain from farmers, but only at a discount.\nto provide or supply a product or service: offer sb sth The package promises to offer customers even cheaper financial services. We have decided to offer free trials with retailers. The package offers 11 nights in Kenya from $1569 per person.\nto say that you will pay a particular amount of money for something: offer $20/£200/$2 million, etc. for sth All three prospective bidders have indicated that they would offer about $1.1 billion for the company.offer sb sth He offered me lots of money for my car.\nFINANCE to make shares, etc. available for sale: They are offering 6.4 million shares with an estimated price range of $10-12.\nto provide or have particular features or advantages: Future generations of products may offer improved price or performance features. The group expects the new devices to be offered as standard equipment on vehicles.\na situation in which someone asks if you would like to have something or if you would like them to do something: make (sb) an offer The company made me a job offer and I accepted it.take up/agree to/accept an offer I took up his offer of help with my presentation. reject/turn down/refuse an offer receive/get/have an offeran offer to do sth He refused all offers to negotiate. an offer of employment/work/a job\nan amount of money that someone is willing to pay for something: make (sb) an offer A Japanese investment bank has already made an offer for the company.an offer for sth They are considering a $519m offer for the business.an offer of sth She turned down an offer of $2,000 a week to organize the conference. accept/consider/get an offer decline/turn down/refuse an offer The board agreed the terms of a recommended cash offer of 42p per share. They have indicated that if they had a good offer for their assets they would sell them. I'll give you $50, and that's my final offer.\nPROPERTY an occasion when someone says they would like to buy a property at a particular price: We were ready to complete the deal when the seller got another, higher offer.make/put in an offer on sth They made an offer on a house downtown. Several people have viewed the property, but no-one has put in an offer.\nFINANCE an occasion when a company makes new shares available for sale, or the number of shares offered : The $22.50-a-share offer to ADT shareholders is 12% more than ADT's closing price yesterday.\nMARKETING a reduction in the usual price of something, usually just for a short period of time: a bargain/introductory offer This superb offer is available for a minimum two-night stay until April 2.\non offer\navailable to be bought, used, etc.: The free savers' guide gives details of all of the different types of accounts on offer.\non (special) offer especially UK\nCOMMERCE if goods in a store are on offer, they are being sold at a lower price than usual: Everything in the store is on offer for this week only.\nopen to offers\nwilling to consider different amounts of money or other things that people are offering you: The agents say they are open to offers, but would expect the site to achieve a price in the region of $7 million. She is open to offers and has had several approaches from firms looking for sales managers.\nunder offer UK\nPROPERTY if a house is under offer, someone has already stated that they would like to buy it at a particular price: The estate agent told me the property was already under offer, and that my viewing had been cancelled. See also\ncounter-offer\nexchange offer\nfirm offer\nfree offer\ngeneral offer\ninitial offer\ninitial public offer\nmandatory general offer\nopen offer\nself-tender\nView all\nsettlement offer\nshare exchange offer\nshare offer\nspecial offer\ntakeover bid\ntender offer\ntrial offer\nunsolicited offer"}