{"id":251846,"name":"offence","type":"noun","us_sound":"əˈfens","us_link":"../audio/o/eus75167.mp3","uk_sound":"əˈfens","uk_link":"../audio/o/ukodd__028.mp3","content":"offence noun\n(CRIME)\nAdd to word list\nAdd to word list\nB2 [ C ] an illegal act; a crime: a serious/minor offence a criminal/drink-driving offence Driving without a licence is an offence. He committed several serious offences. It's the third time that he's been convicted of a drug offence.\nMore examplesFewer examplesThe soldier received a dishonourable discharge for a disciplinary offence.It's an offence to park on double yellow lines.This was the defendant's third court appearance for the same offence.He has a long record of previous convictions for similar offences.She was yesterday bailed for three weeks on drink-driving offences.\nSMART Vocabulary: related words and phrases\nCrime - general words\nanti-crime\nanti-fraud\nanti-narcotics\narrestable\ncaper\ncarrying-on\ndelinquent\ndelinquently\ndriving under the influence\nDUI\nfelonious\nfeloniously\nillegality\noutrage\npetty crime\nprotection racket\nrap sheet\nsecond-degree\nwrongdoing\nzero tolerance\nSee more results »\noffence noun\n(UPSET FEELINGS)\nB2 [ U ] upset and hurt or annoyed feelings, often because someone has been rude or shown no respect: I really didn't mean (to cause/give) any offence (= did not intend to upset anyone) - I was just stating my opinion. Do you think he took offence (= was upset) at what I said about his hair? no offence (intended)\nused when you say something that might upset or annoy someone : No offence, but I find your sister a little rude. If you don't mind, I'd rather go on my own - no offence intended, but I think it would be better.\nMore examplesFewer examplesSometimes taboo words are written with asterisks to avoid causing offence.She takes offence too easily.His remarks caused widespread offence.She took offence when I offered to pay.The last thing I want to do is cause offence to your mother.\nSMART Vocabulary: related words and phrases\nMaking people sad, shocked and upset\naback\namiss\nappal\nbe laughing on the other side of your face idiom\nbite\nbum\nget to\ngnaw\nhaunt\nheartbreaker\nheartbreakingly\nnerve\nsensitivity\nshake someone out of something\nshake someone up\nshake/rock something to its foundations idiom\nshattering\nshatteringly\ntear\ntoxic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPolite expressions\noffence noun\n(SCORING POINTS)\n[ U or C ] US us/ˈɑː.fens/ the part of a game such as American football that involves trying to score points, or the players who try to score points\nSMART Vocabulary: related words and phrases\nWinning, losing & scoring in sport\naet\nagainst the run of play idiom\nbag\nblow someone away\nboss\nbreak your duck idiom\nclose-run\nconcede\nequalizer\ngolden goal\npull\npull back\nreel something off\nrelegation zone\nromp\nrun away with someone\nscore\nstraight\nstrike\ntreble\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCompetitors & participants in sports & games\nGeneral terms used in ball sports\nAmerican football\nAdd to word list\nAdd to word list\n[ C ]\n&#160; LAW an illegal act or crime: It is a criminal offence to mislead customers about the price of an item. a serious/major/minor offencebe/become an offence It became an offence for British citizens to offer bribes for business contracts anywhere in the world.commit an offence In practising as a solicitor without being duly qualified, he committed an offence.be accused of/found guilty of/convicted of an offence She was convicted of drug offences.\n[ U ] feelings of being upset and angry, often because someone has been rude: This advertisement may cause offence in some markets. She took offence at the way the assistant spoke to her.\na sackable/sacking offence UK ( US a firing offense)\nHR a wrong action that you can lose your job for: Drinking alcohol while on duty is a sackable offence."}