{"id":251872,"name":"offensively","type":"adverb","us_sound":"əˈfen.sɪv.li","us_link":"../audio/o/usoctog020.mp3","uk_sound":"əˈfen.sɪv.li","uk_link":"../audio/o/ukoffen003.mp3","content":"offensively adverb\n(IN A WAY THAT UPSETS SOMEONE)\nAdd to word list\nAdd to word list\nin a way that is likely to upset, annoy, or embarrass someone: His comments were offensively patronizing.\nMore examplesFewer examplesComments that are written offensively or disrespectfully will be deleted. I don't mean this offensively, but while I see your profile as \"good\" I wouldn't rate it as \"excellent\".The reality is that someone behaved badly or offensively.It is offensively presumptuous that you claim I have a disregard for human life.\nSMART Vocabulary: related words and phrases\nRude and cheeky\ncheekily\ncheekiness\nchurlishly\nchurlishness\ncoarse\ncoarsely\nfruity\ngall\ngraceless\nincivility\nobnoxiously\nobnoxiousness\noffensiveness\npertly\npotty mouth\npresume\nscatological\nunpleasant\nunprintable\nunrepeatable\nSee more results »\noffensively adverb\n(IN SPORT)\nin a way that relates to getting points in a sport, rather than stopping the other player or team getting points: Joey's got more ability than both of those guys offensively. Opposite\ndefensively\nMore examplesFewer examplesDockery is a very good defender, but Nelson is better offensively.Campanella helped his team win by performing offensively and defensively. Offensively, it took our men a little while to break down the high-quality pitching.\nSMART Vocabulary: related words and phrases\nWinning, losing & scoring in sport\naet\nagainst the run of play idiom\nbag\nblow someone away\nboss\nbreak your duck idiom\nclose-run\nconcede\nequalizer\ngolden goal\npull\npull back\nreel something off\nrelegation zone\nromp\nrun away with someone\nscore\nstraight\nstrike\ntreble\nSee more results »\noffensively adverb\n(ATTACK)\nin a way that relates to attacking someone or something: The weapon had been used offensively. Opposite\ndefensively\nMore examplesFewer examplesThey have to prove the defendant used a deadly weapon or an object which when used offensively against a person would result in serious bodily injury.International law says territory cannot be acquired by force, whether defensively or offensively applied.Like most government agencies with shrinking budgets, the health department finds itself reacting defensively rather than offensively.Could the missile-defence system be used offensively against military assets?\nSMART Vocabulary: related words and phrases\nArms & munitions in general\nair-to-air\nair-to-ground\nammo\nammunition\nanti-aircraft\ncatapult\nchain mail\nchemical weapon\nconventional\ndenuclearize\ngunship\nmustard gas\nnerve gas\nordnance\npoison gas\nsarin\nstab vest\nstealth\nweapons of mass destruction\nWMDs\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nViolent or aggressive\nSee\noffensive"}