{"id":251902,"name":"officer","type":"noun","us_sound":"ˈɑː.fɪ.sɚ","us_link":"../audio/o/eus75173.mp3","uk_sound":"ˈɒf.ɪ.sər","uk_link":"../audio/o/ukoffen011.mp3","content":"Add to word list\nAdd to word list\nB2 a person in the armed forces who has a position of authority: a naval officer a top-ranking officer\nB1 a person who has a position of authority in an organization: a careers/customs/personnel officer\nB1 a member of the police force: Two officers responded to the call at 282 Main Street. Officer Clarke [ as form of address ] \"Do you know how fast you were driving, ma'am?\" \"No, officer.\"\nMore examplesFewer examplesThe officer commanded his men to shoot.Inasmuch as you are their commanding officer, you are responsible for the behaviour of these men.The police have appointed a liaison officer to work with the local community.Every available officer will be assigned to the investigation.There was a record number of confiscations by customs officers last year.\nSMART Vocabulary: related words and phrases\nGeneral ranks in the armed forces\nADC\nadjutant\naide-de-camp\nartificer\nbombardier\nC-in-C\ncaptain\ncommandant\ncommander-in-chief\ncommissioned\ncommissioned officer\nfive-star\nflash\nLt\nmarshal\nNCO\nnon-commissioned\nnon-commissioned officer\nquartermaster\nranking\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople in charge of or controlling other people\nPeople who work for the police service\nofficer noun [C]\n(RESPONSIBILITY)\nAdd to word list\nAdd to word list\na person in the armed forces who has a position of authority: Mike’s father was an officer in the US Marines.\nAn officer is also a member of a police force.\nofficer noun [C]\n(WORK PLACE)\na person who has an important job in a company: the chief financial officer\nAdd to word list\nAdd to word list\nHR, WORKPLACE a person who has a position of authority in an organization. The word is often used in job titles: He joined the company in July as chief operating officer. a personnel officer There follows a list of the Board of Directors and officers of the company. See also\ncareers officer\nchief executive officer\nchief financial officer\nchief information officer\nchief operating officer\nchief technology officer\ncompany officer\ncompliance officer\nenvironmental health officer\nfire safety officer\nknowledge officer\npress officer\nprocurement officer\npublic relations officer"}