{"id":251925,"name":"officially","type":"adverb","us_sound":"əˈfɪʃ.əl.i","us_link":"../audio/o/officially.mp3","uk_sound":"əˈfɪʃ.əl.i","uk_link":"../audio/o/ukoffen015.mp3","content":"Add to word list\nAdd to word list\nC1 formally and in a way agreed to or arranged by people in positions of authority: The royal engagement was announced officially this morning.\nas stated or accepted by people publicly but not privately or as things really are: Well, officially I am on holiday this week, but I'm just catching up on some reports I have to finish.\nin or relating to a position of responsibility that you hold: He has not visited the country officially since his election, only in a private capacity.\nMore examplesFewer examplesShe is expected to announce officially her candidacy for president early next week.The new hospital will be officially opened by the mayor on Tuesday.Although she's not officially our boss, she's in effective control of the office.They officially designated the area (as) unsuitable for human habitation.An elderly man from Hull has confounded doctors by recovering after he was officially declared dead.\nSMART Vocabulary: related words and phrases\nOrganizations - position & status\nambassador\nanti-elite\nanti-elitist\napparatchik\nback seat\nbrother\ncounterpart\nfish\ngrassroots\nhigh-ranking\nopposite number\nrank\nreach\nspokeswoman\nsuper-elite\nsuperboard\nsuperiority\nsuperordinate\nthane\ntitularly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTrue, real, false, and unreal\nInternational relations: diplomacy & mediation\nRuling & governing\nAdd to word list\nAdd to word list\nformally and in a way that is agreed to and arranged by people in positions of authority: The proposed merger was announced officially by the CEO today.\nas stated or accepted by people publicly, although it may not be true: Officially he's in charge but in fact his deputy makes most of the decisions.\nrelating to a position of responsibility: She has been asked to represent the department officially."}