{"id":251914,"name":"official","type":"adjective","us_sound":"əˈfɪʃ.əl","us_link":"../audio/o/eus75174.mp3","uk_sound":"əˈfɪʃ.əl","uk_link":"../audio/o/ukoffen012.mp3","content":"Add to word list\nAdd to word list\nC2 relating to a position of responsibility: He visited China in his official capacity as America's trade representative. Number Ten Downing Street is the British prime minister's official residence. Opposite\nunofficial\nB2 agreed to or arranged by people in positions of authority: the official photos of the president's tour of India The Queen will attend the official opening of the theatre in June. There is to be an official inquiry into the incident.\nC2 If a piece of information is official, it has been announced publicly with authority: Their engagement is now official. Inflation has fallen below two percent, and that's official.\nAn official language is one that is used by the government of a country when making its laws, in official documents, etc.: Arabic is the official language of about 20 countries. There was a vote on which language should become the official one.\nMore examplesFewer examplesBefore buying a pram, make sure that it conforms to the official safety standards.The president's official visit marks the start of a more fraternal relationship between the two countries.The rebels regard the official parliament as illegitimate.Several eyewitnesses' accounts differed considerably from the official version of events.The remit of this official inquiry is to investigate the reasons for the accident.\nSMART Vocabulary: related words and phrases\nOrganizations - position & status\nambassador\nanti-elite\nanti-elitist\napparatchik\nback seat\nbrother\ncounterpart\nfish\ngrassroots\nhigh-ranking\nopposite number\nrank\nseat\nspokeswoman\nsuper-elite\nsuperboard\nsuperiority\nsuperordinate\nthane\ntitularly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnnouncing, informing & stating\nRuling & governing\nC2 a person who has a position of responsibility in an organization: a government/trade-union/council official Synonym\nfunctionary formal\nMore examplesFewer examplesThe whole system was corrupt - every official she approached wanted money before helping her.An official from the Department of Health will be inspecting the restaurant this afternoon.The customs official beckoned the woman to his counter.The information was given by a Vatican official.Senior government officials will be attending a meeting tomorrow.\nSMART Vocabulary: related words and phrases\nPeople in charge of or controlling other people\nacephalous\nadministrator\nanti-management\nauthority\nbureaucrat\ncontroller\ncouncil\ncounter-power\ndean\ndeputy\nmanipulator\nmistress\nmovers and shakers\nmulti-headed\nofficer\ntsar\nvice presidency\nvice president\nvicegerency\nvicegerent\nSee more results »\nAdd to word list\nAdd to word list\na person who has a position of responsibility in an organization: a senior official\nconnected with or arranged by someone in a position of responsibility: an official announcement officially adverb us\nYour browser doesn't support HTML5 audio\n/əˈfɪʃ·ə·li/\nThe name of the new director will be officially announced in June.\nAdd to word list\nAdd to word list\nagreed to or arranged by people in positions of authority: The trust is expected to receive official permission to sell its shares. We obtained official documents that were necessary to start the work. An official inquiry is currently investigating some of the most serious allegations.\nused to describe something that has been announced publicly by someone in a position of authority: So far, there has been no official announcement from the company.\nrelated to your work rather than your personal life: He was acting in his official capacity. Even on official business they still find time for a little tourism. I accompanied the minister on his official visit to Prague.\nrelating to a position of responsibility: They chose him as their official representative in the talks with the management.\na person who has a position of responsibility in an organization: a trade union/government official"}