{"id":251973,"name":"offset","type":"verb","us_sound":"ˌɑːfˈset","us_link":"../audio/o/eus75177.mp3","uk_sound":"ˌɒfˈset","uk_link":"../audio/o/ukoffen024.mp3","content":"Add to word list\nAdd to word list\nC2 to balance one influence against an opposing influence, so that there is no great difference as a result: The extra cost of travelling to work is offset by the lower price of houses here.UK He keeps his petrol receipts because petrol is one of the expenses that he can offset against tax (= can show to the government as being a business cost, and so not pay tax).\nenvironment to pay for things that will reduce carbon dioxide in order to reduce the damage caused by carbon dioxide that you produce: We offset all our long-haul flights.\nSMART Vocabulary: related words and phrases\nBalance and imbalance\naccord with something\nalign\naxisymmetric\nbalance (something) out/up\nbalance of power\nharmonization\nharmonize\nharmony\nimbalance\nin accord with someone/something\nnon-symmetrical\nnonequilibrium\noff balance\non an even keel idiom\none man's loss is another man's gain idiom\ntrade something off\nunbalance\nunharmonious\nwell balanced\nwell rounded\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnvironmental issues\nAdd to word list\nAdd to word list\nto balance one influence against an opposing influence so that no great difference results: The extra cost of commuting to work from the suburbs is offset by cheaper rents.\nAdd to word list\nAdd to word list\nto balance one effect against an opposing effect, so that there is no great difference as a result: The price of petrol products was offset by a decline in motor vehicle prices.offset sth against sth Offset any losses against your overall income.\nENVIRONMENT, SOCIAL RESPONSIBILITY to pay an amount of money when you do something, for example travelling by air, that produces a lot of harmful waste products. The money is used to do something that protects against climate change, such as planting trees: When we are forced to travel by air, we always check the box to choose to offset our flights.\n[ U ]\n&#160; LAW, FINANCE the right to pay a person or organization less money than you owe them because they also owe you money: What is the position regarding the offset of one debt against the other?\n[ C ]\n&#160; ACCOUNTING a payment that is used to reduce the effect of another payment: The Australian government has announced changes to its tax offset rules for overseas production.\n[ C or U ]\n&#160; ENVIRONMENT, SOCIAL RESPONSIBILITY a payment that is made or an action that is done in order to pay for or reduce the harmful effect that something has on the environment: carbon offset You have the opportunity to purchase an offset when you book your flights."}