{"id":252065,"name":"oh","type":"exclamation","us_sound":"oʊ","us_link":"../audio/o/eus75076.mp3","uk_sound":"əʊ","uk_link":"../audio/o/uknutra027.mp3","content":"Add to word list\nAdd to word list\nA1 used to express different emotions, such as surprise, disappointment, and pleasure, often as a reaction to something someone has said: \"He's been married three times.\" \"Oh, really? I didn't know that!\" \"I'm sorry I can't come to the party.\" \" Oh, too bad!\" Is that for me? Oh, that's so sweet! \"I'm sorry I forgot to call you.\" \"Oh, don't worry.\"\nA1 introduces an idea that you have just thought of, or something that you have just remembered: Oh, I've just thought of a problem. Oh, and don't forget to lock the back door.\nA1 used with other expressions of disappointment, sadness, anger, etc.: Oh dear, what a mess! Oh no, I left my umbrella behind!\nMore examplesFewer examplesMy, oh, my, what a busy day!Did you hear what happened to Anna yesterday - oh, speak of the devil, here she is.I really didn't want to go away this weekend but, oh well, it can't be helped.You won't catch Carla eating in a cheap restaurant, oh no.What was I talking about - oh yes, I was telling you what happened at the party.\nSMART Vocabulary: related words and phrases\nLinguistics: sounds used as interjections\naha\nahem\nbah\nbam\nblah\nblah, blah, blah\ncor\nduh\nhuh\now\npooh\npsst\nshh\nsquee\nuh-huh\nvocable\nvroom\nwham\nwhee\nwhew\nSee more results »\nGrammar\nOh …\nOh as an interjectionWe use oh as an interjection to express surprise or disappointment: …\nOh as a discourse markerWe use oh as a discourse marker to respond to new information or to show that we have just discovered something surprising. We often use it with other discourse markers: …\nsometimes used in writing for the number zero: My phone number is five, double oh, seven, six, six.\nSMART Vocabulary: related words and phrases\nNumbers: cardinal, including nought & zero\nB, b\nbi\ncipher\ndeca-\nduodecillion\nfifteen\nforty\ngoogol\njillion\nkazillion\nnaught\nnineteen\nsix\nsixty\nten\nthirteen\nthirty\nunit\nzero\nzillion\nSee more results »\nwritten abbreviation for the US state of Ohio: used in addresses\nSMART Vocabulary: related words and phrases\nTowns & regions: named regions of countries\nAberdeen City\nAberdeenshire\nAffrilachian\nAK\nAL\nEnglish Canadian\nEssex\nfife\nfl.\nMississippian\nMissouri\nMissourian\nMN\nMonmouthshire\nStaffordshire\nStirling\nStirlingshire\nStrathclyde\nSuffolk\nthe Fertile Crescent\nSee more results »\nAdd to word list\nAdd to word list\nused to express a variety of emotions, such as surprise and pleasure, often as a reaction to something someone has said: Oh, I didn’t know they were married. Oh, really?"}