{"id":252112,"name":"oil","type":"noun","us_sound":"ɔɪl","us_link":"../audio/o/eus75186.mp3","uk_sound":"ɔɪl","uk_link":"../audio/o/ukoffst010.mp3","content":"oil noun\n(FUEL)\nAdd to word list\nAdd to word list\nB1 [ U ] petroleum (= the black oil obtained from under the earth's surface from which petrol comes): drilling for oil the oil industry\nB1 [ U ] a thick liquid that comes from petroleum, used as a fuel and for making parts of machines move easily: diesel/lubricating oil\nMore examplesFewer examplesYou should always check your oil, water and tyres before taking your car on a long trip.Reports are just coming in of a major oil spillage in the North Sea.Serve the pasta hot with a drizzle of olive oil.The walls are covered in oil paintings.The oil company was found guilty on ten counts of pollution, and was punished with a $250 million fine.\nSMART Vocabulary: related words and phrases\nPetroleum products especially when used as fuel\nantiknock\nantiknocking\nderv\ndiesel\ngas\ngasohol\nhexane\nhigh-octane\njuice\nleaded\nmineral oil\nnon-leaded\nparaffin\npetrochemical\npetrol\npetroleum\npetroleum jelly\npetroleum-based\npropane\nunleaded\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFuels\noil noun\n(FOR COOKING)\nA2 [ C or U ] a smooth thick liquid produced from plants or animals that is used in cooking: olive/corn/vegetable/sunflower oil\nSMART Vocabulary: related words and phrases\nFats & oils in food & cooking\nargan oil\nbergamot\nbeurre noisette\nbrown butter\nbutter\ncorn oil\ncottonseed oil\ncreamed coconut\ndeep fat\ndrawn butter\nlard\nleaf lard\nmargarine\nmilk fat\nnon-greasy\nunbuttered\nunsaturated\nvanaspati\nvegetable oil\nvirgin\nSee more results »\noil noun\n(FOR BODY/HAIR)\n[ C or U ] a smooth thick liquid that is used to improve the appearance or quality of the skin or hair: bath oil\nSMART Vocabulary: related words and phrases\nHair care\nargan oil\nblow dryer\nblowout\nbobble\nbobby pin\nbrush\ncoconut oil\ncoily\ncrimp\nhair gel\nhair slide\nhairdryer\npermanent wave\nrelaxed\nrelaxer\nroller\nsnood\nstraighteners\nstyling\nuncombed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nToiletry & perfumes\noil noun\n(PAINT)\noils [ plural ]\nthick paints with an oil base, used for painting pictures: Do you paint in oils or watercolours?\nSee more\nto put oil on something, especially a machine, usually to make it work more easily without sticking See also\nwell oiled (EFFECTIVE)\nSMART Vocabulary: related words and phrases\nEngineering - mechanical\n-engined\nair-cooled\nartificer\nautomative\nbionics\ndolly\ndrive shaft\nengage\ngasman\ngo on\nhorsepower\nmechanical\nmechanize\nneutral\noilcan\noverride\ntick over\ntune (something) up\nunmechanized\nvalve\nSee more results »\nIdiom\noil the wheels\noil noun\n(FAT)\nAdd to word list\nAdd to word list\n[ C/U ] thick, liquid fat obtained from plants which does not mix with water and is used esp. in cooking: [ U ] vegetable/corn/olive oil [ U ] I like oil and vinegar on my salad. [ C ] These cookies are made with soybean and palm oils.\noil noun\n(FUEL)\n[ U ] a thick, liquid substance that burns and is used as fuel or as a lubricant (= substance that helps connecting parts move easily), or the thick liquid taken from under the ground which oil, gasoline, and other products are made from: motor oil fuel/heating oil Change your car’s oil every 12,000 miles.\noil noun\n(LIQUID SUBSTANCE)\n[ C ] any of a number of thick liquid substances that do not dissolve in water and are used in beauty products, paints, medicines, etc.\noil verb [T]\n(FUEL)\nto add oil to something so it works better: Oil the door hinges so they stop squeaking.\noil verb [T]\n(FAT)\nto put oil on a pan or other surface that you cook on to keep things from sticking to it: Lightly oil the grill.\nAdd to word list\nAdd to word list\nNATURAL RESOURCES a thick liquid that comes from under the Earth's surface and is used as a fuel and for making plastics, etc.: More than 6,000 rigs were drilling for oil and gas. The oil price increase is a genuine concern. The oil exporting countries might not be able to meet rising world consumption.\nto put oil on something, especially a machine, to make it work more easily without sticking: You may need to oil the wheels and joints.\noil the wheels informal ( US grease the wheels)\nto make it easier for something to happen, especially in business or politics: The new proposal will oil the wheels of deal-making by ensuring that the negotiations get off to a quicker start."}