{"id":252296,"name":"old","type":"adjective","us_sound":"oʊld","us_link":"../audio/o/eus75193.mp3","uk_sound":"əʊld","uk_link":"../audio/o/ukoffst030.mp3","content":"old adjective\n(NOT YOUNG/NEW)\nAdd to word list\nAdd to word list\nA1 having lived or existed for many years: an old man We're all getting older. I was shocked by how old he looked. Now come on, you're old enough to tie your own shoelaces, Carlos. I'm too old to be out in the clubs every night. a beautiful old farm house in the country a battered old car That's an old joke - I've heard it about a thousand times. I think this cheese is old, judging by the smell of it.\nThesaurus: synonyms, antonyms, and examples\nhaving lived for many yearsoldHe was an old man.elderlyA large number of elderly people live alone.the elderlyMany among the elderly cannot afford to pay their electricity bills.agedHe has to look after his aged aunt.ageingUK The ageing chairman was forced to retire.\nSee more results »\ntoo old disapproving (UK also a bit old); (US also a little old)\nunsuitable because intended for older people: Don't you think that book is too old for you?\nSee more\nMore examplesFewer examplesA group of old men sat playing dominoes.Many buildings in the old part of the city are falling down, and the government has no money to repair them.As people get older, they often become set in their ways.It would be a sacrilege to put a neon sign on that beautiful old building.There's some wonderful calligraphy in these old manuscripts.\nSMART Vocabulary: related words and phrases\nDescribing people who are old\naged\nageing\nageless\nas old as Methuselah idiom\nauntie\nfoot\nfor a man/woman/person of his/her years idiom\ngaga\ngerontic\ngrand old age idiom\ngray\ngrey\nhave had its/your day idiom\nhill\nhoary\nsprightly\nspry\nsuperannuated\nwizened\nyear\nSee more results »\nold adjective\n(WHAT AGE)\nA1 used to describe or ask about someone's age: How old is your father? Rosie's six years old now. It's not very dignified behaviour for a 54-year-old man. He's a couple of years older than me.\nMore examplesFewer examplesAn adult under British law is someone over 18 years old.Most children in the UK remain in full-time education until they are at least 16 years old.How old is his daughter?The trial was held in camera because the accused was only 14 years old.He asked me how old I was and, lying through my teeth, I said '29'.\nSMART Vocabulary: related words and phrases\nDescribing age & birthdays\nage\nage group\nage limit\naged\nbaby boomer\ngoing on\ngone\ngrown up\njunior\nknock\nmillennial\nnonagenarian\nripe\nsixties\nsomething\nspring chicken\nsweet sixteen\ntake years off someone idiom\nteens\ntwinkle\nSee more results »\nold adjective\n(FROM THE PAST)\nA2 [ before noun ] from a period in the past: I saw my old English teacher last time I went home. He bought me a new phone to replace my old one. She showed me her old school. I saw an old boyfriend of mine. In my old job I had less responsibility. Synonym\nformer\nThesaurus: synonyms, antonyms, and examples\ncoming from a time in the pastoldBe careful - that clock is very old.formerHe's a former coworker of mine.ancientWe need to protect ancient monuments.archaic\"Thee\" is an archaic word for \"you\".\nSee more results »\nMore examplesFewer examplesAfter six months of chopping and changing, we've decided to go back to our old system.Just by coincidence, I met my old school-mate again 50 years later.It will only complicate the situation if we invite his old girlfriend as well.The new Prime Minister is cultivating relationships with old Eastern Bloc countries.The new house is not dissimilar to our old one except that it's a bit bigger.\nSMART Vocabulary: related words and phrases\nIn the past\nago\nany more idiom\nanymore\nback in the day idiom\nback then idiom\nclock\ndim\ndot\nflood\nmemory\nmoon\nmore\nno longer idiom\nnon-current\nsometime\nstep\nstep back (in time) idiom\nthe mists of time idiom\nthe status quo ante\nuse\nSee more results »\nold adjective\n(LANGUAGE)\nOld English, French, etc.\na language when it was in an early stage in its development: Both words come to us from Old English.\nSee more\nold adjective\n(VERY FAMILIAR)\nA2 [ before noun ] (especially of a friend) known for a long time: She's one of my oldest friends - we met in kindergarten.\n[ before noun ] informal used before someone's name when you are referring to or talking to them, to show that you know that person well and like them: There's old Sara working away in the corner. I hear poor old Frank's lost his job.\nMore examplesFewer examplesDashed decent of you, old boy!They did a few old hits as/for an encore.\"I can't eat this meat - it's too tough.\" \"You old fusspot - give it here and I'll eat it!\"He's a miserable old git.He's an insipid old bore.\nSMART Vocabulary: related words and phrases\nLasting for a long time\nall-night\nancient\nbe going strong idiom\nchangeless\ndateless\nfull time\nimmemorial\nimmemorially\nincorruptibility\nincorruptible\nlong-time\nlongevity\nman and boy idiom\nnever-ending\nnondurable\ntime-consuming\ntimeless\ntimelessly\ntimelessness\nunslaked\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRelationships: general words\nGrammar\nElder, eldest or older, oldest?Elder and eldest mean the same as older and oldest. We only use the adjectives elder and eldest before a noun (as attributive adjectives), and usually when talking about relationships within a family: …\nIdioms\nbe (as) old as the hills\nfor old times' sake\nof old\nof the old school\nthe oldest profession (in the world)\nthe oldest trick in the book\nthe old\nold people considered together as a group: These cuts in services will particularly affect the old.\nMore examplesFewer examplesThe old are particularly vulnerable to these fraudsters.These holidays are aimed at the old.The old tend to have a different perspective on war.\nSMART Vocabulary: related words and phrases\nThe elderly\na ripe old age idiom\nage\naged\nageism\nageist\nagism\ncrock\ngeriatric\ngeriatrics\ngerontological\ngerontology\ninfirmity\nnonagenarian\npension fund\npensioner\nrest home\nsenility\nthe gray dollar\nthe grey market\nthe grey pound\nSee more results »\nold adjective [-er/-est only]\n(EXISTING A LONG TIME)\nAdd to word list\nAdd to word list\nhaving lived or existed for a long time in comparison to others of the same kind: An old man lives there with his dog. They have a beautiful old farm house in the country. She got very depressed in her old age (= the time of her life when she was old).\nold adjective [-er/-est only]\n(KNOWN A LONG TIME)\n(esp. of a friend) known for a long time: She’s one of my oldest friends.\ninfml Old is also used to show that you know and like someone: Poor old Frank broke his arm.\nold adjective [-er/-est only]\n(AGE)\nhaving a particular age, or an age suited to a particular activity or condition: a 14-year-old Charlie is older than I. You’re old enough to know better.\nold adjective [-er/-est only]\n(PREVIOUS)\nfrom a previous time or a period in the past; former : Our old house in Lakewood burned down. Sharon gave her old skates to her younger cousin."}