{"id":252463,"name":"oligocene","type":"adjective","us_sound":"ˈɑː.lɪ.ɡoʊˌsiːn","us_link":"../audio/o/cdo0623usolig2757.mp3","uk_sound":"ˈɒl.ɪ.ɡəˌsiːn","uk_link":"../audio/o/cdo0623ukolig2765.mp3","content":"Add to word list\nAdd to word list\nfrom or referring to the period of time between about 34 and 23 million years ago: Fossils of an especially rich array of Oligocene mammals have been unearthed here. Fossilized leaves may provide information on elevation changes since the end of the Oligocene period.\nMore examplesFewer examplesWe hunted marine fossils from the Oligocene and Eocene eras.Eventually, by Oligocene time, about 30 million years ago, tectonic forces reversed and extension of the crust began.Few fossils from the critical Oligocene epoch are known, and even fewer are described.\nSMART Vocabulary: related words and phrases\nGeology - general words\nAnthropocene\nanticline\nauriferous\nbiozone\ncarboniferous\ncementation\ncontinental crust\ncontinental plate\ngeologically\ngeomorphic\ngully erosion\nhenge\nHolocene\npetrographically\npetrography\npetrological\npetrologically\npetrology\nPrecambrian\nrockfall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrehistory\nSpecific periods of time\nthe Oligocene\nthe period of time between about 34 and 23 million years ago: The Oligocene was a period of global cooling, volcanic eruptions, and seismic disturbance. The specimen is from a young female that lived in the early Oligocene.\nMore examplesFewer examplesIt is divided into five epochs: the Palaeocene, Eocene, Oligocene, Miocene, and Pliocene.The hominoid primates appear to have emerged during the Oligocene at least 25 million years ago.These aquatic mammals were apparently more abundant from the Oligocene to the Pliocene than they are now.\nSMART Vocabulary: related words and phrases\nGeology - general words\nAnthropocene\nanticline\nauriferous\nbiozone\ncarboniferous\ncementation\ncontinental crust\ncontinental plate\ngeologically\ngeomorphic\ngully erosion\nhenge\nHolocene\npetrographically\npetrography\npetrological\npetrologically\npetrology\nPrecambrian\nrockfall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrehistory\nSpecific periods of time"}