{"id":252938,"name":"on","type":"preposition","us_sound":"ɑːn","us_link":"../audio/o/eus73326.mp3","uk_sound":"ɒn","uk_link":"../audio/o/ukad5014.mp3","content":"on preposition\n(ABOVE)\nAdd to word list\nAdd to word list\nA1 used to show that something is in a position above something else and touching it, or that something is moving into such a position: Look at all the books on your desk! Ow, you're standing on my foot! Your suitcase is on top of the wardrobe. They live in that old house on the hill. I got on my bike and left.\nMore examplesFewer examplesA hovercraft travels on a cushion of air.Don't put your elbows on the table.Your dinner is on the table.The oil tanker ran aground on a mud bank in thick fog.They've built a new church on the site of the old one.\nSMART Vocabulary: related words and phrases\nOn or off\nastride\natop\ndisengage\nhereon\non board phrase\nonto\nthereon\nthereupon\nturn\nturn over\nunlit\nupon\non preposition\n(CONNECTED)\nA1 covering the surface of, being held by, or connected to something: There's blood on your shirt. Which finger do you wear your ring on? Can you stand on your head? We could hang this picture on the wall next to the door. Dogs should be kept on their leashes at all times.UK We've just moved house and we're not on the phone (= not connected to the phone service) yet.\nMore examplesFewer examplesWe get a lot of condensation on the walls in the winter.The article continues/is continued on page ten.There's a new Italian restaurant opening on the high street.She gave him a hit on the head that knocked him flying.We stayed in/at a hotel on the seafront.\nSMART Vocabulary: related words and phrases\nOn or off\nastride\natop\ndisengage\nhereon\non board phrase\nonto\nthereon\nthereupon\nturn\nturn over\nunlit\nupon\non preposition\n(TIME)\nA1 used to show when something happens: Hair salons don't usually open on Sundays. What are you doing on Friday? My birthday's on 30 May. Would you mind telling me what you were doing on the afternoon of Friday the 13th of March? The bells in the clock tower ring every hour on the hour (= at exactly one o'clock, two o'clock, etc.). On a clear day you can see the mountains from here. She was dead on arrival (= dead when she arrived) at the hospital. Please leave your key at the reception desk on your departure from (= when you leave) the hotel.\nMore examplesFewer examplesThey're driving to Scotland on Tuesday.Private cars are banned from the city on alternate days.Please make my excuses at the meeting on Friday.We're going on a shopping expedition on Saturday.We've fallen into the habit of getting up late on Saturday mornings.\nSMART Vocabulary: related words and phrases\nDescribing when something happened or will happen\nat\nat short notice idiom\nbe\ncoincident\ncoincidently\ndemand\nexecutory\nfor\nhundred\nimmediately\nmovable feast\nnotice\non demand idiom\none\npossible\nsomewhere along the line idiom\ntime\ntime signature\nup\nzero hour\nSee more results »\non preposition\n(WRITING)\nA2 used to show where something has been written, printed, or drawn: Which page is that curry recipe on? His initials were engraved on the back of his watch. What's on the menu tonight? (= What food is available?)\nMore examplesFewer examplesIt says on the label that no preservatives or artificial colourings have been added.Do you recognize the writing on the envelope?This morning's newspapers all carry the same story on their front page.He carved her name on a tree.See the article on page 4 for more details.\nSMART Vocabulary: related words and phrases\nOn or off\nastride\natop\ndisengage\nhereon\non board phrase\nonto\nthereon\nthereupon\nturn\nturn over\nunlit\nupon\non preposition\n(TRAVEL)\nA2 used for showing some methods of travelling: I love travelling on trains. She's coming in on the 5.30 bus. We went to France on the ferry. It'd be quicker to get there on foot. two figures on horseback\nMore examplesFewer examplesWe're going across to France on the ferry.We fell asleep on the train and woke up to find ourselves in Calais.The railcard allows students and young people to travel half-price on most trains.I'll collect you from the station. Which bus will you be on?The crowd were surrounded by police on horseback.\nSMART Vocabulary: related words and phrases\nOn or off\nastride\natop\ndisengage\nhereon\non board phrase\nonto\nthereon\nthereupon\nturn\nturn over\nunlit\nupon\nYou can also find related words, phrases, and synonyms in the topics:\nTravelling\non preposition\n(PROCESS)\nused to show that a condition or process is being experienced: He accidentally set his bed on fire. Max's on holiday this week. I often get carsick when I'm on a long journey. Crime is on the increase (= is increasing) again.UK Their flights to Paris are on special offer at the moment.UK I'll be away on a training course next week.\nMore examplesFewer examplesSophia fell ill/was taken ill while on holiday.There are few indications (that) the economy is on an upswing.We won't be going on holiday this year - lack of funds, I'm afraid.The Titanic sank on her maiden voyage.He often goes away on business.\nSMART Vocabulary: related words and phrases\nExperiencing and suffering\n(straight) from the horse's mouth idiom\nafflict\naffliction\nalmost/nearly die of something idiom\nbe a martyr to something idiom\nbe a victim of your own success idiom\nbear\ndepth\nget the short end of the stick idiom\ngo through\ngrip\nhands-on\nhit someone where they live idiom\nhorse\npractical\nrun up against something\nseat-of-the-pants\nsee life idiom\nstricken\ntaste\nSee more results »\non preposition\n(RECORDING)\nA2 used to show the form in which something is recorded or performed: How much data can you store on the flash drive? When's the movie coming out on DVD? I was really embarrassed the first time I saw myself on film. What's on TV tonight? I wish there was more jazz on the radio.\nMore examplesFewer examplesThe whole car can be modelled on a computer before a single component is made.He was clattering away on his old typewriter.She comes across really well on television.Some software can be configured to prevent children from giving out their phone numbers on the internet.Sound and pictures can be stored digitally, as on a CD.\nSMART Vocabulary: related words and phrases\nOn or off\nastride\natop\ndisengage\nhereon\non board phrase\nonto\nthereon\nthereupon\nturn\nturn over\nunlit\nupon\non preposition\n(PAIN)\nB2 used to show what causes pain or injury as a result of being touched: I hit my head on the shelf as I was standing up. Be careful not to cut yourself on that knife.\nMore examplesFewer examplesShe banged her knee on the edge of the desk.He smashed his elbow on the door.He scraped his hands on the pavement when he fell off his bike.The chef burned himself on the oven.She pricked her finger on the needle.\nSMART Vocabulary: related words and phrases\nThrough, across, opposite and against\nacross\nacross country idiom\nagainst\nagin\nalong\ncatty-corner\ncountry\ncross\nfront\ngive\nkitty-corner\nopposite\nother\nover\noverland\nthru\nto\ntrans\nSee more results »\non preposition\n(TO)\nA2 to or towards: Our house is the first on the left after the post office. The attack on the village lasted all night. I wish you wouldn't sneak up on me like that!\nMore examplesFewer examplesThe road is the second on the left past the church.His words are an attack on personal liberty.Take the first turning on the left.They survived the onslaught of bombing on the village.We came on them in the wood.\nSMART Vocabulary: related words and phrases\nDescribing movement towards\n-wards\n-ways\nat\nconvergent\nearthward\nfacing\nfor\nforward\nforwards\nhither\ninwards\noncoming\nonward\nonwards\nthither\nto\nup\nward\nway\nwise\nSee more results »\non preposition\n(RELATING)\nB1 relating to: a book on pregnancy Her talk is on Italian women's literature. The minister has refused to comment on the allegations. Criticism has no effect on him. Do the police have anything on you (= do they have any information about you that can be used against you)?\nThesaurus: synonyms, antonyms, and examples\naboutaboutWe always seem to talk about money.regardingI wrote to them regarding the new contract.concerningWhat is your letter concerning?in/with regard toComplaints have been made with regard to your behaviour in the office.in connection withShe is wanted for questioning in connection with the disappearance of their child.onShe’s writing a book on feminism in the 21st century.\nSee more results »\nMore examplesFewer examplesHe gave me a book on gardening for my birthday.I've got nothing to say on the matter.The second round of the quiz was on sport.The committee published a hard-hitting report on the bank's management.The committee voted on the proposal, and accepted it unanimously.\nSMART Vocabulary: related words and phrases\nRegarding and concerning\nabout\napply to\napropos\napropos of something\naround\nconnection\ncover\ndeal with someone\ndepartment\nhereof\nin respect of something idiom\nin the brain/looks department idiom\ninto\nrange\nsay\nsomething\nthereof\ntowards\nvis-à-vis\nwise\nSee more results »\non preposition\n(MONEY)\nA2 used to show something for which a payment is made: He spent €180 on a hat. I've wasted a lot of money on this car. We made a big profit on that deal. How much interest are you paying on the loan?\nMore examplesFewer examplesHe spent all his savings on an expensive car.The council has some spare cash that it proposes to spend on public amenities.Steven squandered his inheritance on a series of risky business ventures.She made a lot of money on the sale of her house.They decided to buy the car on credit.\nSMART Vocabulary: related words and phrases\nPaying money\n2FA\n2SV\nante up (something)\nburn a hole in someone's pocket idiom\nchargeable\ncost-cutting\ndiscretionary\nfund\nlash out (something)\nreimburse\nrepay\nsettle an account idiom\nshell (something) out\nshortchange\nsink into something\nspend\nspend money like water idiom\nspent\nsplurge\nsponsor\nSee more results »\non preposition\n(NECESSARY)\nused to show a person or thing that is necessary for something to happen or that is the origin of something: We're relying on you. I might come - it depends on Andrew. Most children remain dependent on their parents while they are at university. His latest movie is based on a fairy tale.\nMore examplesFewer examplesOn what basis did you make your decision?The Republicans are relying on their agricultural policies to deliver the farmers' vote.The meaning of a sentence often depends on stress and intonation.He's either a hero or a villain, depending on your point of view.Our success rests on an increase in sales.\nSMART Vocabulary: related words and phrases\nEssential or necessary\nbasically\nbasis\nbe a question of doing something idiom\nbox ticking\nbusiness-critical\ndependence\nelemental\nif need be idiom\nif/when push comes to shove idiom\nincumbent\nindispensable\nindispensably\nnecessary evil\nnecessitate\nnecessity\nneed\nneeded\nowe\nsymbiotic\nsymbiotically\nSee more results »\non preposition\n(INVOLVEMENT)\nused to show when someone is involved or taking part in something: I'm working on a new book. \"Where had we got up to?\" \"We were on page 42.\"\nMore examplesFewer examplesI was on the final page of the book, when the phone rang.The athletes are on last lap of the race.\"Is the shower fixed yet?\" \"I'm working on it\".I'm on duty until midnight.I was still on my main course when everyone else was ordering dessert.\nSMART Vocabulary: related words and phrases\nTaking part and getting involved\nactor\nall in\nalong\nattendee\nbe (a) party to something idiom\nconcern\nengagement\ngo in on something\nhat\nhave a horse in the race idiom\nhave skin in the game idiom\nimmerse\nmuscle\nneck\npitch in\nplunge\nplunge in/plunge into something\npunch above your weight idiom\nre-engage\nthick\nSee more results »\non preposition\n(FINANCIAL SUPPORT)\nused to show what is providing financial support or an income: I only have $70 a week to live on at the moment. He retired on a generous pension from the company.UK She's on (= earning) £25,000 a year.\nMore examplesFewer examplesShe lived on £100 a week when she was a student.Have you got enough to live on?He gets by on a very modest salary.New employees start on a basic salary of £25,000.He's on commission only.\nSMART Vocabulary: related words and phrases\nGrants & allowances\nanti-subsidy\nbenefit\nbenny\nbursary\ncost-of-living allowance\ndearness allowance\nexpense\nfellowship\nfringe benefit\nparachute payments\npension\npersonal allowance\npin money\nredundancy payment\nscrappage\nstipend\nsubsidized\nsubsidizer\nunemployment benefit\nweighting\nSee more results »\non preposition\n(FOOD/FUEL/DRUG)\nB2 used to show something that is used as food, fuel, or a drug: What do mice live on? Does this radio run on batteries? Is he on drugs?\nMore examplesFewer examplesMy new car runs on diesel.Some calculators run on solar power.Does your car run on unleaded petrol?The engine runs on high-octane petrol.He had converted the motor so that it could run on vegetable oil.\nSMART Vocabulary: related words and phrases\nDrug addiction\nabuser\naddictiveness\nanti-crack\nbuzzed\nbuzzed up\ncold turkey\ncrackhead\ndependency\ndetox\ndruggie\nglue-sniffer\nglue-sniffing\nhabit\nhooked\nhophead\njunkie\npothead\nsmackhead\nsubstance abuser\nsubstance use disorder\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEating\nFuels\non preposition\n(NEXT TO)\nB1 next to or along the side of: It's a small town on the Mississippi River. Our house was on Sturton Street. Strasbourg is on the border of France and Germany.\nMore examplesFewer examplesNegotiations between the two countries are on the brink of collapse.A demilitarized zone has been created on the border between the warring countries.A new coffee shop is opening on the high street.The Aswan High Dam is on the river Nile in Egypt.The shop front occupies a very prominent position on the main street.\nSMART Vocabulary: related words and phrases\nNext to and beside\nabreast\nadjacency\nadjacent\nadjacently\nadjoining\nagainst\nat someone's elbow idiom\nbeside\nbordering\ncontiguity\ncontiguous\nneighbour\nnext\nnext door\nnext door but one idiom\nnon-contiguous\nshoulder\nshoulder to shoulder idiom\nside\nto\nSee more results »\non preposition\n(MEMBER)\nC1 used to show when someone is a member of a group or organization: Have you ever served on a jury? There are no women on the committee. How many people are on your staff?UK She's a researcher on a women's magazine.\nMore examplesFewer examplesHe has been rewarded for his 20 years of service with a seat on the board.Police officers aren't usually allowed to serve on a jury.Being on the committee is one involvement I could do without.She is on the school's development committee.He was was of the experts on a panel appointed to investigate the accident.\nSMART Vocabulary: related words and phrases\nSupporters, members & defenders\nadvocate\nallyship\nanti-evolution\nanti-evolutionary\nanti-evolutionist\napologist\napostle\nbooster\ncadre\ncard-carrying member\ncustodian\ndefender\nnon-member\nnon-membership\npatroness\nprotagonist\nrecruit\nseconder\nsidekick\nupholder\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNamed organizations & societies & their members\non preposition\n(TOOL)\nB1 used when referring to a tool, instrument, or system that is used to do something: I do all my household accounts on the computer. Chris is on drums and Mike's on bass guitar. I'm on (= talking on) the phone.\nSMART Vocabulary: related words and phrases\nUsing and misusing\nadopt\nadoption\navail\navail yourself of something\nbe/go heavy on something idiom\nexhaust\ngo through\ngobble something up\nmake capital out of something idiom\nmax\nmax out\nspare\nspent\nswallow\ntap\nturn over\nturn to someone/something\nturn/use something to good account idiom\nunblock\nunderuse\nSee more results »\non preposition\n(AGAIN)\nUK literary used to show when something is repeated one or more times: The government suffered defeat on defeat in the local elections. Wave on wave of refugees has crossed the border to escape the fighting.\nSMART Vocabulary: related words and phrases\nContinually & repeatedly\n24/7\nad nauseam\nagain\nalway\nalways\nhour\nhour after hour idiom\nimmemorial\njag\nmorning\nnight\npersistently\nprevalently\nquick-fire\nrecurrently\nrepeated\nrumble\nstreak\nyear\nyear in, year out idiom\nSee more results »\non preposition\n(COMPARISON)\nused when making a comparison: That's my final offer, and I can't improve on it. The manufacturer has never improved on the earliest model of the car.UK The productivity figures are down/up on last week's.\nSMART Vocabulary: related words and phrases\nComparing and contrasting\nanalogy\nantithesis\napple\nas against idiom\nbalance something against something\ncomparative\ncompetitive\ncompetitively\ncontradistinction\ncontrast\ncontrastive\nmeasure\nmutatis mutandis\nnext\nnonrelative\nperspective\nrelative\nrelativity\nshame\nstack\nSee more results »\non preposition\n(POSSESSION)\nC2 [ before pronoun ] used to show when someone has something in a pocket or in a bag that they are carrying: Do you have a spare pen on you? I don't have my driving licence on me.\nSMART Vocabulary: related words and phrases\nHaving and owning - general words\nacquire\nacquisition\nattach\nattach something to something\nbe endowed with something idiom\nbearer\ncarry\nholder\nlay\nlord/master/mistress/king/queen of all you survey idiom\nmake something (all) your own idiom\nmistress\nnot/never want for anything idiom\nrevert\nrevert to something\nshared ownership\nstake\nstake something out\nsurvey\nthey've\nSee more results »\non preposition\n(AFTER)\nhappening after and usually because of: Acting on information given to them anonymously, the police arrested him. He inherited a quarter of a million pounds on his mother's death. On their return they discovered that their house had been broken into.\nSMART Vocabulary: related words and phrases\nDescribing when something happened or will happen\nat\nat short notice idiom\nbe\ncoincident\ncoincidently\ndemand\nexecutory\nfor\nhundred\nimmediately\nmovable feast\nnotice\non demand idiom\none\npossible\nsomewhere along the line idiom\ntime\ntime signature\nup\nzero hour\nSee more results »\non preposition\n(PAYMENT)\ninformal used to show who is paying for something: Dinner meal is on me. She had her operation done on the National Health Service.\nSMART Vocabulary: related words and phrases\nPaying money\n2FA\n2SV\nante up (something)\nburn a hole in someone's pocket idiom\nchargeable\ncost-cutting\ndiscretionary\nfund\nlash out (something)\nreimburse\nrepay\nsettle an account idiom\nshell (something) out\nshortchange\nsink into something\nspend\nspend money like water idiom\nspent\nsplurge\nsponsor\nSee more results »\non preposition\n(FAULTY)\nused to show who suffers when something does not operate as it should: The phone suddenly went dead on me. Their car broke down on them on the way home.\nSMART Vocabulary: related words and phrases\nExperiencing and suffering\n(straight) from the horse's mouth idiom\nafflict\naffliction\nalmost/nearly die of something idiom\nbe a martyr to something idiom\nbe a victim of your own success idiom\nbear\ndepth\nget the short end of the stick idiom\ngo through\ngrip\nhands-on\nhit someone where they live idiom\nhorse\npractical\nrun up against something\nseat-of-the-pants\nsee life idiom\nstricken\ntaste\nSee more results »\non preposition\n(POINTS)\nUK used to show the number of points a person or team has in a competition: Clive's team is on five points while Joan's is on seven.\nSMART Vocabulary: related words and phrases\nHaving and owning - general words\nacquire\nacquisition\nattach\nattach something to something\nbe endowed with something idiom\nbearer\ncarry\nholder\nlay\nlord/master/mistress/king/queen of all you survey idiom\nmake something (all) your own idiom\nmistress\nnot/never want for anything idiom\nrevert\nrevert to something\nshared ownership\nstake\nstake something out\nsurvey\nthey've\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWinning, losing & scoring in sport\nGrammar\nAt, on and in (place)We use at: …\nOn, ontoOn and onto are prepositions. …\nAt, on and in (time)We use at: …\nOther uses of in with timeWe use in to say how long it takes someone to do something: …\nTime expressions without at, on, inWe don’t normally use at, on or in before time expressions beginning with each, every, next, last, some, this, that, one, any, all: …\nAt, on and in (time): typical errorsWe use on not at to talk about a particular day: …\nIdioms\non it\non the go\nbe on someone\non adverb\n(CONNECTED)\nA2 on your body or someone's body: It's very cold so put a coat on. She wanders around the house with nothing on. Can you remember what he had on (= was wearing)? I tried on a few jackets, but none of them looked nice.\ncovering the surface of something or connected to something: Screw the lid on tightly. Surgeons managed to sew the finger back on.\nMore examplesFewer examplesShe had on an orange skirt and pink tights.Put your pyjamas on now, please.I don't have any shoes on.The cover was on the swimming pool at the time.The bottle didn't have a lid on.\nSMART Vocabulary: related words and phrases\nOn or off\nastride\natop\ndisengage\nhereon\non board phrase\nonto\nthereon\nthereupon\nturn\nturn over\nunlit\nupon\non adverb\n(OPERATING)\nB2 used to show when something is operating or starting to operate: Could you switch on the radio? Would you turn the TV on? You left the bedroom light on.\nMore examplesFewer examplesDon't forget to switch the boiler on when you arrive.The lights are on, someone must be in.You always leave the TV on when you go out!Why hasn't the air conditioning come on?Turn the power on by flicking this switch.\nSMART Vocabulary: related words and phrases\nOn or off\nastride\natop\ndisengage\nhereon\non board phrase\nonto\nthereon\nthereupon\nturn\nturn over\nunlit\nupon\nYou can also find related words, phrases, and synonyms in the topics:\nMachines - Functioning\non adverb\n(NOT STOPPING)\ncontinuing or not stopping: The referee waved at the player to play on. Read on to discover the amazing properties of coconut water. The police officers shook their heads and drove on. When Jenny walks the dog, she ignores his hunting behaviour and just walks on till he comes back.\nMore examplesFewer examplesWhen the singer forgot his words, the band played on.As I continued on with my tasks, I started to see some progress.I wish he'd stop prattling on about his football team.\nSMART Vocabulary: related words and phrases\nLasting for a long time\nall-night\nancient\nbe going strong idiom\nchangeless\ndateless\nfull time\nimmemorial\nimmemorially\nincorruptibility\nincorruptible\nlong-time\nlongevity\nman and boy idiom\nnever-ending\nnondurable\nsustainedly\ntime-consuming\ntimeless\ntimelessly\ntimelessness\nSee more results »\non adverb\n(TRAVEL)\nB1 into a bus, train, plane, etc., or in the correct position to start using some other method of travelling: The train suddenly started moving as I was getting on. Her horse galloped off as soon as she was on.\nSMART Vocabulary: related words and phrases\nOn or off\nastride\natop\ndisengage\nhereon\non board phrase\nonto\nthereon\nthereupon\nturn\nturn over\nunlit\nupon\non adverb\n(PERFORMING)\nC2 performing: Hurry up with the make-up - I'm on in ten minutes. The audience cheered as the band came on (= came onto the stage).\nMore examplesFewer examplesThe orchestra came on to a warm round of applause.What time are you due on?The lights dimmed as the band came on.His job is to warm the audience up before the main act comes on.The headline act is due on at ten o'clock.\nSMART Vocabulary: related words and phrases\nPlaying music\naccompaniment\naccompany\nair guitar\nbeat something out\nbeatbox\nblow\npick\npick someone/something out\npitch\nplay (something) by ear idiom\nplayability\nplayable\npump\ntap\nthrow\ntickle the ivories idiom\ntranspose\ntransposition\nultra-smooth\nvibe\nSee more results »\non adverb\n(MOVING FORWARD)\nB2 continuing forward in time or space: They never spoke to each other from that day on (= after that day). What are you doing later on? When you're done with it, would you pass it on to Paul?UK Move on, please, and let the ambulance through.UK You cycle on and I'll meet you there.\nMore examplesFewer examplesKeep your ticket - you'll need it later on.Genes are the instructions by which parents' characteristics are passed on to their children.I hear you've moved on to higher things.You go on, I'll catch you up.We drove on through a barren, rocky landscape.\nSMART Vocabulary: related words and phrases\nDescribing movement towards\n-wards\n-ways\nat\nconvergent\nearthward\nfacing\nfor\nforward\nforwards\nhither\ninwards\noncoming\nonward\nonwards\nthither\nto\nup\nward\nway\nwise\nSee more results »\non adverb\n(HAPPENING)\nB2 happening or planned: Is the party still on for tomorrow? I'm busy tomorrow, but I've got nothing on the day after. I've got a lot on at the moment. Food had to be rationed when the war was on. Are there any good movies on (= being shown) this week?\nMore examplesFewer examplesUK Is there anything good on at the theatre at the moment?It's worth checking to see if the match is still on.Having found a replacement venue, the concert is now back on.Check the website to see what's on.Are we still on for a game of tennis this afternoon?\nSMART Vocabulary: related words and phrases\nOccurring and happening\nafoot\nasynchronous\nasynchronously\nattend\nattendant\nbe at work idiom\neventuate\nfall into place idiom\nfollow on\ngo hand in hand with something idiom\ngo off\ngo on\ngone\npass\nresynchronize\nroll\nroll around\nshake out\nsucceed\nsupervene\nSee more results »\non adverb\n(POSITION)\nused when talking about the position of one thing compared with the position of another: It's amazing nobody was injured because the two buses crashed head on (= the front parts of the buses hit each other).UK The bike hit our car side on (= hit the side of the car rather than the front or back).UK It would be easier to get the bookcase through the doorway if we turned it sideways on (= turned it so that one of its sides is at the front).\nSMART Vocabulary: related words and phrases\nOn or off\nastride\natop\ndisengage\nhereon\non board phrase\nonto\nthereon\nthereupon\nturn\nturn over\nunlit\nupon\nGrammar\nOn, ontoOn and onto are prepositions. …\nIdioms\nbe not on\nbe on about\nbe/go on at someone\non and off\nyou're on!\nin cricket, the left side of the field for a right-handed batter or the right side of the field for a left-handed batter: The captain moved the fielder from off to on. She tapped the ball into the on side and ran through for a single.\nSMART Vocabulary: related words and phrases\nCricket\n12th man\nbails phrase\nball-tampering\nbatswoman\nbatting average\nbowl someone out\nbreak\ncut\ndeclare\ndeep\nforward\nglance\nlength\nmaiden\npavilion\ntest match\nuppish\nuppishly\nwalk\nwicketkeeper\nSee more results »\non preposition, adverb [not gradable]\n(SUPPORTED BY)\nAdd to word list\nAdd to word list\nsupported by or resting at the top of another thing: There is snow on the ground. You put pudding in the pie crust and then put whipped cream on.\non preposition, adjective, adverb [not gradable]\n(ATTACHED TO)\nattached to or forming a part of another thing: Read the instructions on the bag. Hang your coat on that hook. Don’t screw the lid on so tight.\non preposition, adjective, adverb [not gradable]\n(COVERING)\ncovering or wrapping another thing: The child had no shoes on her feet. You should put a coat on. The baby’s got nothing on (= is not wearing anything).\non preposition, adjective, adverb [not gradable]\n(BROADCAST)\nbeing broadcast: What’s on TV tonight? I wish there were more jazz on the radio.\non preposition, adjective, adverb [not gradable]\n(TRAVEL BY)\nused to show a method of travel; via: It’s easy to get to the beach on foot. Two people rode by on horseback.\nOn is also sometimes used to show you are getting in a vehicle: It’s time to get on the bus.\non preposition\n(AT)\nat, near, or next to a particular place, thing, or person: They live on Carlisle Street. Which page is that cheesecake recipe on? El Paso is on the Mexican border. Princess Caroline was seated on my left.\non preposition\n(STORED AS)\nused to show the form in which information is stored or recorded for use with an electronic device: How much data can you store on your hard disk? That movie just came out on video.\non preposition\n(USING)\nshowing what tool, instrument, system, etc., is used to do or achieve something: I made this chart on my computer. I’m on the telephone. You’ll cut yourself on that knife if you’re not careful.\non preposition\n(TAKING)\nshowing that a drug is taken or used: My doctor put me on antibiotics.\non preposition\n(NEEDING HELP FROM)\nused after some verbs and adjectives to show that help is needed from a person or thing: We’re counting on you to drive us to the airport.\non preposition\n(EXISTING)\nused to show that a condition or process exists or is being experienced: The musicians are on strike. Are winter coats on sale?\non preposition\n(INVOLVED IN)\ninvolved in or doing a particular thing: I’m working on a new book. She’s on a diet.\nOn is also used to show that someone is doing something he or she was chosen to do: There was a guard on duty.\non preposition\n(CONNECTED WITH)\nconnected with or part of a group or process: Have you ever served on a jury? There are two women on the committee.\non preposition\n(ABOUT)\nabout or having something as a subject: Did you see that documentary on volcanoes last night? Sarita’s thesis is on George Crumb.\non preposition\n(PAYING FOR)\nshowing that something is paid for or how something is paid for: I’ve wasted a lot of money on this car. Lunch is on me.\non preposition\n(WHEN)\nused to show when something happens: What are you doing on Friday? My birthday’s on May 30th. The flight arrived on time (= at the time it was expected).\non preposition\n(COMPARED WITH)\nused to make a comparison: This week’s sales figures are down on last week’s. He’s got two inches on me (= is two inches taller).\non preposition\n(HAVING AN EFFECT)\nused to show that something has happened to someone: Marty is always playing jokes on people. My car broke down on me this morning.\non preposition\n(POSSESSING)\npossessing, carrying, or having something with you now: Do you have any money on you? I don’t have my driver’s license on me.\non adverb [not gradable]\n(NOT STOPPING)\ncontinuing or not stopping: If her line’s busy, keep on trying.\non adverb [not gradable]\n(TOWARD)\ntoward or to something or someone: You go on and I’ll meet you at the lake. Pass the newsletter on to Emily.\non adjective, adverb [not gradable]\n(OPERATING)\noperating or made to start operating: Would you turn the TV on? The electricity hasn’t been turned back on yet.\ninfml Someone who is on is either performing very well or is in a situation where the person must be aware of everything that is happening and be ready to act: Andy was really on last night – I haven’t heard him sing like that in months.\non adjective [not gradable]\n(HAPPENING)\nhappening or planned: I have nothing on for tomorrow. Is the party still on?"}