{"id":252955,"name":"once","type":"adverb","us_sound":"wʌns","us_link":"../audio/o/eus75209.mp3","uk_sound":"wʌns","uk_link":"../audio/o/ukomniv003.mp3","content":"once adverb\n(ONE TIME)\nAdd to word list\nAdd to word list\nA2 one single time: I went sailing once, but I didn't like it. We have lunch together once a month. at once\nC1 at the same time: They all started talking at once. for once\nB2 used when something happens that does not usually happen: For once, the bus came on time. just this once\nused to say that you will only do or request something on this particular occasion: All right, I'll lend you the money - just this once. once again (also once more)\nB1 again, as has happened before: Once again, racist attacks are increasing across Europe. once more\nB1 one more time: I'd like to visit the campus once more before we leave.\nagain, as has happened before: When my father came home, everything felt right once more. once or twice\na few times: I've seen him once or twice in town. (every) once in a while\nB2 sometimes but not often: We meet for lunch once in a while. once and for all\nC2 completely and in a way that will finally solve a problem: Our intention is to destroy their offensive capability once and for all. once in a lifetime\nonly likely to happen once in a person's life: An opportunity as good as this arises once in a lifetime. See also\nonce-in-a-lifetime the once\nUK on a single occasion: I've only played rugby the once, and I never want to play it again.\nMore examplesFewer examplesI go to aerobics once a week.I did meet him once and it was an experience I shall never forget.The baby only feeds once a night at the moment, thank goodness.If I look flustered it's because I'm trying to do so many things at once.She's decided to write her memoirs to set the record straight once and for all.\nSMART Vocabulary: related words and phrases\nRarely & infrequently\n(every) now and then/again idiom\nblue moon\nday\nepisodic\never and anon\nfew\nfit\nisolated\nit's not every day (that)... idiom\nlike ships that pass in the night idiom\noccasion\noccasional\nodd\none and done idiom\none-off\none-shot\none-time\nrarely\nstop-go\nultra-rare\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSimultaneous and consecutive\nPoints in time\nContinually & repeatedly\nComplete and whole\nUnique and unusual\nonce adverb\n(PAST)\nB1 in the past, but not now: This house once belonged to my grandfather. Computers are much cheaper nowadays than they once were. Once-thriving villages stand deserted and in ruins.\nMore examplesFewer examplesTurkey was once an important colonial power.England was once a densely wooded country.Cancer sufferers no longer face certain death as they once did.Shops of this type, once rare, are now numerous.An article on this topic would once have been considered off limits.\nSMART Vocabulary: related words and phrases\nIn the past\nago\nany more idiom\nanymore\nback in the day idiom\nback then idiom\nclock\ndim\ndot\nflood\nmemory\nmoon\nmore\nno longer idiom\nnon-current\nsometime\nstep\nstep back (in time) idiom\nthe mists of time idiom\nthe status quo ante\nuse\nSee more results »\nGrammar\nOnceOnce is an adverb or conjunction. …\nOnce as an adverbWe use once as an adverb to mean ‘one single time’: …\nOnce as a conjunctionWe use once as a conjunction meaning ‘as soon as’ or ‘after’: …\nIdiom\nonce upon a time\nB2 as soon as, or from the moment when: Once I've found somewhere to live I'll send you my address. Remember that you won't be able to cancel the contract once you've signed. at once\nB1 immediately: I knew at once that I'd like it here.\nThesaurus: synonyms, antonyms, and examples\nwithout delay or waitingimmediatelyPlease report to the office immediately.nowI need you to get me that report now. right nowYou put that back right now.right awayIf you're going to call the doctor, you'd better do it right away - the office is closing in two minutes.straight awayI called them back straight away.\nSee more results »\nMore examplesFewer examplesDecoding the paintings is not difficult once you know what the component parts symbolize.You'll feel better once you've got some hot soup down you.We can't afford to make any false moves once we're in enemy territory.Fourteen miles is further than you'd think once you start to run it.My new hiking boots will be great once I've broken them in.\nSMART Vocabulary: related words and phrases\nSimultaneous and consecutive\naccompanied by someone/something\naccompaniment\naccompany\nall the while idiom\nalong\ngo along\nheavy rotation\nin parallel idiom\nin rotation idiom\nin tandem idiom\nminute\nprocess\nsimultaneousness\nsoon\nstep\nstraight\nsuccessive\nsuccessively\nturn\nwhile\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nImmediately\nGrammar\nOnceOnce is an adverb or conjunction. …\nOnce as an adverbWe use once as an adverb to mean ‘one single time’: …\nOnce as a conjunctionWe use once as a conjunction meaning ‘as soon as’ or ‘after’: …\nIdioms\nall at once\nonce bitten, twice shy\nonce adverb [not gradable]\n(AT ONE TIME)\nAdd to word list\nAdd to word list\non or at a single time: I went to Disney World once. The book club meets once a month. Going to the Olympics is a once-in-a-lifetime opportunity (= a rare and valuable one).\nonce adverb [not gradable]\n(IN THE PAST)\nin the past, but not now: I lived in Milwaukee once. Computers are much cheaper now than they once were. Idioms\nat once\nonce and for all\nonce in a blue moon\n(every) once in a while\nonce more\nonce conjunction\n(AS SOON AS)\nas soon as, or when: Once you’ve tried their ice cream, you’ll be back for more."}