{"id":253009,"name":"one","type":"number","us_sound":"wʌn","us_link":"../audio/o/eus75023.mp3","uk_sound":"wʌn","uk_link":"../audio/o/ukomniv007.mp3","content":"one number, determiner\n(NUMBER)\nAdd to word list\nAdd to word list\nA1 the number 1: He had two slices and I only had one. She'll be one year old tomorrow.\nMore examplesFewer examplesTrouble broke out in the match when one of the players called a member of the other team a cheat.They've got two adopted children and one of their own.He is one of the top chefs in Britain.When one engine stopped, we had to turn round and fly home.Would you run your idea by me one more time?Four parcels came this morning, but only one was for Mark.Paint one side, leave it to dry, and then paint the other.He can't tell one wine from another, so don't give him any of the expensive stuff.\nSMART Vocabulary: related words and phrases\nNumbers: cardinal, including nought & zero\nB, b\nbi\ncipher\ndeca-\nduodecillion\nfifteen\nforty\ngoogol\njillion\nkazillion\nnaught\nnineteen\nsix\nsixty\nten\nthirteen\nthirty\nunit\nzero\nzillion\nSee more results »\none number, determiner\n(MEMBER)\none of\nA2 a member of a group of people or things: One of their daughters has just had a baby. EMI is one of the world's largest record companies. Finding a cure for cancer is one of the biggest challenges facing medical researchers. Our organization is just one of many charities that are providing famine relief in the region.\nSMART Vocabulary: related words and phrases\nGroups of people\nalliance\nan\nanti-gang\nassemblage\nbaby boomer\nfirst people\nflashmob\nflock\nfocus group\nfoursome\nline (someone) up\nmafia\nmob\nposse\npublic\nquaternity\nrabble\nretinue\nscratch\nsyndicate\nSee more results »\none number, determiner\n(FUTURE TIME)\nB2 used to refer to a time in the future that is not yet decided: Why don't we meet for lunch one day next week? I'd like to go skiing one Christmas.\nMore examplesFewer examplesYou're going to get into serious trouble one of these days.Let's go to the cinema one night next week.One of these days we're going to move to France.Come and visit one weekend.One day we'll be able to afford a car like that.\nSMART Vocabulary: related words and phrases\nDescribing when something happened or will happen\nat\nat short notice idiom\nbe\ncoincident\ncoincidently\ndemand\nexecutory\nfor\nhundred\nimmediately\nmovable feast\nnotice\non\non demand idiom\npossible\nsomewhere along the line idiom\ntime\ntime signature\nup\nzero hour\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIn the future & soon\none number, determiner\n(PARTICULAR OCCASION)\nB2 used to refer to a particular occasion while avoiding stating the exact moment: One night we stayed up talking till dawn. He was attacked as he was walking home from work late one afternoon. One moment he says he loves me, the next moment he's asking for a divorce. She never seems to know what she's doing from one minute to the next.\nMore examplesFewer examplesAt one point Seeger fell afoul of the US government for his antiwar actions.He managed to eke out a living one summer by selling drinks on a beach.They met in Paris one enchanted afternoon in early autumn.I suspected he wasn't telling me the truth, and one day I caught him out when I found some letters he'd written.We met one day last year when we got talking in a bar.\nSMART Vocabulary: related words and phrases\nPoints in time\nanytime\nas\nas and when idiom\ndownstream\nduring\nhour\nif\nif and when idiom\njuncture\nlast\nlater\nmidstream\nmidway\nmoment\npoint\nposterior\nthe last minute idiom\ntime\ntime slot\nunder the wire idiom\nSee more results »\none number, determiner\n(SINGLE)\nB2 a single thing; not two or more: Eat them one at a time (= separately). I think we should paint the bedroom all one (= in a single) colour.UK Do you think five of us will manage to squeeze into the one car? (all) in one\nC2 combined in a single person or object: With this model you get a radio, CD player, and MP3 dock all in one.\nMore examplesFewer examplesWith one blow of the knight's axe, he clove the rock in twain.Only one competitor made a clear jump of the highest fence.Don't let one little quarrel come between you.I took one look at her and cracked up.The canteen is the one thing I'll miss about work.\nSMART Vocabulary: related words and phrases\nNumbers: single, double & multiple\nalone\nbilateral\nbilaterally\nbipartite\nbipolar\ndeca-\ndeka-\ndouble-action\ndual\nhimself\nmultiple\nplural\nquintuple\nsolitarily\nsolitary\ntri-\ntrilateral\ntrilaterally\ntriply\nunilateral\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGroups and collections of things\none number, determiner\n(ONLY)\nB2 used when saying there is no other person or thing: He's the one person you can rely on in an emergency. This may be your one and only (= only ever) opportunity to meet her. My final guest on tonight's show needs no introduction. Please welcome the one and only Michael Jordan!\nThesaurus: synonyms, antonyms, and examples\nhaving no others like this oneonlyShe's the only one who can do it.oneHe's the one person you can rely on in a situation like this.singleYou haven't listened to a single thing I've said!lonePolice were looking for a lone gunman.soleHe was the sole survivor of the plane crash.\nSee more results »\nMore examplesFewer examplesThe one thing that's certain is that prices will go up.He was the one person to complete the test with no mistakes.She's the one person I can trust around here.It is the one thing I regret about my time at the company.The one thing he's not prepared to compromise is his family's safety.\nSMART Vocabulary: related words and phrases\nNumbers: single, double & multiple\nalone\nbilateral\nbilaterally\nbipartite\nbipolar\ndeca-\ndeka-\ndouble-action\ndual\nhimself\nmultiple\nplural\nquintuple\nsolitarily\nsolitary\ntri-\ntrilateral\ntrilaterally\ntriply\nunilateral\nSee more results »\none number, determiner\n(UNKNOWN PERSON)\nformal used before the name of someone who is not known: Her solicitor is one John Wintersgill.\nSMART Vocabulary: related words and phrases\nNames and titles\nA.N. Other\nage\naka\nalias\nappellation\nform of address\ngiven name\ngood name\nidentity\nilk\npet name\nplace name\npseudonym\npseudonymity\npseudonymous\ntrademark\nunchristened\nunder the name of idiom\nunidentified\nunnamed\nSee more results »\none number, determiner\n(EMPHASIS)\nmainly US used to emphasize an adjective: His mother is one (= a very) generous woman. That's one (= a very) big ice cream cone you have there. It was one hell of a (= a very great) shock to find out I'd lost my job.\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabsolutely\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\nIdiom\nthe one percent\none pronoun\n(ONE THING/PERSON)\nA2 used to refer to a particular thing or person within a group or range of things or people that are possible or available: I have a few books on Chinese food. You can borrow one if you want. Which one would you like? Please make a copy for everybody in the office and a few extra ones for the visitors. \"Which cake would you like?\" \"The one in the front.\" French croissants are so much better than the ones we get here. There were lots of people watching, and not one of them offered to help. I've received no replies to my job applications - not a single one (= none). Chris is the one (= the person) with curly brown hair. not be one to do something UK informal\nto never do something: I'm not one to criticize other people, as you know. be one for something informal\nto like something very much: I've never been one for staying out late. He's a great one for the ladies.\nMore examplesFewer examplesThat's one classy vehicle you've got there.You can always tell a real bow tie from one that clips on.She's written five books, and every one a cracker.Mrs. Wilson is one of our regular customers.I really must get a new jacket - this one's starting to go at the elbows.\nSMART Vocabulary: related words and phrases\nParticular and individual\nbe the very thing idiom\nbiomarker\ncalling card\ncapita\ncertain\nespecially\nindividualistic\nindividualistically\nindividuality\nindividualized\nindividually\nmatter\npeculiarity\nper capita\npersonally\npet\nprivate\nregard\nrespectively\nseparately\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAlways & never\nLiking\none pronoun\n(COMPARISON)\nused to talk about one person or thing compared with other similar or related people or things: They look so similar it's often difficult to distinguish one from the other. You may have one or the other, but not both. Crime and freedom are inseparable. You can't have one without the other.\nMore examplesFewer examplesDuring the night, he had rolled from one side of the bed to the other.The two cultures were so utterly disparate that she found it hard to adapt from one to the other.If I have to listen to something I don't understand, it just goes in one ear and out the other.The two sisters are so similar that it's almost impossible to tell one from the other.This film begins where the other one leaves off.\nSMART Vocabulary: related words and phrases\nComparing and contrasting\nanalogy\nantithesis\napple\nas against idiom\nbalance something against something\ncomparative\ncompetitive\ncompetitively\ncontradistinction\ncontrast\ncontrastive\nmeasure\nmutatis mutandis\nnext\nnonrelative\nperspective\nrelative\nrelativity\nshame\nstack\nSee more results »\none pronoun\n(ANY PERSON)\nC1 formal any person, but not a particular person: One has an obligation to one's friends. One ought to make the effort to vote.\nMore examplesFewer examplesOne's primary responsibility is to the legal system.One must not assume from this that the defendant is guilty.I wondered whether there might, after all, be some truth in the old chestnut that one's school days are the happiest of one's life.Yoga is said to restore one's inner equilibrium.Spending time with one's family is never an unalloyed pleasure.\nSMART Vocabulary: related words and phrases\nLinguistics: personal pronouns\n'em\nhe\nher\nI, i\nit\nnumber one\npersonally\nS, s\ns/he\nshe\nthee\nthem\nthemself\nthou\nus\ny'all\nyou\nyou-all\nYours truly phrase\nyous\nSee more results »\none pronoun\n(I/ME)\nformal the person speaking or writing: Of course, one (= I) would be delighted to dine with the Queen.\nSMART Vocabulary: related words and phrases\nLinguistics: personal pronouns\n'em\nhe\nher\nI, i\nit\nnumber one\npersonally\nS, s\ns/he\nshe\nthee\nthem\nthemself\nthou\nus\ny'all\nyou\nyou-all\nYours truly phrase\nyous\nSee more results »\nGrammar\nOneWe commonly use one and its plural ones as a substitute for a countable noun: …\nOne and one’sAs a personal pronoun (both subject and object), one can be used to refer to ‘people in general’. We often use one in making generalisations, especially in more formal styles. However, if one is used too much, it can make the speaker sound too formal. One takes a third person singular verb: …\nPronouns: one, you, we, theyOne, you, we and they are generic personal pronouns. We can use one, you, we and they to refer to ‘people in general’. …\nOne, you and weWe can use one, you or we when we are making generalisations and not referring to any one person in particular. When used like this, one, you and we can include the speaker or writer: …\nTheyWe can use they to talk about a wide group of people, such as an authority or an institution. In such cases, they does not refer to specific people: …\nIdioms\nbe a one\nbe at one\nbe one of a kind\nbe one up on someone\ndown in one\nfor one\nget one up on someone\ngo off on one\ngot it in one!\na hundred/thousand/million and one\nMore idioms\nin ones and twos\none after another\none and all\none and done\none by one\none day\none or two\none way or another\nthe one about\none number\n(NUMBER)\nAdd to word list\nAdd to word list\n1: I have one brother and two sisters. Paula rented a one-room studio apartment.\nOne can also mean one o’clock. Idioms\none after another\none and only\none by one\none day\none of a kind\none of the boys\none of those days\none step at a time\none thing leads to another\none way or another\nMore idioms\none way or the other\non the one hand but on the other hand\nthe one and only\none pronoun, adjective [not gradable]\n(SINGLE)\nnot two or more: There are too many of us to fit in just one car.\none pronoun, adjective [not gradable]\n(PARTICULAR THING/PERSON)\nused to refer to a particular thing or person within a group or range of things or people: There are lots of flavors – which one would you like? He advised workers around him, especially the younger ones, to be patient. Kayla is the one with dark brown hair. Make sure the ones that we've got there do what you want them to do. She is one beautiful woman (= she is very beautiful). Why don’t we meet for lunch one day next week? one of\nTo be one of a group of people or things is to be a member of that group: It’s one of the most popular songs.\none adjective [not gradable]\n(ONLY)\nused when saying there is no other person or thing: He’s the one person you can rely on in an emergency.\none pronoun\n(ANY PERSON)\nany person, but not a particular person: One ought to make the effort to vote."}