{"id":253142,"name":"only","type":"adjective","us_sound":"ˈoʊn.li","us_link":"../audio/o/eus75217.mp3","uk_sound":"ˈəʊn.li","uk_link":"../audio/o/ukomniv015.mp3","content":"Add to word list\nAdd to word list\nA1 used to show that there is a single one or very few of something, or that there are no others: I was the only person on the train. Is this really the only way to do it? The only thing that matters is that the baby is healthy. It was the only thing I could do under the circumstances. Rita was the only person to complain.\nThesaurus: synonyms, antonyms, and examples\nhaving no others like this oneonlyShe's the only one who can do it.oneHe's the one person you can rely on in a situation like this.singleYou haven't listened to a single thing I've said!lonePolice were looking for a lone gunman.soleHe was the sole survivor of the plane crash.\nSee more results »\nMore examplesFewer examplesThe only time I have clear next week is Tuesday afternoon.The rebels' only form of defence against the soldiers' guns was sticks and stones.An Olympic gold medal is the only thing that has evaded her in her remarkable career.Dennis White scored the only goal in an otherwise forgettable match.They turned their noses up at the only hotel that was available.\nSMART Vocabulary: related words and phrases\nNumbers: single, double & multiple\nalone\nbilateral\nbilaterally\nbipartite\nbipolar\ndeca-\ndeka-\ndouble-action\ndual\nhimself\nmultiple\nplural\nquintuple\nsolitarily\nsolitary\ntri-\ntrilateral\ntrilaterally\ntriply\nunilateral\nSee more results »\nGrammar\nOnlyOnly is an adjective or adverb. …\nOnly as an adjectiveWe use only as an adjective to mean that there is just one or very few of something, or that there are no others: …\nOnly as an adverbWe use only as an adverb to mean that something is limited to some people, things, an amount or an activity: …\nOnly: positionAs an adjective, we use only in front of a noun or one, or before another adjective or a number: …\nonly adverb\n(NOT MORE)\nA1 used to show that something is limited to not more than, or is not anything other than, the people, things, amount, or activity stated: At present these televisions are only available in Japan. Only Sue and Mark bothered to turn up for the meeting. This club is for members only. Only an idiot would do that. These shoes only cost $50. Don't worry - it's only a scratch. I was only joking. I was only trying to help. I only arrived half an hour ago. She spoke to me only a few minutes ago on the phone. It's only four o'clock and it's already getting dark. \"Who's there?\" \"It's only me (= it is not someone you should worry about). I've locked myself out.\" It's only natural that you should worry about your children.\nMore examplesFewer examplesOf 30 countries inspected for airline safety, only 17 received a clean bill of health.I was only doing 30 mph on the clock.He only got the job because of his connections!She only asked me to her party as an afterthought.Not only did I speak to her, I even got her autograph!\nSMART Vocabulary: related words and phrases\nNumbers: single, double & multiple\nalone\nbilateral\nbilaterally\nbipartite\nbipolar\ndeca-\ndeka-\ndouble-action\ndual\nhimself\nmultiple\nplural\nquintuple\nsolitarily\nsolitary\ntri-\ntrilateral\ntrilaterally\ntriply\nunilateral\nSee more results »\nonly just\nB1 used to refer to something that happens almost immediately after something else: People were leaving and I'd only just arrived. We'd only just set off when the car broke down.\nalmost not: There was only just enough food to go round. We got there in time for our flight, but only just (= but we almost did not).\nSMART Vocabulary: related words and phrases\nIn the past\nago\nany more idiom\nanymore\nback in the day idiom\nback then idiom\nclock\ndim\ndot\nflood\nmist\nmoon\nmore\nno longer idiom\nnon-current\nrewind the clock idiom\nsometime\nstep\nstep back (in time) idiom\nthe mists of time idiom\nthe status quo ante\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMerely and barely\nnot only ... (but) also\nB2 used to say that two related things are true or happened, especially when this is surprising or shocking: Not only did he turn up late, he also forgot his books. If this project fails, it will affect not only our department, but also the whole organization. have only (got) to\nIf you say you have only (got) to do something, you mean that it is all you need to do in order to achieve something else: If you want any help, you have only to ask. You only have to look at her face to see that she's not well.\nSMART Vocabulary: related words and phrases\nAlso, extra, and in addition\nadded\nadditional\nadditionally\nagain\nalong\net cetera\netc.\nexcess\nfiller\nfor good measure idiom\nhand\nrate\nsame\nsecond\nsecondly\nside\nsuchlike\nsupernumerary\nthirdly\ntouch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSucceeding, achieving and fulfilling\nonly adverb\n(BAD RESULT)\nused when saying that something unpleasant will happen as a result of an action or a failure to act: If you don't do something about it now it will only get worse.\nSMART Vocabulary: related words and phrases\nMerely and barely\nall\nall of something idiom\nat a pinch idiom\nbarely\nbut\nby a whisker idiom\nby inches idiom\nhardly\nill\njust\nlittle\nmere\nmerely\nmerest\nnarrowly\nnothing\nnothing more than idiom\nscarce\nscarcely\nwhisker\nSee more results »\nonly adverb\n(FEEL SORRY)\nused to show that you feel sorry about something that cannot happen when explaining why it cannot happen: I'd love to go to Australia. I only wish I could afford to. I only hope/wish (that)\nB2 used to emphasize what you are hoping or wishing for: I only hope you know what you're doing. I only wish that they would keep in touch more regularly.\nSMART Vocabulary: related words and phrases\nSadness and regret\naw\nbe/weigh on your conscience idiom\nbitter\nblack dog\nbreastbeating\ncry\ndistress\nfeel bad idiom\ngloominess\nglumness\ngroan\nguilt\nprick\nprick someone's conscience idiom\nregretful\nregretfully\nremorse\nrepentant\nwrench\nwretchedness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: intensifying expressions\nHoping and hopefulness\nonly adverb\n(SILLY)\nUK informal used to show that you think someone has done something silly: She's only locked herself out of her flat again!\nSMART Vocabulary: related words and phrases\nLinguistics: interjections\naiyo\nattaboy\nattagirl\nauf Wiedersehen\naw shucks\ndoctor\neat your heart out idiom\nfigure\nmazel tov\nmore\nmore power to your elbow! idiom\nneed\nneed I say more? idiom\nperiod\nroll\nthe rest is history idiom\nyou should have seen/heard something/someone idiom\nyou the man! idiom\nyuk\nyum yum\nSee more results »\nGrammar\nNot only … but alsoWe use not only X but also Y in formal contexts: …\nOnlyOnly is an adjective or adverb. …\nOnly as an adjectiveWe use only as an adjective to mean that there is just one or very few of something, or that there are no others: …\nOnly as an adverbWe use only as an adverb to mean that something is limited to some people, things, an amount or an activity: …\nOnly: positionAs an adjective, we use only in front of a noun or one, or before another adjective or a number: …\nIf onlyWe use if only to express a strong wish that things could be different. It means the same as I wish but is stronger. We use it to talk about past, present and future unreal conditions. …\nIdioms\nif only\nonly to do something\nC2 used to show what is the single or main reason why something mentioned in the first part of the sentence cannot be performed or is not completely true: I'd invite Frances to the party, only (= but I will not because) I don't want her husband to come. I'd call him myself, only (= but I cannot because) I'm at work all day. I'd be happy to do it for you, only (= but) don't expect it to be done before next week. This fabric is similar to wool, only (= except that it is) cheaper.\nMore examplesFewer examplesI'd offer to give you a lift to the airport, only I've got to go to work.I'll make dinner, only not until you've tidied your room.I'd would pay for dinner, only I've forgotten my wallet.I would help you move house, only I've hurt my back.Her latest novel is similar to her last one, only it's not as well written.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a contrast\nagain\nany way you slice it idiom\nat any rate idiom\nat least idiom\nbest\nbut\ndisjunctive\ngiven\nhowever\nin the face of something idiom\nin the teeth of something idiom\nmight\nnevertheless\nrate\nseeing (that)\nslice\nspite\nthough\ntooth\nwhen\nSee more results »"}