{"id":253214,"name":"onstage","type":"adverb","us_sound":"ˌɑːnˈsteɪdʒ","us_link":"../audio/o/usomniv010.mp3","uk_sound":"ˌɒnˈsteɪdʒ","uk_link":"../audio/o/ukomniv023.mp3","content":"Add to word list\nAdd to word list\nonto or on a stage so the people watching can see: The audience cheered as the band walked onstage for another encore. I was terrified the first time I got up on-stage. What's it like when people throw their underwear at you on stage?\n(of a performer, actor, etc.) when acting in a play or film, etc., or taking part in some other kind of performance, rather than in real life: He's very mild-mannered in real life but onstage, he's crazy. The characters have to remain \"chic\" at all times, something they have found easier on-stage than off it. Compare\noffstage adverb\nSMART Vocabulary: related words and phrases\nTheatres, cinemas & their parts\napron\nart house\narthouse\nbackdrop\nbackstage\nbillboard\nbioscope\nfleapit\nfootlights\ngreen room\nloge\norchestra pit\nscenery\nspotlight\nstage left\nstage right\nstagily\nstagy\nstrip light\nwing\nSee more results »\nhappening on the stage, so the people watching can see: Have there been any difficult onstage moments? An on-stage accident badly injured one of the dancers.\n: used for describing a performer or their behaviour when they are acting in a play or film, etc., or taking part in some other kind of performance, rather than in their own life: The dancers' partners were said to be jealous of the couple's onstage sexual chemistry. Her shyness is quite at odds with her on-stage demeanour. Compare\noffstage adjective\nSMART Vocabulary: related words and phrases\nTheatres, cinemas & their parts\napron\nart house\narthouse\nbackdrop\nbackstage\nbillboard\nbioscope\nfleapit\nfootlights\ngreen room\nloge\norchestra pit\nscenery\nspotlight\nstage left\nstage right\nstagily\nstagy\nstrip light\nwing\nSee more results »\nAdd to word list\nAdd to word list\non the stage of a theater or other place where people are performing: Rock stars usually show up onstage looking just the way you want them to."}