{"id":253513,"name":"open","type":"adjective","us_sound":"ˈoʊ.pən","us_link":"../audio/o/eus75227.mp3","uk_sound":"ˈəʊ.pən","uk_link":"../audio/o/ukoomph016.mp3","content":"open adjective\n(NOT CLOSED)\nAdd to word list\nAdd to word list\nA2 not closed or fastened: an open door/window An open suitcase lay on her bed. You left the container open. Someone had left the window wide (= completely) open. He had several nasty open wounds (= those which had not begun to heal).\nMore examplesFewer examplesHis shirt was open to the waist revealing a very hairy chest.We could hear him cursing and swearing as he tried to get the door open.My jaw dropped open when she told me how old she was.I keep the bedroom door open in case the children call for me in the night.The thieves broke the safe open and stole the diamonds.\nSMART Vocabulary: related words and phrases\nOpen and closed\nairtight\najar\nbarred\nclosed\ncrack\ngaping\nhermetic\nhermetically sealed\nhour\nlatch\noff-hours\noutspread\npatency\nsealed\nshut\nto\nunbarricaded\nunopened\nwatertight\nwide-eyed\nSee more results »\nopen adjective\n(READY)\nA1 [ after verb ] ready to be used or ready to provide a service: The supermarket is open till 8.00 p.m. The road is open now, but it is often blocked by snow in the winter. The new hospital was declared open by the mayor.\nMore examplesFewer examplesThe museum is open daily except Monday(s).The Royal Apartments are open to the public.The hotel bar is open to non-residents.The west wing of the house is still lived in by Lord and Lady Carlton, while the rest of the house is open to the public.As both a teacher and parent, she had a vested interest in seeing the school remain open.\nSMART Vocabulary: related words and phrases\nOpen and closed\nairtight\najar\nbarred\nclosed\ncrack\ngaping\nhermetic\nhermetically sealed\nhour\nlatch\noff-hours\noutspread\npatency\nsealed\nshut\nto\nunbarricaded\nunopened\nwatertight\nwide-eyed\nSee more results »\nopen adjective\n(NOT ENCLOSED)\nB1 not closed in or covered: It's not a good idea to camp in the middle of an open field (= one which is not covered with trees, bushes, etc.). Suddenly we had left the city behind and were out in open country. The survivors were adrift on the open sea (= far from land).\nMore examplesFewer examplesThe road goes through several miles of open countryside.The open road stretched out in front of us.The house was surrounded by open fields.The fishing boat made its way out of the harbour and into the open sea.The soldiers were marching across open country.\nSMART Vocabulary: related words and phrases\nEnclosing, surrounding and immersing\nbeleaguer\nbeleaguered\nbeset\nborder\nbox someone/something in\ndunk\nenclosure\nfence something off\nflooding\ngather\ngift wrap\ngift-wrapped\ngirdle\nsiege\nsteep\nsteep something/someone in something\nsubmersion\nswaddle\nswallow\nswamp\nSee more results »\nopen adjective\n(COMPUTER)\nIf a computer document or program is open, it is ready to be read or used: Make sure you have both files open at the same time.\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntap\ntoolbar\nvectorization\nvectorize\nvirtualization\nvirtualize\nwake word\nzip file\nSee more results »\nopen adjective\n(AVAILABLE)\nC1 [ after verb ] available; not limited: There are still several possibilities open to you. The competition is open to anyone over the age of 16. Is the library open to the general public? Their whole attitude to these negotiations is open to criticism (= can be criticized). I'd like to think I'm open to (= willing to consider) any reasonable suggestion. An accident would lay the whole issue of safety open (= cause it to be considered).\nMore examplesFewer examplesThe company's accounts are open to scrutiny.The current system is open to abuse.He laid himself open to ridicule.The success of the project is open to question.The publisher is open to book proposals from new authors.\nSMART Vocabulary: related words and phrases\nAvailable and accessible\naccessibility\naccessible\naccessibly\nat your command idiom\navailability\ndrop\nnon-restricted\nnothing\nobtainable\non call idiom\non demand idiom\non/about your person idiom\nrelease\nseason\nstream\nunfreeze\nunfrozen\nunlock\nunobtainable\nup for grabs idiom\nSee more results »\nopen adjective\n(NOT SECRET)\nC2 not secret: There has been open hostility between them ever since they had that argument last summer.\nC2 honest and not trying to keep things secret: He's very open about his weaknesses. I wish you'd be more open with me, and tell me what you're feeling. She has an honest, open face.\nThesaurus: synonyms, antonyms, and examples\ntelling the truth and able to be trustedhonestThe new MP was refreshingly honest with her constituents.straightJust be straight with her and tell her how you feel.sincereHe's so sincere that you know exactly where you stand with him. truthfulAre you being truthful with me?\nSee more results »\nMore examplesFewer examplesI like her open and direct manner.The deal was completely open and above board.Despite a commitment to more open government, the public are still being kept in the dark about the inner machinations of the Cabinet.They showed open contempt for their new neighbours.The minister hasn't been entirely open about his business interests.\nSMART Vocabulary: related words and phrases\nApparent and obvious\n(from) under your nose idiom\napparent\nbe (as) plain as the nose on your face idiom\nbe (right) under your nose idiom\nbe etched somewhere idiom\nbe writ large idiom\nflagrantly\nforegone conclusion\nglaringly\nI need hardly do something idiom\nobtrude\novertly\npalpable\npalpably\nparallax\npatently\nsqueaky\nstand/stick out a mile idiom\nwonder\nwritten all over someone's face idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHonesty, openness & sincerity\nopen adjective\n(NOT DECIDED)\nnot decided or certain: We don't have to make a firm decision yet. Let's leave it open. We can leave our offer open for another week, but we have to have your decision by then. I want to keep my options open, so I'm not committing myself yet.\nSMART Vocabulary: related words and phrases\nUncertainty\namorphous\nbe neither fish nor fowl idiom\nblurringly\nblurry\ncircumstantial\nindeterminate\nindeterminately\ninsecurely\ninsecurity\ninterrogatively\nmurky\nshallowly\nslippery\nspec\nsquishy\nstutter\nwavery\nwifty\nwishy-washy\nyou never know idiom\nSee more results »\nopen adjective\n(OF QUESTION)\nAn open question can be answered in many different ways, and not with just \"yes\" or \"no\" or by choosing one of a number of fixed answers: Ask an open question along the lines of \"What do you think/feel about this?\" The interviewer should ask open and probing questions. Compare\nclosedSynonym\nopen-ended\nMore examplesFewer examplesThe University of Arkansas published a poll in which state voters were asked an open question about their presidential preference. If you ask an open question, such as, \"What is the most important feature you are looking for in your new home?\" then you will get meaningful answers.The questionnaire is typically multiple choice, with one question at the end which is more open.\nSMART Vocabulary: related words and phrases\nQuestioning people & asking questions in general\nask after someone\nask questions of someone/something idiom\nbe someone's for the asking idiom\nbeat something out of someone\nbombard\nconsultative\ninquire within idiom\ninterviewer\nply someone with something\npoll\npry\nput someone through the mill idiom\nput someone through the wringer idiom\nput someone to something idiom\nQ, q\nrhetorical question\nroll\nsurvey\nthe third degree idiom\ntrick question\nSee more results »\nopen adjective\n(MUSIC)\nmusic\n&#160; specialized If a string on an instrument such as a guitar is open, it does not have a finger or a capo (= device fixed across the strings) pressing down on it: The lowest note available in first position in standard tuning is an open G. He altered the cello's usual tuning on some tracks to let open strings resound.\nMore examplesFewer examplesThe guitar style on the song is all joyful open strings.Doubled open strings are employed for more force and emphasis on the open note.Note the use of the open A string to facilitate position changes.\nSMART Vocabulary: related words and phrases\nTechnical music terms\naccidental\nadagio\naleatory\nandante\nantiphonal\narpeggio\narr.\ncadence\ngiusto\ngroove\nharmonic\nharmonic progression\nharmony\nlegato\nsyncopated\nsyncopation\ntempered\ntempo\ntimbre\ntime signature\nSee more results »\nGrammar\nOpen or opened?We use open as an adjective to mean ‘not closed’: …\nIdiom\ngreet/welcome someone with open arms\nopen verb\n(BEGIN)\nB2 [ I or T ] to (cause to) begin: I would like to open my talk by giving a brief background to the subject. I'm going to open an account with another bank. The Olympic Games open tomorrow. A new radio station is due to open (up) next month. The film opens (= will be shown for the first time) in New York and Los Angeles next week.\nThesaurus: synonyms, antonyms, and examples\nto begin to (make something) happenstartHurry up – the film has already started.beginThe ceremony is about to begin.commenceThe meeting commenced with a moment of silence.openThe meeting opened with a short word of welcome to new members.originateThe idea for the business originated with my grandmother's recipes.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto start to do somethingbeginI'll begin working on the project this weekend.startHave you started your homework yet?commenceWe commenced listening to Uncle Jim's long story, knowing we were in for it now.embark on/upon somethingThat fateful morning, she embarked upon the longest solo climb in history. enter on/upon somethingWith his diagnosis, we entered upon the most difficult time of our lives.\nSee more results »\nopen for someone\nto perform before the main performer in a show: The band opened for The Who at a baseball stadium in 1982. Comedians used to regularly open for rock acts.\nMore examplesFewer examplesThe Chairperson opened the proceedings with a short speech.I've opened an account with a building society.The show will open with a firework display.The album opens with his most famous song.Let's open with a reminder of what we did last week.\nSMART Vocabulary: related words and phrases\nStarting and beginning\nbe in the first flush of idiom\nbe/get in on the ground floor idiom\nbecome\nbegin\nbranch out\ngrow\nhalf-cock\nhere\nhere goes! idiom\nhit the ground running idiom\nmotion\nsail in\nstart (something) off\nstart on something\nstart out\nstart/set/get the ball rolling idiom\nstarting\nthe ground floor\nwaste\nwheel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCelebrating & entertaining\nopen verb\n(NOT CLOSED)\nA1 [ I or T ] to move something to a position that is not closed, or to make something change to a position that is not closed: Could you open the window, please? You can open your eyes now - here's your present. The flowers open (out) in the morning but close again in the afternoon. From the kitchen there is a door that opens (out) into the garden. That door opens (out) onto the patio.informal \"Open up (= open the door) - it's the police!\" shouted the police officer, banging on the door.\nA2 [ T ] to remove or separate part of a container or parcel so that you can see or use what it contains: Don't open a new bottle just for me. I couldn't wait to open the letter.\nMore examplesFewer examplesI can't open my bag - the zip has stuck.I just opened the drawer as usual and the handle came away in my hand.The customs officials made us go through the whole rigmarole of opening up our bags for inspection.We must open the channels of communication between the two countries.The door opens outwards.\nSMART Vocabulary: related words and phrases\nUnfastening and opening\nbreak something open\nbreaker\nbroach\ngape\nlet/set something loose idiom\nloosen\nshut (someone) up\ntease\ntease something out\nthe earth/ground/floor opens idiom\nunbolted\nunbuckle\nunfold\nunknot\nunlace\nunlock\nunpick\nunplug\nunwind\nunzip\nSee more results »\nopen verb\n(READY)\nA2 [ I or T ] If a shop or office opens at a particular time of day, it starts to do business at that time: The coffee shop opens at ten o'clock. He opens (up) his coffee shop at ten o'clock.\nB2 [ T ] If someone, usually someone important, opens a building, event, etc., they officially say that it is ready to be used or to start operating: The new hospital will be officially opened by the mayor on Tuesday.\nMore examplesFewer examplesThe box office opens at ten.The Queen will open the new visitors' centre.The opening of the superstore will sound the death knell for hundreds of small independent shops.The factory opened last November.The corner shop opens at five o'clock in the morning.\nSMART Vocabulary: related words and phrases\nUnfastening and opening\nbreak something open\nbreaker\nbroach\ngape\nlet/set something loose idiom\nloosen\nshut (someone) up\ntease\ntease something out\nthe earth/ground/floor opens idiom\nunbolted\nunbuckle\nunfold\nunknot\nunlace\nunlock\nunpick\nunplug\nunwind\nunzip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCeremonies\nopen verb\n(AVAILABLE)\n[ T ] to make something available: This research opens (up) the possibility of being able to find a cure for the disease. The country is planning to open (up) its economy to foreign investment.\nMore examplesFewer examplesThe market has been opened up to private investors.By denying responsibility for the matter, the minister has opened himself up to criticism.Deregulation has opened the rail industry to competition.The chairman opened up the meeting to questions from the audience.Organizers have been urged to open the race up to international runners.\nSMART Vocabulary: related words and phrases\nAvailable and accessible\naccessibility\naccessible\naccessibly\nat your command idiom\navailability\ndrop\nnon-restricted\nnothing\nobtainable\non call idiom\non demand idiom\non/about your person idiom\nrelease\nseason\nstream\nunfreeze\nunfrozen\nunlock\nunobtainable\nup for grabs idiom\nSee more results »\nopen verb\n(COMPUTER)\nB1 [ T ] If you open a computer document or program, you make it ready to read or use: To open a new document, click \"File\" and then click \"New\". Click the desktop icon to open the Cambridge Advanced Learner's Dictionary.\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntap\ntoolbar\nvectorization\nvectorize\nvirtualization\nvirtualize\nwake word\nzip file\nSee more results »\nGrammar\nOpen or opened?We use open as an adjective to mean ‘not closed’: …\nIdioms\nthe earth/ground/floor opens\nopen someone's eyes\nopen your heart to someone\nopen your mouth\nopen doors\nopen the door to somethingPhrasal verbs\nopen something out/up\nopen (something) up\nopen something up\nopen someone up\nopen up\nopen noun [S]\n(NOT ENCLOSED)\nthe open\nsomewhere outside, rather than in a building: It's good to be (out) in the open after being cooped up in an office all day.\nSMART Vocabulary: related words and phrases\nFrom, out and outside\nal fresco\nbreath\ndoor\nexogenous\nexterior\nexteriority\nextrinsic\nextrinsically\nforth\nindigenous\nnon-indigenous\noutdoorsman\noutdoorswoman\noutdoorsy\nouter\noutermost\noutside\noutwith\nthence\ntherefrom\nSee more results »\nopen noun [S]\n(NOT SECRET)\nout into the open (US also out in the open)\nnow known or able to be seen when it was hidden before: It's time this issue was brought out into the open.\nSee more\nopen adjective, adverb [not gradable]\n(POSITIONED FOR ACCESS)\nAdd to word list\nAdd to word list\nbeing in a position that allows things to pass through or that allows for immediate use; not closed or fastened: The window was wide open. The trunk of his car had been pried open. Idioms\nin the open\nopen someone’s eyes\nopen fire\nopen your mouth\nopen the floodgates\nopen adjective\n(READY FOR USE)\n[ not gradable ] ready to be used or to provide a service: The supermarket is open till 9 p.m.\nopen adjective\n(NOT DECIDED)\nnot decided or certain: I want to keep my options open until I have all the facts. Whether we’ll go is still an open question. You should keep an open mind about your new school (= not form any opinions) until you’ve been there.\nopen adjective\n(NOT SECRET)\nnot secret: Open warfare had broken out in Yugoslavia.\nA person who is open is honest and not trying to hide something: He is quite open about his weaknesses.\nopen adjective\n(NOT COVERED)\nnot enclosed or covered: The park is one of the city’s largest open spaces.\nopen adjective\n(AVAILABLE)\n[ not gradable ] available; not limited: Are there any positions open in the marketing department? This library is open to the general public. Their behavior at these negotiations is open to criticism (= can be criticized). I’m open to (= willing to consider) any reasonable suggestion.\nopenly adverb us\nYour browser doesn't support HTML5 audio\n/ˈoʊ·pən·li/\nShe talked about her cancer quite openly. openness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈoʊ·pən·nəs/\nThe agency released detailed plans for greater openness and stronger standards in the international marketplace.\nopen verb [I/T]\n(BEGIN)\nto begin something or cause it to begin: [ T ] I would like to open the meeting by asking each of you to introduce yourself. [ M ] They’re opening up a new restaurant in about a month. [ I ] The film opens (= will be shown for the first time) next week.\nopen verb [I/T]\n(MAKE READY FOR USE)\nto become or make something ready to provide a service: [ I ] The cleaners opens (up) around seven. [ T ] They opened the exhibit to the public yesterday. opening adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈoʊ·pə·nɪŋ/\nHe made some opening remarks, then introduced the main speaker. Phrasal verbs\nopen up\nopen up\nopen up something\nopen up something\nAdd to word list\nAdd to word list\nCOMMERCE if a shop, bank, office, etc. is open, its door are unlocked and it is doing business: Our offices are open from 9 to 5. The club has a liquor license allowing it to remain open until 2 a.m. The new airport terminal is now open for business.\nSTOCK MARKET if a financial market is open, investors can trade shares, bonds, etc. on it: For the purposes of this agreement, a business day is any day that the New York Stock Exchange is open for business.\nwilling to consider something: open to sth A spokesman for the organization said they were open to a deal at the right price. open to offers/suggestions/negotiation\navailable to be used, considered, etc. : open to sth Membership is open to all local businesses.leave the door/option/possibility open The appeals court left open the possibility that the computing giant could be forced to change its business practices.\nnot secret or hidden from members, the public, etc.: open about sth After the economic crisis, consumers expect banks to be more open and transparent about their lending policies.\nallowing everyone to share their ideas and information: open debate/dialogue/discussion These are complicated questions, and we welcome an open discussion about them. open communication\nIT if a computer file, document, or program is open, it is ready to be used: Make sure the file you're copying to is open before you click 'Paste'. Compare\nclosed\nkeep your options open\nto avoid doing or deciding something immediately in case there is a better opportunity to consider later: They are still keeping their options open but a merger is a strong possibility.\nopen court\nLAW a court of law where the details of a case are available to the public: The law firm didn't want the hearings held in open court because it feared the press would influence public opinion.\nopen question\nsomething which has not been decided yet: How voters will view this latest crisis remains an open question.\nhave/keep an open mind\nto wait until you know all the facts before forming an opinion or making a decision about something: The judge urged the jury to keep an open mind until they had heard all the evidence.\n[ I or T ]\n&#160; COMMERCE to start doing business and dealing with customers : We open daily from 11 to 6.\n[ I or T ]\n&#160; COMMERCE to start a new business: The Chicago-based coffee chain has opened branches in every major city in the UK.\n[ I ]\n&#160; STOCK MARKET if shares, bonds, etc. open at a particular price or rate, that is the amount they are worth when trading starts that day: Share prices on the London Stock Exchange opened lower today.\n[ T ] to start something: open a conference/meeting/proceedings The Chief Executive opened the meeting with an announcement of big redundancies throughout the group.open discussions/negotiations/talks The union had not yet decided when to open negotiations with management.\n[ T ]\n&#160; IT if you open a computer file, document, or program you make it ready for you to start reading or working on: You can open the program from the menu or by double-clicking the icon. Compare\nclose (sth) down\nopen an account\nBANKING to enter into an agreement with a bank or other financial organization so that they look after your money: Open an internet savings account before the end of March and get a free mobile phone.\nopen your borders/markets\nCOMMERCE to allow foreign countries to sell their goods and products in your country with fair conditions: The US threatened to put a 100% tax on Japan's luxury cars unless it agreed to open its markets to US cars and parts.\nopen doors for sb (also open the door for sb)\nto make it possible for someone to do something: The former Republican candidate was key in opening the door for more women to run for office in the US.\nopen the floodgates (to sb/sth)\nto make a lot of people do something by removing a rule that stopped it being possible before, especially when you do not want this to happen: Banks feared the legal action could open the floodgates for customers to sue over high fees. Phrasal verb\nopen up\nSTOCK MARKET the time when a stock market begins trading: Bonds rose at the open after a cut in German interest rates. Stocks fell heavily at the open of trading today."}