{"id":253595,"name":"operator","type":"noun","us_sound":"ˈɑː.pə.reɪ.t̬ɚ","us_link":"../audio/o/usl30246.mp3","uk_sound":"ˈɒp.ər.eɪ.tər","uk_link":"../audio/o/ukopera004.mp3","content":"operator noun [C]\n(PERSON OR BUSINESS)\nAdd to word list\nAdd to word list\nB2 someone whose job is to use and control a machine or vehicle: a computer operator\nB2 a company that does a particular type of business: a tour operator\na person who helps to connect people on a phone system a smooth, clever, etc. operator\nsomeone who is skilled at dealing with people and getting what he or she wants from a situation: He has shown himself to be a canny operator in wage negotiations.\nSee more\nMore examplesFewer examplesWe rationalized the production system so that one operator could control all three machines.The tour operator will arrange transport and plan your itinerary.Radar operators plotted the course of the incoming missile.At the twiddle of a knob the operators can focus on a tiny amount of airspace or scan the whole area.Beach operators do not have a legal obligation to provide against injury or drowning.\nSMART Vocabulary: related words and phrases\nActing and acts\n(your) every move idiom\n-ence\nact\nact for someone\nact/do something on your own responsibility idiom\nactivity\nADL\nagency\nant\ner\nexecution\nexploit\nmove\nput your money where your mouth is idiom\nresponsibility\nrole-play\nrot\nstep\nstuff\ntalk\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnterprises\nCommunications - by telephone\noperator noun [C]\n(IN MATHEMATICS)\nmathematics\n&#160; specialized a symbol that does something to a number or quantity in a calculation. For example, in 7 + y, the symbol + is the operator Compare\noperand\nSMART Vocabulary: related words and phrases\nMathematical symbols\naddition sign\ndegree\ndivision sign\nequal sign\nexpression\nfoot\nminus\nmultiplication sign\npi\nplaceholder\nplus\npoint\nsolidus\nsubtraction sign\nvalue\nX, x\nY, y\nYou can also find related words, phrases, and synonyms in the topics:\nCalculations & calculating\nAdd to word list\nAdd to word list\na person who makes something work or puts something into action: a computer/machine operator\nAn operator is also a person who works on a telephone switchboard: Dial or press zero for the operator.\nusually disapproving An operator is a person who is often successful but seems too intelligent or speaks and acts too quickly and may not always be honest: He’s a smooth operator.\nAdd to word list\nAdd to word list\nsomeone whose job is to use and control a machine, vehicle, or piece of equipment: a camera/crane/forklift operator The system lets you talk directly to a call centre operator.\na company that runs a particular type of business: a cable/mobile-phone/hotel operator The company is the owner and operator of several radio stations.\nCOMMUNICATIONS a person who connects people on a phone system: a switchboard operator He worked as a 911 operator with the Cincinnati Police Department.\na smooth/slick/clever operator informal\na person who deals with people or problems in a clever way, especially for their own advantage: He has shown himself to be a clever operator in wage negotiations. See also\nowner-operator\ntour operator"}