{"id":253571,"name":"operate","type":"verb","us_sound":"ˈɑː.pə.reɪt","us_link":"../audio/o/eus75231.mp3","uk_sound":"ˈɒp.ər.eɪt","uk_link":"../audio/o/ukoomph027.mp3","content":"operate verb\n(WORK)\nAdd to word list\nAdd to word list\nB2 [ I or T ] to (cause to) work, be in action or have an effect: How do you operate the remote control unit? Does the company operate a pension scheme? For several years she operated a dating agency from her basement. Changes are being introduced to make the department operate more efficiently. Specially equipped troops are operating in the hills. We have representatives operating in most countries. Exchange rates are currently operating to the advantage of exporters.\nMore examplesFewer examplesThe video provides instruction on how to operate the computer.This sewing machine is operated by a foot pedal.The legal system operates very differently in the US and Britain.Terrorists have been operating covertly in England for several years.The scheme is simple and cheap to operate.\nSMART Vocabulary: related words and phrases\nMachines - Functioning\naction\nactuator\ndeactivation\nengaged\nfaultily\nfaulty\nfire someone up\nfunction as something/someone\nin commission idiom\nlight\noperative\npeg\npeg out\nplay something up\npower\npower (something) up\nrefire\nreset\nroad\ntick\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPerforming a function\noperate verb\n(MEDICAL PROCESS)\nB1 [ I ] to cut a body open for medical reasons in order to repair, remove, or replace an unhealthy or damaged part: If the growth gets any bigger they'll have to operate. Are they going to operate on him?\nSMART Vocabulary: related words and phrases\nMedical treatment: surgery\nablate\nadrenalectomy\namputation\namputee\nanaesthesiology\nanaesthetize\nharvesting\nhave something out\nhysterectomy\nimplantable\nimplantation\nincision\ninteroperative\nlaughing gas\nliposuction\nreplacement\nresected\nresection\nrhino\nrhinoplasty\nSee more results »\noperate verb\n(WORK)\nAdd to word list\nAdd to word list\n[ I/T ] to work or cause something to work, be in action, or have an effect: [ T ] How do you operate the remote control unit? [ I ] Changes are being introduced to make the department operate more efficiently.\noperate verb\n(USE MEDICAL PROCESS)\n[ I ] to cut a body open in order to repair, remove, or replace an unhealthy or damaged part: Doctors will operate on her tomorrow morning.\nAdd to word list\nAdd to word list\n[ T ] to use or control equipment or a machine or to make something work: Older people are returning to classrooms for instruction in everything from operating a mouse to mastering spreadsheets.\n[ I ] if a business, system, etc. operates in a particular way, it works or is used in that way: Changes are being introduced to make the department operate more profitably. Exchange rates are currently operating to the advantage of exporters.operate as sth The company operates as an international delivery service for produce trading companies.operate through sb/sth Centralized lenders operate through mortgage brokers and insurance companies.operate at sth The plant is operating at barely 30% of capacity.\n[ I ] to do business in or from a particular place: operate across/in/from sth We operate in 50 countries around the world. We have representatives operating in most countries.operate out of sth The organization operates out of a small office in the centre of town.\n[ T ] to manage a business, service, etc. and make it work: The company operated 156 fewer stores this year. We began operating a pilot service earlier this year. Does the company operate a pension plan?"}