{"id":253580,"name":"operation","type":"noun","us_sound":"ˌɑː.pəˈreɪ.ʃən","us_link":"../audio/o/eus75233.mp3","uk_sound":"ˌɒp.ərˈeɪ.ʃən","uk_link":"../audio/o/ukoomph030.mp3","content":"operation noun\n(WORK)\nAdd to word list\nAdd to word list\nC1 [ U ] the fact of operating or being active: There are several reactors of the type in operation (= working) at the moment. We expect the new system for assessing claims to come into operation (= start working) early next year.\n[ U ] the way that parts of a machine or system work together, or the process of making parts of a machine or system work together\nC1 [ C ] a business organization: Less profitable business operations will have difficulty in finding financial support.\nC1 [ C ] an activity that is planned to achieve something: a military/peacekeeping operation. Following the earthquake, a large-scale rescue operation was launched. [ + to infinitive ] The operation to fly in supplies will begin as soon as possible.\nMore examplesFewer examplesThe rescue operation has been complicated by bad weather.We need to look at the logistics of the whole aid operation.They mounted a salvage operation after the fire.Starting your own business can be a risky operation.They're winding down their operations abroad because they're losing money.\nSMART Vocabulary: related words and phrases\nMachines - Functioning\naction\nactuator\ndeactivation\nengaged\nfaultily\nfaulty\nfire someone up\nfunction as something/someone\nin commission idiom\nlight\noperative\npeg\npeg out\nplay something up\npower\npower (something) up\nrefire\nreset\nroad\ntick\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPerforming a function\nEnterprises\nActing and acts\noperation noun\n(MEDICAL PROCESS)\nB1 [ C ] (UK informal op) an occasion when a doctor cuts a body for medical reasons in order to repair, remove, or replace an unhealthy or damaged part: a major/minor/routine operation an abdominal/cataract/transplant operation He has to have an operation on his shoulder. [ + to infinitive ] We will know in a couple of days if the operation to restore her sight was successful.\nMore examplesFewer examplesThe hospital has a two-year waiting list for minor operations.The child's parents or guardians must give their consent before she has the operation.After the operation the wound became infected.The operation involves putting a small tube into your heart.The operation must be carried out under sterile conditions.\nSMART Vocabulary: related words and phrases\nMedical treatment: surgery\nablate\nadrenalectomy\namputation\namputee\nanaesthesiology\nanaesthetize\nharvesting\nhave something out\nhysterectomy\nimplantable\nimplantation\nincision\ninteroperative\nlaughing gas\nliposuction\nreplacement\nresected\nresection\nrhino\nrhinoplasty\nSee more results »\noperation noun\n(MATHEMATICS)\n[ C ]\n&#160; mathematics\n&#160; specialized a mathematical process, such as addition, in which one set of numbers is produced from another\nSMART Vocabulary: related words and phrases\nCalculations & calculating\nalgebraic\nalgebraically\nalgo\nalgorithmic\namount\ncalculate\nguesstimate\ninterpolate\ninverse function\nlinear equation\nmathematical\nmatrix\nmiscalculate\nmiscalculation\nmiscount\nmultigrid\noperator\nsum\nsum total\nwork something out\nSee more results »\noperation noun\n(MATHEMATICS)\nAdd to word list\nAdd to word list\n[ C ]\n&#160; mathematics a mathematical process, such as addition, in which one set of numbers is produced from another\noperation noun\n(MEDICAL PROCESS)\n[ C ] a medical process in which doctors cut a body open in order to repair, remove, or replace an unhealthy or damaged part: She underwent a six-hour open-heart operation.\noperation noun\n(WORK)\n[ C/U ] an act or process of working, doing something, being in action, or having an effect: [ U ] Several printing presses are in operation (= working) at the moment. [ C ] Setting a mousetrap is a delicate operation (= act of doing something).\n[ C/U ] An operation is also an activity planned to achieve something: [ C ] a rescue operation\nAdd to word list\nAdd to word list\n[ U ] the fact of operating or being active: come into/begin operation We expect the new procedure to come into operation early next year.be out of/cease operation The company was facing a court order to cease operation. The construction work will not affect the day-to-day operation of the company.in operation There are several reactors of this type in operation at the moment. We hope to be in commercial operation within three months. The firm is in its third year of operation.\n[ C ] a business organization: Less profitable business operations will have difficulty finding financial support. a banking/retail/manufacturing operation We can capture carbon emissions at power plants, oil refineries, and cement-making operations. The group's profits fell, despite a good performance from its overseas operations.\noperations [ U ]\nMANAGEMENT the activities involved in a company producing goods or delivering services: Mary handles operations and travel planning.head/director of operations He is director of operations for a recruitment agency. The operations department is responsible for ensuring a company operates as efficiently and economically as possible.\n[ C ] an activity which is planned to achieve something: an operation to do sth The police have launched an operation to prevent the sale of pirated software. A rescue operation to save the country's largest bank is underway. a cost-cutting operation. a military/peacekeeping operation\n[ U ] the way that parts of a machine work together, or the process of making parts of a machine or system work together: Teamwork is essential to ensure the smooth operation of the department. Open the machine and check the operation of the locking mechanism. See also\nholding operation\nmaterials, repair, operation"}