{"id":253845,"name":"opinion","type":"noun","us_sound":"əˈpɪn.jən","us_link":"../audio/o/eus75237.mp3","uk_sound":"əˈpɪn.jən","uk_link":"../audio/o/ukopera011.mp3","content":"Add to word list\nAdd to word list\nB1 [ C ] a thought or belief about something or someone: What's your opinion about/on the matter? People tend to have strong opinions on capital punishment. He didn't express/give an opinion on the matter. Who, in your opinion, (= who do you think) is the best soccer player in the world today? He's very much of the opinion that alternative medicine is a waste of time.\nB2 [ U ] the thoughts or beliefs that a group of people have: Eventually, the government will have to take notice of public opinion. There is a diverse range of opinion on the issue. There was a difference of opinion as to the desirability of the project. Opinion is divided as to whether the treatment actually works. Both performances were excellent, it's simply a matter of opinion as to whose was better.\nB1 [ C ] a judgment about someone or something: Her opinion of Adam changed after he was so helpful at the wedding. She has a good/high opinion of his abilities (= thinks he is good). I have a pretty bad/low/poor opinion of my sister's boyfriend (= I do not like or approve of him). He has a very high opinion of himself (= thinks he is very skilled/clever in a way that is annoying).\nB1 [ C ] a judgment made by an expert: My doctor has referred me to a specialist for a second opinion on the results of my blood test. Synonyms\nmentality\nmindset\noutlook (OPINION)\npoint of view\nstandpoint\ntake on something\nview (OPINION)\nviewpoint\nMore examplesFewer examplesIt is my considered opinion that he should be promoted.What amazes me is her complete disregard for anyone else's opinion.What's your expert opinion?She has strong opinions about religion.Her experience does give her opinions quite a bit of weight.\nSMART Vocabulary: related words and phrases\nOpinions, beliefs and points of view\nAfrocentric\nagnosticism\nanti-ideological\narticle of faith\nascription\nbubble\ncreed\nhelicopter view\nheretical\nheretically\nhot take\nidea\noutlook\npole\nposture\npretension\nprism\nredistributionist\nrelativism\ntick\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIdeas, concepts and theories\nGrammar\nOpinionWe use opinion as a noun to mean beliefs or judgements about someone or something. When it refers to the beliefs or judgements of individuals, it is countable: …\nAdd to word list\nAdd to word list\nthe ideas that a person or a group of people have about something or someone, which are based mainly on their feelings and beliefs, or a single idea of this type: [ C ] When you're a teenager you've got strong opinions on/about everything. [ C ] McGuinness was expressing his personal opinion. [ U ] Her writings influenced public opinion. [ C ] I think you’re wrong, though you’re certainly entitled to your opinion.\nAdd to word list\nAdd to word list\n[ C ] a thought or belief about something or someone: an opinion on sth What's your opinion on Britain joining the Euro?have/hold an opinion She has strong opinions on how people should dress for work.express/give your opinion They will have the opportunity to express their opinion on the design.ask/seek sb's opinion We will seek opinions from the public before going forward.in sb's opinion Who, in your opinion, is the best candidate for the job?be of the opinion that He's very much of the opinion that we should outsource the project.\n[ U ] the thoughts or beliefs that a group of people have: Eventually, the government will have to take notice of public opinion. There was a difference of opinion over his appointment. Opinion is divided as to whether the treatment actually works. It's a matter of opinion which approach is best.\n[ C ] a judgment about someone or something: an opinion of sb/sth Her opinion of Adam changed after he'd helped her with her project. She has a high opinion of his abilities. I have a rather poor opinion of the sales manager.\n[ C ] a judgment made by an expert: You should get a second opinion from an engineer. See also\nclean opinion\nqualified opinion"}