{"id":253963,"name":"opportunity","type":"noun","us_sound":"ˌɑː.pɚˈtuː.nə.t̬i","us_link":"../audio/o/eus75244.mp3","uk_sound":"ˌɒp.əˈtʃuː.nə.ti","uk_link":"../audio/o/ukopera021.mp3","content":"Add to word list\nAdd to word list\nB1 [ C or U ] an occasion or situation that makes it possible to do something that you want to do or have to do, or the possibility of doing something: Everyone will have an opportunity to comment. I was never given the opportunity of going to college. [ + to infinitive ] The exhibition is a unique opportunity to see her later work. An ankle injury meant she missed the opportunity to run in the qualifying heat.formal Please contact us at the earliest opportunity (= as soon as possible). He goes fishing at every opportunity (= as often as possible). I used to love going out dancing, but I don't get much opportunity now. He had a golden (= an extremely good) opportunity to score in the first half but squandered it.\nThesaurus: synonyms, antonyms, and examples\na chance to do somethingchanceI didn't get a chance to say goodbye.opportunityEveryone will get the opportunity to comment.breakHer big break came when she was offered a role in a Spielberg movie.springboardHe hoped writing an opinion piece for The Times would be the springboard he needed to get into journalism.\nSee more results »\nB2 [ C ] the chance to get a job: employment/job opportunities opportunities for young graduates There are some great opportunities now for engineers trained in computer-aided design. Synonyms\nopening (OPPORTUNITY)\nvacancyCompare\nSituations Vacant UK\nMore examplesFewer examplesIf you delay now, the opportunity might be lost.The rights give holders the opportunity to purchase additional equity interests in the company at a big discount.His work provided him with the opportunity for a lot of foreign travel.Job opportunities are severely limited/restricted at the moment.The company is aggressively pursuing new business opportunities.\nSMART Vocabulary: related words and phrases\nOpportunity\nanother/a second bite at/of the cherry idiom\nbe in with a shout idiom\nbest bet idiom\nbig break\nbreak\nfish\nfoot\nhave a few, several, etc. irons in the fire idiom\nhave a field day idiom\nhay\nheadroom\nit's now or never idiom\npass\nplatform\nscope\nshop window\nsmell blood idiom\nsneak peek\nthe American dream\nthe run of something idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nApplying for a job\nGrammar\nOpportunity or possibility?We use opportunity to talk about a situation in which we can do something that we want to do. Opportunity is most commonly followed by a verb in the to-infinitive form, or of + -ing form: …\nAdd to word list\nAdd to word list\nan occasion or situation which makes it possible to do something that you want to do or have to do, or the possibility of doing something: [ C ] She was given the opportunity to manage a day-care center. [ C ] The university is not providing enough recreational opportunities for the community. [ U ] He had ample opportunity to examine the car.\nAdd to word list\nAdd to word list\n[ C or U ] an occasion or situation that makes it possible to do something that you want to do or have to do, or the possibility of doing something: an opportunity to do sth There will be an opportunity to discuss the matter again next week.an opportunity for sth Fast internet service in rural areas provided a new opportunity for prosperity.get/have an opportunity Everyone will have the opportunity to comment.give/offer/provide an opportunity The merger offers an excellent opportunity for growth in the Asian market.take/seize an opportunity We need to seize this opportunity while we can.miss/lose an opportunity I've been invited to speak at the conference – it's an opportunity that's too good to miss. You should include employees in decision-making at every opportunity. Please contact us at the earliest opportunity. He left because there was a lack of opportunity for promotion.\n[ C ] a chance to get a job: employment/job opportunitiesan opportunity for sb We need to create more opportunities for young graduates. See also\nEqual Employment Opportunity\nequal opportunities"}