{"id":253978,"name":"opposite","type":"adjective","us_sound":"ˈɑː.pə.zɪt","us_link":"../audio/o/eus75246.mp3","uk_sound":"ˈɒp.ə.zɪt","uk_link":"../audio/o/ukopera025.mp3","content":"opposite adjective\n(DIFFERENT)\nAdd to word list\nAdd to word list\nB2 completely different: You'd never know they're sisters - they're completely opposite to each other in every way. Police attempts to calm the violence had the opposite effect.\nThesaurus: synonyms, antonyms, and examples\ncompletely differentoppositeTheir two daughters may look alike, but they are completely opposite to one another. polar oppositesLove and hate are polar opposites.identicalHis opinions are identical to his spouse's.antitheticalHis actions were absolutely antithetical to our code of conduct.converseIf we ask what a citizen must sacrifice for the good of the nation, we must ask the converse question: what will the nation sacrifice for the good of its citizens?\nSee more results »\nMore examplesFewer examplesThe two politicians have diametrically opposite points of view.Two of the president's chief advisors have staked out opposite positions on this issue.He held the opposite view to his brother.The witnesses gave opposite accounts of who caused the accident.The movie was supposed to be scary, but it had the opposite effect on him.\nSMART Vocabulary: related words and phrases\nOpposites\nantinome\nantithesis\nantithetical\nantonymous\nanything\nconverse\ncounterpose\ndiametric\ndiametrical\ndichotomist\ndichotomous\nflip side\nnegation\nor otherwise idiom\notherwise\npolar\npolarity\npole\npoles apart idiom\nreverse\nSee more results »\nopposite adjective\n(FACING)\nB1 being in a position on the other side; facing: My brother and I live on opposite sides of the city. The map on the opposite page shows where these birds commonly breed. They sat at opposite ends of the table (to/from each other), refusing to talk.\nfacing the speaker or stated person or thing: If you want to buy tickets, you need to go to the counter opposite. Who owns that house opposite (= on the other side of the road)?\nsport\n&#160; specialized In baseball, the opposite field is the right side of the field for a right-handed batter (= the person who hits the ball) or the left side of the field for a left-handed batter: He hit a home run to the opposite field. Wilson hit the pitch the opposite way for a single.\nMore examplesFewer examples\"No, go that way, \" I said, pointing in the opposite direction.These two men might be thought to represent the opposite poles of economic ideology.By the time we reached the opposite bank, the boat was sinking fast.Firmly secure the two uprights to opposite walls in the alcove and then slot the shelves in between them.They drove away in opposite directions.\nSMART Vocabulary: related words and phrases\nThrough, across, opposite and against\nacross\nacross country idiom\nagainst\nagin\nalong\ncatty-corner\ncountry\nfront\ngive\nkitty-corner\non\nother\noverland\nthrough\nthru\nto\ntrans\nunblock\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBaseball & rounders\nA2 in a position facing someone or something but on the other side: We're in the building opposite the government offices. They sat opposite each other. Put a tick opposite (= next to) the answer that you think is correct. act/play/star opposite someone\nto act a part in a film or play with someone as a partner: Katharine Hepburn played opposite Henry Fonda in many films.\nSee more\nMore examplesFewer examplesWe're in the very modern-looking building opposite the station.I live bang opposite the cinema.A thin, bearded man sat opposite me on the train.The woman seated opposite him refused to stop staring at him.The women sitting opposite us were gazing admiringly at baby Joe.\nSMART Vocabulary: related words and phrases\nThrough, across, opposite and against\nacross\nacross country idiom\nagainst\nagin\nalong\ncatty-corner\ncountry\nfront\ngive\nkitty-corner\non\nother\noverland\nthrough\nthru\nto\ntrans\nunblock\nSee more results »\nGrammar\nOpposite or in front of?Opposite as a preposition means ‘in a position facing someone or something but on the other side’: …\nB1 something or someone that is completely different from another person or thing: My father is a very calm person, but my mother is just the opposite. She's turned out to be the exact opposite of what everyone expected. The opposite of \"fast\" is \"slow\". People say opposites attract. Synonyms\nantonym specialized\nthe inverse formalCompare\nsynonym\nMore examplesFewer examplesWhile claiming to promote positive images of women, advertisers are in fact doing the very opposite.She's very thoughtful - the direct opposite of her sister.No, I'm not tired. Rather the opposite in fact.What's the opposite of 'steep'?I don't dislike him - quite the opposite, actually.\nSMART Vocabulary: related words and phrases\nOpposites\nantinome\nantithesis\nantithetical\nantonymous\nanything\nconverse\ncounterpose\ndiametric\ndiametrical\ndichotomist\ndichotomous\nflip side\nnegation\nor otherwise idiom\notherwise\npolar\npolarity\npole\npoles apart idiom\nreverse\nSee more results »\nGrammar\nOppositenessMost common adjectives are members of a pair of opposites (antonyms): …\nGradable opposites (antonyms)The most common gradable adjectives can be grouped into pairs of opposites (antonyms) which refer to features like height: short – tall; heat: hot – cold, size; big – small, etc. These adjectives are at the upper and lower parts of an open-ended scale (a scale with no maximum or minimum): …\nB1 in a position facing someone or something but on the other side: She asked the man sitting opposite whether he'd mind if she opened the window. The people who live opposite (= on the other side of the road) are always making a lot of noise. Synonym\nface-to-faceCompare\nin front\nMore examplesFewer examplesI asked the woman opposite if I could use her phone.I was on the metro this morning when for no apparent reason the man opposite suddenly screamed.I went to the bank opposite.The house opposite is owned by an Italian family.The ball ended up in the field opposite.\nSMART Vocabulary: related words and phrases\nThrough, across, opposite and against\nacross\nacross country idiom\nagainst\nagin\nalong\ncatty-corner\ncountry\nfront\ngive\nkitty-corner\non\nother\noverland\nthrough\nthru\nto\ntrans\nunblock\nSee more results »\nopposite adjective [not gradable]\n(DIFFERENT)\nAdd to word list\nAdd to word list\ncompletely different: We turned and walked in the opposite direction. People often believe the exact opposite of what you tell them. His efforts to intimidate his enemies produced just the opposite effect (= made them braver).\nopposite preposition, adjective, adverb [not gradable]\n(FACING)\nbeing in a position on the other side; facing: The two settlements are on opposite sides of the river. We’re in the building opposite the gas station. She asked the man sitting opposite if she could borrow his newspaper.\nAdd to word list\nAdd to word list\ncompletely different: opposite to sth This year's conference is completely opposite to last year's, which was very poorly attended. The new rates of pay were intended to increase staff morale, but they had the opposite effect.\nin a position on the other side to something: the opposite side/end/edge to sth We're on the opposite side of the city to the airport.\nfacing you or facing someone or something: If you want to buy tickets, you need to go to the counter opposite.\nin a position facing someone or something but on the other side: We're in the building opposite the government offices. They sat opposite each other.\nsomething or someone that is completely different from another person or thing: the opposite of sth/sb She tends to do the opposite of what people expect. The new CEO is the exact opposite of his predecessor. We thought negotiations would be easy, but they were just the opposite.\nin a position facing someone or something but on the other side: The offices will be on this side of the road, and the warehouse will be built opposite."}