{"id":254119,"name":"optimism","type":"noun","us_sound":"ˈɑːp.tə.mɪ.zəm","us_link":"../audio/o/eus75257.mp3","uk_sound":"ˈɒp.tɪ.mɪ.zəm","uk_link":"../audio/o/ukoppre012.mp3","content":"Add to word list\nAdd to word list\nC2 the quality of being full of hope and emphasizing the good parts of a situation, or a belief that something good will happen: There was a note of optimism in his voice as he spoke about the company's future. They had cause/grounds/reason for cautious optimism about an improvement in her medical condition. Opposite\npessimism\nMore examplesFewer examplesIn spite of the scale of the famine, the relief workers struggled on with dauntless optimism and commitment.Her optimism seemed to infect all those around her.The prevailing mood is one of optimism.The prime minister's speech was intended to purvey a message of optimism.International support has given rise to a new optimism in the company.\nSMART Vocabulary: related words and phrases\nHoping and hopefulness\nappealingly\nboosterish\nboosterism\ncautious\ncautiously\nglass\nhopeful\nhopefully\nhopefulness\nill\nit's an ill wind (that blows nobody any good) idiom\nla-la land\npipe dream\nplease God idiom\nPollyanna\npositive\npositiveness\npositivism\ntrust\nwing\nSee more results »\nAdd to word list\nAdd to word list\nthe tendency to be hopeful and to emphasize or think of the good part in a situation rather than the bad part, or the feeling that in the future good things are more likely to happen than bad things: There was a note of optimism in his voice as he spoke about his recovery. optimist noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈɑp·tə·mɪst/\nShe was an optimist in the face of adversity. optimistic adjective us\nYour browser doesn't support HTML5 audio\n/ˌɑp·təˈmɪs·tɪk/\nI’m optimistic that they can work things out. optimistically adverb us\nYour browser doesn't support HTML5 audio\n/ˌɑp·təˈmɪs·tɪ·kli/\nWhite optimistically predicted success.\nAdd to word list\nAdd to word list\nthe feeling that good things are more likely to happen than bad things: optimism about/over sth There was a wave of optimism about future earnings of software and internet companies. Some analysts expressed cautious optimism that this could be a turning point. consumer/investor/public optimism reason/cause for optimism Compare\npessimism"}