{"id":254139,"name":"option","type":"noun","us_sound":"ˈɑːp.ʃən","us_link":"../audio/o/eus75260.mp3","uk_sound":"ˈɒp.ʃən","uk_link":"../audio/o/ukoppre018.mp3","content":"Add to word list\nAdd to word list\nB1 [ C or U ] one thing that can be chosen from a set of possibilities, or the freedom to make a choice: The best option would be to cancel the trip altogether. There are various options open to someone who is willing to work hard. They didn't leave him much option - either he paid or they'd beat him up.\n[ C ]\n&#160; finance &amp; economics\n&#160; specialized the right to buy something in the future: UK a share optionUS a stock option The publishers decided not to take up their option on the paperback version. have no option (but to do something)\nC1 to have to do a particular thing because there is no possibility of doing anything else: After her appalling behaviour, we had no option but to dismiss her.\nMore examplesFewer examplesI think we should go for the safest option.They're considering separation as an option.Whichever option we choose there'll be disadvantages.The committee decided in favour of the cheapest option.The government has few options except to keep interest rates high.\nSMART Vocabulary: related words and phrases\nTaking and choosing\nadopt\nadopted\nadoption\nappoint\nbags I... idiom\nbe your best bet idiom\ncull\nempanel\nfaute de mieux\nfavoured\nfilterable\ngo for someone\npicker\nRobin Hood\nselect\nselection\nselective\nselectively\nskim\nyou pays your money and you takes your choice/chance idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStock markets\nLack of freedom to act\nIdiom\nhave/keep your options open\nAdd to word list\nAdd to word list\none thing that can be chosen from a set of possibilities, or the freedom to make a choice: The program helps students explore career options.\nAn option is also a part of a contract that allows for something to happen in the future: He decided to exercise an option to break the team’s lease on the stadium. Idiom\nkeep your options open\nAdd to word list\nAdd to word list\n[ C or U ] one of a number of choices or decisions you can make, or the ability or freedom to choose what you do: You need to think very carefully about the various options. Our options look fairly limited at the moment.have the option of doing sth Insurance policyholders with the company have the option of waiving the excess altogether.have the option to do sth Customers have the option to cancel the contract within 21 days.explore/review/look at the options WTO members are reviewing options for improving market access for the least-developed countries.assess/consider/weigh the options The board will take its time in weighing the available options.not be an option If telecommuting isn't an option, firms can offer their employees more flexible working schedules.have no/little option (but to) In order to compete, we have no option but to cut prices.\n[ C ]\n&#160; FINANCE, STOCK MARKET an agreement that can be bought and sold, that gives the owner the right to decide whether to buy or sell shares, bonds, etc. for a fixed price within an agreed time period or on a particular date: share/stock option I took the job because they were offering good health care and stock options.exercise an option (to do sth) We acquired the right to own a 100% interest in the company, and we expect to exercise that option. The phone company could exercise their option to sell part of their stake in Verizon.an option on sth She has options on about 448,000 shares.\n[ C ]\n&#160; FINANCE, COMMERCE an agreement in which a company buys a product from another company and has the right to buy more of that product later, but does not have to do so: take an option (on/for sth) The airline also said it plans to take options on three of the 777-200 jets.\n[ C ]\n&#160; COMMERCE, MARKETING something that is added, at extra cost, to a basic product or service to make it more attractive, efficient, etc.: Options such as metallic paint and leather seats increase the price of the car considerably.\n[ C ]\n&#160; IT one in a list of possible actions that appears on a computer screen when you click on a button: Click on \"File\" to see the list of options.\n[ C ]\n&#160; COMMUNICATIONS one of a set of numbered choices that you are given on the phone when you call a company or organization, that allow you to choose which person, department, etc. you want to speak to: Listen carefully and choose from one of the following options.\nkeep your options open\nto wait before making a decision to make sure that you know all the choices that are available to you: Better offers are becoming available all the time, so you should keep your options open. See also\nAmerican option\nAsian option\ncall option\ncovered option\ncurrency option\ndouble option\nEuropean option\ngreenshoe option\nindex option\nin-the-money option\nView all\nnuclear option\nout-of-the-money option\nput and call option\nput option\nshare option\nstock-index option\nstock option\ntraded option"}