{"id":254198,"name":"or","type":"conjunction","us_sound":"ɔːr","us_link":"../audio/o/eus75267.mp3","uk_sound":"ɔːr","uk_link":"../audio/o/ukoak__004.mp3","content":"or conjunction\n(POSSIBILITIES)\nAdd to word list\nAdd to word list\nA1 used to connect different possibilities: Is it Tuesday or Wednesday today? You can pay now or when you come back to pick up the paint. Are you listening to me or not? The patent was granted in (either) 1962 or 1963 - I can't quite remember which. It doesn't matter whether you win or lose - it's taking part that's important. There were ten or twelve (= approximately that number of) people in the room. He was just kidding - or was he (= but it is possible that he was not)?\nA2 used after a negative verb to mean not one thing and also not another: The child never smiles or laughs. Compare\nnor\nMore examplesFewer examplesIf the product doesn't work, you are given the choice of a refund or a replacement.Are the photos in colour or black and white?Are you comfortable or shall I turn the heat down?You can move the cursor either by using the mouse or by using the arrow keys on the keyboard.Is it my imagination or is David behaving strangely at the moment?\nSMART Vocabulary: related words and phrases\nEither, or, neither, nor\nand\nand/or phrase\neither\nelse\nneither\nnor\nor else idiom\notherwise\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: connecting words which express a contrast\nor conjunction\n(IF NOT)\nB1 if not: You should eat more, or you'll make yourself ill.\nMore examplesFewer examples\"Clear off or I'll call the police!\"Do your coat up, Joe, or you'll freeze.Are you comfortable or shall I turn the heat down?Come on, stir yourselves, or you'll be late!I heard him shout \"Stop, or I'll shoot!\"\nSMART Vocabulary: related words and phrases\nEither, or, neither, nor\nand\nand/or phrase\neither\nelse\nneither\nnor\nor else idiom\notherwise\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: connecting words which express a contrast\nor conjunction\n(EXPLAIN)\nB2 used to show that a word or phrase means the same as, or explains, limits, or corrects, another word or phrase: Rosalind, or Roz to her friends, took the initiative. Things have been going very well recently. Or they were, until two days ago.\nMore examplesFewer examplesI'll do it later. Or, at least I'll try to do it.Football, or soccer as it's sometimes called, is very popular in the country.\nSMART Vocabulary: related words and phrases\nLinguistics: relative forms\nhowsoever\nthat\nwhat\nwhatever\nwhence\nwhenever\nwhere\nwhereby\nwhereof\nwheresoever\nwherever\nwhichever\nwho\nwhom\nwhomever\nwhose\nwhosoever\nwot\nSee more results »\nGrammar\nOr and otherwiseWe often use or and otherwise with conditional meanings: …\nOrOr is a conjunction that connects two or more possibilities or alternatives. It connects words, phrases and clauses which are the same grammatical type: …\nIdioms\nor no\nor so\nused to describe something on a coat of arms (= a special shield or shield-shaped pattern that is the sign of a family, university, or city) that is gold or yellow: The city's crest is a fleur-de-lys or between two roses argent.\nMore examplesFewer examplesRichard III used either a lion Or and a boar argent, or two boars argent.\nSMART Vocabulary: related words and phrases\nSpecific signs and symbols\nargent\narrow\nbadge\nBritannia\ncheck something off\nchevron\ncoat of arms\ncrested\ncross\ndot\nhallmark\nL-plate\nMaltese cross\nMorse code\npatch\nregistered trademark\nsemaphore\nservice mark\nshield\nunderscore\nSee more results »\nOR noun\n(IN HOSPITAL)\n[ C ] US abbreviation for\noperating room US\nSMART Vocabulary: related words and phrases\nMedical places & organizations\nA &amp; E\naccident and emergency\naid station\nbiotech\nbirth centre\nblood bank\nclinic\nconsulting room\ndispensary\ninstitutional\nmadhouse\nmaternity ward\nNICU\nNIH\nnon-hospital\nout of hours idiom\noutpatients\nPICU\nsocialized medicine\nward\nSee more results »\nOR noun\n(ADDRESS)\nwritten abbreviation for the US state of Oregon: used in addresses\nSMART Vocabulary: related words and phrases\nTowns & regions: named regions of countries\nAberdeen City\nAberdeenshire\nAffrilachian\nAK\nAL\nEnglish Canadian\nEssex\nfife\nfl.\nMississippian\nMissouri\nMissourian\nMN\nMonmouthshire\nStaffordshire\nStirling\nStirlingshire\nStrathclyde\nSuffolk\nthe Fertile Crescent\nSee more results »\nor conjunction\n(POSSIBILITIES)\nAdd to word list\nAdd to word list\nused to connect different possibilities: Is today Tuesday or Wednesday? You can get that blouse in blue, gray, or white. There were ten or twelve people in the room (= approximately that number of people). We’d better make a decision soon or the whole deal will fall through.\nAfter a negative verb, or can also continue the negative meaning of the verb: He won’t eat meat or fish (= and will not eat fish either).\nor conjunction\n(EXPLAIN)\nused to show that a word or phrase means the same as, or explains or corrects, another word or phrase: Photons, or individual particles of light, travel huge distances in space. Things were going well, or seemed to be, but the relationship had already begun to change. Idioms\nor else\nor so\nabbreviation for operating room\nAdd to word list\nAdd to word list\nWORKPLACE, MANAGEMENT →\noperations research"}