{"id":254512,"name":"order","type":"noun","us_sound":"ˈɔːr.dɚ","us_link":"../audio/o/eus75280.mp3","uk_sound":"ˈɔː.dər","uk_link":"../audio/o/ukorang022.mp3","content":"order noun\n(REQUEST)\nAdd to word list\nAdd to word list\nA2 [ C ] a request to make, supply, or deliver food or goods: \"Can I take your order now?\" said the waiter. I would like to place (= make) an order for a large pine table.\n[ C ] a product or a meal that has been asked for by a customer: I got an email saying that the order has been shipped. be on order\nIf something is on order, you have asked for it but have not yet received it: The new drilling equipment has been on order for several weeks. do/make something to order\nto do or make something especially for a person who has asked for it: We make wedding cakes to order.\nMore examplesFewer examplesI dictated my order over the phone.They decided not to honour an existing order for aircraft.A waiter hovered at the table, ready to take our order.All our customer orders are handled by computer.There's no logic in the decision to reduce staff when orders are the highest for years.\nSMART Vocabulary: related words and phrases\nBills & invoices\nbilling\nbond\nchit\nclaim form\ncounterfoil\ncredit note\nmischarge\npassbook\npayslip\npro forma\nreceipt\nsales slip\nsavings bond\ntab\nticket\ntill roll\ntoll\ntolled\nunbilled\nwater bill\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBuying\nMaking appeals & requests\norder noun\n(ARRANGEMENT)\nB1 [ U ] the way in which people or things are arranged, either in relation to one another or according to a particular characteristic: The children lined up in order of age/height. I can't find the file I need because they're all out of order (= they are no longer arranged in the correct way). Put the files in alphabetical/chronological order.mainly UK Here's the running order for the concert (= the order in which each item will happen).\nMore examplesFewer examplesGive me the dates in chronological order.The names are published in alphabetical order.I shall list my objections to the plan in ascending order of importance.Keep your files in numerical order.She ranked the bottles in order of size along the shelf.\nSMART Vocabulary: related words and phrases\nOrder and sequence - general words\nalphabetize\naround\nback end\nbe a chapter of accidents idiom\ncatalogue\nchapter\ncycle\ninconsecutive\ninline\nlinear\nlinearity\nlinearly\nlitany\nprecedence\npriority\nprocession\nsecondly\nsequence\nstring\nwave\nSee more results »\norder noun\n(INSTRUCTION)\nB2 [ C often plural ] something that someone tells you you must do: The soldiers fired as soon as their commander gave the order. Soldiers must obey orders. What are your orders? My orders are to search everyone's bag as they come in. The road was closed all day by order of the police. Clean up this room immediately - and that's an order! Compare\nrequest noun be under orders\nto have been told that you must do something by someone in authority: We are under orders not to allow anyone into the building.\n[ C ] an official instruction telling someone what they can or cannot do, or a written instruction to a bank to pay money to a particular person\nMore examplesFewer examplesI think it galls him to take orders from a younger and less experienced colleague.The soldiers listened in silence as their captain gave the orders.Don't blame me, I'm only carrying out my orders.The judge issued a gagging order to prevent the witnesses from speaking to the press.We were sinking fast, and the captain gave the order to abandon ship.\nSMART Vocabulary: related words and phrases\nInstructions and orders\nas per instructions idiom\nbrief\nbriefing\ncharge\nclarion call\ncommandment\ncounter-order\ndictate\ndiktat\ndoctor's orders\nfiat\nimperatively\ninterdict\nmarching orders\norders are orders idiom\nunbriefed\nwalkthrough\nwith\nword\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCourt cases, orders & decisions\norder noun\n(PURPOSE)\nin order (for someone/something) to do something (also in order that something)\nB1 with the aim of achieving something: He came home early in order to see the kids before they went to bed. I agreed to her suggestion in order not to upset her.\nMore examplesFewer examplesThey've introduced all sorts of new elements to that programme in order to broaden its appeal.In order to make the company viable, it will unfortunately be necessary to reduce staffing levels.The president took the unusual step of altering his prepared speech in order to condemn the terrorist attack.Children need to feel secure in order to do well at school.He assumed a false identity in order to escape from the police.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which introduce a cause or reason\nas\nat\ncase\ncourtesy\ncuz\ndint\ndue\nexcept\nexcept that idiom\nherein\ninasmuch as\ninsofar as\nlight\nnecessarily\nnow\nsince\nthat\nthing\nview\nwith a view to doing something idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGoals and purposes\norder noun\n(TIDY)\nB2 [ U ] a situation in which everything is arranged in its correct place: The house was such a mess that she spent the whole day trying to establish some kind of order. leave/put something in order\nto organize something well: I try to leave my desk in order when I go home. He put his affairs in order (= made arrangements for his personal and business matters) before he went into the hospital.\nMore examplesFewer examplesTheir house is always in apple-pie order.You should put your own house in order before you start telling me what to do!I need to put the kitchen in order before I can leave.Make sure you leave the changing rooms in order.We must impose some kind of order on the way this office is run.\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nconcordance\ndescribe\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nset something up\nshake someone down\nshort-list\nshortlist\nsort\ntick\nSee more results »\norder noun\n(STATE)\nB1 [ U ] the state of working correctly or of being suitable for use: TV for sale in (good) working order. Are your immigration papers in order (= legally correct)? The coffee machine is out of order (= not working).\nThesaurus: synonyms, antonyms, and examples\nbrokenbrokenThe microwave's broken.deadThe phone's dead; there must be a problem with the line.defunctThe TV's defunct!bustUK You won't be able to watch the game, the TV's bust.bustedUS Oh no, my laptop's busted.out of orderThe coffee machine was out of order.\nSee more results »\nMore examplesFewer examplesThe cash machine is out of order.The inspectors checked that all the documentation was in order.I forgot to tell her that my phone is out of order.The sign on the elevator read \"out of order\".It has taken about five years to restore the aircraft to full working order.\nSMART Vocabulary: related words and phrases\nMachines - Functioning\naction\nactuator\ndeactivation\nengaged\nfaultily\nfaulty\nfire someone up\nfunction as something/someone\nlight\noperative\npeg\npeg out\nplay something up\npower\npower (something) up\nrefire\nreset\nroad\ntick\nworking\nSee more results »\norder noun\n(CORRECT BEHAVIOUR)\nC2 [ U ] a situation in which rules are obeyed and people do what they are expected to do: The teacher found it hard to keep her class in order. As the demonstration began to turn violent, the police were called in to restore order. After some heated discussion, the chairperson called the meeting to order (= told everyone to stop talking so that the meeting could continue).UK Is it in order (= allowed) for me to park my car outside the building? order! formal\nan expression used in a parliament or a formal meeting to get people's attention and make them stop talking, so that the meeting or discussion can start or continue\nMore examplesFewer examplesThere has been a complete breakdown in law and order.The army has been brought in to maintain order in the region.Would you say the government's stance on law and order has softened?The self-declared guardians of law and order held a press conference.Without realistic sanctions, some teachers have difficulty keeping order in the classroom.\nSMART Vocabulary: related words and phrases\nSocial order & disorder\nanarchic\nanarchism\nanarchist\nanarchistic\nanarchy\nbedlam\ndisorganization\ndisorganized\nferment\nfree-for-all\nhavoc\ninstability\nmaelstrom\nriot\nrioting\nriotousness\nsocial exclusion\nstrife\nturbulence\nturbulent\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: interjections\norder noun\n(SYSTEM)\nC2 [ C ] a social or political system: The collapse of Communism at the end of the 1980s encouraged hopes of a new world order.\nSMART Vocabulary: related words and phrases\nSystems of government\nabsolutism\nancien régime\nanti-apartheid\nanti-communism\nanti-federalist\ndemocratically\ndemocratization\ndemocratize\ndespotic\ndespotically\nkleptocratic\nmajority rule\nmartial law\nmatriarchal\nmatriarchy\npolice state\npost-apartheid\npre-fascist\npure democracy\nregime\nSee more results »\norder noun\n(RELIGION)\n[ C, + sing/pl verb ] a group of people who join together for religious or similar reasons and live according to particular rules: religious/holy orders monks of the Cistercian/Franciscan Order\nSMART Vocabulary: related words and phrases\nReligious people: monks & nuns\nabbess\nabbey\nabbot\nanchorite\nascetic\nbenedictine\nFranciscan\nfriar\nfriary\nhermit\nlay brother\nmonastic\nmonastically\nmonasticism\nmonk\nmother\nprioress\npriory\nTrappist monk\nveil\nSee more results »\norder noun\n(HONOUR)\n[ S, + sing/pl verb ] a group that people are made members of as a reward for services they have done for their country: He was made a knight of the Order of the Garter.\nSMART Vocabulary: related words and phrases\nRoyalty, aristocracy & titles\naccede to something\naccession\nanointed\nanti-monarchical\nanti-monarchist\nduke\ndukedom\nearl\nearldom\nemir\nMessrs\nmiss\nmister\nmonarch\nmonarchist\nroyal prerogative\nroyalist\nroyally\nRt. Hon.\nShah\nSee more results »\norder noun\n(TYPE)\n[ U ] the type or size of something: These were problems of a completely different order from anything we had faced before.formal No successful business can be run without skills of the highest order (= great skills). of the order of (UK also in the order of)\napproximately: The cost will be something in the order of $500.\nSMART Vocabulary: related words and phrases\nGeneral words for size and amount\n-sized\namount\nbulk\ncontent\nelement\nextent\nfootprint\ngood things come in small packages idiom\nhaul\nlevel\nload\nlot\nmeasure\nmuch\npercent\nquantity\nquota\nration\nsmall-scale\nstrong\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCategories and varieties\nApproximate\norder noun\n(BIOLOGY)\n[ C ]\n&#160; biology\n&#160; specialized (used in the classification of plants and animals) a group of related plants or animals: An order is below a class and above a family.\nSMART Vocabulary: related words and phrases\nSpecies & genders\nclade\nclass\ncliff edge\nfemale\nfemaleness\ngenera\ngenus\nhe\nholotype\nintergeneric\nmale\nmulti-species\nparamecium\nphylum\nsame-gender\nshe\nspeciesism\nstrain\nsuborder\nsubspecies\nSee more results »\nGrammar\nIn order toIn order to is a subordinating conjunction. …\nSo that or in order that?We use so that and in order that to talk about purpose. We often use them with modal verbs (can, would, will, etc.). So that is far more common than in order that, and in order that is more formal: …\nIdioms\norders are orders\nout of order\nthe lower orders\nthe order of the day\norder verb\n(REQUEST)\nA2 [ I or T ] to ask for something to be made, supplied, or delivered, especially in a restaurant or shop: I ordered some pasta and a mixed salad. [ + two objects ] There are no shirts left in this size but we could order one for you/order you one.\nMore examplesFewer examplesThe waiter smiled contemptuously at anyone who didn't know which wine to order.I ordered a double espresso.She quickly emptied her glass and ordered another drink.He orders the same thing every time he goes to this restaurant.I'll be ordering a take-away later. Would you like anything?\nSMART Vocabulary: related words and phrases\nBuying\nacquirable\nacquire\nacquisition\nacquisitiveness\nbidding\nbidding war\ninvest\nload up on something\nmisorder\nmoney-off\norder form\norder something in\npurchasing power\nrepurchase\nretail therapy\nROBO\nROPO\nsend\nslate\nsplurge\nSee more results »\norder verb\n(INSTRUCT)\nB2 [ T ] If a person in authority orders someone to do something, or orders something to be done, they tell someone to do it: The management has ordered a cutback in spending. [ + speech ] \"Wait over there,\" she ordered. [ + to infinitive ] They ordered him to leave the room.\nMore examplesFewer examplesI order you to put down your weapon.The police have been ordered to pay substantial damages to the families of the two dead boys.An inquiry was ordered into the recent rail disaster.In a level voice, he ordered the soldiers to aim and fire.You can't just come in here and start ordering people around.\nSMART Vocabulary: related words and phrases\nGiving orders & commands\nall-points bulletin\nboss someone around\nbossily\nbossiness\nbossyboots\ncommanding\ndecree\ndemand\ndictate\nexact\nexpect\ninstruct\nprescribe\npush someone around\nput something on\nshove\nshove someone around\nstick\nstick out for something\ntask\nSee more results »\norder verb\n(ARRANGE)\n[ T ] to arrange a group of people or things in a list from first to last: The documents have been ordered alphabetically. I've ordered the application forms into three groups.\nThesaurus: synonyms, antonyms, and examples\nto arrange papers, furniture, etc.arrangeThe books are arranged in alphabetical order.orderThe names are ordered alphabetically.sortTen million pieces of mail are sorted every day. organizeHe liked to organize his herbs and spices alphabetically in the cabinet.lay outHe laid the playing cards out in a precise circle.set outShe was setting out the usual platter of cheese sandwiches.\nSee more results »\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nconcordance\ndescribe\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nset something up\nshake someone down\nshort-list\nshortlist\nsort\ntick\nSee more results »\nIdiom\norder your thoughtsPhrasal verbs\norder someone around\norder something in\norder noun\n(INSTRUCTION)\nAdd to word list\nAdd to word list\n[ C ] something you are told to do by someone else and which you must do: [ + to infinitive ] The company has received an order to stop releasing pollution into the air. His defense was that he was only obeying orders.\norder noun\n(ARRANGEMENT)\n[ U ] the way in which people or things are arranged in relation to one another or according to a particular characteristic: Please arrange the books in alphabetical order by author. I can’t find the files I need because they’re all out of order (= they are not arranged in the correct way).\n[ U ] If you leave/put things in order, you make them neat: I want to leave my desk in order before I go on vacation.\norder noun\n(CORRECT BEHAVIOR)\n[ U ] a situation in which rules are obeyed and people do what they are expected to do: Observers were present to preserve order during the voting.\norder noun\n(USABLE CONDITION)\n[ U ] the state of working correctly or of being suitable for use: The set of power tools are all in good working order. Are your immigration papers in order (= legally correct)? The elevator is out of order (= not working).\norder noun\n(SYSTEM)\n[ C ] a social or political system: a new economic order\norder noun\n(REQUEST)\n[ C ] An order is also the thing that has been requested: The store phoned to say your order has come in. on order\nIf something is on order, you have asked for it to be obtained but have not yet received it: The lamp has been on order for several weeks.\nIdioms\nin order\nin order for something to happen\nin order to do something\norder verb\n(REQUEST)\n[ I/T ] to ask for something to be made, supplied, or delivered: [ I ] Are you ready to order, or do you need a little more time? [ T ] I ordered some pasta and a mixed salad. [ T ] After looking through the catalog, she called the store and ordered new sheets and towels.\norder verb\n(INSTRUCT)\n[ T ] (esp. of a person in authority) to tell someone to do something: They ordered him to leave the room. Phrasal verb\norder around someone\nAdd to word list\nAdd to word list\n[ C ]\n&#160; COMMERCE a request from a customer for goods or services: Recent trends suggest that orders are unlikely to be converted into sales until the second half. We make a service and handling charge of $4 for all phone and internet orders of tickets. Already, the US aeronautics company has accumulated its biggest-ever backlog of orders - valued at $475 million. online/postal orders We're encouraged by the rise in order intakes this past quarter. a reduction in order volumes in the UKplace/put in an order (for sth) Placing orders by computer for medications ensures greater efficiency and a quicker delivery time to patients.take/get/receive an order (for sth) The Project extended the period for taking orders for its €45 million IPO until Friday.lose/win/cancel an order (for sth) Due to technical difficulties, the company recently lost an order for $175,000 worth of bakery equipment.process/fill/make up an order (for sth) The time it takes to fill orders for cars has increased. Once an order goes through, a message is sent to an inventory system on another computer.orders are up/down Durable goods orders were up in October by 2.9 %.orders fall/increase/rise In the past twelve months, we have seen export orders rise by 26%.\n[ C ]\n&#160; COMMERCE the goods that a customer has ordered from a company, store, or manufacturer: Call centres were flooded with complaints from people who had experienced problems with their orders.deliver/send/supply an order We will notify you by email once your order has been sent.receive/get/take delivery of an order The \"Super Express\" option enables customers to receive orders on the next working day. handle/trace/monitor an order By going online, our customers can easily trace the status of their order. In spite of the rail strike, only a handful of orders were delayed.\n[ C ]\n&#160; LAW a statement made by a court of law or an official authority saying that something must be done: issue/back/block an order The company was forced to stop selling insurance in May after the order which was issued by Florida's Insurance Department.an order expires/is extended The order was scheduled to expire today but was extended at the request of US prosecutors.an order to do sth Authorities need an order from the courts to require libraries to provide records on the borrowing of books and on the use of internet sites.\n[ S or U ]\n&#160; ACCOUNTING, FINANCE the way in which data or information is arranged: in alphabetical/numerical/date order Names of recent clients are listed in alphabetical order.the order of priority/preference There are laws that control the order of priority for payments to creditors.\n[ S or U ]\n&#160; ECONOMICS, GOVERNMENT a situation in which laws or rules relating to a particular activity exist: The federal government needs to bring order to the complicated system of trading. a new world/global/economic order\nbe in order\nto be necessary : Recent events have shown that a review of existing laws is in order.\nto be legally or officially acceptable: Check that all your documentation is in order before travelling abroad.\nbuild/make sth to order\nCOMMERCE, PRODUCTION to make something for a specific customer, rather than making something in large numbers: All our furniture is made to order.\nby order of\nLAW according to the orders of a judge or someone in a position of authority: After a press scandal concerning the company's CEO, the deal was canceled by order of the state attorney general.\nin ascending/descending order\ndata or information that is arranged in ascending order is arranged so that the smallest or least important numbers, facts, etc. are shown first; data or information that is arranged in descending order is arranged so that the largest or most important numbers, facts, etc. are shown first: Click once and the list is sorted in ascending order; click again and it's sorted in descending order.\nin good/working, etc. order\nin good condition, or in good enough condition to be used: Business owners are being urged to check that their CCTV cameras are in working order.\nin the order of sth (US also on the order of sth)\nhaving the approximate value stated: The German group is capable of financing a deal in the order of €100bn. The latest estimates of the state's unfunded pension liability are on the order of $10 billion.\nkeep/put sth in order\nto make sure that something is done in a controlled way, or to take action in order to control something : Huge budget cuts are inevitable in order to put public finances back in order.\non order\nCOMMERCE something that is on order has been asked for by a customer but has not yet been received by them: The shipping company is the largest buyer of the new trucks, with 55 currently on order.\norder of business\nMEETINGS the order in which different subjects are discussed at a business meeting: Has anyone any changes to suggest to the order of business? Our first order of business is how to tackle the current debt crisis. Compare\nagenda\nout of order\nnot acceptable according to a law or rule, or according to what people think is correct or suitable: Her comments were ruled out of order by the chairperson. The Press Complaints Commission acknowledged that newspaper coverage of the event had been completely out of order.\na machine that is out of order is not working correctly: All our elevators are currently out of order.\ndocuments, files, etc. that are out of order are not arranged in the correct way: The pages I printed out were all out of order.\nunder orders to do sth\na person or organization that is under orders to do something has been told officially to do something: Commercial banks are under orders not to begin selling the new coins to customers until Thursday. See also\nadministration order\nadvance order\nback order\nbanker's order\nbank order\nbankruptcy order\nbuilt-to-order\nbuying order\nbuy limit order\nbuy order\ncompulsory purchase order\ncopy order\ncourt order\nday order\ndelivery order\ndiscretionary order\nexecutive order\nfill or kill order\ngag order\ngood-till-cancelled order\ninternational money order\njob order\njudge's order\nlimit order\nmade-to-order\nmake-to-order\nmail order\nmandatory order\nmarket order\nmoney order\npart shipment\npecking order\npoint of order\npostal order\npurchase order\nreceiving order\nrepeat order\nrush order\nselling order\nsell limit order\nsell order\nstanding order\nstop order\n[ I or T ]\n&#160; COMMERCE to ask a company, store, manufacturer, etc. to supply goods or services: Our new service enables you to order foreign currency online. To order your copy, visit our website or call this number.order sth online/on the internet More and more people are ordering books and DVDs online.\n[ T ]\n&#160; WORKPLACE, GOVERNMENT, LAW to tell someone to do something, especially when you are in a position of legal or official authority: order sb/sth to do sth State agencies were ordered to cut all nonessential energy use. Banks have been ordered by the Financial Services Authority to assess how they would cope in the event of house prices crashing by 40 %.order a trial/investigation/inquiry Local governments have ordered an inquiry into radiation levels in the affected areas.order that Alaska's attorney-general has ordered that the company retain all documents relating to financial transactions in the current fiscal year.\n[ T ] to organize information or data using a particular method: He counted and ordered the copies.order sth alphabetically/numerically/by date Order the documents in the file by date. Phrasal verbs\norder sb around\norder sth up"}