{"id":254538,"name":"ordinary","type":"adjective","us_sound":"ˈɔːr.dən.er.i","us_link":"../audio/o/eus75283.mp3","uk_sound":"ˈɔː.dən.əri","uk_link":"../audio/o/ukorang030.mp3","content":"Add to word list\nAdd to word list\nB1 not different or special or unexpected in any way; usual: an ordinary neighbourhood Readers of the magazine said they wanted more stories about ordinary people and fewer stories about the rich and famous. Her last concert appearance was no ordinary (= a very special) performance.\nThesaurus: synonyms, antonyms, and examples\nnormalnormalTemperatures are well above normal today.usualI went to bed at my usual time.ordinaryThe magazine has stories about ordinary people rather than celebrities.standardIt's standard practice for surgeons to wear gloves.naturalIt's completely natural to feel anxious on your first day at a new school.typicalHe was a typical teenager - arguing with his parents and staying out late.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nbeing part of normal life and not specialordinaryHe took ordinary household objects and transformed them into pieces of art. everydayComputers are now just a part of everyday life.quotidianWe longed for the quotidian rituals, like shopping and tea, that the end of the war would bring.day-to-dayDay-to-day operations of the team would be handled by the assistant coach.dailyI'm looking for a good daily shampoo that won't damage my hair.\nSee more results »\nin the ordinary way UK\nnormally, or in the way that usually happens: If we hadn't seen the TV programme, we would have carried on giving money to the charity in the ordinary way.\nSee more out of the ordinary\nC2 unusual: For the police, the incident was nothing out of the ordinary.\nSee more\nMore examplesFewer examplesHer paintings depict the lives of ordinary people in the last century.Movie theaters are harder to repurpose than ordinary stores in a shopping mall.She accused the government of trampling on the needs and rights of the ordinary citizen.At times, his performance verged on brilliance, but at others it was only ordinary.My job's been downgraded to that of ordinary editor.\nSMART Vocabulary: related words and phrases\nPlain and ordinary\nas it comes idiom\naustere\nausterely\nausterity\naverage Joe\ngeneralized\nhomeliness\nhomely\nhomespun\nhomey\nsevere\nseverely\nsimple\nsomething/nothing to shout about idiom\nsparely\nunostentatiously\nunremarkable\nunremarkably\nwell trodden\nworkaday\nSee more results »\nRelated word\nordinariness\nAdd to word list\nAdd to word list\nnot different, special, or unexpected in any way; usual: His music was of the sort that ordinary Americans could relate to. Computers are now widely available in ordinary school settings."}