{"id":254570,"name":"ordovician","type":"adjective","us_sound":"ˌɔːr.dəˈvɪʃ.ən","us_link":"../audio/o/cdo0318usordo3422.mp3","uk_sound":"ˌɔː.dəˈvɪʃ.ən","uk_link":"../audio/o/cdo0216ordouk1369.mp3","content":"Add to word list\nAdd to word list\nfrom or referring to the period of time between about 485 and 445 million years ago, in which there were many different types of animals in the sea, including vertebrates (= animals with backbones), but no life on land: For his PhD he mapped Welsh Ordovician rocks and described new species of fossils. In mid Ordovician times a volcanic island arc is thought to have extended through the English Lake District, Wales and Newfoundland.\nMore examplesFewer examplesAs time passed there was a possible lowering of local temperatures in the succeeding Ordovician period.The same unfortunately isn't the case for the very brief late Ordovician cold spell.An early Ordovician trench is thought to have extended from just north of the Southern Uplands of Scotland down across northern Ireland.\nSMART Vocabulary: related words and phrases\nGeology - general words\nAnthropocene\nanticline\nauriferous\nbiozone\ncarboniferous\ncementation\ncontinental crust\ncontinental plate\ngeologically\ngeomorphic\ngully erosion\nhenge\nHolocene\npetrographically\npetrography\npetrological\npetrologically\npetrology\nPrecambrian\nrockfall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrehistory\nSpecific periods of time\nthe Ordovician\nthe period of time between about 485 and 445 million years ago, in which there were many different types of animals in the sea, including vertebrates (= animals with backbones), but no life on land: This first happened early in the Ordovician. As the Ordovician progressed, the separation between the two continents decreased and they both acquired warm environments.\nMore examplesFewer examplesAt Builth in Central Wales, a complicated history has been worked out for one part of the Ordovician.Extensive volcanism occurred during the Ordovician in the Lake District and Wales. In the late Ordovician , these strata were intruded by dolerite sills and stocks.\nSMART Vocabulary: related words and phrases\nGeology - general words\nAnthropocene\nanticline\nauriferous\nbiozone\ncarboniferous\ncementation\ncontinental crust\ncontinental plate\ngeologically\ngeomorphic\ngully erosion\nhenge\nHolocene\npetrographically\npetrography\npetrological\npetrologically\npetrology\nPrecambrian\nrockfall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrehistory\nSpecific periods of time"}