{"id":254690,"name":"organizational","type":"adjective","us_sound":"ˌɔːr.ɡən.əˈzeɪ.ʃən.əl","us_link":"../audio/o/eus73345.mp3","uk_sound":"ˌɔː.ɡən.aɪˈzeɪ.ʃən.əl","uk_link":"../audio/o/ukordin010.mp3","content":"organizational adjective [before noun]\n(RELATING TO PLANNING)\nAdd to word list\nAdd to word list\nrelating to the planning of an activity or event: She is looking for a personal assistant with good organizational skills.\nMore examplesFewer examplesA lot of what he does is organizational; he handles all the meetings.The most notable qualities of their staging of the Olympic Games were the politeness of the people and their superb organizational ability.\nSMART Vocabulary: related words and phrases\nManaging and organizing\nadmin\nadminister\nadministration\nanti-bureaucracy\nbronze command\nfixer\nflabbily\nget up\nget your act together idiom\ngold command\nmobilize\nmount\nparty planner\nparty planning\nproject-manage\nrationalization\nrationalize\nrecentralization\nscrum\nwieldy\nSee more results »\norganizational adjective [before noun]\n(RELATING TO GROUP)\nrelating to an organization: We think this is a good way of reaching our organizational goals.\nMore examplesFewer examplesThe group is conscious of its own organizational interests but guided as well by standards regarding the rights of its members and workers.Research suggests that low levels of organizational commitment have negative consequences for salespeople.The group is to hold its regular organizational meeting this week.\nSMART Vocabulary: related words and phrases\nOrganizations, Societies & clubs\nAssn\nAssoc.\nco-op\ncollegium\ncooperative\nestablishment\nguild\nhost\ninspectorate\nlodge\nmission\norganization\nsemi-public\nshuffle\nsuperclub\nsyndicate\nthird party\ntrust\nyouth academy\nyouth club\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnterprises\norganizational adjective [before noun]\n(RELATING TO SYSTEM)\nrelating to the way the different parts of something are combined or work together: He created an organizational chart clarifying the workflow. See\norganization\nMore examplesFewer examplesHe created an effective organizational framework with four independent facets (\"categories\") comprised of 10 nodes (\"subcategories\"). The country does not now have the manpower or organizational structure to close those gaps.Among the sample of unions, 25 percent had six or more organizational levels.The idea behind student-based allocation is that the money goes out based on the needs of students, not on the organizational structure that is in place.\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nbracket\nconcordance\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nshake someone down\nshort-list\nshortlist\nsort\nsort something out\ntick\nSee more results »\norganizational adjective [not gradable]\n(ABLE TO PLAN)\nAdd to word list\nAdd to word list\nrelating to the ability to plan things carefully and keep things neat: Her networking and organizational skills came in handy for a charity boxing event she hosted.\norganizational adjective [not gradable]\n(HAVING A SYSTEM)\nrelating to a particular system or arrangement: The White House Office of Management and Budget issued a revised organizational chart.\nAdd to word list\nAdd to word list\nrelating to an organization, or to organizing something: The changes will affect people at all organizational levels. The job needs someone with excellent organizational skills."}