{"id":254697,"name":"organizer","type":"noun","us_sound":"ˈɔːr.ɡən.aɪ.zɚ","us_link":"../audio/o/organizer.mp3","uk_sound":"ˈɔː.ɡən.aɪ.zər","uk_link":"../audio/o/ukordin013.mp3","content":"Add to word list\nAdd to word list\nB2 the person or group who plans and arranges an event or activity: There aren't enough seats for all the guests - I must tell the organizers. Community organizers help to get people out to vote on election day.\na person who is able to plan things carefully: We need someone who is a good organizer.\nMore examplesFewer examplesThe fault lay with the organizers, who failed to make the necessary arrangements for dealing with so many people.The organizers are forging ahead with a programme of public events.To the mortification of the show's organizers, the top performers withdrew at the last minute.The organizers say it's a fair contest but who knows what goes on backstage?Tournament organizers need to offer big money to attract the top players.\nSMART Vocabulary: related words and phrases\nManaging and organizing\nadmin\nadminister\nadministration\nanti-bureaucracy\nbronze command\nfixer\nflabbily\nget up\nget your act together idiom\ngold command\nmobilize\nmount\nparty planner\nparty planning\nproject-manage\nrationalization\nrationalize\nrecentralization\nscrum\nwieldy\nSee more results »\na container with separate parts for organizing things inside drawers or other spaces: Medicine cabinet organizers are especially useful for keeping things like mascara, thermometers, and other tubes upright.\nSMART Vocabulary: related words and phrases\nCleaning & tidying places & things\nadjust\nairing\nbed\nbioremediation\nclean something out\ndusting\nfreshen (someone/something) up\ngoing-over\nHoover\nhoover something up\nshampoo\nsmarten (someone/something) up\nspiff someone/something up\nspit\nspit and polish idiom\nspring-clean\nspruce\nspruce someone/something up\ntidy\nvalet\nSee more results »\nAdd to word list\nAdd to word list\nthe person or group that plans and arranges an event or activity: The organizers are forging ahead with a programme of public events.\na person who plans things: This is a complicated job that requires someone who is a good organizer .\nHR, WORKPLACE a person who helps people form or join a trade union: He is an organizer with the Service Employees International Union.\na book or small computer in which you keep a record of what you have to do, your meetings, etc.: This is a two-way pager, wireless phone, wireless Web browser, and hand-held organizer all in one device. See also\npersonal organizer"}