{"id":254689,"name":"organization","type":"noun","us_sound":"ˌɔːr.ɡən.əˈzeɪ.ʃən","us_link":"../audio/o/eus75291.mp3","uk_sound":"ˌɔː.ɡən.aɪˈzeɪ.ʃən","uk_link":"../audio/o/ukordin009.mp3","content":"organization noun\n(GROUP)\nAdd to word list\nAdd to word list\nB1 [ C ] a group of people who work together in an organized way for a shared purpose: the World Health Organization The article was about international aid organizations.\nMore examplesFewer examplesThe company has evolved over the years into a multi-million dollar organization.Because the organization is a charitable enterprise it is free from tax worldwide.We've applied to a charitable organization for a grant for the project.It's an organization that offers free legal advice to people on low incomes.The hospital has asked various voluntary organizations to help raise money for the new operating theatre.\nSMART Vocabulary: related words and phrases\nOrganizations, Societies & clubs\nAssn\nAssoc.\nco-op\ncollegium\ncooperative\nestablishment\nfellowship\nguild\nhost\nlodge\nmembership\nmission\nsecretary\nsemi-public\nshuffle\nsuperclub\nthird party\ntrust\nyouth academy\nyouth club\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnterprises\norganization noun\n(ARRANGEMENT)\nB1 [ U ] the planning of an activity or event: He didn't want to be involved in the organization of/for the conference, although he was willing to attend and speak.\nMore examplesFewer examplesShe's performed remarkable feats of organization for the office.I blame poor organization, more than lack of funds, for the failure of the project.\nSMART Vocabulary: related words and phrases\nManaging and organizing\nadmin\nadminister\nadministration\nanti-bureaucracy\nbronze command\nfixer\nflabbily\nget up\nget your act together idiom\ngold command\nmobilize\nmount\npaperwork\nparty planner\nparty planning\nproject-manage\nrationalization\nrationalize\nvice-presidential\nwieldy\nSee more results »\norganization noun\n(SYSTEM)\nC1 [ U ] the way in which something is done or arranged\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nconcordance\ndescribe\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nset something up\nshake someone down\nshort-list\nshortlist\nsort\ntick\nSee more results »\nRelated word\norganizational\nAdd to word list\nAdd to word list\n[ C ] a group whose members work together for a shared purpose in a continuing way: the National Organization of Women Labor organizations have contributed heavily to the Democratic campaigns.\norganization noun\n(MAKE A SYSTEM)\n[ U ] arrangement according to a particular system: An organization by subject rather than by date seems to make sense.\nAdd to word list\nAdd to word list\n[ C ]\n&#160; WORKPLACE a company or other group of people that works together for a particular purpose: Most organizations nowadays are under increasing pressure to be more accountable to multiple stakeholders. a business/trading organization a consumer/marketing/research organization a nonprofit/charitable/voluntary organization a national/international/local organizationa large/big/small organization In today's climate, large organizations are inevitably part of even bigger global networks.join/work for an organization How long have you worked for the organization?found/set up/launch an organization In 2006 North Dakota launched an organization which hosts an annual business plan competition and provides assistance to young entrepreneurs. head/director/member of an organization She's executive director of an organization that promotes Fair Trade.in/throughout/within an organization Reaching agreement within big organizations is not always easy.\n[ U ] the activity of planning an event or activity: We specialize in the organization of corporate events.careful/poor/bad organization According to the report, the firm's problems resulted from poor organization and bad management.\n[ U ] the way in which something is arranged : The organization and structure of the department needs rethinking.\nSee also\nECO\nemployers' organization\nfunctional organization\nInternational Labour Organization\nNGO\nvirtual organization"}