{"id":254695,"name":"organize","type":"verb","us_sound":"ˈɔːr.ɡən.aɪz","us_link":"../audio/o/eus75292.mp3","uk_sound":"ˈɔː.ɡən.aɪz","uk_link":"../audio/o/ukordin011.mp3","content":"organize verb [T]\n(ARRANGE)\nAdd to word list\nAdd to word list\nB1 to make arrangements for something to happen: They organized a meeting between the teachers and students. [ + to infinitive ] UK She had organized a car to meet me at the airport.\nMore examplesFewer examplesShe has been designated to organize the meeting.Most British schools organize social events for the students.She organizes a school reunion once a year.This event was organized in association with the Sports Council.She's an active member of the Women's Institute and is always organizing talks for her local group.\nSMART Vocabulary: related words and phrases\nManaging and organizing\nadmin\nadminister\nadministration\nanti-bureaucracy\nbronze command\nfixer\nflabbily\nget up\nget your act together idiom\ngold command\nmobilize\nmount\nparty planner\nparty planning\nproject-manage\nrationalization\nrationalize\nrecentralization\nscrum\nwieldy\nSee more results »\norganize verb [T]\n(MAKE A SYSTEM)\nB2 to do or arrange something according to a particular system: The books were organized on the shelves according to their size.informal My mother is always trying to organize me (= make me do things in the way she likes).\nThesaurus: synonyms, antonyms, and examples\nto arrange papers, furniture, etc.arrangeThe books are arranged in alphabetical order.orderThe names are ordered alphabetically.sortTen million pieces of mail are sorted every day. organizeHe liked to organize his herbs and spices alphabetically in the cabinet.lay outHe laid the playing cards out in a precise circle.set outShe was setting out the usual platter of cheese sandwiches.\nSee more results »\nMore examplesFewer examplesShe organizes her financial affairs very efficiently.The secretary was busy organizing the files.This new program will help you organize your files more efficiently.He organized his bibliography into three sections.She organized the language classes according to ability.\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nbracket\nconcordance\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nshake someone down\nshort-list\nshortlist\nsort\nsort something out\ntick\nSee more results »\nIdiom\ncouldn't organize a piss-up in a brewery\norganize verb [T]\n(PLAN)\nAdd to word list\nAdd to word list\nto make the necessary plans for something to happen; arrange: The group organizes theater trips once a month. They organized a meeting between the students and teachers.\norganize verb [T]\n(MAKE A SYSTEM)\nto do or arrange something according to a particular system: She had organized her work so that she could do some of it at home. organizer noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈɔr·ɡəˌnɑɪ·zər/\na union organizer\nAdd to word list\nAdd to word list\n[ T ] to do or arrange things, plans, ideas, etc., according to a particular system so that they can be used or understood easily: I am trying to organize my office so I can work more efficiently. He will need some help organizing his schedule for the coming month. The department is organized into three groups, each with its own area of responsibility.organize sth by sth The conference program is organized by topic.\n[ T ] to make arrangements for something to happen: This event was organized by a committee of city employees and local business owners. She has been designated to organize the meeting. They had organized a car to pick me up at the airport.\n[ I or T ]\n&#160; HR, WORKPLACE to form, join, or help someone to join a trade union: Labor unions are pushing a bill in the legislature that would make it easier for them to organize."}