{"id":254639,"name":"organ","type":"noun","us_sound":"ˈɔːr.ɡən","us_link":"../audio/o/eus75287.mp3","uk_sound":"ˈɔː.ɡən","uk_link":"../audio/o/ukordin004.mp3","content":"organ noun\n(BODY PART)\nAdd to word list\nAdd to word list\nC1 [ C ] a part of the body of an animal or plant that performs a particular job: an external/internal/reproductive organ an organ donor/transplant\nMore examplesFewer examplesHe sustained injuries to his arms, legs and several internal organs.Your ears, eyes, tongue, nose and skin are your sense organs.Transplantation of organs from living donors raises ethical issues.\nSMART Vocabulary: related words and phrases\nSubstances & structures in the body\nabductor\naccessorius\nadductor\nadenoid\nagonist\nglomerulus\nGnRH\ngonadotropin\ngracilis\ngrey matter\nnotch\norigin\noxytocin\npapilla\npapillary\nvalvular\nventriculus\nvesica\nvesical\nvesicle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParts of plants\norgan noun\n(INSTRUMENT)\nC2 [ C ] a musical instrument with a keyboard in which sound is produced by air being forced through pipes of different sizes and lengths when you press the keys with your hands or feet, or in which sound is produced electronically: Electronic organs are much smaller and cheaper than pipe organs.\nEncyclopaedia Britannica/Contributor/ Universal Images Group/GettyImages\nSMART Vocabulary: related words and phrases\nMusical instruments\naccordion\nacoustically\naerophone\nalphorn\nalto\ndrum kit\ndrum machine\ndrumbeat\ndrumhead\ndrumroll\npanpipes\npedal steel\npenny whistle\npercussion\npercussionist\ntuning fork\ntuning peg\nukulele\nunpitched\nunplugged\nSee more results »\norgan noun\n(NEWSPAPER)\nthe organ of something formal\na newspaper or broadcasting station produced by a particular organization and giving only the opinions of that organization: The newspaper Pravda was the official organ of the Communist Party in the Soviet Union.\nSee more\norgan noun\n(BODY PART)\nAdd to word list\nAdd to word list\n[ C ]\n&#160; biology a part of the body of a person, animal, or plant that performs a special job\norgan noun\n(INSTRUMENT)\n[ C/U ] a musical instrument with one or more rows of keys that are pressed with the fingers to play notes produced by forcing air through pipes of different sizes, or a similar electronic instrument: [ U ] Fred taught his wife to play the organ.\nAdd to word list\nAdd to word list\nCOMMUNICATIONS a newspaper or magazine that represents the opinions of a group or organization, or that is produced for a particular group of people: The monthly journal was once the official organ of the Communist party. She edits the company's house organ that is distributed to employees twice a year.\nGOVERNMENT an organization that works as part of a larger organization, for example, a government: China's top national security policy organ the courts and other government organs"}