{"id":254700,"name":"organizing","type":"verb","us_sound":"ˈɔːr.ɡən.aɪz","us_link":"../audio/o/eus75292.mp3","uk_sound":"ˈɔː.ɡən.aɪz","uk_link":"../audio/o/ukordin011.mp3","content":"Add to word list\nAdd to word list\npresent participle of\norganize\norganize verb [T]\n(ARRANGE)\nB1 to make arrangements for something to happen: They organized a meeting between the teachers and students. [ + to infinitive ] UK She had organized a car to meet me at the airport.\nMore examplesFewer examplesShe has been designated to organize the meeting.Most British schools organize social events for the students.She organizes a school reunion once a year.This event was organized in association with the Sports Council.She's an active member of the Women's Institute and is always organizing talks for her local group.\nSMART Vocabulary: related words and phrases\nManaging and organizing\nadmin\nadminister\nadministration\nanti-bureaucracy\nbronze command\nfixer\nflabbily\nget up\nget your act together idiom\ngold command\nmobilize\nmount\npaperwork\nparty planner\nparty planning\nproject-manage\nrationalization\nrationalize\nvice-presidential\nwieldy\nSee more results »\norganize verb [T]\n(MAKE A SYSTEM)\nB2 to do or arrange something according to a particular system: The books were organized on the shelves according to their size.informal My mother is always trying to organize me (= make me do things in the way she likes).\nThesaurus: synonyms, antonyms, and examples\nto arrange papers, furniture, etc.arrangeThe books are arranged in alphabetical order.orderThe names are ordered alphabetically.sortTen million pieces of mail are sorted every day. organizeHe liked to organize his herbs and spices alphabetically in the cabinet.lay outHe laid the playing cards out in a precise circle.set outShe was setting out the usual platter of cheese sandwiches.\nSee more results »\nMore examplesFewer examplesShe organizes her financial affairs very efficiently.The secretary was busy organizing the files.This new program will help you organize your files more efficiently.He organized his bibliography into three sections.She organized the language classes according to ability.\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nconcordance\ndescribe\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nset something up\nshake someone down\nshort-list\nshortlist\nsort\ntick\nSee more results »\nIdiom\ncouldn't organize a piss-up in a brewery"}