{"id":254655,"name":"organically","type":"adverb","us_sound":"ɔːrˈɡæn.ɪ.kəl.i","us_link":"../audio/o/usorgan001.mp3","uk_sound":"ɔːˈɡæn.ɪ.kəl.i","uk_link":"../audio/o/ukordin006.mp3","content":"organically adverb\n(PRODUCE FOOD)\nAdd to word list\nAdd to word list\nwithout using artificial chemicals in the growing or raising of plants and animals for food and other products: The wine is made from organically grown grapes. They farm organically.\nMore examplesFewer examplesThey switched over to using organically grown cotton.The message is to eat wholesome, fresh, unprocessed food, organically produced where possible. Organically raised animals grow at their own natural pace, with no artificial hormones. It's better to use fish that has either been line-caught or organically farmed.If you are going to farm or garden organically, you need to attract beneficial insects.We now grow 70 percent of our own food organically.\nSMART Vocabulary: related words and phrases\nNatural and artificial\nanti-natural\nartificial\nartificiality\nartificially\nbiodynamic\ndollishly\nfake\nfalse\nfreshness\nGod-given\nnon-natural\nnon-toxic\npure\nrawness\nrefined\nunbleached\nunnatural\nunnaturally\nunprocessed\nuntamed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFarming - general words\nGardening - general words\norganically adverb\n(DEVELOP)\nin a way that happens or develops naturally over time, without being forced or planned by anyone: He is not convinced that \"city planning\" works, saying that the best cities evolve organically over time. Don't force the relationship—let mutual attachment develop organically.\nbusiness\n&#160; specialized If a business grows organically, it develops its own business rather than buying other companies: A business can expand either organically (internally) or externally through takeovers and mergers.\nMore examplesFewer examplesOur musical style grew very organically, from what we all like to listen to and play.The road to future development must start by tapping into pre-existing physical and psychological roots and building up organically from there.\"What makes us good at what we do,\" says frontman Ben Gibbard, \"is the fact that we've been doing it organically for the last seven years.\"Where customer needs can't be met organically, we'll be open-minded to acquisitions.These companies are very strong because they've grown organically— a business could become too cumbersome to run if it continues growing by acquisition.\nSMART Vocabulary: related words and phrases\nChange and changes\nadjustment\nalteration\nanti-evolutionism\nbe ahead of the curve idiom\nblip\nevolutionism\nflatten\nflip-flop\nfluctuation\ngradation\ngyrate\nretransformation\nreversal\nreversion\nrevolution\nrhythm\nuntick\nvariation\nvicissitudes\nyouthquake\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSuccess & failure in business\norganically adverb\n(LIVING THINGS)\nin a way that relates to or comes from living plants or animals: The plants thrive in well- drained soil that has been organically enriched.\nMore examplesFewer examplesScientists are trying to work out whether the carbon on Mars was produced organically or simply existed in the environment without the need for life.They have studied the algae of organically enriched river waters.\nSMART Vocabulary: related words and phrases\nAnimal & plant biology - general words\nabiotic\nanatomical\nanatomically correct\nanti-Darwinian\nanti-Darwinism\nbiologist\nDarwinian\nDarwinism\nDarwinist\nentomological\nentomologist\nmorph\nnaturalist\npoisonous\nprimary producer\nprimitively\nprokaryote\npseudopod\nrecolonization\nzoology\nSee more results »\nRelated word\norganic"}