{"id":254696,"name":"organized","type":"adjective","us_sound":"ˈɔːr.ɡən.aɪzd","us_link":"../audio/o/usa30092.mp3","uk_sound":"ˈɔː.ɡən.aɪzd","uk_link":"../audio/o/ukordin012.mp3","content":"organized adjective\n(USING SYSTEM)\nAdd to word list\nAdd to word list\nB2 arranged according to a particular system: The letters had been placed in organized piles, one for each letter of the alphabet. Opposite\ndisorganized\nB2 An organized person is able to plan things carefully and keep things tidy: She's not a very organized person and she always arrives late at meetings.\nMore examplesFewer examplesHe has a lot of good qualities but being organized isn't one of them.His immaculate garden was a reproach to all his less organized neighbours.She has a very organized system for her filing.He had made a series of organized lists to help plan the party.He is always very organized at work.\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nbracket\nconcordance\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nshake someone down\nshort-list\nshortlist\nsort\nsort something out\ntick\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEfficient and effective\norganized adjective\n(PLANNED)\nB2 (of travel, visits, activities, etc.) planned and arranged for you to do, especially as part of a group: I don't like going on organized tours.\nSMART Vocabulary: related words and phrases\nManaging and organizing\nadmin\nadminister\nadministration\nanti-bureaucracy\nbronze command\nfixer\nflabbily\nget up\nget your act together idiom\ngold command\nmobilize\nmount\nparty planner\nparty planning\nproject-manage\nrationalization\nrationalize\nrecentralization\nscrum\nwieldy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEfficient and effective\nAdd to word list\nAdd to word list\nable to plan things carefully and keep things neat: We are looking for a person who is well organized.\nOrganized also means relating to groups or people who are members of large and often powerful organizations in a particular area of activity: organized labor organized sports organized crime\nAdd to word list\nAdd to word list\narranged according to a particular system: She has developed a very organized filing system. Our whole department is better organized now that he is in charge.\nable to plan things carefully, keep things tidy, and work effectively: She's not a very organized person and she always arrives late at meetings. I wish I were better organized. The more organized we can be about the everyday running of things, the more time we have to spend on ideas.\nHR, WORKPLACE belonging to a trade union: Collective bargaining refers to negotiations between organized workers and their employers."}