{"id":254892,"name":"original","type":"adjective","us_sound":"əˈrɪdʒ.ən.əl","us_link":"../audio/o/eus75297.mp3","uk_sound":"əˈrɪdʒ.ən.əl","uk_link":"../audio/o/ukordin028.mp3","content":"original adjective\n(FIRST MADE)\nAdd to word list\nAdd to word list\nB1 [ usually before noun ] existing since the beginning, or being the earliest form of something: Is this the original fireplace? The gardens have recently been restored to their original glory.\nB2 [ usually before noun ] An original piece of work, such as a painting, etc. is produced by the artist and not a copy: an original drawing/manuscript Is this an original Rembrandt? (= Was it painted by him?)\nMore examplesFewer examplesWe agreed to look afresh at her original proposal.This is a daring new film by one of our most original modern directors.My original statement has been completely distorted by the media.Researchers tried many times to replicate the original experiment.I'd like to steer our discussion back to our original topic.\nSMART Vocabulary: related words and phrases\nFirst and firstly\nat first blush idiom\nat first idiom\nbegin\nblush\nfirst come, first served idiom\nfrom the word go idiom\nfront end\nin the first/second place idiom\ninaugural\ninitial\ninitially\nplace\nprimary\nproto-\nprototypical\nstart\nstarter\nto begin with idiom\ntrailblazing\nword\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSamples and examples\noriginal adjective\n(DIFFERENT)\nB1 approving not the same as anything or anyone else and therefore special and interesting: original ideas/suggestions/work She's a highly original young designer. Opposite\nunoriginal\nThesaurus: synonyms, antonyms, and examples\ngood or important because of unusual qualities specialAre you doing anything special for your birthday?exceptionalTheir standard of acting was very high but there was one exceptional performance.outstandingHe accepted an award for outstanding achievement in baseball.extraordinaryHer capacity to remember things is extraordinary.deluxeThe salesman tried to sell us the deluxe model.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nrecently appeared, arrived, or developednewI bought a new suit for my interview.brand newThe company unveiled a brand new product this week.novelThat's a novel way of approaching the problem.novelThe bank has introduced a novel way of detecting fraud.innovativeThe project uses innovative ideas for recycling.\nSee more results »\nSMART Vocabulary: related words and phrases\nNew\nafresh\nbe ahead of the curve idiom\nbox-fresh\nbrand new\nink\ninnovative\ninnovatively\nlatest\nnewborn\nnewness\nnext-gen\nnext-generation\nnovel\nnovelty\noriginality\nthe avant-garde\nthe ink is not dry/still wet idiom\nunprecedented\nup-to-the-minute idiom\nyouth\nSee more results »\nB2 the first one made and not a copy: Can you give me the original of your report? I can't read this copy.\nB2 a piece of work by a famous artist or designer and not a copy by someone else: If the painting is an original, it will be very valuable. in the original\nIf you read something in the original, you read it in the language in which it was first written: As part of his studies, he read Homer in the original.\nSee more\nMore examplesFewer examplesThis painting is only a copy - the original hangs in the Louvre.This watch may be a counterfeit, but it looks just like the original.The new version is worse in every respect - I much preferred the original.The new version of the program comes with a much better user interface than the original.It's an original, not one of those imitation jobs.\nSMART Vocabulary: related words and phrases\nSamples and examples\nadvertisement\naliquot\narchetype\nbenchmark\nbenchmarking\ncore\ncross-section\nflavour\nfor instance idiom\nforerunner\nillustration\ninstance\nqua\nquintessence\nrole model\nsample\nshowpiece\nsort\nspecimen\ntaste\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe visual arts in general\nAdd to word list\nAdd to word list\nthe first one made and not a copy: Send a copy of your receipt, but keep the original.\nAn original is also a piece of work by an artist or designer and not a copy by someone else.\nSomeone who is an original behaves or speaks in a way that is not like other people.\nin the earliest form of something, or in the form that existed at the beginning: The original plans have been changed.\nOriginal can also mean different from anything or anyone else and therefore new and interesting: Our teacher said we’d better come up with something original.\nAn original piece of work, such as a painting or drawing, is produced by the artist or writer and is not a copy.\nAdd to word list\nAdd to word list\nspoken, written, or existing first: The final cost was much greater than the contractor's original estimate. We have more than doubled our original investment. His original plan was to stay two to three years, but he loved the job so much that he has never left. Please do not send original documents with your application.\nnot the same as anything or anyone else and for that reason special and interesting: original idea/suggestion, etc. We need some original ideas that will increase sales. She's a highly original young designer.\nthe first one made and not a copy: Can you let me have the original of your report? Sign the original and return it to us, keeping the copy for your records. The new version is worse in every respect - I much preferred the original."}