{"id":254902,"name":"originate","type":"verb","us_sound":"əˈrɪdʒ.ən.eɪt","us_link":"../audio/o/eus75300.mp3","uk_sound":"əˈrɪdʒ.ən.eɪt","uk_link":"../audio/o/ukorigi001.mp3","content":"Add to word list\nAdd to word list\nC2 [ I ] to come from a particular place, time, situation, etc.: Although the technology originated in the UK, it has been developed in the US The game is thought to have originated among the native peoples of Alaska.\n[ T ] to start something or cause it to happen: Who originated the saying \"Small is beautiful\"?\nThesaurus: synonyms, antonyms, and examples\nto begin to (make something) happenstartHurry up – the film has already started.beginThe ceremony is about to begin.commenceThe meeting commenced with a moment of silence.openThe meeting opened with a short word of welcome to new members.originateThe idea for the business originated with my grandmother's recipes.\nSee more results »\nSMART Vocabulary: related words and phrases\nOrigins and sources\nat source phrase\nbases\nbe a recipe for disaster, trouble, success, etc. idiom\nbeginning\nbirth\nbirthplace\ncradle\nemanate\nemanate from/through something/someone\nfount\nfountainhead\ngateway drug\nhail\norigin\npaternity\nprovenance\nrecipe\nroot\nseed\nson\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing things to happen\nStarting and beginning\nAdd to word list\nAdd to word list\nto come from or begin in a particular place or situation: Jazz originated in the US and is now popular throughout the world.\nAdd to word list\nAdd to word list\n[ I ] to come from a particular place, time, situation, etc.: originate in Although the technology originated in the UK, it has been developed in the US.originate at This flight originated at Los Angeles airport and is continuing to Boston and then Madrid.originate from sb/sth They are studying complaints believed to have originated from retailers.\n[ T ] to start something or cause it to happen: We plan to improve our marketing program using ideas originated by our customers.\n[ T ]\n&#160; FINANCE to arrange a new loan or investment : A mortgage broker matches borrowers with lenders but does not originate or service mortgages."}