{"id":254890,"name":"origin","type":"noun","us_sound":"ˈɔːr.ə.dʒɪn","us_link":"../audio/o/eus75296.mp3","uk_sound":"ˈɒr.ɪ.dʒɪn","uk_link":"../audio/o/ukordin027.mp3","content":"Add to word list\nAdd to word list\nB2 [ C ] (also origins) the beginning or cause of something: It's a book about the origin of the universe. Her unhappy childhood was the origin of her problems later in life. What's the origin of this saying? (= Where did it come from?)\nThesaurus: synonyms, antonyms, and examples\nthe start of somethingbeginningLet's go back to the beginning. Can you tell me when you arrived at the crime scene?startI didn't like him from the very start.endThis is it – the end of the tour. openingThe opening of the ceremony was marred by protest.commencementWhat is the commencement date of their contract?kick-offWhat time is the kick-off for the banquet and show?\nSee more results »\norigins [ plural ]\nused to describe the particular way in which something started to exist or someone started their life: The story has obscure origins (= no one knows how it started).\nSee more\nC1 [ U ] where a person was born: He is of North African origin. What is your country of origin?\nB2 [ U ] where an object was made: The furniture was French in origin.\nMore examplesFewer examplesThis book finally explodes some of the myths about the origin of the universe.We must contextualize the problem before we can understand its origin.We begin our dip into local history by examining the town's origins.The Easter egg has both pagan and Christian origins.The refugees were deported back to their country of origin.\nSMART Vocabulary: related words and phrases\nOrigins and sources\nat source phrase\nbases\nbe a recipe for disaster, trouble, success, etc. idiom\nbeginning\nbirth\nbirthplace\ncradle\nemanate\nemanate from/through something/someone\nfount\nfountainhead\ngateway drug\nhail\noriginate\npaternity\nprovenance\nrecipe\nroot\nseed\nson\nSee more results »\n[ C ]\n&#160; medical\n&#160; specialized the end of a muscle attached to the bone that does not move when the muscle is used\nSMART Vocabulary: related words and phrases\nSubstances & structures in the body\nabductor\naccessorius\nadductor\nadenoid\nagonist\nglomerulus\nGnRH\ngonadotropin\ngracilis\ngrey matter\nnotch\noxytocin\npapilla\npapillary\nparietal\nventriculus\nvesica\nvesical\nvesicle\nvestibular\nSee more results »\nAdd to word list\nAdd to word list\nthe thing from which something comes, or the place where it began: [ C ] the origins of language [ U ] He studied the origin and development of the nervous system.\nA person’s origin is the country from which the person comes: [ U ] The population is of Indian or Pakistani origin.\nmathematics The origin is the zero point on a number line (= drawing that represents all the numbers that exist), or the point where the horizontal and vertical lines on a graph (= drawing) cross. originator noun [ C ] us\nYour browser doesn't support HTML5 audio\n/əˈrɪdʒ·əˌneɪ·t̬ər/\nMorton was the originator of Arbor Day.\nAdd to word list\nAdd to word list\n[ C ] (also origins [ plural ]) the beginning or cause of something: The origins of this practice date back to the time of the Depression. Whether entrepreneurs are self-employed or working as employees, they are often at the origin of radical innovations.\n[ U ] the place where something was made or came from: The furniture was French in origin. The origin of the money that financed the deal was unclear. All these products must state their country of origin clearly on the packaging.\n[ U ] the place where a person was born: He is of North African origin. What is your country of origin?\nSee also\ncertificate of origin"}