{"id":255467,"name":"orthotic","type":"adjective","us_sound":"ɔːrˈθɑː.t̬ɪk","us_link":"../audio/o/cdo0319usorth1238.mp3","uk_sound":"ɔːˈθɒt.ɪk","uk_link":"../audio/o/cdo0319ukorth1128.mp3","content":"Add to word list\nAdd to word list\ndesigned to support a weak or damaged bone, joint, muscle, etc.: Orthotic insoles support the arches and re-align the feet. Individuals may be fitted with orthotic braces for the legs to help muscle control.\nMore examplesFewer examplesPatients receive a comprehensive biomechanical evaluation to determine if they will benefit from an orthotic device.He might be prescribed an orthotic shoe insert to correct an imbalance in his running pattern.Orthotic lycra garments to reduce lumbo-pelvic pain are being developed.\nSMART Vocabulary: related words and phrases\nMedical dressings, supports & devices\nanti-shock\nauditory brainstem implant\nbind\nbinder\nbiomaterial\nbiventricular pacemaker\nbrace\ncotton wool\nElastoplast\nexoskeleton\nin a cast phrase\nin plaster phrase\ninduction loop\nkinesiology tape\nliposome\nmedicine ball\npoultice\nsling\nwheelchair\nZimmer frame\nSee more results »\na device made to support an injured or badly formed part of the body, or to help someone move it more easily: A biomechanical foot orthotic is a highly specialized piece of medical equipment. Problems can sometimes be missed that can contribute to an uncomfortable orthotic.\nMore examplesFewer examplesA custom orthotic is designed from a cast taken from the patient's foot.An orthotic was ordered immediately postoperatively to facilitate activity and early mobilization.After about two years of neuromuscular dentistry, which included a custom orthotic, the headaches and sores were gone.\nSMART Vocabulary: related words and phrases\nMedical dressings, supports & devices\nanti-shock\nauditory brainstem implant\nbind\nbinder\nbiomaterial\nbiventricular pacemaker\nbrace\ncotton wool\nElastoplast\nexoskeleton\nin a cast phrase\nin plaster phrase\ninduction loop\nkinesiology tape\nliposome\nmedicine ball\npoultice\nsling\nwheelchair\nZimmer frame\nSee more results »"}