{"id":255791,"name":"ossified","type":"adjective","us_sound":"ˈɑː.sə.faɪd","us_link":"../audio/o/usorgan027.mp3","uk_sound":"ˈɒs.ɪ.faɪd","uk_link":"../audio/o/ukoscil007.mp3","content":"ossified adjective\n(IDEAS)\nAdd to word list\nAdd to word list\nformal disapproving (of habits or ideas) fixed and unable to change: The institutions of government have become more ossified and inflexible. He tried to push liberalizing policies through an ossified bureaucracy.\nThesaurus: synonyms, antonyms, and examples\nstaying the sameconstantCheck to make sure your oven maintains a constant temperature.the sameYou look exactly the same as you did ten years ago!same old same oldThe Italian restaurant is under new management, but it's just the same old same old.unchangingHis novel is about the unchanging nature of humanity.unchangeableThe company's position on the matter is absolute and unchangeable.\nSee more results »\nMore examplesFewer examplesThe whole system has become ossified and unresponsive.Fight the tendency to become ossified in your musical tastes.The government must escape its ossified past.\nSMART Vocabulary: related words and phrases\nHard and firm\n(as) stiff/straight as a ramrod idiom\nadamantine\ncast iron\ncongealed\ncrisp\ncrisply\ndilatancy\ndilatant\nerect\nfirm\nfirmness\nfossilized\nramrod\nrigid\nrigidity\nrock-hard\nrock-solid\nsolidly\ntense\nunyielding\nSee more results »\nossified adjective\n(BODY)\nmedical\n&#160; specialized (of body tissue) having become hard and changed into bone: The bones in the creature's feet were only partially ossified. With increasing age the joints between the bones may become ossified. See\nossify\nMore examplesFewer examplesThe fontanelle is a membrane-covered space between cranial bodies in the fetus that later becomes ossified.The car was completely covered in ossified bird droppings.Thousands of fossilized dinosaur footprints have survived and become preserved in ossified rock.\nSMART Vocabulary: related words and phrases\nHard and firm\n(as) stiff/straight as a ramrod idiom\nadamantine\ncast iron\ncongealed\ncrisp\ncrisply\ndilatancy\ndilatant\nerect\nfirm\nfirmness\nfossilized\nramrod\nrigid\nrigidity\nrock-hard\nrock-solid\nsolidly\ntense\nunyielding\nSee more results »"}