{"id":255952,"name":"osteopathic","type":"adjective","us_sound":"ˌɑː.sti.oʊˈpæθ.ɪk","us_link":"../audio/o/cdo0318usoste3451.mp3","uk_sound":"ˌɒs.ti.əˈpæθ.ɪk","uk_link":"../audio/o/epd21154.mp3","content":"Add to word list\nAdd to word list\nrelating to the treatment of injuries to bones and muscles using pressure and movement: He could improve posture with osteopathic treatment.\nIn the United States and Canada, osteopathic medicine is a system of medicine that emphasizes the care of the whole person, using the latest scientific treatments and also sometimes treating injuries to bones and muscles using pressure and movement: Osteopathic medicine takes a holistic approach to the human body, treating it as a unit of interrelated systems working together for good health. Physicians graduate from either an allopathic or osteopathic medical school. See also\nDoctor of Osteopathic MedicineCompare\nallopathic\n(of a doctor) trained in osteopathic medicine: Osteopathic doctors (DOs) are different from allopathic doctors (MDs). Osteopathic physicians are calling on schools to ban carbonated soft drinks. See also\nDoctor of Osteopathic Medicine\nCompare\nallopathic\nMore examplesFewer examplesYou should avoid osteopathic manipulation if you have a broken bone.Osteopathic medicine is a branch of the medical profession in the United States.She trained as an osteopathic physician. The medical training of osteopathic doctors mirrors that of medical doctors.\nSMART Vocabulary: related words and phrases\nPhysiotherapy, massage & osteopathy\nchiropractic\nchiropractor\ncraniosacral\nECT\neffleurage\nessential oil\nmanipulation\nmassage\nmassage parlour\nmasseur\nmasseuse\nosteopath\nphysical therapist\nphysical therapy\nphysio\nphysiotherapy\nprone\nprone positioning\nproning\nset\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical studies & the people who study them\nMedical treatment: general words\nMedical treatment: doctors & health workers generally"}