{"id":256130,"name":"other","type":"determiner","us_sound":"ˈʌð.ɚ","us_link":"../audio/o/eus75322.mp3","uk_sound":"ˈʌð.ər","uk_link":"../audio/o/ukoscil021.mp3","content":"other determiner\n(ADDITIONAL)\nAdd to word list\nAdd to word list\nA1 as well as the thing or person already mentioned: The product has many other time-saving features. There is no other work available at the moment. There is only one other person who could help us. Are there any other people we should ask? I found one earring - do you know where the other one is? See also\nanother (ADDITIONAL)\nA1 used at the end of a list to show that there are more things, without being exact about what they are: The plan has been opposed by schools, businesses and other local organizations. These two books will be especially useful for editors, journalists and other professional users of the language.\nMore examplesFewer examplesCirculars and other junk mail go straight in the bin.The site links to about 24 other sites offering clip art.This drug can be safely used in combination with other medicines.The country has vast oil reserves and rich deposits of other minerals.Mr Savino has been charged with three murders as well as a whole slew of other crimes.\nSMART Vocabulary: related words and phrases\nAlso, extra, and in addition\nadded\nadditional\nadditionally\nagain\nalong\net cetera\netc.\nexcess\nfiller\nfor good measure idiom\nhand\nrate\nsame\nsecond\nsecondly\nside\nsuchlike\nsupernumerary\nthirdly\ntouch\nSee more results »\nother determiner\n(OPPOSITE)\nthe other side/end (of something)\nB1 the opposite side or end of something: Put the chair at the other end of the desk. The man was waiting on the other side of the street.\nMore examplesFewer examplesI saw him at the other end of the street.I saw him on the other side of the room.We rowed across to the other bank.If I saw him, I'd cross to the other side of the street.He's at the other end of the political spectrum from me.\nSMART Vocabulary: related words and phrases\nThrough, across, opposite and against\nacross\nacross country idiom\nagainst\nagin\nalong\ncatty-corner\ncountry\ncross\nfront\ngive\nkitty-corner\non\nopposite\nover\noverland\nthru\nto\ntrans\nSee more results »\nother determiner\n(DIFFERENT)\nB1 different from the thing or person already mentioned: Idon't have any cash - is there no other way of paying? He likes travelling abroad and learning about other people's customs and traditions. See also\nanother (DIFFERENT) the other day, week, etc.\nB1 referring to a day, week, etc. in the recent past without saying exactly when it was: I saw him just the other day/night. other than\nC1 different from or except: Cruises other than the ones listed below are not discounted at this time. The form cannot be signed by anyone other than yourself.\nin a negative sentence, used to mean \"except\": There's nothing on TV tonight, other than the usual rubbish. in other words\nB2 used to introduce an explanation that is simpler than the one given earlier: He was economical with the truth - in other words, he was lying. or other C1 informal\nused when you cannot or do not want to be exact about the information you are giving: The event was held in some park or other. We'll find someone or other to help us.\nMore examplesFewer examplesAll her life she had a childlike trust in other people.There's no harm in applying for other jobs, but if I were you, I wouldn't advertise the fact at work.The professor was a real Jekyll and Hyde - sometimes kind and charming, and at other times rude and obnoxious.The president urged other countries to lift the trade restrictions.Children need to be taught to have respect for other people's property.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanother\nanything\ndisparity\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\nnon-comparability\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nunrepresentativeness\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIn the past\nExcluding\nMeaning & significance\nUncertainty\nGrammar\nOther, others, the other or another?Other means ‘additional or extra’, or ‘alternative’, or ‘different types of’. …\nOtherOther means ‘additional or extra’, or ‘alternative’, or ‘different types of’. …\nThe otherThe other with a singular noun means the second of two things or people, or the opposite of a set of two: …\nAnotherWhen we use the indefinite article an before other, we write it as one word: another. Another means ‘one more’ or ‘an additional or extra’, or ‘an alternative or different’. …\nOther, others, the other or another: typical errorsWhen other is a determiner, it does not have a plural form: …\nOrOr is a conjunction that connects two or more possibilities or alternatives. It connects words, phrases and clauses which are the same grammatical type: …\nA2 the second of two things or people, or the thing or person that is left in a group or set of things: Hold the racquet in one hand and the ball in the other. Some people prefer a vegetarian diet, while others prefer a meat-based diet. She gave me one book last week and promised to bring the others on Wednesday. others [ plural ]\nB2 more ones: I only know about this book, but there might be others (= other books).\nB1 people in general, not including yourself: You shouldn't expect others to do your work for you.\nMore examplesFewer examplesI lived on my own for a while but I missed the companionship of others.Perhaps some systems of government are more corruptible than others.This is one possible solution to the problem. However, there are others.Some words are more difficult to spell than others.Some college courses have stiffer entry requirements than others.\nMore examplesFewer examplesAt the top of the hill I switched off the engine and we just coasted down the other side.Trouble broke out in the match when one of the players called a member of the other team a cheat.When you run, each foot leaves the ground before the other comes down.This cable should have a plug at one end and a socket at the other.Roughly half (of) the class are Spanish and the others are a mixture of nationalities.\nSMART Vocabulary: related words and phrases\nThings remaining\n(and) all the rest idiom\nbalance\nbastion\nbe left phrase\ncremains\ncutpiece\ndeposit\nground\nhangover\nredoubt\nrelic\nremainder\nremains\nremnant\nresidual\nsurvival\nthrowback\ntime capsule\nunallocated\nuneaten\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDifferent and difference\nAlso, extra, and in addition\nPeople in general\nGrammar\nOrOr is a conjunction that connects two or more possibilities or alternatives. It connects words, phrases and clauses which are the same grammatical type: …\nOther, others, the other or another?Other means ‘additional or extra’, or ‘alternative’, or ‘different types of’. …\nOtherOther means ‘additional or extra’, or ‘alternative’, or ‘different types of’. …\nThe otherThe other with a singular noun means the second of two things or people, or the opposite of a set of two: …\nAnotherWhen we use the indefinite article an before other, we write it as one word: another. Another means ‘one more’ or ‘an additional or extra’, or ‘an alternative or different’. …\nOther, others, the other or another: typical errorsWhen other is a determiner, it does not have a plural form: …\ndifferent to what is usual or expected, and sometimes not well understood: I guess it doesn’t fit with the historically expected monogamous model, therefore it’s considered other. There was a fear that under the costume there is something foreign, something terrifying and essentially other.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanother\nanything\ndisparity\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\nnon-comparability\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nunrepresentativeness\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nSee more results »\nto treat someone as though they are not part of a group and are different in some way: A lot of people can relate to being othered or seeing it happen to someone else. The book is often criticized for romanticizing and othering black Americans. Related word\nothering\nSMART Vocabulary: related words and phrases\nBeing and appearing different\nanomalously\nanother\nanti-conventional\napple\nbe a far cry from something idiom\nbuck\nconflict\ndepart from something\ndeviate\ndiffer\ndifferentiate\ndiverge\ndiversify\nfish\nflow\nothering\npolymorphous\nrebrand\nrebranding\nremove\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnfairness and favouring someone unfairly\nother pronoun\n(PART OF A SET)\nAdd to word list\nAdd to word list\nthe second of two things or people, or the item or person that is left from a group or set of things: Hold the racket in one hand and the ball in the other. Some people like living in big cities, but others prefer the suburbs. or other\nOr other is used after words such as some, someone, something, or somewhere when you cannot be exact about what you are saying: The event will be held in some park or other. Idioms\nin other words\non the other hand\nother than\nthe other day\nother adjective [not gradable]\n(MORE)\nmore of the same kind as the item or person already mentioned: In addition to the microwave oven, the kitchen has several other modern appliances. There is one other point I would like to discuss with you. Are there any other people you want to invite?\nOther can be used at the end of a list to show that there are more items without being exact about what they are: milk, cheese, and other dairy products\nother adjective [not gradable]\n(DIFFERENT)\ndifferent from the item or person already mentioned: I’m going to have to take the car – there’s no other way to get there. Ask me some other time, when I’m not so busy.\nother adjective [not gradable]\n(PART OF A SET)\nThe other end/side means the opposite end or side: Put this chair at the other end of the table. Jeanne was waiting on the other side of the street.\nAdd to word list\nAdd to word list\nACCOUNTING used to describe amounts of money, usually small amounts, that are added together and not listed under a separate name in financial records: These expenses are included under the headings 'utilities', 'taxes', and 'other'."}