{"id":256153,"name":"otherwise","type":"conjunction","us_sound":"ˈʌð.ɚ.waɪz","us_link":"../audio/o/eus75323.mp3","uk_sound":"ˈʌð.ə.waɪz","uk_link":"../audio/o/ukoscil024.mp3","content":"Add to word list\nAdd to word list\nB1 used after an order or suggestion to show what the result will be if you do not follow that order or suggestion: I'd better write it down, otherwise I'll forget it. Call home, otherwise your parents will start to worry.\nMore examplesFewer examplesCome in now, otherwise you'll get wet.I'd better tell him about the letter, otherwise he might be angry.You'd better hurry, otherwise you'll miss the train.Take that chocolate away, otherwise I'll eat it all.They had to leave early, otherwise the children would have been up too late.\nSMART Vocabulary: related words and phrases\nEither, or, neither, nor\nand\nand/or phrase\neither\nelse\nneither\nnor\nor\nor else idiom\nGrammar\nOr and otherwiseWe often use or and otherwise with conditional meanings: …\notherwise adverb\n(DIFFERENTLY)\ndifferently, or in another way: The police believe he is the thief, but all the evidence suggests otherwise (= that he is not). Under the Bill of Rights, a person is presumed innocent until proved otherwise (= guilty). Protestors were executed, jailed or otherwise persecuted. Marion Morrison, otherwise known as the film star John Wayne, was born in 1907.formal I can't meet you on Tuesday - I'm otherwise engaged/occupied (= doing something else).\nMore examplesFewer examplesHis phone call was a welcome intrusion into an otherwise tedious morning.A tiny mark flawed the otherwise perfect silk shirt.She was badly bruised but otherwise unhurt.When referees make contentious decisions players are going to be upset, and anyone who thinks otherwise is living in cloud-cuckoo-land.Dennis White scored the only goal in an otherwise forgettable match.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanother\nanything\ndisparity\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\nnon-comparability\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nvariant\nSee more results »\notherwise adverb\n(NOT INCLUDING)\nB2 except for what has just been referred to: The bike needs a new wheel, but otherwise it's in good condition. The poor sound quality ruined an otherwise beautiful film.\nSMART Vocabulary: related words and phrases\nExcluding\nacid-free\napart\nbar\nbar none idiom\nbarring\ncount\ndiscount\nexclude\nexcluding\nexclusion\nexclusionist\nexclusive\nexclusively\nnegative\non/from the sidelines idiom\nostracism\nostracize\nout of it idiom\noutlier\nstand-alone\nSee more results »\nGrammar\nOr and otherwiseWe often use or and otherwise with conditional meanings: …\nIdiom\nor otherwise\nused to show that something is completely different from what you think it is or from what was previously stated: He might have told you he was a qualified electrician, but the truth is quite otherwise.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanother\nanything\ndisparity\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\nnon-comparability\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nvariant\nSee more results »\nGrammar\nOr and otherwiseWe often use or and otherwise with conditional meanings: …\nAdd to word list\nAdd to word list\ndifferently, or in another way: Samuel Clemens, otherwise known as Mark Twain Parts of the company will be sold or otherwise dismantled.\nOtherwise also means except for what was just referred to: I like working outside when it’s warm, but otherwise I stay indoors.\nif not; or else: Tell me if you want it, otherwise I’ll give it to Freya."}