{"id":256390,"name":"ourselves","type":"pronoun","us_sound":"ˌaʊ.ɚˈselvz","us_link":"../audio/o/usl30255.mp3","uk_sound":"ˌaʊəˈselvz","uk_link":"../audio/o/ukough_006.mp3","content":"Add to word list\nAdd to word list\nA2 used when the subject of the verb is \"we\" or the speaker and one or more others, and the object is the same group of people: We went to get ourselves something to eat. John and I promised ourselves a good holiday this year.\nformal used to emphasize the subject \"we\": We ourselves realize that there are flaws in the plan. (all) by ourselves\nalone or without help from anyone else: We were all by ourselves in the restaurant. Nobody wanted to come with us, so we went by ourselves. We couldn't do all the work by ourselves. (all) to ourselves\nfor our use only: The hotel was very quiet so we had the swimming pool all to ourselves .\nMore examplesFewer examplesAgainst all probability we found ourselves in the same hotel.It was so noisy that we couldn't hear ourselves speak.We amused ourselves by watching the passers-by.Let's not trouble ourselves about the precise details at the moment.We must ensure that we do not set ourselves goals that are not attainable.\nSMART Vocabulary: related words and phrases\nLinguistics: reflexive forms\nauto\nherself\nhimself\nitself\nmyself\nnot be/seem herself phrase\nnot be/seem himself phrase\noneself\nper se\nreflexive\nself\nthemself\nthemselves\nthyself\nyourself\nGrammar\nPronouns: reflexive (myself, themselves, etc.)Reflexive pronouns end in -self or -selves. They refer back to the subject forms of personal pronouns (underlined in the example below): …\nReflexive pronouns for same subject and objectWe often use reflexive pronouns when the subject and the object of the verb refer to the same person or thing: …\nReflexive pronouns for emphasisWe can use reflexive pronouns for emphasis: …\nReflexive pronouns + by meaning aloneWe often use reflexive pronouns with by to mean ‘alone’ or ‘without any help’: …\nReflexive pronouns for politenessWe sometimes use reflexive pronouns instead of personal pronouns for politeness, but not as the subject of a clause: …\nAdd to word list\nAdd to word list\nthe person speaking and one or more others; the reflexive form of we: We promised ourselves a long vacation this year. It’s a big garden, but we do the gardening by ourselves (= without help). Everyone else is busy, so we’ll have to go all by ourselves (= without other people). We had the swimming pool all to ourselves (= we did not have to share it)."}