{"id":256912,"name":"outfit","type":"noun","us_sound":"ˈaʊt.fɪt","us_link":"../audio/o/eus75343.mp3","uk_sound":"ˈaʊt.fɪt","uk_link":"../audio/o/ukoutdo008.mp3","content":"outfit noun\n(CLOTHES)\nAdd to word list\nAdd to word list\n[ C ] a set of clothes worn for a particular occasion or activity: I'm going to wear my vampire outfit for Halloween. Synonyms\nensemble\nget-up informal\nrig-out informal old-fashionedCompare\ncostume\nsuit noun (SET OF CLOTHES)\noutfit noun\n(GROUP)\n[ C, + sing/pl verb ] informal an organization, company, team, military unit, etc.: He has recently set up his own research outfit.\nSMART Vocabulary: related words and phrases\nEnterprises\nacquiree\nacquirer\nacquiror\nagency\nagribusiness\nanswering service\nclicks and mortar idiom\nconglomerate\nconsortium\nfintech\nfirm\nfranchise\nfranchisee\nfranchiser\norganizationally\nparent company\npartner up\npartnership\nplc\nzombie company\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOrganizations, Societies & clubs\nto provide someone or something with equipment or clothes: The ambulances have all been outfitted with new radios. Synonyms\nequip\nfit\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\nafford\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\nreassign\nreassignment\nrebid\nregift\nregive\nspare\nSee more results »\noutfit noun [C]\n(CLOTHES)\nAdd to word list\nAdd to word list\na set of clothes worn for a particular occasion or activity: Susan wore a black outfit.\nAn outfit is also a set of equipment for a particular purpose: She got a complete ski outfit as a gift from her parents.\noutfit noun [C]\n(ORGANIZATION)\nan organization or group: Our company merged with another consulting outfit.\noutfit verb [T]\n(PROVIDE THINGS)\nto provide someone with clothes or other equipment: I found a place that can outfit us for the canoe trip.\nAdd to word list\nAdd to word list\na set of clothes worn for a particular occasion or activity: You should bring at least one extra outfit to the conference. Give some consideration to what outfit to wear for the interview. Our reception staff all wear matching outfits.\ninformal an organization, company, etc.: He has recently set up his own research outfit, which has as yet no name.\nto provide someone or something with equipment or clothes: The award provides funds to outfit labs and pay for other start-up expenses.outfit sb/sth with sth The vehicles have been outfitted with message boards."}