{"id":257047,"name":"outgrow","type":"verb","us_sound":"ˌaʊtˈɡroʊ","us_link":"../audio/o/eus75346.mp3","uk_sound":"ˌaʊtˈɡrəʊ","uk_link":"../audio/o/ukoutdo016.mp3","content":"outgrow verb [T]\n(SIZE)\nAdd to word list\nAdd to word list\nto grow bigger than or too big for something: My seven-year-old got new shoes in April, and he's already outgrown them (= his feet have grown too large for them). The company outgrew (= became too large for) its office space.\nSMART Vocabulary: related words and phrases\nBecoming bigger\naccrete\naccrue\nanti-growth\nballoon\nbell\nbillow\nbump\nelongate\nengorged\nenlarge\nenlargement\nexpansion\noak\npile\npuff up\nput something on\nregenerate\nscalability\nscalable\nstretch\nSee more results »\noutgrow verb [T]\n(AGE)\nto lose interest in an idea or activity as you get older: He eventually outgrew his adolescent interest in war and guns.\nSMART Vocabulary: related words and phrases\nBore and bored\nbanal\nbanally\nbe (stuck) in a groove idiom\nbe watching the clock idiom\nbend\nblah\nboil\nbore\nbore the ass off someone idiom\nlanguid\nlanguidly\nlistless\nlistlessly\nlistlessness\ntire\nunderemployed\nunderwhelm\nunderwhelmed\nundynamic\nuninspired\nSee more results »\nAdd to word list\nAdd to word list\nto grow too large for something: Our teenager has outgrown most of his clothes. The company outgrew its office space.\nAdd to word list\nAdd to word list\nif a company or organization outgrows its buildings or offices, it becomes too big for them: The foundation is expanding rapidly and has outgrown its current facility.\nto need something that is bigger, more modern, etc. than what you have or use at the present time, for example, because you have become more successful, skilled, etc. than you were previously: In recent years, air travel has outgrown the air traffic control system.\nto become more successful or important than another person or company that is involved in the same activity or industry as you are: Analysts have predicted that China will outgrow America economically in the second decade of the 21st century."}