{"id":257175,"name":"outlay","type":"noun","us_sound":"ˈaʊt.leɪ","us_link":"../audio/o/eus75353.mp3","uk_sound":"ˈaʊt.leɪ","uk_link":"../audio/o/ukoutdo030.mp3","content":"Add to word list\nAdd to word list\nan amount of money spent for a particular purpose, especially as a first investment in something: For an initial outlay of $2,000 to buy the equipment, you can earn up to $500 a month if the product sells well. Few are able to afford the cash outlay.\nMore examplesFewer examplesIt's low cost, with no significant cash outlay at the outset.He will invest another $65 million, bringing his total outlay to $315 million. This technology will require an initial outlay, but it will produce long-term savings.\nSMART Vocabulary: related words and phrases\nCosts & expenses\naliment\nall in\nblue book value\nbook value\ncarriage\ncarrying charge\ncash flow\nexpenditure\nfee\nflat rate\ngate money\npurchasing power\nSP\nspecial offer\nstarting price\nsticker price\nsunk cost\nsurcharge\ntime is money idiom\ntransfer fee\nSee more results »\nto spend an amount of money for a particular purpose, especially as a first investment in something: In the first year we outlaid thousands of dollars on computers. Employees are not required to outlay any of their own money.\nMore examplesFewer examplesBritain's leading manufacturing companies are outlaying proportionately less in capital expenditure than are their foreign competitors.The Government will outlay $1.5 million for the construction of overtaking lanes on the Pacific Highway.Publishers will point out that they take a huge punt with an author, outlaying a small fortune on the print run and warehouse space.\nSMART Vocabulary: related words and phrases\nPaying money\n2FA\n2SV\nante up (something)\nburn a hole in someone's pocket idiom\nchargeable\ncost-cutting\ndiscretionary\nlash out (something)\npay through the nose idiom\npay top dollar idiom\nreimburse\nrepay\nsettle an account idiom\nshell (something) out\nshortchange\nsink into something\nspend\nspend money like water idiom\nspent\nsponsor\nSee more results »\nAdd to word list\nAdd to word list\nan amount of money spent, esp. at the beginning of a planned activity or business: This year’s advertising outlay was over $250,000.\nAdd to word list\nAdd to word list\nFINANCE an amount of money that you spend on something, especially a large amount that is spent on new equipment or to start a new business activity: Investors can receive tax relief of up to 40% on their outlay.an outlay of $150m/£300/€580m, etc. The bank is currently receiving an 8.9% stake for an outlay of £10 million.outlay for/on sth Total outlay on the health sector is budgeted at 18.34 billion rupees.an initial/an original/a total outlay Initial outlay for a franchise is approximately £45,000.recover/recoup your outlay Casinos must not only recoup their outlay, they must also make a profit. Going into the wine business involves a large financial outlay. an annual/a monthly outlay a big/huge/small outlay See also\ncapital outlay\ncash outlay"}