{"id":257236,"name":"outline","type":"noun","us_sound":"ˈaʊt.laɪn","us_link":"../audio/o/eus75355.mp3","uk_sound":"ˈaʊt.laɪn","uk_link":"../audio/o/ukoutle002.mp3","content":"outline noun [C]\n(SHAPE)\nAdd to word list\nAdd to word list\nC2 the main shape or edge of something, without any details: She drew the outline of the boat and then coloured it in. in outline\nas a shape with an edge but without any details: The mountain was visible only in outline as the light faded.\nSee more\nMore examplesFewer examplesUnderneath the hospital blankets I could see the outline of her poor wasted body.The outline of the castle on the hill was clearly defined against the evening sky.\nSMART Vocabulary: related words and phrases\nPatterns and shapes\namorphous\narabesque\nargyle\nasymmetrically\nasymmetry\nfigure of eight\nfishbone\nfishhook\nflecked\nformless\npalmate\nreticulation\nrhomboid\nscissor\nsemilunaris\nshapeable\nshaped\nshapeless\nwillow pattern\nzigzag\nSee more results »\noutline noun [C]\n(DESCRIPTION)\nB2 a description of the main facts about something: If you read the minutes of the meeting, they'll give you a broad outline of what was discussed. Some novelists start by writing an outline (= plan of the main points of the story).\nSMART Vocabulary: related words and phrases\nDefining & explaining\naccount (to someone) for something\naccountability\nadumbrate\nadumbration\nannotation\nannotator\nbelabour\ndemythologize\ndisabuse\nexcuse\nextenuate\ninexpressibly\njustificatory\nlay something out\nlimn\nmansplaining\nsketch\nspell\ntrace\nundefinable\nSee more results »\noutline verb [T]\n(DRAW SHAPE)\nto draw the main shape or edge of something: The area we're interested in is outlined in red on the map.\nMore examplesFewer examplesMichael Davis has prepared a memorandum outlining our need for an additional warehouse.The progress of religious reforms is outlined in a separate chapter.The scheme outlined in Mr Smith's speech has the support of the committee.The introduction outlines the content each chapter.She spent ten minutes outlining the main features of the scheme.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensive\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nreflect\nspeak\nunwrap\nvent\nvirtue signalling\nvisualization\nSee more results »\noutline verb [T]\n(DESCRIBE)\nB2 to give the main facts about something: At the interview she outlined what I would be doing.\nSMART Vocabulary: related words and phrases\nDefining & explaining\naccount (to someone) for something\naccountability\nadumbrate\nadumbration\nannotation\nannotator\nbelabour\ndemythologize\ndisabuse\nexcuse\nextenuate\ninexpressibly\njustificatory\nlay something out\nlimn\nmansplaining\nsketch\nspell\ntrace\nundefinable\nSee more results »\noutline noun [C]\n(STATEMENT)\nAdd to word list\nAdd to word list\na statement of the main facts, ideas, or items: The House approved the broad outlines of the president’s budget.\noutline noun [C]\n(LINE)\na line or lines showing the main shape of something: She drew the outline of a face. outline verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈɑʊtˌlɑɪn/\nI’ve outlined my research paper and begun writing the first draft.\nAdd to word list\nAdd to word list\nto describe something, for example a new plan or idea, in a general way without giving too many details: The government has outlined a series of environmental goals it is seeking to meet by 2020.(be) outlined in sth Recommendations outlined in the recent report have angered investors.outline a plan/proposal/strategy Senior figures from the energy industry will hold a public meeting to outline plans to build a $300m plant.outline the terms of sth The Department of Agriculture yesterday outlined the terms of a new consent agreement.(be) outlined by sb/sth The commission's position was outlined by its general counsel, Julie Hodgkins.(be) outlined above/below When planning objectives, it's a good idea to use a checklist to ensure that you meet the criteria outlined above.outline how/what/when, etc. The Pensions Board will be obliged to outline how future pensions systems might operate.\nif a drawing or diagram outlines something, it shows its general appearance or shape: Maps filed with the Planning Commission outline a 154,000-square-foot hospital that could eventually be on the site's northern end.\na description of the main facts about something, for example a new plan or idea: The outline calls for city government to lead by example, as well as to encourage the private sector to embrace conservation. Terms of the deal between NATO and the European Union seem clear in outline, although agreeing on details may prove more difficult.the outline(s) of a deal/proposal/settlement, etc. Officials agree that the broad outlines of a deal on agriculture need to be in place by July.the outline(s) of what/why/how, etc. Fund managers have been asked to prepare a document containing an outline of how investment professionals make decisions.broad/brief/general outline(s) The House Speaker endorsed the broad outlines of the new taxation program.an outline for change/reform/the future In spite of a tight deadline, the working party succeeded in delivering a practical and common-sense outline for reform. an outline agreement/deal\na series of lines or shapes on a drawing or diagram that show the general appearance of something, for example, a building, machine, etc.: Figure 8 shows the outline of the proposed extension. an outline design"}