{"id":257359,"name":"outperform","type":"verb","us_sound":"ˌaʊt.pɚˈfɔːrm","us_link":"../audio/o/eus75364.mp3","uk_sound":"ˌaʊt.pəˈfɔːm","uk_link":"../audio/o/ukoutle010.mp3","content":"Add to word list\nAdd to word list\nto do well in a particular job or activity compared to others of a similar type: The company has consistently outperformed its rivals this season. Synonyms\nexceed\noutdo\noutstrip\nsurpass formal\nSMART Vocabulary: related words and phrases\nSurpassing in quality or number\ncatch\ncatch (someone) up\ncompare\ncrown\ncrush\ndo something for an encore idiom\neclipse\nencore\noutcompete\noutdo\noutflank\noutgo\noutman\nput/leave someone in the shade idiom\nshade\nshame\nsteal a march on someone idiom\nsteal someone's thunder idiom\nsurpass\ntower\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWinning and defeating\nAdd to word list\nAdd to word list\nto perform better or do better than someone or something: Technology stocks are outperforming the rest of the market.\nAdd to word list\nAdd to word list\n[ I or T ]\n&#160; STOCK MARKET, FINANCE if shares, bonds, etc. outperform, or if they outperform a particular stock market or financial market, they produce more money for investors than other shares, bonds, etc. of a similar type: Commodities futures have produced better annual returns than stocks and outperformed bonds even more. In the short term, equities are higher risk, but over the long term they are less risky because they will outperform.outperform the (stock) market/index The latest Fortune survey of business performance in the US showed that new and diverse companies outperform the stock market.\n[ T ] to be more successful than other companies or countries: Employment reports suggest that the US economy will outperform Europe in the months to come.outperform (your) competitors/rivals In order to achieve dramatic improvements and outperform competitors, a corporation often needs to make radical changes."}