{"id":257742,"name":"outsider","type":"noun","us_sound":"ˌaʊtˈsaɪ.dɚ","us_link":"../audio/o/eus75377.mp3","uk_sound":"ˌaʊtˈsaɪ.dər","uk_link":"../audio/o/ukoutsh004.mp3","content":"outsider noun [C]\n(NOT MEMBER)\nAdd to word list\nAdd to word list\na person who is not involved with a particular group of people or organization or who does not live in a particular place: Outsiders have a glamorized idea of what it is like to work in Hollywood.\na person who is not liked or accepted as a member of a particular group, organization, or society and who feels different from those people who are accepted as members: As a child he was very much an outsider, never participating in the games other children played.\nSMART Vocabulary: related words and phrases\nGroups of people\nalliance\nan\nanti-gang\nassemblage\nbaby boomer\nfirst people\nflashmob\nflock\nfocus group\nfoursome\nline (someone) up\nmafia\nmob\nposse\npublic\nquaternity\nrabble\nretinue\nsquad\nsyndicate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAlone\noutsider noun [C]\n(UNLIKELY WINNER)\na person or animal with only a slight chance of winning: A complete outsider won this year's award. The race was won by a rank outsider.\nSMART Vocabulary: related words and phrases\nCompetitors & participants in sports & games\nanchor\nback four\nballer\nballplayer\nbase jumper\nbenchwarmer\nchallenger\nkeeper\nlogroller\nlong-jumper\nlongboarder\nmajor league\nmid-table\nracer\nretire\ntrampolinist\ntrialist\ntriathlete\ntriple jumper\ntriple threat\nSee more results »\noutsider noun [C]\n(NOT PART OF SOMETHING)\nAdd to word list\nAdd to word list\na person who is not involved with a particular group of people or an organization, or who does not live in a particular place: I moved here three years ago, but I still feel like an outsider.\nAdd to word list\nAdd to word list\nWORKPLACE someone who is paid by a company or organization to do a particular job, but who is not a permanent employee: In 2009, the company hired an outsider with marketing experience in an effort to revive its business.\nsomeone who is not directly involved in a situation: To outsiders, it looked as if the company was doing well."}