{"id":257884,"name":"outstanding","type":"adjective","us_sound":"ˌaʊtˈstæn.dɪŋ","us_link":"../audio/o/eus75381.mp3","uk_sound":"ˌaʊtˈstæn.dɪŋ","uk_link":"../audio/o/ukoutsh012.mp3","content":"outstanding adjective\n(EXCELLENT)\nAdd to word list\nAdd to word list\nB2 clearly very much better than what is usual: an outstanding performance/writer/novel/year It's an area of outstanding natural beauty. Synonym\nexcellent\nThesaurus: synonyms, antonyms, and examples\ngood or important because of unusual qualities specialAre you doing anything special for your birthday?exceptionalTheir standard of acting was very high but there was one exceptional performance.outstandingHe accepted an award for outstanding achievement in baseball.extraordinaryHer capacity to remember things is extraordinary.deluxeThe salesman tried to sell us the deluxe model.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nbetter than anyone or anything elsebestShe was the best singer in the country.excellentHe was an excellent singer.superlativeShe gave a superlative performance.superbThe meal was absolutely superb.outstandingHe was an outstanding chef.\nSee more results »\nMore examplesFewer examplesThe region is renowned for its outstanding natural beauty.Her outstanding performances set a new benchmark for singers throughout the world.He produced the outstanding performance of the match.He gave an outstanding speech to the other directors.Passing her exams was an outstanding achievement.\nSMART Vocabulary: related words and phrases\nExtremely good\nadmirable\namazing\namazingly\nask for someone\naward-winning\nfirst-rate\nfive-star\ngold-plated\ngourmet\ngreatness\nhave no parallel phrase\npar excellence\nsensational\nshining\nsock\nsplendid\nsplendidly\nstellar\nsuperiority\nwonderfully\nSee more results »\noutstanding adjective\n(NOT FINISHED)\nnot yet paid, solved, or done: $450 million in outstanding debts There are still a couple of problems outstanding.\nMore examplesFewer examplesAny outstanding library fines must be paid before you can graduate.There are a number of outstanding problems that still need to be resolved.They believe that all the outstanding issues should fall within the ambit of the talks.He calculated the difference between the outstanding debts and credits.She used the money to pay off the outstanding amount on her mortgage.\nSMART Vocabulary: related words and phrases\nBorrowing & lending\namortizable\namortization\nbad debt\nbonded\nborrow\nborrow something from something\nbridging loan\ncredit limit\nforeclose\nhole\nliquidator\nloan\nnon-prime\nnonaccrual\non the slate idiom\nover-borrowed\noverpay\noverpayment\npay someone/something back\nreceivership\nSee more results »\nRelated word\noutstandingly\noutstanding adjective\n(EXCELLENT)\nAdd to word list\nAdd to word list\nvery much better than usual; excellent: You’ve done an outstanding job.\noutstanding adjective\n(NOT FINISHED)\nnot yet done, solved, or paid: My credit cards usually have an outstanding balance.\nAdd to word list\nAdd to word list\nFINANCE an outstanding debt has not yet been paid: Most of the proceeds from the house sale were used to pay the outstanding mortgage. an outstanding debt/balance\nFINANCE used to talk about the total number of shares held by a company's shareholders at a particular time: As of July 23, the chip maker had about 12.3 million shares outstanding. outstanding shares/securities/stock\nan outstanding problem or subject has not been solved or discussed: We still have some outstanding issues to discuss."}