{"id":259965,"name":"overhaul","type":"verb","us_sound":"oʊ.vɚˈhɑːl","us_link":"../audio/o/uscld2s064.mp3","uk_sound":"əʊ.vəˈhɔːl","uk_link":"../audio/o/ukoverh001.mp3","content":"Add to word list\nAdd to word list\nto repair an engine, machine, etc. so that every part of it works as it should: I got the engine overhauled.\nto completely change a system so that it works more effectively: The government has recently overhauled the healthcare system. The school chose to overhaul its curriculum by equipping classrooms with new technology.\nto completely change something, especially by getting rid of some people or things and replacing them with others: Most women don't overhaul their wardrobes from season to season. The restaurant has overhauled its menu, cutting portions and eliminating items with lots of calories.\nSMART Vocabulary: related words and phrases\nCorrecting and mending\ncalibration\nclean (someone/something) up\ncorrection\nfiddle (around) with something\nfine-tune\nmess\nreconstruct\nreconstruction\nrectifiable\nrectification\nrefine\nremedy\nrevise\nscratch\nset/put the record straight idiom\nsmooth something away\nsmoothen\nsort\nsort something out\ntinker\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChanging\n[ C or U ] the act of repairing an engine, machine, etc. so that every part works as it should: I took my motorbike in for an overhaul. Our gas turbine division is now a world market leader in the repair and overhaul of industrial gas turbines.\n[ C ] the act of completely changing a system so that it works more effectively: They announced plans for a radical overhaul of the country's political system. Such changes call for an overhaul of the way Britain runs air travel.\n[ C ] the act of completely changing something, especially by getting rid of some people or things and replacing them with others: There is likely to be a major overhaul of the squad this summer.\nSMART Vocabulary: related words and phrases\nCorrecting and mending\ncalibration\nclean (someone/something) up\ncorrection\nfiddle (around) with something\nfine-tune\nmess\nreconstruct\nreconstruction\nrectifiable\nrectification\nrefine\nremedy\nrevise\nscratch\nset/put the record straight idiom\nsmooth something away\nsmoothen\nsort\nsort something out\ntinker\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChange and changes\nAdd to word list\nAdd to word list\nto repair or improve something so it works well: They repaired and maintained aircraft and overhauled their engines. Congressional leaders are considering overhauling the Clean Air Act. overhaul noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈoʊ·vərˌhɔl/\nI think our justice system needs a major overhaul.\nAdd to word list\nAdd to word list\nto repair or improve something so that every part of it works as it should: The government plans to overhaul bank regulations. The network has been overhauled and upgraded. I got the engine overhauled. The new CEO's mandate from the board had been to overhaul the company from top to bottom.\nthe act of repairing or improving something so that every part of it works as it should: a complete/major/radical overhaul The firm's organizational infrastructure needed a major overhaul. Critics of the overhaul argued that yesterday's changes were only cosmetic improvements."}