{"id":260399,"name":"overload","type":"verb","us_sound":"ˌoʊ.vɚˈloʊd","us_link":"../audio/o/eus75418.mp3","uk_sound":"ˌəʊ.vəˈləʊd","uk_link":"../audio/o/ukoverh022.mp3","content":"Add to word list\nAdd to word list\nC1 to put too many things in or on something: Don't overload the washing machine, or it won't get the clothes clean.\nto put too much electricity through an electrical system\nC2 to give someone more work or problems than they can deal with: Try not to overload yourself with work.\nSMART Vocabulary: related words and phrases\nFilling and completing\nbackfill\nbox ticking\nbrick\nbrick something up\nbrim\nfill\njam\novercrowd\noverrun\npack something/somewhere out\npermeate\npermeation\nplug\nround\nsaturable\nsqueeze (someone/something) in/squeeze (someone/something) into something\nstuffing\nsuffuse\nsupersaturated\ntank\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nElectricity & electronics\nCausing difficulties for oneself or others\nC2 the fact that something or someone is overloaded: People today suffer from information overload (= being given too much information). There was an overload on the electrical circuit and the fuse blew.\nSMART Vocabulary: related words and phrases\nElectrical switches & connections\nclicker\ncoaxial\ncorded\ndimmer\ndimmer switch\njunction box\noutlet\noverride\npatch\npatch someone through\npause\nplug\nplug (something) in/plug (something) into something\nplug-in\npowerbank\nshaver point\nspark plug\nswitchboard\nterminal\nwire\nSee more results »\nAdd to word list\nAdd to word list\nto put too great a load in or on something: Don’t overload the washer or it won’t work properly. fig. I can’t go out tonight – I’m overloaded with work (= I have a lot of work to do).\nIf you overload an electrical system, you put too much electricity through it.\nAdd to word list\nAdd to word list\nto give something or someone too much work: Many companies limit personal downloads so that they don't overload the computer system. We are doing our best in a highly competitive environment with an overloaded staff.\nto put too many things in or on something: The company had overloaded the truck, which was illegal.overload sth with sth His desk is overloaded with papers and books.\nto put too much electricity through an electrical system: Avoid overloading outlets and extension cords.\ntoo much of something: an overload of sth There is an overload of factors that confront consumers in the marketplace. Investors are already swamped with information and there is a serious danger of overload. See also\ninformation overload\nwork overload"}