{"id":258386,"name":"over","type":"preposition","us_sound":"ˈoʊ.vɚ","us_link":"../audio/o/over.mp3","uk_sound":"ˈəʊ.vər","uk_link":"../audio/o/epd32598.mp3","content":"over preposition\n(HIGHER POSITION)\nAdd to word list\nAdd to word list\nB1 above or higher than something else, sometimes so that one thing covers the other; above: The sign over the door said \"Exit\". She held the umbrella over both of us. Helicopters dropped leaflets over the city. I put my hands over my eyes/ears because I couldn't bear to watch/listen. I couldn't hear what she was saying over the noise of the planes taking off (= the planes were louder than her voice). Compare\nunder preposition (LOWER POSITION)\nMore examplesFewer examplesHe clamped his hand over her mouth.Could you put some clingfilm over the salad?The cart rumbled over the cobbles.The trees' branches intertwined to form a dark roof over the path.She pulled the duvet over her head to try to shut out the light.\nSMART Vocabulary: related words and phrases\nAbove & over\nabove\naloft\no'er\noverhead\noverlie\nsuper\nsupra\nsur-\ntopper\nupmost\nover preposition\n(COVERING)\nA2 in a position that is covering something: Put a clean cloth over the cakes while they cool. I put a shawl over my shoulders.\nSMART Vocabulary: related words and phrases\nCovering and adding layers\nadditive\nasphalt\nbestrew\nbind\nblanket\nblindfold\nbury\ngum\ninlaid\nlag\nlaminate\nlayer\nobliterate\nretread\nseasoned\nslap\nslap something on\nsmother something in/with something\nspeckle\ntent\nSee more results »\nover preposition\n(ACROSS)\nB1 across from one side to the other, especially by going up and then down: She jumped over the gate. The road goes over the mountains, not through a tunnel. She is always chatting with her neighbour over the garden fence. From the top of the tower you could see for miles over the city. Tanks travel over the most difficult ground.\nMore examplesFewer examplesWe exchanged commonplaces about the weather over cups of tea.She was staring out over the lake, lost in contemplation.The contents of his bag spilled all over the floor.It's difficult to track an animal over stony ground.She rubbed sun lotion over her entire body.\nSMART Vocabulary: related words and phrases\nThrough, across, opposite and against\nacross\nacross country idiom\nagainst\nagin\nalong\ncatty-corner\ncountry\ncross\nfront\ngive\nkitty-corner\non\nopposite\nother\noverland\nthru\nto\ntrans\nSee more results »\nover preposition\n(FALLING)\nfalling down from somewhere: The coin rolled over the edge of the table. Harold jumped out of the car just before it went over the cliff.\nfalling because of stepping on something: She tripped over a toy lying on the path.\nSMART Vocabulary: related words and phrases\nFalling and dropping\nass\ncollapse/fall in a heap idiom\ncropper\ncrumple\ndrop\ndrop like flies idiom\ndrop off\nfaceplant\nfall away\nfly\nlet go idiom\nmic drop\nnosedive\noverbalance\nparachutist\nplunge\npratfall\nshower\nthump\nwayside\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDown and downward\nover preposition\n(MORE THAN)\nA2 more than: Most of the carpets cost/are over $5,000. Children over the age of twelve (= older than twelve) pay the full price. I value quality of life over money.\nA2 increasing to further than a particular limit or point: They are already $25 million over budget. over and above\nin addition to: They receive extra money over and above the usual welfare payments.\nSee more\nMore examplesFewer examplesAn adult under British law is someone over 18 years old.The factory closed over ten years ago.A freak whirlwind has destroyed over 20 caravans in west Wales.The film has grossed over $200 million this year.We were overtaken by a crowd of bikers doing over 90 mph.\nSMART Vocabulary: related words and phrases\nLarge in number or quantity\nabove and beyond something idiom\namount\nand then some idiom\nanother\nany amount of idiom\nbag\nbillion\nin buckets idiom\nin spades idiom\nincalculable\nincomputable\ninnumerable\npoly\nscore\nshower\nso much so idiom\nsome\nstrength\nsuper-large\nsupererogation\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPresent\nAbove & over\nover preposition\n(OTHER SIDE)\nB1 on the other side of: There's a bar over the road we could go to. The story continues over the page.\nMore examplesFewer examplesWe don't sell them, but you could try over the road in the hardware store.There's a postbox just over the road.I'd recommend the Buther's over the road.\nSMART Vocabulary: related words and phrases\nThrough, across, opposite and against\nacross\nacross country idiom\nagainst\nagin\nalong\ncatty-corner\ncountry\ncross\nfront\ngive\nkitty-corner\non\nopposite\nother\noverland\nthru\nto\ntrans\nSee more results »\nover preposition\n(CONNECTED WITH)\nC2 (referring to a cause of interest, worry, discussion, etc.) connected with or about: There's no point in arguing over something so unimportant. I need time to talk/think over your proposal (= to discuss/consider it carefully). The legal battle was over who should have custody of the child.\nMore examplesFewer examplesThere's no point arguing over it now.They fell out over a trivial incident.A legal battle is taking place over who owns the rights to the song.She is taking the newspaper to court over the allegations.There's no point crying over spilled milk.\nSMART Vocabulary: related words and phrases\nLinking and relating\naffiliated\nAL\nappertain to something\napplicable\naround\ncollateral\necosystem\nequation\nincestuously\ninterconnect\ninterconnected\ninterconnectedness\ninterconnection\nrecoupling\nrelatability\nrelatable\nrelate\nrelate to someone/something\nrelatedly\nweld\nSee more results »\nover preposition\n(DURING)\nB1 during something, or while doing something: I was in Seattle over the summer. Shall we discuss it over lunch/over a drink? They took/spent an hour over lunch (= their meal lasted an hour). It's fascinating to watch how a baby changes and develops over time (= as time passes).\nMore examplesFewer examplesComputer hacking has become very widespread over the last decade.The improvement in water standards over the last 50 years has been very great.This graph shows how crime has varied in relationship to unemployment over the last 20 years.He works until nine o'clock every evening, and that's quite apart from the work he does over the weekend.There has been a gradual improvement in our sales figures over the last two years.\nSMART Vocabulary: related words and phrases\nSimultaneous and consecutive\naccompanied by someone/something\naccompaniment\naccompany\nall the while idiom\nalong\nfly\ngo along\nheavy rotation\nin parallel idiom\nin rotation idiom\nin tandem idiom\nminute\nprocess\nsimultaneously\nsimultaneousness\nsoon\nstep\nstraight\nsuccessive\nturn\nSee more results »\nover preposition\n(FEELING BETTER)\nbe/get over something\nto feel physically or mentally better after an illness or an upsetting experience: It takes you a while to get over an illness like that.\nSee more\nover preposition\n(CONTROL)\nC2 in control of or teaching someone or something: A good teacher has an easy authority over a class. She's a sales manager but she has a regional sales director over (= with a higher rank than) her. The victory over the French at Waterloo was Wellington's greatest triumph.\nMore examplesFewer examplesColonel Sailing has command over the Guards Regiment.The board concurred that the editor should have full control over editorial matters.She's got no control over that child - it's terrible.The Mogul dynasty ruled over India for centuries.Italy had a comfortable three-goal lead over France by half-time.\nSMART Vocabulary: related words and phrases\nControlling and being in charge\naggrandize\nassert your authority\nassume\nassumption\nauthoritative\ncynical\nget the better of someone idiom\nget your hooks into someone/something idiom\nget/fall into the wrong hands idiom\ngovern\nguiding principle\npaternalistic\npaternalistically\nperemptorily\nperemptory\nplay God idiom\ntame\nwhat someone says, goes idiom\nwrangle\nwrangler\nSee more results »\nover preposition\n(USING)\nB2 using: They spoke over the phone. We heard the news over the radio.\nMore examplesFewer examplesSome software can be configured to prevent children from giving out their phone numbers over the internet.I've accepted the job over the phone, but I haven't confirmed in writing yet.I won't go into detail over the phone, but I've been having a few health problems recently.Long-distance truck drivers often talk to each other over CB radio.I bought the tickets over the internet.\nSMART Vocabulary: related words and phrases\nUsing and misusing\nadopt\nadoption\navail\navail yourself of something\nbe/go heavy on something idiom\nexhaust\ngo through\ngobble something up\nmake capital out of something idiom\nmax\nmax out\nspare\nspent\nswallow\ntap\nturn over\nturn to someone/something\nturn/use something to good account idiom\nunblock\nunderuse\nSee more results »\nover preposition\n(MATHEMATICS)\nsometimes used when talking about a calculation in which one number is divided by another number: 40 over 7 is roughly 6.\nSMART Vocabulary: related words and phrases\nAddition, subtraction, multiplication & division\nadd\nadd (something) up\naddition sign\nadditive\narithmetical\ndeduction\nhalf\nhalve\nhighest common factor\nlong division\npower\nquadruply\nquintuple\nquotient\nrecursion\nround something down\nsquare\nsubtraction sign\ntable\ntreble\nSee more results »\nGrammar\nAbove or over?When we use above as a preposition, it means ‘higher than’. Its meaning is close to that of the preposition over. In the following sentences, over can be used instead of above: …\nOverOver is a preposition, adverb, adjective or prefix. …\nOver as a prepositionWe use over to talk about movement or position at a higher level than something else: …\nOver as an adverbWe can use over as an adverb to talk about movement above something or someone: …\nOver as an adjective: be overWe can use be over to mean ‘finished’, ‘at an end’: …\nOver as a prefixWe can use over as a prefix to mean ‘too much’. We connect over to the word which comes after it, sometimes with a hyphen after over: …\nOver: typical errorsOver, when used with periods of time, refers to the period from start to finish, not to any one moment during that time: …\nAcross, over or through?We use across as a preposition (prep) and an adverb (adv). Across means on the other side of something, or from one side to the other of something which has sides or limits such as a city, road or river: …\nAcrossWe use across as a preposition (prep) and an adverb (adv). Across means on the other side of something, or from one side to the other of something which has sides or limits such as a city, road or river: …\nOverWe use over as a preposition and an adverb to refer to something at a higher position than something else, sometimes involving movement from one side to another: …\nAcross or through?When we talk about movement from one side to another but ‘in something’, such as long grass or a forest, we use through instead of across: …\nAcross, over and through: typical errorsWhen moving from one side to another while surrounded by something, we use through not across: …\nIdioms\nall over somewhere\nbe all over someone\nover adverb\n(DOWN)\nfrom a higher to a lower position; down: The lamp fell over and broke. He was run/knocked over by a taxi.UK The little boy fell over and started to cry.\nSMART Vocabulary: related words and phrases\nDown and downward\ndeclivity\ndown\ndownhill\ndownstairs\ndownstream\ndownward\ndownwardly\ndownwards\nfallen\nsunken\nup\nover adverb\n(ACROSS)\nB1 across; from one side or place to another: She leaned over and kissed me. A fighter plane flew over. Why don't you come over (= come to my house) for dinner on Thursday? A friend of mine from France is over visiting us this week (= a friend came from France and is staying with us). Now we're going over to (= there will be a broadcast from) Wembley for commentary on the Cup Final. Come over here - it's warmer. Who's that man over there?\nB2 used to describe the way an object moves or is moved so that a different part of it is facing up: She turned another page over. The dog rolled over onto its back. The children rolled over and over (= turned over many times) down the gentle slope.\nchanging or exchanging position: Would you mind changing/swapping those plates over? She changed over to editing from marketing. Why should we hand over the money to them? I've done everything I can - now it's over to you (= it's your turn to take action).\nMore examplesFewer examplesHe came rushing over when I fell.Look both ways before you cross over.She's been looking all over for you.She leaned over and whispered something in his ear.Our lawn is frosted over.\nSMART Vocabulary: related words and phrases\nThrough, across, opposite and against\nacross\nacross country idiom\nagainst\nagin\nalong\ncatty-corner\ncountry\ncross\nfront\ngive\nkitty-corner\non\nopposite\nother\noverland\nthru\nto\ntrans\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPresent\nover adverb\n(HIGHER POSITION)\nabove or higher than something else, sometimes so that one thing covers the other: A fighter plane flew over. A man came to paint over (= cover with paint) the cracks in the wall.\nSMART Vocabulary: related words and phrases\nAbove & over\nabove\naloft\no'er\noverhead\noverlie\nsuper\nsupra\nsur-\ntopper\nupmost\nover adverb\n(MORE THAN)\nA2 more than a particular amount or level: People who are 65 years old and over can get half-price tickets.\nMore examplesFewer examplesAn adult under British law is someone who is 18 or over.At one time, worldwide sales of his books reached 180 million and over.The warning signs specify that vehicles of that height or over cannot pass under the bridge.You get a free gift if you spend £20 or over.At the hottest time of year, they get temperatures of 40 and over.\nSMART Vocabulary: related words and phrases\nLarge in number or quantity\nabove and beyond something idiom\namount\nand then some idiom\nanother\nany amount of idiom\nbag\nbillion\nin buckets idiom\nin spades idiom\nincalculable\nincomputable\ninnumerable\npoly\nscore\nshower\nso much so idiom\nsome\nstrength\nsuper-large\nsupererogation\nSee more results »\nover adverb\n(FINISHED)\nB1 (especially of an event) finished: I'll be glad when the competition is over. I used to have a thriving business and a happy marriage, but that's all over now. over and done with (US also done and over with)\nC2 completely finished: She gets unpleasant tasks over and done with as quickly as possible.\nSee more\nMore examplesFewer examplesThe party was over by midnight.The game was effectively over before half-time.A pitched battle between the two sets of fans developed on the terraces after the match was over.Now that the war is over may there be a lasting peace between our nations.Her exams are all over by the end of July.\nSMART Vocabulary: related words and phrases\nFinished & over\nall over\nbar\nbe (all) over bar the shouting idiom\nbe done and dusted idiom\ncan\nclose\nclosed\ndown\nfinished\nfinito\nin the can idiom\nit's a wrap idiom\njig\nlapsed\nout\nsee\nsee the last of something/someone idiom\nsunset\nto the last idiom\nwrap\nSee more results »\nover adverb\n(EXTRA)\nextra; not used: I have some euros left over from the last time I was in France.UK When all the guests had gone, we realized there was lots of food over.\nMore examplesFewer examplesHe made a stew from the meat and vegetables left over from yesterday's meal.When the dress was finished she still had some material left over.We've got six bottles of wine left over from the party.Any paper that is left over will be recycled.Was there any paint left over when you painted the bathroom?\nSMART Vocabulary: related words and phrases\nAlso, extra, and in addition\nadded\nadditional\nadditionally\nagain\nalong\net cetera\netc.\nexcess\nfiller\nfor good measure idiom\nhand\nrate\nsame\nsecond\nsecondly\nside\nsuchlike\nsupernumerary\nthirdly\ntouch\nSee more results »\nover adverb\n(AGAIN)\nUS again or repeatedly: You ruined it - now I'll have to do it over!\nMore examplesFewer examplesI lost the file with all my notes in, so I'm going to have to start over.Because the results were wrong, he had to do the experiment over.It's already taken me two hours - I don't want to have to do it all over.\nSMART Vocabulary: related words and phrases\nContinually & repeatedly\n24/7\nad nauseam\nagain\nalway\nalways\nhour\nhour after hour idiom\nimmemorial\njag\nmorning\nnight\npersistently\nprevalently\nquick-fire\nrecurrently\nrepeated\nrumble\nstreak\nyear\nyear in, year out idiom\nSee more results »\nover adverb\n(FINISHED TALKING)\nsaid when you are talking to someone by radio, to mean that you have finished speaking and will wait for their answer: \"This is flight 595X. Do you read me? Over.\" over and out\nsaid when you are talking to someone by radio in order to end the conversation, or when you humorously want to say that something is finished: \"Thank you, control tower. Over and out.\"\nSee more\nSMART Vocabulary: related words and phrases\nBroadcasting: radio\nam\nantenna\nanti-jamming\nanti-radar\nautotune\nbandwidth\nbeacon\nCB\nLW\nmedium wave\nmulti-wavelength\nmultichannel\nMW\nRDS\nreceiver\nshort wave\nshout-out\ntranny\ntransponder\ntuner\nSee more results »\nGrammar\nOverOver is a preposition, adverb, adjective or prefix. …\nOver as a prepositionWe use over to talk about movement or position at a higher level than something else: …\nOver as an adverbWe can use over as an adverb to talk about movement above something or someone: …\nOver as an adjective: be overWe can use be over to mean ‘finished’, ‘at an end’: …\nOver as a prefixWe can use over as a prefix to mean ‘too much’. We connect over to the word which comes after it, sometimes with a hyphen after over: …\nOver: typical errorsOver, when used with periods of time, refers to the period from start to finish, not to any one moment during that time: …\nAcross, over or through?We use across as a preposition (prep) and an adverb (adv). Across means on the other side of something, or from one side to the other of something which has sides or limits such as a city, road or river: …\nAcrossWe use across as a preposition (prep) and an adverb (adv). Across means on the other side of something, or from one side to the other of something which has sides or limits such as a city, road or river: …\nOverWe use over as a preposition and an adverb to refer to something at a higher position than something else, sometimes involving movement from one side to another: …\nAcross or through?When we talk about movement from one side to another but ‘in something’, such as long grass or a forest, we use through instead of across: …\nAcross, over and through: typical errorsWhen moving from one side to another while surrounded by something, we use through not across: …\nIdioms\nover and over (again)\nit isn't over until the fat lady sings\nin cricket, a set of six bowls (= throws) from the same end of the field: Simons took three wickets in his opening spell of 10 overs.\nMore examplesFewer examplesOnly 11 overs were possible before lunch.England were 180 for five and needing 90 off 12 overs.Somehow McGrath survived until the end of the over.\nSMART Vocabulary: related words and phrases\nCricket\n12th man\nbails phrase\nball-tampering\nbatswoman\nbatting average\nbowl someone out\nbreak\ncut\ndeclare\ndeep\nforward\nglance\nlength\nmaiden\npavilion\ntest match\nuppish\nuppishly\nwalk\nwicketkeeper\nSee more results »\nover- prefix\n(TOO MUCH)\ntoo much or more than usual: The children got over-excited (= too excited).\nSMART Vocabulary: related words and phrases\nToo much and unnecessary\nado\nbe up to your neck (in something) idiom\nbellyful\nbinge\ncarry/take coals to Newcastle idiom\ndrown\ngush\nhave your (fair) share of something idiom\nhyper\nimmoderate\nimmoderately\ninappeasable\nplay gooseberry idiom\nplenty\npleonasm\npleonastic\nplethora\nunnecessary\nunwarranted\nweigh someone/something down\nSee more results »\nover- prefix\n(MORE THAN)\nmore than: a club for the over-50s\nSMART Vocabulary: related words and phrases\nDescribing age & birthdays\nage\nage group\nage limit\naged\nbaby boomer\ngoing on\ngone\ngrown up\nknock\nmillennial\nnonagenarian\nripe\nsexagenarian\nsixties\nsomething\nspring chicken\nsweet sixteen\nteens\ntwenties\ntwinkle\nSee more results »\nover- prefix\n(ACROSS)\nacross: Of course, the overland route is much slower than going by air.\nSMART Vocabulary: related words and phrases\nAbove & over\nabove\naloft\no'er\noverhead\noverlie\nsuper\nsupra\nsur-\ntopper\nupmost\nover- prefix\n(HIGHER POSITION)\nabove: She was knocked off her bicycle by an overhanging branch.\nSMART Vocabulary: related words and phrases\nAbove & over\nabove\naloft\no'er\noverhead\noverlie\nsuper\nsupra\nsur-\ntopper\nupmost\nGrammar\nOverOver is a preposition, adverb, adjective or prefix. …\nOver as a prepositionWe use over to talk about movement or position at a higher level than something else: …\nOver as an adverbWe can use over as an adverb to talk about movement above something or someone: …\nOver as an adjective: be overWe can use be over to mean ‘finished’, ‘at an end’: …\nOver as a prefixWe can use over as a prefix to mean ‘too much’. We connect over to the word which comes after it, sometimes with a hyphen after over: …\nOver: typical errorsOver, when used with periods of time, refers to the period from start to finish, not to any one moment during that time: …\nover preposition\n(ABOVE)\nAdd to word list\nAdd to word list\nin, to, on, or at a position above or higher than something else, sometimes so that one thing covers the other; above: The sign over the door said, \"Private.\" He put a sweater on over his shirt. The horse jumped over the fence. I couldn’t hear what she said over the sound of the music (= The music was louder than her voice).\nover preposition\n(ACROSS)\nacross from one side to the other, esp. by going up and then down: Once we get over the bridge we’ll stop for lunch. She tripped over the rug. The car went over the cliff (= across the edge of it).\nOver also means on the other side of: Their house is just over the river.\nover preposition\n(MORE THAN)\nmore than: Most of these rugs cost over $1000. Children over 12 (= older than 12) pay full price.\nIf someone or something goes over a limit or point, it increases beyond it: Construction costs are already $25 million over budget.\nover preposition\n(CALCULATE)\nmathematics\n&#160; infml divided by\nover preposition\n(USING)\nusing a device such as a telephone: They spoke over the phone. We transfer files over the Internet.\nover preposition\n(DURING)\nduring a period of time, or while doing something: She made a lot of changes over the past six months. Can we discuss this over lunch?\nover preposition\n(AUTHORITY)\ngreater in authority, power, or position than: Parents want to have control over their children.\nover preposition\n(ABOUT)\nabout or connected with: There’s no point in arguing over this.\nover preposition\n(FINISHED)\n(esp. of illness) no longer suffering from: Is he over the flu yet? His wife died last year and he’s still not over it. Idioms\nover your head\nover the hill\nover adverb [not gradable]\n(DOWN)\nfrom a higher to a lower position; down: The little boy fell over and started to cry.\nover adverb [not gradable]\n(AGAIN)\nagain or repeatedly: You’ve ruined it – now I’ll have to do it over.\nover adverb [not gradable]\n(ACROSS)\nOver also describes the way an object moves or is moved so that a different part of it is facing up: The dog rolled over onto its back.\nover adjective [not gradable]\n(FINISHED)\n(esp. of an event) finished, completed, or ended: I’ll be glad when the meeting is over. The game was over by 5 o’clock. I'm worried about the test, but at least it will be all over (= completely finished)in an hour.\nover- prefix\n(MORE THAN)\ntoo much or more than usual: overpriced overdressed He’s always been an overachiever.\nAdd to word list\nAdd to word list\nmore or greater than: Free delivery on orders over $25. Over 80% of temporary workers are part-timers. The cable company has viewers in over 5 million households. Shares fell by just over 1 per cent to 1,327p.\nduring a particular period of time: The loan can be paid back in instalments over 12 months. Sales went up 300% over only six weeks.\ngo over (sth)\nto become or make something become greater than a particular limit of time, money, etc. : These additional costs made the project go over. Be prepared to go over budget."}