{"id":259508,"name":"overestimate","type":"verb","us_sound":"ˌoʊ.vɚˈes.tə.meɪt","us_link":"../audio/o/eus75406.mp3","uk_sound":"ˌəʊ.vəˈres.tɪ.meɪt","uk_link":"../audio/o/ukoverc021.mp3","content":"Add to word list\nAdd to word list\n[ I or T ] to guess an amount that is too high or a size that is too big: I overestimated and there was a lot of food left over after the party. Most of us overestimate how much time and energy we have. According to the survey, agents frequently overestimate the size of rooms. Opposite\nunderestimate (AMOUNT)Compare\novervalue\nC1 [ T ] to think that something is better or more important than it really is: We cannot overestimate the importance of this work. The benefits of nuclear technology, she said, had been grossly overestimated.\n[ T ] to think that someone is stronger, or more skilful, intelligent, or determined than they really are: They were forced to the conclusion that they had overestimated him. Synonym\noverrateOpposite\nunderestimate (PERSON)\nSMART Vocabulary: related words and phrases\nGuesses and assumptions\na shot in the dark idiom\napproximation\nassumption\nbet\nconjecturally\nconjecture\ncounterfactual\nestimate\nmisestimate\nmisestimation\noverestimation\npreception\npreconception\nproposition\nre-estimate\nsneaking\nspeculation\nspeculatively\nsupposition\nsuspicion\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEstimating value\nAnalysing and evaluating\nMisunderstanding\na guess that is too high in amount: The shortfall was caused by an overestimate of revenue last year. Experts put remaining tiger numbers at somewhere between 5,000 and 7,000, although this could be an overestimate.\nSMART Vocabulary: related words and phrases\nGuesses and assumptions\na shot in the dark idiom\napproximation\nassumption\nbet\nconjecturally\nconjecture\ncounterfactual\nestimate\nmisestimate\nmisestimation\noverestimation\npreception\npreconception\nproposition\nre-estimate\nsneaking\nspeculation\nspeculatively\nsupposition\nsuspicion\nSee more results »\nAdd to word list\nAdd to word list\nto think that something is or will be greater, more extreme, or more important than it really is: [ T ] I’m afraid Theresa is forever overestimating her strength.\nAdd to word list\nAdd to word list\n[ I or T ] to think that something is or will be greater or more important than it really is: grossly/wildly overestimate I think we have grossly overestimated the pace of growth. Most people overestimate what they can achieve in a day and underestimate what they can achieve in a year. Assess your potential earnings honestly - don't overestimate.\n[ T ] to think that someone is better at doing something, more intelligent, etc. than they really are: I thought they would pick it up very quickly, but I overestimated them. overestimation noun [ C or U ]\nPart of the problem was gross overestimation of ticket sales.\nan opinion that something is larger or more important than it really is: Experts put the figure at $6 million, though this may be an overestimate.\nCompare\nunderestimate"}