{"id":259937,"name":"overhang","type":"verb","us_sound":"ˌoʊ.vɚˈhæŋ","us_link":"../audio/o/eus75410.mp3","uk_sound":"ˌəʊ.vəˈhæŋ","uk_link":"../audio/o/ukoverc029.mp3","content":"overhang verb [T]\n(STICK OUT)\nAdd to word list\nAdd to word list\nto stick out over something at a lower level: Several large trees overhang the path.\nSMART Vocabulary: related words and phrases\nProtruding and sticking out\nbeetling\nbristly\nbug out\nbulbous\nbulge\njutting\nledge\nmale\noutcrop\noverhanging\npeek\npoke\nproject\nprojection\nprotuberance\nprotuberant\nproud\nstick\nstick out\nstick up\nSee more results »\noverhang verb [T]\n(AFFECT)\nto have a negative effect on a situation: Overhanging the controversy is the question of how much the administration knew about the arms deal.\nSMART Vocabulary: related words and phrases\nDamaging and spoiling\nadulterate\nadulterated\nadulteration\napplecart\nat-risk\nbutcher\neat\neat away at something\nerode\nflaw\nfoul\nfoul (something) up\ngloss\nrain on someone's parade idiom\nrampage\nravage\nravages\nruin\nsour\nwreck\nSee more results »\noverhang noun [C]\n(STICK OUT)\nthe part of a rock or roof that sticks out over something below: The church is unsafe because it was built on an overhang.\nSMART Vocabulary: related words and phrases\nProtruding and sticking out\nbeetling\nbristly\nbug out\nbulbous\nbulge\njutting\nledge\nmale\noutcrop\noverhanging\npeek\npoke\nproject\nprojection\nprotuberance\nprotuberant\nproud\nstick\nstick out\nstick up\nSee more results »\noverhang noun [C]\n(EFFECT)\nsomething that has a negative effect on a situation: Prices are unlikely to increase while there is an overhang of 40,000 unsold new houses. Latin America's current debt overhang Related word\noverhanging\nAdd to word list\nAdd to word list\n(of something at a high level) to stick out farther than something at a lower level and therefore not to have any support from below, or to hang over: The balcony overhangs the patio, creating a shady place to sit. overhang noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈoʊ·vərˌhæŋ/\nThe house has a deep overhang facing the southern sun.\nAdd to word list\nAdd to word list\nCOMMERCE a quantity of goods or other things that have not been sold when they should have been: a stock/an inventory/a supply overhang We're about to enter the selling season with a really big supply overhang.an overhang of sth Prices are unlikely to increase while there is an overhang of 40,000 unsold new houses.\nFINANCE, STOCK MARKET a situation on a stock market in which a quantity of shares is available but not sold, reducing their price: an overhang of sth The potential overhang of more than 200 million shares of stock is one of a number of financial and legal risks that investors in the company face.\nFINANCE, STOCK MARKET to bring down the price of something because there is too much of it available: Massive gold stocks continue to overhang the market, traders say."}