{"id":259915,"name":"overground","type":"adjective","us_sound":"ˈoʊ.vɚˌɡraʊnd","us_link":"../audio/o/cdo0623usover2815.mp3","uk_sound":"ˌəʊ.vəˈɡraʊnd","uk_link":"../audio/o/cdo0623ukover2826.mp3","content":"overground adjective, adverb\n(ABOVE GROUND)\nAdd to word list\nAdd to word list\nabove the surface of the earth: It's much better to put cables overground than underground. After a couple of hours, the many underground and overground streams began to look like a river. Many of the Tube's usual three million daily users switched to the roads and overground trains or walked.\nMore examplesFewer examplesFloods destroyed cars in the underground and overground car parks.The tube train nipped briefly overground and went past some trees.New overground walkways and crossings were created in the centre of town.\nSMART Vocabulary: related words and phrases\nThe Earth & outer space - general words\nablate\nanti-gravity\natmosphere\natmospherically\nauroral\ngeocentric\ngravity\nhorizon\nhydrosphere\nionospheric\nlithosphere\nlithospheric\nmacrocosm\nmesosphere\nmesospheric\nMother Nature\nthe Big Bang\nunderground\nweightlessness\nzero gravity\nSee more results »\noverground adjective, adverb\n(NOT SECRET)\nAn overground activity is not secret or illegal, or is accepted by most people: Illicit operators are connecting with overground businesses where money can be laundered.go overground Once a scene goes overground, the people who started it often lose interest.\nMore examplesFewer examplesHere was a band taking the rave scene overground.He is hopeful that rap music will go overground one day in his country.The problem is that the show tries too hard to bring a camp aesthetic overground; to deliver a mainstream version of camp when by definition camp is a secret, niche sensibility.\nSMART Vocabulary: related words and phrases\nLegal & illegal\nbang to rights idiom\nbookable\nbootleg\nchargeable\nconcealed carry idiom\ncontroverted election\ncriminally\nillegality\nimproper\nlegitimate\nlegitimately\nlicensed\nlicit\nlicitly\nnon-criminal\nshady\ntreasonable\nunlawful\nvalidity\nvalidly\nSee more results »\nCompare\nunderground\nthe overground\n(also the Overground) in the UK, a railway system in which trains travel above the ground: You can connect to buses and the overground quite easily. the London Overground Compare\nunderground"}