{"id":261420,"name":"oversight","type":"noun","us_sound":"ˈoʊ.vɚ.saɪt","us_link":"../audio/o/eus75435.mp3","uk_sound":"ˈəʊ.və.saɪt","uk_link":"../audio/o/ukovers012.mp3","content":"oversight noun\n(MISTAKE)\nAdd to word list\nAdd to word list\n[ C or U ] a mistake made because of a failure to notice something: They claimed it was simply (an) oversight.\nThesaurus: synonyms, antonyms, and examples\na mistakemistakeIt was just a silly mistake - no need to apologize.errorHe admitted that he'd made an error.blunderThe company was struggling after a series of financial blunders.slipIt was an understandable slip.mix-upThere was a mix-up with the bags at the airport.gaffeI made a real gaffe by calling her \"Emma\", which is the name of his previous girlfriend.\nSee more results »\nSMART Vocabulary: related words and phrases\nFaults and mistakes\naberration\nAchilles heel\nadrift\nblack mark\nblemish\nerror\nfailing\nfalse move\nfaux pas\nflaw\nmalapropism\nmiscue\nmisfunction\nmisperception\nmisprint\nmisspelling\ntypo\nwardrobe malfunction\nweakness\nwhat price...? idiom\nSee more results »\noversight noun\n(RESPONSIBILITY)\n[ U ] responsibility for a job or activity and for making sure it is being done correctly: Who has oversight of genetic testing?\nSMART Vocabulary: related words and phrases\nPower to control\nahold\nall-powerful\nascendancy\nauthoritarianism\nbe above someone's pay grade idiom\nbig beast\ncradle\ndiscretionary\ngrip\nhe who pays the piper calls the tune. idiom\nhegemonic\nhegemonism\nimplant\npower structure\npower struggle\npower vacuum\npredominance\npuissance\nsway\nthe hand that rocks the cradle rules the world idiom\nSee more results »\noversight noun\n(MISTAKE)\nAdd to word list\nAdd to word list\n[ C ] a mistake caused by a failure to notice or do something: Because of a bank oversight, the money had not been credited to my account.\noversight noun\n(MANAGEMENT)\n[ U ] management of an operation or process: The FBI provided technical expertise and general oversight to the investigation.\nAdd to word list\nAdd to word list\n[ U ]\n&#160; LAW, GOVERNMENT, MANAGEMENT systems or actions to control an activity and make sure that it is done correctly and legally: In commodity trading, key goods such as oil or uranium are traded with almost no oversight.government/regulatory oversight Lawmakers are questioning whether the industry needs more government oversight.oversight of sth The report criticized weak oversight of the contractors.\n[ C ] a mistake made because of a failure to notice something: For a development targeting families, a lack of four-bed houses is an oversight. We apologize for this oversight."}