{"id":258939,"name":"overcome","type":"verb","us_sound":"ˌoʊ.vɚˈkʌm","us_link":"../audio/o/eus75398.mp3","uk_sound":"ˌəʊ.vəˈkʌm","uk_link":"../audio/o/ukovary028.mp3","content":"overcome verb\n(DEAL WITH)\nAdd to word list\nAdd to word list\nB2 [ I or T ] to defeat or succeed in controlling or dealing with something: Juventus overcame Ajax in a thrilling game. to overcome difficulties/obstacles/problems/resistance Eventually she managed to overcome her shyness in class. 20,000 demonstrators sang \"We shall overcome\" as they marched through Washington.\nMore examplesFewer examplesTheir resolute opposition to new working methods was difficult to overcome.The plan was designed to help women and minorities overcome discrimination in the workplace.He overcame all obstacles in his path to the top.What are the prospects for overcoming the strife between the Christian minority and Muslim majority?This film reveals their resourcefulness in overcoming appalling weather and treacherous terrain.\nSMART Vocabulary: related words and phrases\nDealing with things or people\naddressable\napproach\nattend to someone/something\nbe all over it idiom\nbeard the lion (in his/her den) idiom\nbed\ncut\ngrip\nhave it out with someone idiom\nhold\nhold on idiom\nI/I've got this idiom\nill-prepared\nsquare\nto get a handle on something idiom\nto have a handle on something idiom\ntough\ntough something out\nturn to someone/something\nweather\nSee more results »\novercome verb\n(UNABLE TO ACT)\nC2 [ T usually passive ] to prevent someone from being able to act or think in the usual way: They were overcome by fumes from the fire and had to be carried out of their houses. Overcome with/by emotion, she found herself unable to speak for a few minutes.\nSMART Vocabulary: related words and phrases\nPreventing and impeding\nanti-jamming\navoid\navoidable\navoidably\nbar\nbottleneck\nderail\nfireproof\nhave someone/something hanging round your neck idiom\nhead off\nhinder\nhogtie\nhold back\nprevent\npreventable\npreventative\nprevention\nprevention is better than cure idiom\nscuttle\nsmother\nSee more results »\novercome verb\n(DEAL WITH)\nAdd to word list\nAdd to word list\n[ I/T ] to defeat or succeed in controlling or dealing with something: [ T ] I eventually overcame my shyness in class. [ I ] I believe that we will overcome in the end.\novercome verb\n(UNABLE TO ACT)\n[ T ] to prevent someone from being able to act or think in the usual way: He was overcome by smoke before he could get out of the apartment."}