{"id":259557,"name":"overexpose","type":"verb","us_sound":"ˌoʊ.vɚ.ɪkˈspoʊz","us_link":"../audio/o/usoverd008.mp3","uk_sound":"ˌəʊ.və.rɪkˈspəʊz","uk_link":"../audio/o/ukoverc023.mp3","content":"overexpose verb [T usually passive]\n(EXPERIENCE)\nAdd to word list\nAdd to word list\nto make someone or something experience something too much, or for too long, risking harm: He is another employee who was regularly overexposed to lead, arsenic, and cadmium in his 26 years at the plant.\nMore examplesFewer examplesThe new insecticides were also widely used in farming, and the mosquitoes that had been overexposed quickly became resistant to the chemicals.The staining of teeth is a warning sign that the child has been overexposed to fluoride.People retire to southern climes and overexpose their skin.\nSMART Vocabulary: related words and phrases\nExperiencing and suffering\n(straight) from the horse's mouth idiom\nafflict\naffliction\nalmost/nearly die of something idiom\nbe a martyr to something idiom\nbe a victim of your own success idiom\nbear\ncount\nget the short end of the stick idiom\ngo through\ngrip\nhands-on\nhit someone where they live idiom\nhorse\npractical\nseat-of-the-pants\nsee life idiom\nstricken\nsurvive\ntaste\nSee more results »\noverexpose verb [T usually passive]\n(ATTENTION)\nto give too much attention to someone or something in newspapers, on television, on social media, etc.: His parents and his team protected him from being overexposed, keeping him from doing interviews and turning down endorsement deals.\nMore examplesFewer examplesSome media watchers say the comedian risks becoming the kind of overexposed personality he so mercilessly mocks.Unlike some actresses, Miss Shue has never been overexposed.Topping the charts can make a career, of course, but it can also overexpose the performer and create a backlash.\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ncustomer relationship management\ndetoxify\ndifferentiator\ndogfooding\nflyer\no.n.o.\noff-brand\non-brand\noverexposure\noverhype\ntout\nunadvertised\nunbilled\nunbranded\nunmarketable\nSee more results »\noverexpose verb [T usually passive]\n(PHOTOGRAPH)\nto give too much light to a piece of photographic film when taking a photograph: Unfortunately the light was too bright and my pictures were all overexposed. Since my camera allows me to preset exposure above and below the automatic reading, I typically overexpose my shots by one f-stop.\nSMART Vocabulary: related words and phrases\nPhotography\naerial photograph\nairbrush\nanalogue\naperture\nbokeh\ncamera\nexpose\nglossy\ngolden hour\ngrainy\nhalation\nhappy slapping\nhi-res\npap\nphotoshoot\npic\npicture\nPillCam\npin-up\nprojection\nSee more results »"}