{"id":259707,"name":"overflowing","type":"verb","us_sound":"ˌoʊ.vɚˈfloʊ","us_link":"../audio/o/eus75408.mp3","uk_sound":"ˌəʊ.vəˈfləʊ","uk_link":"../audio/o/ukoverc025.mp3","content":"Add to word list\nAdd to word list\npresent participle of\noverflow\noverflow verb\n(TOO FULL)\nC2 [ I or T ] When a liquid overflows, it flows over the edges of a container, etc. because there is too much of it: The milk overflowed when I poured it into the jug. Because of heavy rain, the river may overflow its banks.\n[ I or T ] If a container or a place overflows, whatever is inside it starts coming out because it is too full: Oh no, the sink is overflowing all over the floor. The bin was overflowing with rubbish.\nC2 [ I ] When a place overflows, or people or things overflow from somewhere, some people or things have to come out because it cannot contain them all: The bar was so full that people were overflowing into/onto the street. His room is overflowing with books.UK The train was full to overflowing (= so full that there was not space for any more passengers). to overflowing\nso that water or another substance is almost coming over the top: Someone had filled the sink to overflowing.UK The sink was full to overflowing.\nSMART Vocabulary: related words and phrases\nMovement of liquids\nbacksplash\nbe dripping with something idiom\ncounter-stream\ndecant\ndrainage\ndrip\nfunnel\nleakage\nreinjection\nrespray\nripple\nrun a bath phrase\nrun someone/something over\nrunnel\nspate\nswash\nswill\nswirl\nswirling\ntop something up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nToo much and unnecessary\nFull\noverflow verb\n(EMOTIONS)\nC2 [ I ] If you overflow with thoughts or feelings, you express them strongly: They were overflowing with emotion at the birth of their baby. Suddenly, her anger overflowed.\nSMART Vocabulary: related words and phrases\nExpressing and showing feelings\na gleam in your eye idiom\nabandon\naffective\narticulation\nbe in/get into a state idiom\nbeat your breast/chest idiom\nbeetroot\ncrimson\nfling\nfling up your hands idiom\nflush\nfreak\nfreak (someone) out\ngame face\nroar\nroar with something\nsook\nspill\nspill out\nsulk\nSee more results »"}