{"id":261994,"name":"overturn","type":"verb","us_sound":"ˌoʊ.vɚˈtɝːn","us_link":"../audio/o/eus73373.mp3","uk_sound":"ˌəʊ.vəˈtɜːn","uk_link":"../audio/o/epd32612.mp3","content":"overturn verb\n(GO UPSIDE DOWN)\nAdd to word list\nAdd to word list\n[ I or T ] to (cause to) turn over: The car skidded off the road, hit a tree and overturned. The intruder had overturned some of the furniture in the house.\nMore examplesFewer examplesThe rioters overturned several cars and set them alight.An articulated lorry has overturned on the south-bound carriageway, shedding its load.A truck driver died last night when his vehicle overturned.She overturned the car, but walked away from it without a scratch.Vandals smashed windows and overturned cars in the downtown shopping district.\nSMART Vocabulary: related words and phrases\nTurning upside down\nass\ncapsize\nflip\ngo ass over (tea)kettle idiom\ninvert\ninverted\ninvertible\nsupinate\nupend\nupset\nupside down\nupturned\noverturn verb\n(CHANGE)\n[ T ] formal to change a legal decision: The Court of Appeal overturned the earlier decision.\n[ T ] UK If you overturn someone's majority in an election in the UK, you defeat them: The Labour candidate unexpectedly overturned the long-standing Tory majority.\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\ndiminished responsibility\nextrajudicial\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\npower of attorney\nprecedent\npretrial\nprobate\nprovide\nthe Webster ruling\nwitness to something\nwobbler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nElections\nWinning and defeating\nAdd to word list\nAdd to word list\nto turn over, or to cause something to turn over: [ I ] The truck overturned, spilling its cargo.\nTo overturn a decision or judgment is for a court to change it so it will not be in effect: [ T ] The court of appeals overturned her conviction and ordered a new trial.\nAdd to word list\nAdd to word list\nLAW to change a legal decision: overturn a decision/verdict/ruling The Court of Appeal overturned the earlier decision."}