{"id":260650,"name":"overnight","type":"adjective","us_sound":"ˌoʊ.vɚˈnaɪt","us_link":"../audio/o/eus75422.mp3","uk_sound":"ˌəʊ.vəˈnaɪt","uk_link":"../audio/o/ukovern001.mp3","content":"overnight adjective, adverb\n(TIME OF DAY)\nAdd to word list\nAdd to word list\nB1 for or during the night: an overnight stop in Paris You can stay overnight if you want to. Don't forget to pack an overnight bag (= a bag for things that you need when you stay away from home for a night).\nMore examplesFewer examplesSeveral of the injured were detained overnight in hospital.The temperature could fall below zero overnight.I emptied the closet and put my belongings into the black overnight case.I'm travelling overnight so I've booked a sleeper.The overnight invasion took the military experts unawares.\nSMART Vocabulary: related words and phrases\nDays & times of day\nafternoon\nafternoons\nall day\nam\narvo\nhappy hour\nhigh noon\nhour\nin broad daylight idiom\nin the dead of night/winter idiom\nnocturnally\nnoon\nnoontime\no'clock\noffice hours\nthe witching hour\nwhite night\nwine o'clock\nworkday\nworking day\nSee more results »\novernight adjective, adverb\n(SUDDENLY)\nC2 suddenly and unexpectedly: She became a star overnight. The book was an overnight success.\nSMART Vocabulary: related words and phrases\nNot expected or planned\nabrupt end\nabrupt halt\nabruptly\nabruptness\nad hoc\nimprovidently\ninadvertence\ninadvertency\ninadvertent\ninadvertently\nrudely\nsharpness\nsine die\nspirit\nspontaneity\nunstarry\nunsuspected\nuntimely\nuntoward\nunwilled\nSee more results »\n[ I ] to stay somewhere for a night: We've overnighted at some remote and beautiful places. He overnighted in Detroit before continuing his campaign.\n[ T ] US to send something to someone so it arrives the next day: He said he needed a new passport urgently, so we overnighted one to him. These truffles are fresh, overnighted from Italy.\nMore examplesFewer examplesWe decided to overnight at Lake Wanaka.King Charles II once overnighted here on his way to France.We missed our plane and had to overnight in Amsterdam.She overnighted her application.I have been so desperate for brisket that my grandmother overnighted one to me.The salmon is caught in a mountain stream and overnighted to your doorstep.\nSMART Vocabulary: related words and phrases\nLiving or sleeping somewhere\nabide\nco-resident\nco-residential\ndomiciled\ndwell\ninhospitable\ninhospitably\nlive in\nlive in sin idiom\nlive out\nlodge\npopulate\nrepopulate\nrepopulation\nreside\nresidence\nresidency\nsettle\nslum\ntenancy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDelivering and despatching\nAdd to word list\nAdd to word list\nfor or during the night: You can stay overnight with us if you want to. fig. The book was an overnight success (= a sudden success).\nAdd to word list\nAdd to word list\nfor or during the night: an overnight stay/stop We made an overnight stop in Paris. Stocks in Hong Kong closed moderately higher encouraged by overnight gains on Wall Street.\nsudden and unexpected: Like many so-called overnight successes, she had been working hard for quite some time.\nfor or during the night: I took a train overnight.\nsuddenly or quickly, and often unexpectedly: Building a project like this doesn't happen overnight. The company almost overnight reformed itself as a real estate developer. Major capital expenditure is rarely recouped overnight.\n[ I ]\n&#160; TRANSPORT to stay somewhere for a night: We overnighted at Frankfurt before flying on to Chennai.\n[ T ]\n&#160; COMMUNICATIONS\n&#160; US to send a letter or package to be delivered by the end of the next day: I told him to overnight the contract to me."}