{"id":260283,"name":"overlay","type":"verb","us_sound":"ˌoʊ.vɚˈleɪ","us_link":"../audio/o/usoverd018.mp3","uk_sound":"ˌəʊ.vəˈleɪ","uk_link":"../audio/o/ukoverh019.mp3","content":"Add to word list\nAdd to word list\nto cover something with a layer of something: The tiny carvings were overlaid with silver.\nThesaurus: synonyms, antonyms, and examples\nto lie on the surface of someone or somethingcoverSnow covered the ground.overlayClicking this button will overlay your map with satellite images of the terrain. blanketThe fields were blanketed with early-morning mist.enshroudThe mountaintops were enshrouded in a thick veil of cloud.buryThe shed was completely buried by rubble.be carpeted with somethingThe aisle was carpeted with rose petals.\nSee more results »\nbe overlaid with something literary\nSomething that is overlaid with something has a particular quality added to it that influences its character: Her new novel is overlaid with political concerns.\nSMART Vocabulary: related words and phrases\nCovering and adding layers\nadditive\nasphalt\nbestrew\nbind\nblanket\nblindfold\ngum\ninlaid\nlag\nlaminate\nlayer\nobliterate\nseasoned\nslap\nslap something on\nsmother something in/with something\nspeckle\nstudded\ntent\nwax\nSee more results »\na thin covering of something: The wood frame has a gold overlay.\nSMART Vocabulary: related words and phrases\nSurfaces of objects\n-backed\nback\nbase\nbases\nbed\ncrust\nescutcheon\nface\nfront\nmulti-sided\nnap\nobverse\nplate\nrear\nreverse\nside\nsubstrate\nsuperficialis\nsurface area\nunderneath\nSee more results »\nAdd to word list\nAdd to word list\nto cover something with a layer of something else: Sticky tracing paper overlaid on street maps lets travelers chart their course again and again.overlay sth with sth By mapping the entire retail landscape and overlaying it with demographic information, the company is able to isolate store-by-store effects of television ad campaigns.\nto add information, data, ideas, etc. to existing information: A computer model overlaid information about age, work experience, and educational attainment.\nsomething such as a transparent layer or image that can be put over something else, for example to add information or show a relationship between two things: The printer is also able to add a watermark or overlay.\ninformation, data, ideas, etc. that are added to existing information: The phone codes could be changed completely, or by an overlay that adds a second area code."}