{"id":261300,"name":"overseas","type":"adjective","us_sound":"ˌoʊ.vɚˈsiːz","us_link":"../audio/o/usl30270.mp3","uk_sound":"ˌəʊ.vəˈsiːz","uk_link":"../audio/o/ukovers002.mp3","content":"Add to word list\nAdd to word list\nB2 in, from, or to other countries: We need to open up overseas markets. There are a lot of overseas students studying at our college. My brother is a student overseas. to go/travel/live/work overseas I wanted to go to an oversea university.\nMore examplesFewer examplesThe company has been successful in penetrating overseas markets this year.If you were offered an overseas posting, would you take it?After he'd served his apprenticeship he found work overseas.The airline halved its overseas service because of a sharp reduction in traffic.Our firm does a lot of business with overseas customers.Further expansion was planned both at home and oversea.\nSMART Vocabulary: related words and phrases\nCountries, nationalities & continents: country & nation\nbirthright citizenship\nbody politic\nBRICS\ncitizen\ncompatriot\ncross-border\ndenaturalize\ndomestic\ndomestically\ndual\nfatherland\ninternationalism\nnative\nnaturalization\nnon-country\nnon-domestic\nnon-indigenous\nnon-national\nstatehood\nstateless\nSee more results »\nAdd to word list\nAdd to word list\nin, from, or to countries that are across the sea: The Air Force was recalling troops from overseas bases. I’ve had to travel overseas fairly often.\nAdd to word list\nAdd to word list\nin, from, or connected with another country or countries, especially across the sea: We need to open up overseas markets. In the following years, he expanded the firm's overseas operations.overseas investment/investors Finance ministers have struggled to attract overseas investors. He continued to pay state taxes while he and his family were overseas.\nin or to another country or countries, especially across the sea: They're outsourcing jobs overseas. The company doesn't have enough capital to invest overseas. Occasionally, I travel overseas to vet potential suppliers."}