{"id":262084,"name":"overwater","type":"verb","us_sound":"ˌoʊ.vɚˈwɑː.t̬ɚ","us_link":"../audio/o/cdo0123usover1877.mp3","uk_sound":"ˌəʊ.vəˈwɔː.tər","uk_link":"../audio/o/cdo0123ukover2213.mp3","content":"Add to word list\nAdd to word list\nto pour too much water on to plants or the soil that they are growing in: A common mistake is to overwater houseplants. You shouldn't overwater your lawn. Take care not to over-water - this plant needs plenty of drainage. Compare\nwater verb (GIVE WATER)\nMore examplesFewer examplesTake care not to overwater the containers, and make sure that the drainage holes do not become blocked.Many homeowners overwater their lawns, thinking that the grass must need more water in the heat.Orchids can die through being overwatered, while other plants die through lack of water. Providing you don't overwater, it will grow back.\nSMART Vocabulary: related words and phrases\nGardening - general words\nallotmenteer\nallotmenteering\naquaponics\narborist\nbeanpole\nbed\nhedging\nhomegrown\nhorticultural\nhorticulturally\nhorticulture\nregraft\nregreen\nrepot\nresod\nresow\nweedy\nwindow box\nxeriscaping\nyardwork\nSee more results »\nabove an area of water such as the sea: The pilots said they had seen the boats on their overwater flights. Guests stay in elegant over-water bungalows dotted around the lagoon.\nintended for use above an area of water such as the sea: On aircraft with overwater equipment, check the life vest. Compare\nunderwater\nMore examplesFewer examplesMany of the birds make landfall further south, an overwater distance of about 3,500–4,000 km.They spent their honeymoon in a fantastic overwater villa in the Maldives. The overwater bungalows have large glass floor panels, so you can gaze at the ocean life below. Over-water flights were restricted to a distance of 100 miles offshore.\nSMART Vocabulary: related words and phrases\nWater in general\naquatically\naqueous\nbathwater\nbathymetric\nbathymetrically\nbathymetry\nbrackish\nbriny\ndistilled water\nfreshwater\ngrey water\nhypersaline\nhypersalinity\nnon-turbulent\npool\nrainwater\nsalinity\nsalt water\nsoft water\nwet\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSeas & oceans"}