{"id":261898,"name":"overtime","type":"adverb","us_sound":"ˈoʊ.vɚ.taɪm","us_link":"../audio/o/eus75443.mp3","uk_sound":"ˈəʊ.və.taɪm","uk_link":"../audio/o/ukovers212.mp3","content":"Add to word list\nAdd to word list\nB2 (time spent working) after the usual time needed or expected in a job: They're doing/working overtime to get the job done on time. Everyone is on overtime (= being paid extra for working after the usual time) this weekend.\nUS (UK extra time) a period of time in a sports game in which play continues if neither team has won in the usual time allowed for the game: If the game ends in a tie, overtime will be played. They lost to the Bears in overtime. Compare\nregulation time\nnormal time\nSMART Vocabulary: related words and phrases\nWorking hours\nafter hours idiom\nclock in\nclock out\nclose of business\nclose of play\nfull time\nhour\nin-service\nman-hour\nnight shift\npunch\npunch out\npunch the clock idiom\nreduced time\nrush hour\nshiftwork\ntime clock\nworking week\nworkweek\nzero-hours contract\nSee more results »\nextra payment for working after the usual time: You can earn some overtime by working after 6.00 p.m.\nSMART Vocabulary: related words and phrases\nEarning money\nassessable\nbank\nbase pay\nbasic\nbasic income\ndisposable income\nhand over fist idiom\nin arrears idiom\nline your pocket(s) idiom\nmake an honest living idiom\npro rata\nprofit from something\nprorate\npull\npull something down\nraise\nrake something in\nretainer\nrevenue\nsick pay\nSee more results »\nAdd to word list\nAdd to word list\ntime worked in addition to your usual job hours: Approval must be granted for overtime before the work has been performed.\nOvertime is also the period of time in a game, such as football or basketball, in which play continues if neither team has won in the usual time allowed for the game. overtime adjective, adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈoʊ·vərˌtɑɪm/\nI’m working overtime this week.\nAdd to word list\nAdd to word list\ntime spent working after the usual time needed or expected in a job: We have put in 15 hours of overtime this week. The pay is $7.75 per hour; $11.75 for overtime.\nextra payment for working after the usual time: You can earn some overtime by working after 6.00 p.m.eligible/ineligible for overtime If you work 45 hours a week and you are eligible for overtime, then you should get paid time and a half for five hours.be on overtime Everyone is on overtime this weekend.\nafter the usual time needed or expected in a job: Utility crews are working overtime to restore service which was knocked out by ice storms."}