{"id":259561,"name":"overexposure","type":"noun","us_sound":"ˌoʊ.vɚ.ɪkˈspoʊ.ʒɚ","us_link":"../audio/o/cdo0318usover3479.mp3","uk_sound":"ˌəʊ.vər.ɪkˈspəʊ.ʒər","uk_link":"../audio/o/cdo0318ukover1009.mp3","content":"overexposure noun [U]\n(EXPERIENCE)\nAdd to word list\nAdd to word list\nthe fact of experiencing something or being affected by it because of being in a particular situation or place for too long: A child's development can be irreversibly stunted by overexposure to lead. They were concerned about their children's overexposure to violence.\nMore examplesFewer examples Overexposure to the sun is unhealthy.Keeping children busy is one way to combat TV overexposure.Chronic overexposure to the paint's vapor can lead to asthma-like symptoms.\nSMART Vocabulary: related words and phrases\nExperiencing and suffering\n(straight) from the horse's mouth idiom\nafflict\naffliction\nalmost/nearly die of something idiom\nbe a martyr to something idiom\nbe a victim of your own success idiom\nbear\ncount\nget the short end of the stick idiom\ngo through\ngrip\nhands-on\nhit someone where they live idiom\nhorse\npractical\nseat-of-the-pants\nsee life idiom\nstricken\nsurvive\ntaste\nSee more results »\noverexposure noun [U]\n(ATTENTION)\nthe fact of a person, event, or information appearing or being discussed too much in newspapers, on the television, on social media, etc.: He worries about overexposure and how his friends will react to his new level of fame. The show died a sudden death from overexposure after ABC decided to air it four nights a week.\nMore examplesFewer examplesThe most underestimated risk for a politician is overexposure.Never one to fear overexposure, the businessman and multimedia star will lend his name to another high-profile business venture.Marketers need to make their commercials more entertaining and guard against overexposure.\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ncustomer relationship management\ndetoxify\ndifferentiator\ndogfooding\nflyer\no.n.o.\noff-brand\non-brand\noverexpose\noverhype\ntout\nunadvertised\nunbilled\nunbranded\nunmarketable\nSee more results »\noverexposure noun [U]\n(PHOTOGRAPH)\nthe fact of a piece of film being in the light for too long when a photograph is being taken: He rescued the photo from overexposure and processed it in his darkroom. The photographs were partially bleached by overexposure.\nMore examplesFewer examplesThe negatives can be rescued if overexposure is not too severe.Overexposure of the negative produces a lighter than normal print.The most common cause of overexposure is areas of darkness that fool the meter into thinking there's too little light, which results in highlights that are blown out.\nSMART Vocabulary: related words and phrases\nPhotography\naerial photograph\nairbrush\nanalogue\naperture\nbokeh\ncamera\nexpose\nglossy\ngolden hour\ngrainy\nhalation\nhappy slapping\nhi-res\npap\nphotoshoot\npic\npicture\nPillCam\npin-up\nprojection\nSee more results »"}