{"id":262130,"name":"overwhelming","type":"adjective","us_sound":"ˌoʊ.vɚˈwel.mɪŋ","us_link":"../audio/o/usl30272.mp3","uk_sound":"ˌəʊ.vəˈwel.mɪŋ","uk_link":"../audio/o/ukovers227.mp3","content":"Add to word list\nAdd to word list\nC1 difficult to fight against: She felt an overwhelming urge/desire/need to tell someone about what had happened. Synonym\noverpowering\nThesaurus: synonyms, antonyms, and examples\nfelt or experienced with a lot of forcestrongI felt a strong urge to hug him.powerfulAnger is one of the most powerful human emotions.intenseShe learned that even intense emotional pain passes.fierceThe people have a fierce pride in their country.deepHe suffered from a deep feeling of inadequacy.deep-seatedHe has a deep-seated loathing of snobbery.\nSee more results »\nC1 very great or very large: She said how much she appreciated the overwhelming generosity of the public in responding to the appeal. An overwhelming majority has voted in favour of the proposal.\nMore examplesFewer examplesThere has been overwhelming public support for the proposed shopping development.The temptation to have another glass of wine proved overwhelming.The evidence against the suspect is overwhelming.The home team had the support of the overwhelming majority of the spectators.The devastation showed the overwhelming power of the earthquake.\nSMART Vocabulary: related words and phrases\nPhysically strong and powerful\n(as) tough as old boots idiom\nbeefy\nbilly-o\nbrute\nbulletproof\nburly\nimpregnably\nindestructible\nindestructibly\nindustrial-strength\nintensely\nshatterproof\nshockproof\nsinewy\nsouped-up\nstalwart\nstoutly\nviolent\nwashboard stomach\nwith a vengeance idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnormous\nAdd to word list\nAdd to word list\nvery great or strong: An overwhelming majority voted in favor of the proposal. I felt an overwhelming sense of relief when the semester was over. overwhelmingly adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˌoʊ·vərˈhwel·mɪŋ·li, -ˈwel-/\nIn April, the House of Representatives overwhelmingly passed the bill."}