{"id":261797,"name":"overtake","type":"verb","us_sound":"ˌoʊ.vɚˈteɪk","us_link":"../audio/o/eus75442.mp3","uk_sound":"ˌəʊ.vəˈteɪk","uk_link":"../audio/o/ukovers205.mp3","content":"overtake verb\n(GO PAST)\nAdd to word list\nAdd to word list\nC1 [ T ] to go past something by being a greater amount or degree: Our US sales have now overtaken our sales in Europe. We'd planned to hold a meeting tomorrow, but events have overtaken us (= things have changed).\nB2 [ I or T ] UK (US pass) to come from behind another vehicle or a person and move in front of them: Always check your rear view mirror before you overtake (another car).\nMore examplesFewer examplesI accelerated to overtake the bus.Garcia was gaining on her opponent throughout the race, but only overtook her at the very end.A continuous white line in the middle of the road means no overtaking.DVDs are overtaking videos in popularity.\nSMART Vocabulary: related words and phrases\nSurpassing in quality or number\ncatch\ncatch (someone) up\ncompare\ncrown\ncrush\ndo something for an encore idiom\neclipse\nencore\noutcompete\noutdo\noutflank\noutgo\noutman\npush the envelope idiom\nput/leave someone in the shade idiom\nshade\nshame\nsteal a march on someone idiom\nsteal someone's thunder idiom\nsurpass\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOn the road: driving & operating road vehicles\novertake verb\n(HAPPEN)\n[ T ] to happen to a person or a place suddenly and unexpectedly: The family was overtaken by tragedy several years ago, and they still haven't recovered.\nSMART Vocabulary: related words and phrases\nSurprising and shocking\nagainst all expectations phrase\namaze\namazing\namazingly\nastonish\ndumbfounding\ndumbfoundingly\ndynamite\nearth-shaking\nearth-shattering\npull\npull something out of the bag/hat idiom\nraise (a few) eyebrows idiom\nreality check\nsensationalist\nstagger\nunbelievable\nwalk\nwalk in on someone\nworld-shattering\nSee more results »\novertake verb [T]\n(GO PAST)\nAdd to word list\nAdd to word list\nto go beyond something by being a greater amount or degree, or to come from behind and move in front of: In the 1500-meter race, he finished with a late rush to overtake Barbosa in 1 minute, 44.84 seconds. The Bruins got within three points late in the game but just couldn’t overtake the Cowboys.\novertake verb [T]\n(HAPPEN)\n(esp. of unpleasant emotions or events) to happen suddenly and unexpectedly: The family was overtaken by tragedy several years ago.\nAdd to word list\nAdd to word list\nto grow, develop, or progress more quickly than something else: Our US sales have now overtaken our sales in Europe. Plastic soon overtook cash as Britain's most popular method of payment."}