{"id":260297,"name":"overlapping","type":"adjective","us_sound":"ˌoʊ.vɚˈlæp.ɪŋ","us_link":"../audio/o/usoverd016.mp3","uk_sound":"ˌəʊ.vəˈlæp.ɪŋ","uk_link":"../audio/o/ukoverh017.mp3","content":"overlapping adjective\n(SAME SPACE)\nAdd to word list\nAdd to word list\ncovering something partly by going over its edge, or covering part of the same space: The overlapping slates of the roofs in the mountain village resembled fish scales.\nMore examplesFewer examplesShe made place mats by gluing overlapping maple leaves to a base.Line the dish with pastry with overlapping edges.The steamer is a metal basket with overlapping petals that open to a circle.\nSMART Vocabulary: related words and phrases\nCovering and adding layers\nadditive\nasphalt\nbestrew\nbind\nblanket\nblindfold\ngum\ninlaid\nlag\nlaminate\nlayer\nobliterate\nseasoned\nslap\nslap something on\nsmother something in/with something\nspeckle\nstudded\ntent\nwax\nSee more results »\noverlapping adjective\n(SAME FEATURES)\nhaving some parts that are the same or happen at the same time: The word has two separate but overlapping meanings. She had several overlapping commitments that day.\nMore examplesFewer examplesThey want to clear up confusion about overlapping privacy laws that may keep teachers, doctors, and police from sharing information.There are some problems to do with state sovereignty and overlapping jurisdiction.The dialogue imitates the overlapping speech rhythms of real conversation.They bring together evidence from different, although overlapping, periods of time.The film has an intricate structure, with overlapping plotlines, flashbacks, and flashforwards.\nSMART Vocabulary: related words and phrases\nBeing or appearing similar or the same\na passing resemblance idiom\nalign\naligned\nbe in good company idiom\nbe in the same ballpark idiom\nbe nothing/not much/very little in it idiom\ncorrespond\nequal\nequalization\neven (something) out\nflatlining\nhomologous\nhomologous series\nmatch\nparallel\npassing\nplaceless\nplacelessness\nresemble\nrival\nSee more results »\noverlapping adjective\n(FOOTBALL)\nin football, involving a player passing the ball to another member of his or her team and then running beyond that player so that he or she is ready to receive the ball again: Carragher made some excellent overlapping runs.\nMore examplesFewer examplesHe praised their passing, their crossing, the overlapping play of the two full-backs.Tiatto finished off a fine overlapping move with a cross-shot.\nSMART Vocabulary: related words and phrases\nFootball/soccer\n18-yard box\n2 3 5\n4 3 2 1\n4 4 2\n4 5 1\nfootballer\nfooty\nformation\nfoul throw\nfour five one\nfour four two\nfour three two one\nrelegation zone\nreserve team\nroute one football\nrow Z\nRoy of the Rovers stuff\nsweeper\ntreble\nwoodwork\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral terms used in ball sports\nSee\noverlap"}