{"id":261070,"name":"overreach","type":"verb","us_sound":"ˌoʊ.vɚˈriːtʃ","us_link":"../audio/o/usoverp004.mp3","uk_sound":"ˌəʊ.vərˈiːtʃ","uk_link":"../audio/o/ukovern019.mp3","content":"Add to word list\nAdd to word list\n[ I or T ] (also overreach yourself) to fail by trying to achieve, spend, or do more than you can manage: The housing meltdown hurt high-risk borrowers who overreached. In the flush of success, he overreached. Don't go too far and overreach yourself. Companies that overreach themselves soon find themselves in debt.\n[ I ] to make a bigger claim than is reasonable: Those doing sound science don’t overreach, knowing that their methodology will be replicated and their results tested.\n[ T ] to do more than your authority allows: Some officials charged that the investigators had overreached their authority. It was a warning to the Florida court not to overreach its powers.\nSMART Vocabulary: related words and phrases\nFailing and doing badly\nabjectly\nat-risk\nbackbencher\nballs (something) up\nbe on your beam ends idiom\nblow (someone/something) up\nbomb\negg\nflog\nflog a dead horse idiom\nflop\nflub\nflunk out\nfounder\nrunning on empty idiom\nsclerotic\nscrew\nscrew (something) up\nsmoke\nthe rot sets in idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExaggerating & playing down\nBad and wrong behaviour\noverreach noun [C or U]\n(DOING TOO MUCH)\nthe act of doing more than your authority allows: Courts act as a safeguard against executive overreach in individual counter-terrorism cases. Already there are signs of regulatory overreach.\nthe act of making a bigger claim than is reasonable: To say \"Organizations will be forced to pay for procedures they morally oppose\" is clearly an overreach.\nMore examplesFewer examples\"There's a real danger of overreach,\" claims one political scientist. Politicians recognise the risks of overreach.The finding was the result of an \"overreach\" by the investigator who went beyond \"the intent of \" the original inquiry.\nSMART Vocabulary: related words and phrases\nBad and wrong behaviour\nact out\nangel\nASB\nastray\nat your worst idiom\nbe up to no good idiom\nget up to something\ngo off the rails idiom\ngo round\ngross misconduct\nhellion\nprofligacy\nprofligate\nraise hell idiom\nrakish\nrakishly\nunprofessionally\nunworthily\nunworthy\nvillainy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExaggerating & playing down\noverreach noun [C or U]\n(INJURY)\nan injury to a horse's foot caused by the foot reaching too far forward when the horse is moving: He was in the lead when he suffered an overreach and had to retire.\nMore examplesFewer examplesHe suffered a nasty overreach.The six-year-old suffered an overreach when winning the Tingle Creek Chase. Lingo was ruled out of the Supreme Novices' Hurdle with an overreach.\nSMART Vocabulary: related words and phrases\nInjuring and injuries\nat-risk\nbe in the wars idiom\nbite\nboo-boo\nbrain damage\ndisable\nharm\ninjure\ninjury\nlesion\nlesional\nreinjury\nscarred\nscathe\nsprain\nstrain\ntrample\ntrauma\ntwist\nvictim\nSee more results »"}