{"id":262366,"name":"own","type":"determiner","us_sound":"oʊn","us_link":"../audio/o/eus75455.mp3","uk_sound":"əʊn","uk_link":"../audio/o/ukoverw013.mp3","content":"Add to word list\nAdd to word list\nA2 belonging to or done by a particular person or thing: Each neighbourhood in New York has its own characteristics. I'd like to have my very own apartment. He wanted an apartment of his own. She makes all her own clothes. I'm going to be out tonight, so you'll have to make your own dinner (= prepare it yourself). Was that your own idea or did someone suggest it to you? You'll have to make up your own mind (= decide by yourself) what you want to do. I'd never have believed it if I hadn't seen it with my own eyes/heard it with my own ears. \"Is that your mum's car?\" \"No, it's my own (= it belongs to me).\" James Joyce wrote in a style that was all his own (= that was not like that of anyone else). We like to take care of our own (= take care of people who are members of our family, or who work for us). (all) on your own\nB1 alone: I like living on my own.\nB1 mainly UK without any help: I did my buttons up all on my own, Dad .\nSee more in your own time\nmainly UK If you do something in your own time, you do it at the speed at which you want to work: I like to do things in my own time - I don't like to be rushed.\nUK (US on your own time) during the time when you are not officially working: You may only use company computers to access the Web in your own time.\nSee more\nMore examplesFewer examplesThey have no children of their own, but they're hoping to adopt.Now you can watch the latest films in the comfort of your own room.She said that she didn't want a lawyer and was going to conduct her own defence.Her death made him more aware of his own mortality.We now have our very own post office in the village.\nSMART Vocabulary: related words and phrases\nParticular and individual\nbe the very thing idiom\nbiomarker\ncalling card\ncapita\ncertain\nespecially\nindividualistic\nindividualistically\nindividuality\nindividualized\nindividually\nmatter\npeculiarity\nper capita\npersonally\npet\nprivate\nregard\nrespectively\nseparately\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHaving and owning - general words\nSee also\nsomeone's (own) flesh and bloodGrammar\nOwnOwn is a determiner and a pronoun. …\nIdioms\nbe your own person/woman/man\ncome into your own\nfor its own sake\nget your own back (on someone)\nget your own way\nmake something (all) your own\non your own head be it\nown verb\n(HAVE LEGALLY)\nB1 [ T not continuous ] to have something that legally belongs to you: We own our house. I've never owned a suit in my life.\nMore examplesFewer examplesThey own 20% of the company's stock.Who owns/holds the copyright on this article?She owns a popular tourist restaurant on the town's waterfront.The house is partly owned by her father.I get a real kick out of owning my own car.\nSMART Vocabulary: related words and phrases\nHaving and owning - general words\nacquire\nacquisition\nattach\nattach something to something\nbe endowed with something idiom\nbearer\ncarry\nholder\nlay\nlord/master/mistress/king/queen of all you survey idiom\nmake something (all) your own idiom\nmistress\nnot/never want for anything idiom\nrevert\nrevert to something\nshared ownership\nstake\nstake something out\nsurvey\nthey've\nSee more results »\nown verb\n(ADMIT)\n[ I ] old-fashioned to admit: [ + (that) ] I own (that) I was not very happy with the group's decision.\nSMART Vocabulary: related words and phrases\nAdmitting & confessing\nacknowledge something as something\nacknowledgedly\nacknowledgment\nadmission of guilt\nadmittedly\navowedly\nbreastbeating\nclean\nclimb down\ncome clean idiom\nconfess\nhold/put your hands up idiom\nretraction\nself-admittedly\nself-confessed\nself-confessedly\nself-confession\nstand\nswallow your words idiom\ntake something back\nSee more results »\nown verb\n(DEFEAT/DO WELL)\n[ T ] mainly US informal to defeat someone completely or be much better than him or her; to perform extremely well: Last time we played them, we owned them! Beyoncé owned that stage tonight!\nSMART Vocabulary: related words and phrases\nWinning and defeating\nannihilate\nannihilation\nbank\nbe gunning for someone idiom\nbe one in the eye for someone idiom\nconvincing\nmoral victory\nmove/go in for the kill idiom\nnear thing\noutclass\noutcompete\nscrape\nsew\nslaughter\nstomp on someone/something\nsweep the board idiom\ntake someone down\ntake someone to the cleaner's idiom\ntake something apart\nthrash\nSee more results »\nown verb\n(ACCEPT)\n[ T ] to accept and be responsible for something: It's your life - own it. I own who I was, and so I’m always open to admitting fault and talking through it.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconclusion\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nwithout a murmur idiom\nSee more results »\nIdiom\nas if you owned the placePhrasal verb\nown up\nAdd to word list\nAdd to word list\nbelonging to or done by a particular person or thing: Mary has her own car. You’ll have to fix your own dinner. The police testified that the woman left of her own accord (= she chose to do it without being forced). Idioms\nin your own right\non your own\nto have or possess something: We own some property in Texas. owner noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈoʊ·nər/\nWill the owner of the gray Ford parked in front of the restaurant please move it? Phrasal verb\nown up\nAdd to word list\nAdd to word list\nto have something that legally belongs to you: He has owned the business since 1995. The group owns assets worth $620 million. This gave many people the opportunity to own their own home for the first time.\nto accept responsibility for something such as an idea: For the reorganization to work, employees need to own the idea of change.\nbelonging or relating to a particular person rather than to other people: She started her own business selling cameras. The software helps you create your own website. He invested €5 million of his own money."}