{"id":206911,"name":"label","type":"noun","us_sound":"ˈleɪ.bəl","us_link":"../audio/l/label.mp3","uk_sound":"ˈleɪ.bəl","uk_link":"../audio/l/ukkos__030.mp3","content":"label noun [C]\n(SIGN)\nAdd to word list\nAdd to word list\nB1 a piece of paper or other material that gives you information about the object it is attached to: Remember to put some address labels on the suitcases. Washing instructions should be on the label.\nVincenzo Lombardo/Photographer's Choice RF/GettyImages\nC2 a word or a phrase that is used to describe the characteristics or qualities of people, activities, or things, often in a way that is unfair: He seems to be stuck with the label of \"troublemaker\".\nMore examplesFewer examplesIt says on the label that no preservatives or artificial colourings have been added.The label became detached from your parcel.The label says to take one dose three times a day.The label on this bread says it is guaranteed free of/from preservatives .It's described on the label as 'light, fruity wine'.\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\npostscript\nPSA\npush notification\nradiogram\nreadout\ntelemetry\nthe real deal\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClassifying and creating order\nlabel noun [C]\n(COMPANY)\nB1 a company that produces goods for sale, the goods themselves, or the company's name or symbol: Her favourite designer label (= maker of expensive clothes) is Armani. Their own-label vegetarian products have been a huge success. The group have just signed (= arranged to record) with a new record label.\nMore examplesFewer examplesI can't afford designer labels/designer label clothes.an indie movie/film/record labela new album on the Motown labelShe's signed a three-album deal with a new record label.His own-label ready meals are very good.\nSMART Vocabulary: related words and phrases\nEnterprises\nacquiree\nacquirer\nacquiror\nagency\nagribusiness\nanswering service\nclicks and mortar idiom\nconglomerate\nconsortium\nfintech\nfirm\nfranchise\nfranchisee\nfranchiser\npacker\nparent company\npartner up\npartnership\nplc\nprivate company\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople who sell things\nC1 to fasten a label to: [ + adj ] The parcel was clearly labelled \"Fragile\". If you spend any time in prison, you're labelled as a criminal for the rest of your life.\nMore examplesFewer examplesHe was always labelled as lazy.I labelled all my strawberry jam today.Make sure your cases are clearly labelled.The medicines are carefully labelled.They labelled all the specimins .\nSMART Vocabulary: related words and phrases\nNames and titles\nA.N. Other\nage\naka\nalias\nappellation\nform of address\ngiven name\ngood name\nidentity\nilk\nplace name\npseudonym\npseudonymity\npseudonymous\npseudonymously\nunchristened\nunder the name of idiom\nunidentified\nunnamed\nuntitled\nSee more results »\nAdd to word list\nAdd to word list\na piece of paper or other material that gives information about the object it is attached to: the address/mailing label Follow the instructions on the label.\nA label can also mean the name or symbol of a company that produces goods for sale: Everything we produce goes out under our own label.\nA label can also be a name or a phrase used to describe the characteristics or qualities of people, activities, or things: It’s hard to say whether to apply the label “jazz” or “rock” to her music.\nto attach a piece of paper or other material that has information about an object to that object: She labeled all the packages and sent them out the same afternoon.\nTo label something or someone is also to name that thing’s or person’s character: He didn’t want to be labeled a complainer, so he didn’t raise any objection to the extra work.\nAdd to word list\nAdd to word list\na piece of paper or other material that gives you information about the object that it is fixed to: address/price/warning label Canada put graphic warning labels on cigarette packs back in June 2001. Food packages that did not carry a label certifying them as safe were being blocked from export. Launder or dry-clean, according to the care label. Check the sodium levels on the food label.\na company that produces goods for sale, using a particular name: designer/fashion label She also has plans to launch a range of cosmetics if her fashion label takes off.\na name of a record company: an independent/record/major label\na name of a company that makes wine: Among its other big deals this year was the purchase of two champagne labels.\na name or symbol that is used by a company to sell its products, or the products themselves: Contaminated wheat gluten made its way into pet food sold under nearly 100 labels across North America. See also\nbrand label\ndesigner label\nown-label\nprivate-label\nstore label\nCOMMERCE, MARKETING to fasten a label to something, or write information on something: All food products are labelled with their price and country of origin.be labelled as sth Only clothes with a UPF of 15 to 50-plus may be labeled as sun-protective. Processed foods must be clearly labeled to indicate fat, sugar, and salt content for shoppers.\nto describe someone or something using a particular word or phrase, often unfairly: She doesn't like being labelled as a \"woman director\", saying she's just a director who happens to be a woman."}