{"id":207061,"name":"labour","type":"noun","us_sound":"ˈleɪ.bɚ","us_link":"../audio/l/labor.mp3","uk_sound":"ˈleɪ.bər","uk_link":"../audio/l/uklabia002.mp3","content":"labour noun\n(WORK)\nAdd to word list\nAdd to word list\nC1 [ U ] practical work, especially when it involves hard physical effort: The car parts themselves are not expensive, it's the labour that costs the money. manual labour (= hard work using the hands)\nC1 [ U ] workers, especially people who do practical work with their hands: skilled/unskilled labour labours [ plural ] literary\nall the effort and hard work that have been involved in doing a particular piece of work: Are you tired after your labours? West was paid very little for his labours. Retirement is the time to enjoy the fruits of your labours.\nMore examplesFewer examplesFarming has been mechanized, reducing the need for labour.The older generation were bent double from decades of labour in the fields.Society is challenging the traditional sexual division of labour.There has been some increase in the use of casual labour over recent years.We'll invoice you for parts and labour.\nSMART Vocabulary: related words and phrases\nWork, working and the workplace\nact as something\nall work and no play (makes Jack a dull boy) idiom\nassignment\nbandh\nbe at work idiom\ngrind\nhoop\nhot-desking\nhotelling\nhousekeeping\nin the line of duty idiom\ninduction\nindustry\nmoonlight\nskivvy\nslave\nslog\nslouch\nspadework\nsweat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWorkers in general\nEffort and expending energy\nlabour noun\n(BIRTH)\nC2 [ C or U ] the last stage of pregnancy from the time when the muscles of the womb start to push the baby out of the body until the baby appears: labour pains She went into (= started) labour at twelve o'clock last night. I was in labour for twelve hours with my first baby. No two labours are ever the same.\nSMART Vocabulary: related words and phrases\nObstetrics: birth\nafterbirth\nantenatally\nApgar score\nB, b\nbirth centre\nbirth partner\nbirth rate\nbore\nchildbearing\nchildbirth\nhypnobirth\nhypnobirthing\ninduce\nmaternity suite\nmaternity unit\nmatrescence\nposh\npreemie\nstillbirth\nstillborn\nSee more results »\nIdiom\nlabour of love\n[ I ] to do hard physical work: He travelled around Europe labouring to pay his way. [ + to infinitive ] Three hours after the explosion, rescue teams were still labouring to free those trapped.\n[ I + adv/prep ] to do something slowly with great physical or mental effort: He laboured up the hill with his heavy load. She's been labouring over the same article for days.\nSMART Vocabulary: related words and phrases\nWork, working and the workplace\nact as something\nall work and no play (makes Jack a dull boy) idiom\nassignment\nbandh\nbe at work idiom\ngrind\nhoop\nhot-desking\nhotelling\nhousekeeping\nin the line of duty idiom\ninduction\nindustry\nmoonlight\nskivvy\nslave\nslog\nslouch\nspadework\nsweat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSlow and moving slowly\nIdioms\nlabour the point\nlabour under the delusion, illusion, misapprehension, etc.\nthe Labour Party, the political party in Great Britain that believes in social equality, a more equal sharing out of wealth, and the rights of workers: Labour are sure to get in at the next election. I voted Labour in the last election. Compare\nLabor\nSMART Vocabulary: related words and phrases\nPolitics - general words\nanti-capitalism\nanti-capitalist\nanti-communism\nanti-communist\nanti-fascism\ninterparty\ninterpellate\ninterpellation\ninterventionist\nlab\non message\nOrwellian\noverstep\nparliament\nparty politics\nstatesman\nstatesmanlike\nstateswoman\nsubsidiarity\nsuper-conservative\nSee more results »\nbelonging or relating to the Labour Party: the Labour Party Labour voters the Labour candidate\nSMART Vocabulary: related words and phrases\nPolitics - general words\nanti-capitalism\nanti-capitalist\nanti-communism\nanti-communist\nanti-fascism\ninterparty\ninterpellate\ninterpellation\ninterventionist\nlab\non message\nOrwellian\noverstep\nparliament\nparty politics\nstatesman\nstatesmanlike\nstateswoman\nsubsidiarity\nsuper-conservative\nSee more results »\nAdd to word list\nAdd to word list\npractical work, especially involving physical effort: The cost will depend on the amount of labour involved. They gave us an estimated price including parts and labour. The shorts sell for $45, but the hard labor of the women who made them cost just 50 cents. Most jobs these days aren't exhausting manual labour.\nHR workers in a company or a country, especially people who do practical work with their hands: skilled/unskilled labour Foreign workers were brought in to fill a temporary shortfall in skilled labor. We use casual labour during busy periods. cheap/local/temporary labour More companies are building plants abroad to take advantage of cheaper labor costs. labour disputes/shortages/standards\nwithdraw your labour UK\nHR to stop working as a way of complaining about or trying to change something, such as pay or working conditions: The pilots have chosen to withdraw their labour at a crucial time in the airline's history.\nSee also\nagency labour\ncasual adjective\nchild labour\ndirect labour\ndivision of labour\nforced labour\nindirect labour\norganized labour\nsweated labour"}