{"id":207233,"name":"lack","type":"noun","us_sound":"læk","us_link":"../audio/l/lack.mp3","uk_sound":"læk","uk_link":"../audio/l/uklabia021.mp3","content":"lack of something\nAdd to word list\nAdd to word list\nB1 the fact that something is not available or that there is not enough of it: Her only problem is a lack of confidence.\nSee more\nB2 to not have or not have enough of something that is needed or wanted: He just lacks a little confidence. What we lack in this house is space to store things. We are lacking three members of staff due to illness. Compare\nmissing\nMore examplesFewer examplesThey've won a few matches this season but they lack consistency.They lack basic foodstuffs, such as bread and milk.He lacks the necessary skills for the job.The town lacks leisure facilities such as a swimming pool or squash courts.Joshua clearly has ability in this subject but he lacks application.\nSMART Vocabulary: related words and phrases\nLacking things\nbankrupt\nbankruptcy\nbe hard up (for something) idiom\nbereft\ncry out for something\nhole\ninappeasable\nlacking\nminus\nneed\nneed something like you need a hole in the head idiom\nneedful\nscrape\nscream\nshy\nskimpily\nstarve someone/something of something\ntaken\nunaccompanied\nunappeased\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nScarce, inadequate and not enough\nAdd to word list\nAdd to word list\na condition of not having any or enough of something, esp. something necessary or wanted: a lack of ambition/confidence/knowledge a lack of money She certainly has no lack of friends (= She has a lot of friends).\nto not have any or enough of something, esp. something necessary or wanted: What we lack in this house is space to store things. He’s totally lacking a sense of humor.\nAdd to word list\nAdd to word list\na situation in which there is not enough of something, or something is not available: serious/severe lack of sth Many of these communities are having to cope with a severe lack of resources. \"Lack of time\" is frequently cited as the reason for poor-quality work.\nto not have enough of something that is necessary: Most of the candidates had the right qualifications but lacked the necessary skills."}