{"id":208157,"name":"lancastrian","type":"noun","us_sound":"læŋˈkæs.tri.ən","us_link":"../audio/l/cdo0623uslanc2303.mp3","uk_sound":"læŋˈkæs.tri.ən","uk_link":"../audio/l/cdo0623uklanc2302.mp3","content":"Add to word list\nAdd to word list\na person from the county (= area with its own local government) of Lancashire or the city of Lancaster in northwestern England: He is himself a Lancastrian, from Morecambe. Robert is a quiet but plain-spoken Lancastrian.\nhistory\n&#160; specialized someone who was on the side of the House of Lancaster during the English Wars of the Roses (1455–1487) fought between the Houses of Lancaster and York: Edward IV defeated the Lancastrians at Tewkesbury in 1471. Compare\nYorkist\nMore examplesFewer examplesJack is a big, brawny Lancastrian who must have been a good rugby player in his day. She was pleased to find herself working with a fellow Lancastrian.\nSMART Vocabulary: related words and phrases\nTowns & regions: city names & their inhabitants\nAberdeen\nAberdonian\nAbidjan\nAbu Dhabi\nAbuja\nBratislava\nBrazzaville\nBridgetown\nBrisbane\nBristol\nDushanbe\nEdinburgh\nEl Paso\nEton\nFaisalabad\nMelbourne\nMemphis\nMiami\nMontreal\nMoscow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTowns & regions: named regions of countries\nMiddle Ages (medieval Period) 501-1500\nfrom or relating to the county (= area with its own local government) of Lancashire or the city of Lancaster in northwestern England: He spoke with a broad Lancastrian accent. Pies are part of my Lancastrian heritage. This part of Cumbria was Lancastrian until 30 years ago.\nhistory\n&#160; specialized belonging or relating to the side of the House of Lancaster during the English Wars of the Roses (1455–1487) fought between the Houses of Lancaster and York: The church was destroyed by the Lancastrian army in their sack of the town in 1461. Richard confiscated the Lancastrian estates to divide among his allies. Compare\nYorkist\nMore examplesFewer examplesThere's an old Lancastrian joke about a Yorkshireman who finds himself in the audience at a comedy club.The chef is known for his use of local Lancastrian produce.On the accession of Henry IV, these Lancastrian forests came once again into the hands of the Crown.\nSMART Vocabulary: related words and phrases\nTowns & regions: city names & their inhabitants\nAberdeen\nAberdonian\nAbidjan\nAbu Dhabi\nAbuja\nBratislava\nBrazzaville\nBridgetown\nBrisbane\nBristol\nDushanbe\nEdinburgh\nEl Paso\nEton\nFaisalabad\nMelbourne\nMemphis\nMiami\nMontreal\nMoscow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTowns & regions: named regions of countries\nMiddle Ages (medieval Period) 501-1500"}