{"id":208280,"name":"landmark","type":"noun","us_sound":"ˈlænd.mɑːrk","us_link":"../audio/l/landmark.mp3","uk_sound":"ˈlænd.mɑːk","uk_link":"../audio/l/uklampl021.mp3","content":"landmark noun [C]\n(OBJECT)\nAdd to word list\nAdd to word list\nC1 a building or place that is easily recognized, especially one that you can use to judge where you are: The Rock of Gibraltar is one of Europe's most famous landmarks.\nSMART Vocabulary: related words and phrases\nBuildings in general\n-bedroomed\nbeach hut\nbuilding\nbunkhouse\ncampanile\nfour-square\ngeodesic dome\nhalf-timbered\nheritage\nheritage-listed building\nnon-residential\nnon-structural\nNorman\nobservation tower\noutstation\nresidential\nstructure\ntower\nturreted\nwarren\nSee more results »\nlandmark noun [C]\n(STAGE)\nC2 an important stage in something's development: The invention of the silicon chip was a landmark in the history of the computer. In a landmark case/decision, the governor pardoned a woman convicted of killing her husband, who had physically abused her.\nSMART Vocabulary: related words and phrases\nStages & phases\nearly-stage\nearly-term\nhome run\nhome straight\nin phase/out of phase idiom\ninterstage\nleg\nmulti-phase\nmultiphasic\npartway\nperiod\nphase\npoint\nshovel-ready\nstage\nstep\ntertiary\ntwilight\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTurning points & deciding moments\nlandmark noun [C]\n(PLACE)\nAdd to word list\nAdd to word list\na building or place that is easily recognized, esp. one that you can use to judge where you are: I couldn’t pick out any familiar landmarks in the dark and got completely lost.\nA landmark is also a building or other structure that is considered especially important as an example of its type: a landmark skyscraper\nlandmark noun [C]\n(STAGE)\nan important stage in the development of something: The invention of the silicon chip is a landmark in the history of technology.\nAdd to word list\nAdd to word list\nan important stage in the development of something: a landmark in sth The deal is a landmark in the company's rapid international expansion.a landmark deal/decision/settlement The landmark deal secures 6,000 jobs and ends more than a week of protests and strikes."}