{"id":208200,"name":"land","type":"noun","us_sound":"lænd","us_link":"../audio/l/land.mp3","uk_sound":"lænd","uk_link":"../audio/l/uklampl010.mp3","content":"land noun\n(DRY SURFACE)\nAdd to word list\nAdd to word list\nB2 [ U ] the surface of the earth that is not covered by water: It is cheaper to drill for oil on land than at sea. The treaty has led to a dramatic reduction in the number of land-based missiles in Europe. The military commanders won't deploy their land forces until they're satisfied that the air attacks have done their job.\nB1 [ U ] an area of ground, especially when used for a particular purpose such as farming or building: This sort of land is no good for growing potatoes. I always prosecute people who trespass on my land. We want to buy a plot of land to build a house. the land\nfarms, farming, and the countryside: Most of the families lived off the land (= grew their own food, etc.). My parents worked (on) the land.\nMore examplesFewer examplesThe farmer grazes cattle on this land in the summer months.This stretch of land was once covered with luxuriant forest, but is now bare.There are several plots of land for sale.The refugees were at sea for 40 days before reaching land.This path marks the dividing line between my land and my neighbour's.\nSMART Vocabulary: related words and phrases\nThe Earth & outer space - general words\nablate\nanti-gravity\natmosphere\natmospherically\nauroral\ncosmic\ngravity\nhorizon\nhydrosphere\nionospheric\nlithosphere\nlithospheric\nmacrocosm\nmesosphere\nmesospheric\nMother Nature\nthe Big Bang\nunconformity\nweightlessness\nzero gravity\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFarming - general words\nTowns & regions: the countryside\nland noun\n(COUNTRY)\nC2 [ C ] literary a country: a land of ice and snow The group want to promote their ideas in schools throughout the land. See also\nfatherland\nhomeland\nmotherland\nMore examplesFewer examplesHe developed a malignant hatred for the land of his birth.It is a barren and hostile land.It is a land of antiquated social rules and suffocating traditions.We've got the best brains in the land working on this problem.They journeyed to foreign lands.\nSMART Vocabulary: related words and phrases\nCountries, nationalities & continents: country & nation\nbirthright citizenship\nbody politic\nBRICS\ncitizen\ncompatriot\ndenaturalize\ndomestic\ndomestically\ndual\nfatherland\ninternationalism\nnative\nnaturalization\nnon-country\nnon-domestic\nnon-indigenous\nnon-national\noverseas\nstatehood\nstateless\nSee more results »\nIdioms\nbe in the land of nod\nbe in the land of the living\nfind out/see how the land lies\nland of milk and honey\nthe land of the midnight sun\nthe Land of the Rising Sun\nland verb\n(ARRIVE)\nB1 [ I or T ] to (cause to) arrive on the ground or other surface after moving down through the air: We should land in Madrid at 7 a.m. You can land a plane on water in an emergency. The bird landed on my finger.figurative The report first landed on my desk this morning.\nB1 [ I ] to arrive on land from the sea: We landed at Port Said in the early evening.\n[ I ] to arrive at or appear on a particular website: If you click on the link you land on his blog. The allegations attracted a lot of attention when they landed on the Drudge Report site in the morning.\nMore examplesFewer examplesOne of the plane's engines cut out, so they had to land with only one.Air traffic control at Heathrow have given us clearance to land in 20 minutes.Unlike other spacecraft, the shuttle can glide back through the atmosphere, land safely, and be reused.There was a good-sized crowd at the airport waiting for the plane to land.By the grace of God, the pilot managed to land the damaged plane safely.\nSMART Vocabulary: related words and phrases\nArriving, entering and invading\nannex\nannexation\nbe on the scene idiom\nbeen\nbreak\nbreak someone in\nhit\ningress\ninterloper\nintrude\nintrusion\ninvade\njump\nrock up\nroll up! idiom\nscene\nset foot in somewhere idiom\nshow up\ntrespass\nturn\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTransferring and transporting objects\nAir travel: travelling by aircraft\nPorts & docks\nInternet terminology\nland verb\n(UNLOAD)\n[ T ] to take goods or people off a ship or aircraft: The general's plan involved landing troops behind enemy lines.\nSMART Vocabulary: related words and phrases\nEmptying\nclear\ndrain\nempty\nevacuate\nevacuation\ngut\nhollow\nhollow something out\nlet\nlet someone/something out\nturn\nturn out\nunbox\nunload\nunpack\nvacate\nYou can also find related words, phrases, and synonyms in the topics:\nArriving & departing by boat or ship\nAir travel: travelling by aircraft\nland verb\n(CATCH)\n[ T ] to catch a fish with a hook (= curved piece of wire) or net and remove it from the water: He landed a huge salmon.\nSMART Vocabulary: related words and phrases\nHunting & fishing\nangler\nangling\nanti-hunt\nanti-hunter\nanti-hunting\nbarb\nfisher\nfishhook\nfishing line\nfishing rod\nfly fishing\noutcatch\noutfish\noverfishing\npiscatory\npoach\nquarry\nravening\nwhaler\nyoicks\nSee more results »\nland verb\n(GET)\nC2 [ T ] to get or achieve something good, especially in a way that seems easy or unexpected: He landed a senior editorial job.\nSMART Vocabulary: related words and phrases\nGetting, receiving and accepting\nacquirable\nacquire\nacquisition\nawardee\ncarve\ndraw\nearn\nget back\nget out of something\nget/lay/put your hands on someone idiom\nglom onto something/someone\ngo to someone\npocket\nscore\nscrew\nscrew something out of someone\nsecure\nseize\nseize on/upon something\nsnap something up\nSee more results »\nland verb\n(SUCCEED)\n[ I ] to happen or succeed as intended: Some of his jokes didn't really land, but he was pretty funny.\nland verb\n(HIT)\n[ I or T ] If someone lands a blow or it lands, they hit another person: He managed to land more punches than his opponent. One blow landed on the right side of his face.\nSMART Vocabulary: related words and phrases\nFighting sports\naikido\nall-in wrestling\narm-wrestling\nbantamweight\nblack belt\nfeint\nfull nelson\ngrappler\ngumshield\nhalf nelson\nhammerlock\nleft-hander\npugilist\npugilistic\npunch-drunk\npunchbag\npuncher\npunching bag\nsouthpaw\nwrestler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHitting and beating\nland verb\n(SPORT)\n[ T ] in sport, to make a move that is completed successfully: He landed the jump perfectly. He landed five goals from eight attempts.\nMore examplesFewer examplesEven without training she can still land her trademark axel.She can be counted on to land jump after jump.He landed the winning kick from 47 yards.\nSMART Vocabulary: related words and phrases\nWinter sports\nairboard\nairboarder\nairboarding\nAlpine skiing\naprès-ski\ngroom\nice rink\nice skater\nice skating\ninbounds\nluge\nmogul\nmush\nsled\nsnow groomer\nsnowblade\nsnowblading\nsnowboard\nsnowboarder\ntuck\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAthletics\nSports & games generally\nPhrasal verbs\nland someone in something\nland up\nland someone with something\nland noun\n(DRY SURFACE)\nAdd to word list\nAdd to word list\n[ U ] the surface of the earth that is not covered by water: It is cheaper to drill for oil on land than at sea.\n[ U ] Land is also a particular area of the earth’s surface: They just bought 150 acres of land in Idaho.\n[ U ] The land refers to farms, farming, and the countryside: My parents worked (on) the land all their lives.\nland noun\n(NATION)\n[ C ] a country: Ireland was my mother’s native land.\nland verb\n(ARRIVE)\n[ I/T ] to arrive or cause something to arrive at a place in an aircraft: [ I ] The pilot said we would land in about 20 minutes.\n[ I/T ] To land is also to arrive in a boat: [ I ] We’d been sailing for three weeks by the time we landed at Miami.\nland verb\n(UNLOAD)\n[ T ] to unload people or things from a ship or aircraft onto the ground: The general’s plan involved landing troops behind enemy lines.\nland verb\n(ACHIEVE)\n[ T ] infml to get or achieve something desirable: to land a job Idiom\nland on your feet\nAdd to word list\nAdd to word list\nthe surface of the Earth that is not covered by water: on land It is cheaper to drill for oil on land than at sea.by land The code gives the minimum standards of welfare required for the transport of animals by land.\nPROPERTY an area of ground, especially when used for a particular purpose such as farming or building: The agent controls land with the potential for 22,850 new homes, 5,650 of which already have planning permission.\nPROPERTY\n&#160; (also lands [ plural ]) the land owned by a person or organization: It was understood that federal lands would be given to the oil and gas industry.\nthe land\na way of referring to farms, farming, and the countryside: Many of these migrants have been forced to leave the land and find work in the cities. Some people in the state manage to live off the land. See also\narable\ndevelopment land\nfarm noun\nfederal land\nmarginal land\nprime land\nprivate land\npublic land\nraw land\nreclaimed land\nView all\nvacant land\n[ I or T ]\n&#160; TRANSPORT when a plane lands or someone lands it, it comes down from the sky to the ground: We shall be landing at Paris, Charles de Gaulle, in approximately ten minutes.\n[ I ]\n&#160; TRANSPORT when a boat lands, it arrives at a port, etc. next to the land: The ferry will land at the International Ferry Terminal.\n[ T ]\n&#160; TRANSPORT to take goods or people off a ship or aircraft: After some delay the customs officer finally gave them permission to land the goods.\n[ I ] to arrive somewhere: The report landed on my desk yesterday morning.\n[ T ] informal to get or achieve something good, for example a job: In the past six months they have landed some high-profile contracts."}