{"id":208244,"name":"landing","type":"noun","us_sound":"ˈlæn.dɪŋ","us_link":"../audio/l/landing.mp3","uk_sound":"ˈlæn.dɪŋ","uk_link":"../audio/l/uklampl016.mp3","content":"landing noun [C]\n(PLANE/BOAT)\nAdd to word list\nAdd to word list\nB2 the fact of an aircraft arriving on the ground or a boat reaching land: One person has died after the pilot of a light aircraft was forced to make a crash/emergency landing in a field.\nMore examplesFewer examplesThe plane had to make a forced landing because one of the engines cut out.The captain was forced to jettison the cargo and make an emergency landing.There's a special area at the airport where you can view aircraft taking off and landing.The passengers were told to brace themselves for a crash landing.We had a smooth landing.\nSMART Vocabulary: related words and phrases\nArriving & departing by boat or ship\nanchor\nberth\ncast\ncast off\ndock\nland\nlaunch\nlauncher\nmoor\npost-landing\nrelaunch\nsail\nsea\nshove\nshove off!\nweigh\nYou can also find related words, phrases, and synonyms in the topics:\nAir travel: travelling by aircraft\nlanding noun [C]\n(FLOOR)\nan area of floor that joins two sets of stairs or that leads from the top of a set of stairs to rooms\nSMART Vocabulary: related words and phrases\nParts of buildings: floors & parts of floors\nbasement\ncatwalk\nceiling\ndais\ndecking\ngallery\nground level\nloft\nlow slung\nmachicolation\nmezzanine\npodium\nrostrum\nrunway\nsoapbox\nsplit-level\nthe ground floor\nthe second floor\nupstairs\nwoodblock\nSee more results »\nlanding noun [C]\n(BUILDING)\nAdd to word list\nAdd to word list\na floor between two sets of stairs or at the top of a set of stairs: There is another bathroom on the landing between the first and second floors.\nAdd to word list\nAdd to word list\nTRANSPORT the act of an aircraft arriving on the ground, or of a boat reaching land: The plane made a safe landing on Lake Michigan beach. The pilot was cleared for an emergency landing after reporting smoke in the cockpit.\nTRANSPORT, COMMERCE the act of taking goods off an aircraft or boat, or the amounts that are taken off: His job is to supervise the loading and landing of goods at the quayside. Records of fish and shellfish landings must be submitted to the authorities that are monitoring fish stocks. See also\nhard landing\nsoft landing"}