{"id":208355,"name":"lane","type":"noun","us_sound":"leɪn","us_link":"../audio/l/lain.mp3","uk_sound":"leɪn","uk_link":"../audio/l/uklaidb003.mp3","content":"lane noun [C]\n(ROAD)\nAdd to word list\nAdd to word list\nB2 a narrow road in the countryside or in a town: He drives so fast along those narrow country lanes. I live at the end of Church Lane.\nMore examplesFewer examplesTurn left where the lane meets the main road.The cottage is situated in the middle of a wood at the end of a narrow potholed lane.The youths scuffled with the policeman, then escaped down the lane.He climbed onto his horse and set off at a relaxed trot down the lane.We were trotting along the lane when a car suddenly appeared from nowhere and almost made me fall off my pony.\nSMART Vocabulary: related words and phrases\nRoads: urban & residential streets\naccess road\nadopt\nadopted\nalley\narterial\nboulevard\ncrossing guard\ncul-de-sac\ngrove\nhigh street\nlollipop lady\nparade\nplaza\nRd\nrow\nrunnel\nsquare\nst\nstreet\nunadopted\nSee more results »\nlane noun [C]\n(STRIP)\nB2 a special strip of a road, sports track, or swimming pool that is used to keep vehicles or competitors separate: a bus/bike/cycle lane The northbound lane is closed because of an accident. I find driving in the fast lane very stressful. The German runners/swimmers are in lanes 4 and 6.\na route across the sea or through the air that ships or aircraft regularly sail or fly along: The English Channel is the busiest shipping lane in the world. someone's lane informal\nthe knowledge, experience, or skills that someone has; used especially when saying that someone should only do things or express opinions on things that they know about: Stay in your lane. Just do your job. Do what you're asked to do. Many scientists have \"stayed in their lanes\" and not asked enough questions about the data emanating from \"official\" sources. Instead of checking out other people's lanes, why not focus on what you think and what you want?\nSMART Vocabulary: related words and phrases\nRoads & routes in general\nadopt\nadopted\napproach\nascent\nbicycle lane/path\nbike lane\ncommunication\ndead end\ndetour\nexit\nimpassable\nmilk round\nmulti-lane\nroadway\nroadworks\nroute\nRR\nshortcut\nskid marks\ntoll road\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSurfaces on which sports take place\nSwimming\nAir travel: aviation\nNavigation & shipwrecks\nSkill, talent and ability\nlane noun [C]\n(PATH)\nAdd to word list\nAdd to word list\none of two or more marked paths in a road to keep vehicles traveling in the same direction a safe distance apart: That section of Interstate 95 is a four-lane highway, with two northbound lanes and two southbound lanes.\nA lane in a running track or swimming pool is a narrow section marked to keep the competitors apart.\nlane noun [C]\n(ROAD)\na narrow road, esp. in the countryside or in a small town"}