{"id":208408,"name":"language","type":"noun","us_sound":"ˈlæŋ.ɡwɪdʒ","us_link":"../audio/l/language.mp3","uk_sound":"ˈlæŋ.ɡwɪdʒ","uk_link":"../audio/l/uklangu001.mp3","content":"Add to word list\nAdd to word list\nA1 [ U ] a system of communication consisting of sounds, words, and grammar: She does research into how children acquire language. This type of parent-child interaction is associated with language learning in infancy.\n[ C ] a system of communication used by people living in a particular country: Do you speak any foreign languages?\" I'm hopeless at learning languages. the English language Compare\ntongue (LANGUAGE) literary\ndialect\n[ C ] a system of symbols and rules for writing instructions for computers: Java and Perl are both important computer programming languages.\n[ U ] the way that someone speaks or writes, for example, the kind of words and phrases that they use: No one wants to hear foul language coming from the mouths of children. In interviews, he was fond of flowery language. He said some of the language appeared inflammatory and biased.\n[ U ] the special words and phrases used by people who do a particular type of work: legal/technical language the language of business\n[ U ] informal rude or offensive words: My mother wouldn't let us watch it because of the language. Less of that language, please!\nMore examplesFewer examplesShe's studying modern Japanese language and culture.Unable to speak a word of the language, he communicated with his hands.We were encouraged to learn foreign languages at school.Her novels have been translated into 19 languages.One of the main reasons I came to England was to study the language.\nSMART Vocabulary: related words and phrases\nLinguistic terms & linguistic style\naccentual\naffricate\nallophone\nallophony\nanaphor\ncontextualize\ndowntoner\neasy read\nemphatic\nentailment\netymological\nidiomatic\ninflected language\nparatactically\nparataxis\nphilological\nphilologically\nphilology\npolysemy\nstylistics\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer programming & software\nWays of speaking\nSwearing and blasphemy\nGrammar\nNationalities, languages, countries and regionsWhen we refer to a nation or region, we can use: …\nIdiom\nspeak/talk the same language\nAdd to word list\nAdd to word list\na system of communication by speaking, writing, or making signs in a way that can be understood, or any of the different systems of communication used in particular regions: [ C ] the English language [ C ] American Sign Language [ C ] He speaks six foreign languages. [ U ] Her language skills are excellent.\nLanguage is also a particular type of expression: [ U ] beautiful language [ U ] foul language (= offensive words)\nIn computer programming, a language is a system of writing instructions for computers.\nAdd to word list\nAdd to word list\nCOMMUNICATIONS the method of human communication that uses speaking and writing, or the system of communication in speaking and writing that is used by the people of a particular country: learn/understand a language It's easier to learn a language when you're younger.speak/use a language 35% of residents speak a language other than English at home. Many British people speak no foreign languages.in a language Business deals often go more smoothly if you can speak to people in their own language. Too many children leave school with poor language skills, unable to compose a letter or email. The company offers language classes for employees posted abroad.\nCOMMUNICATIONS a particular style of speaking or writing, for example, one that is used by the people doing a particular job: When you are giving instructions, make sure you use language that everyone can understand.the language of sth They speak the language of international finance.\nIT written instructions, for example, rules and symbols, given to a computer so it can understand what the user wants it to do: This version of the UNIX language serves as a software platform for computer programs.\nspeak/talk the same language\nto understand someone because you have the same way of thinking about things, or of doing things: Our businesses complement each other, and we speak the same language. See also\nassembly language\nbody language\ncomputer language\nmachine language\nobject language\nofficial language\nprogramming language\nworld language"}