{"id":208691,"name":"lapse","type":"noun","us_sound":"læps","us_link":"../audio/l/lapse.mp3","uk_sound":"læps","uk_link":"../audio/l/uklangu019.mp3","content":"lapse noun\n(FAILURE)\nAdd to word list\nAdd to word list\n[ C ] a temporary failure: a lapse of concentration The management's decision to ignore the safety warnings demonstrated a remarkable lapse of judgment. a memory lapse\nThesaurus: synonyms, antonyms, and examples\nthe fact of not doing something you shouldfailureFailure to follow the employee guidelines can lead to your immediate termination.defaultThe bank seized his house because his mortgage was in default.malpracticeThe surgeon was sued for malpractice.derelictionHe was dishonourably discharged for dereliction of duty.neglectCorruption and neglect resulted in a government that was weakened enough to be overthrown. negligenceEducational standards deteriorated thanks to the negligence of the administration.\nSee more results »\nSMART Vocabulary: related words and phrases\nFaults and mistakes\naberration\nAchilles heel\nadrift\nblack mark\nblemish\nerror\nfailing\nfalse move\nfaux pas\nflaw\nmalapropism\nmisfunction\nmisperception\nmisprint\nmisspelling\nmisstep\ntypo\nwardrobe malfunction\nweakness\nwhat price...? idiom\nSee more results »\nlapse noun\n(PERIOD)\n[ C usually singular ] a period of time passing between two things happening: a time lapse/a lapse of time He turned up again after a lapse of two years.\nSMART Vocabulary: related words and phrases\nPauses & interludes\nabeyance\nadjournment\nasynchronously\nbreak\nbreak-journey\ncaesura\ncomfort stop\nhiatus\nhold something in abeyance\nin abeyance\ninterlude\nintermission\ninterval\nnon-continuous\none-stop\npause\nplateau\npostponement\nrespite\nsuspension\nSee more results »\nto end legally or officially by not being continued or made effective for a longer period: The association needs to win back former members who have allowed their subscriptions to lapse.\nSMART Vocabulary: related words and phrases\nComing to an end\nclosure\ncloture\ncome off\ncome to a full stop idiom\ncome to a head idiom\nend\nfinish line\nfinish up\nfinishing line\nfizzle\nfizzle out\ngo out (of) the window idiom\nhead\nlet\nroad\nrun\nsunset\ntaper\ntaper off\nwind something up\nSee more results »\nPhrasal verb\nlapse into something\nlapse noun\n(FAILURE)\nAdd to word list\nAdd to word list\n[ C ] a failure to do something that happens as a particular event at a particular time: a memory lapse She had a momentary lapse in concentration and lost the game.\nlapse noun\n(PERIOD)\n[ U ] a period of time after an event or between two events: Owing to the lapse of time since the crimes, none of the original witnesses could be found.\nlapse verb [I]\n(END)\nto end something, either intentionally or accidentally, that might be continued or that should continue: I must have let my subscription lapse, because I haven’t received any issues of the magazine in months.\nPhrasal verb\nlapse into something\nAdd to word list\nAdd to word list\nif something such as an agreement lapses, it ends legally or officially because nothing has been done to make it continue, for example because payments are not made: The agreement ran for three years, after which they decided to allow it to lapse. Many uninsured drivers aren't even aware that their insurance has lapsed. Phrasal verb\nlapse into sth\n[ C ] a mistake that is made because of a temporary lack of attention to something: lapse in sth There had been a lapse in security at the company, and the personal details of hundreds of customers had been made public. a security lapse\n[ C, usually singular ] a period of time that passes between two things happening: The company will resume paying a quarterly dividend on common shares, following a two-year lapse. a time lapse"}