{"id":208786,"name":"large","type":"adjective","us_sound":"lɑːrdʒ","us_link":"../audio/l/large.mp3","uk_sound":"lɑːdʒ","uk_link":"../audio/l/uklangu028.mp3","content":"Add to word list\nAdd to word list\nA2 big in size or amount: a large house the world's largest computer manufacturer We need a larger car. We didn't expect such a large number of people to attend the concert. We've made good progress, but there's still a large amount of work to be done. There was a larger-than-expected fall in unemployment last month. Researchers have just completed the largest-ever survey of criminal behaviour in the UK The population faces starvation this winter without large-scale emergency food aid. Synonyms\nastronomical (LARGE) informal\nbig (LARGE)\ncolossal\nelephantine formal\nenormous\ngargantuan\ngiant\ngigantic\nginormous informal\ngreat (BIG)\nhefty\nhuge\nimmense\njumbo\nmahoosive UK informal\nmammoth\nmassive\nsizeable mainlyUK\nstupendous\ntremendous\nvast\nwalloping informal humorous\nwhopping informal\nThesaurus: synonyms, antonyms, and examples\nhaving a body that is bigger than averagelargeThey sell clothes for large men.bigHe is quite big for his age.well builtHe's muscular and well built.heavysetThe victim was a heavyset, bearded male in his 30s.thicksetMax is thickset and heavy, like a rugby player.burlyHe got out of the way for the burly biker.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\ngreater than the average size or amountbigThey live in a big house in the country.largeA large number of people were crowded into the room.greatThe party was a great success.enormousThey bought an enormous house in the suburbs.\nSee more results »\nMore examplesFewer examplesA large house like this must be expensive to heat.The Black Sea is a large inland sea.Has she had any experience of managing large projects?We had to cross a large area of arid, featureless desert.I come from a large family - I have three brothers and two sisters.\nSMART Vocabulary: related words and phrases\nBig and quite big\nappreciable\nbaronial\nbigly\nbloated\nboxcar\nbulky\nfullness\ngrandly\ngrowthy\nheaping\nhearty\nheftily\nhefty\npalatially\npumped\nrambling\nroomy\nroyal\nroyally\nthe bigger the better idiom\nSee more results »\nIdioms\nby and large\n(as) large as life\nlarger than life\nlarging it UK informal\nenjoying yourself very much by dancing and drinking alcohol: We were larging it at a club last night.\nSMART Vocabulary: related words and phrases\nPaying money\n2FA\n2SV\nante up (something)\nburn a hole in someone's pocket idiom\nchargeable\ncost-cutting\ndiscretionary\nfund\nlash out (something)\nreimburse\nrepay\nsettle an account idiom\nshell (something) out\nshortchange\nsink into something\nspend\nspend money like water idiom\nspent\nsplurge\nsponsor\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTaking pleasure in something\nAdd to word list\nAdd to word list\nof more than a typical or average size or amount: They have a large house in the suburbs. This apartment is much larger than our last one. It was the largest bug I had ever seen. This computer stores large amounts of data. I’d like a large soda. in large part (also in large measure)\nIf something is true in large part or in large measure, it is true to a great degree: The rebirth of interest in cycling in this country was, in large part, a result of Lance Armstrong's success.\nLarge (abbreviation L) is a size of clothing or other product that is bigger than average: The shirt is available in small, medium, and large (sizes). Idioms\nat large\nby and large\nlarger than life"}