{"id":209064,"name":"last","type":"adjective","us_sound":"læst","us_link":"../audio/l/last.mp3","uk_sound":"lɑːst","uk_link":"../audio/l/uklargi028.mp3","content":"Add to word list\nAdd to word list\nA2 (the person or thing) after everyone or everything else: [ + to infinitive ] I hate being the last one to arrive at a meeting. Our house is the last one on the left before the traffic lights. The Mets will surely finish the season in last place (= at the lowest rank of their division). I know Johnson finished last in the race, but who was second to last (= the one before the one at the end)? I don't know why he bothers to bet - his horses always come in last. At the last moment (= as late as possible) he changed his mind. He always leaves important decisions to the last (possible) moment (= as late as possible). at (long) last\nB1 finally: I've finished my essay at last!\nSee more the last person, thing, etc.\nB2 the least expected or wanted person or thing: Three extra people to feed - that's the last thing I need!\nSee more last thing (at night) mainly UK\nat the latest time in the day: I'll switch on the washing machine last thing so it'll be finished when I get up in the morning.\nSee more the last time\nIf you say that it is the last time you will do something, you mean that you will never do it again: He never even thanked me, so that's the last time I do him a favour.\nSee more\nMore examplesFewer examplesMy last class ends at four o'clock.The doctors made one last desperate attempt to save the boy's life.Ruth Ellis was the last woman to be hanged in Britain.He was the last person to see the woman alive, and suspicion immediately fell on him.I didn't manage to write down that last bit she said, about the meeting.\nSMART Vocabulary: related words and phrases\nFinal and finally\nantepenultimate\nas a last resort idiom\nat the end of the day idiom\nback end\nclosing\nconclusion\neventual\neventually\nfinal\nfinally\nhear/see the last of something idiom\nlast-ditch\nlastly\nlatest\nlatter\nnon-final\nthe last but one idiom\nthe last someone heard/saw of someone/something idiom\nultimate\nultimately\nSee more results »\nGrammar\nFinally, at last, lastly or in the end?Finally, at last, lastly and in the end all have a meaning of ‘after a period of time’. However, we use them in different ways. …\nIdioms\nhave the last laugh\nlast but not least\nthe last but one\nthe last someone heard/saw of someone/something\nthe last minute\nthe last word in something\nto the last\n(down) to the last ...\nto the last (man)\nB1 (being) the only one or part that is left: Do you mind if I have the last chocolate? I'm down to my last dollar - could I borrow some money for lunch? I'm afraid Martha's eaten the last of the ice cream. She was the last of the great educational reformers.\nMore examplesFewer examplesYou got the last ticket - damn you, I wanted that!Today's my last full day in Paris.Go steady on the milk, Dan - that's our last bottle.I finally surrendered to temptation, and ate the last remaining chocolate.That's the last time I'm going to look after her kids - I'll be glad when the little demons go home.\nSMART Vocabulary: related words and phrases\nFinal and finally\nantepenultimate\nas a last resort idiom\nat the end of the day idiom\nback end\nclosing\nconclusion\neventual\neventually\nfinal\nfinally\nhear/see the last of something idiom\nlast-ditch\nlastly\nlatest\nlatter\nnon-final\nthe last but one idiom\nthe last someone heard/saw of someone/something idiom\nultimate\nultimately\nSee more results »\nGrammar\nFinally, at last, lastly or in the end?Finally, at last, lastly and in the end all have a meaning of ‘after a period of time’. However, we use them in different ways. …\nIdioms\nas a last resort\nhear/see the last of something\non your last legs\non its last legs\nA1 (being) the most recent or the one before the present one: Did you hear the storm last night (= during the previous night)? Did you see the news on TV last night (= yesterday evening)? They got married last November. When was the last time you had a cigarette? When did you last have a cigarette? She's been working there for the last month (= for the four weeks until now).formal Could you account for your whereabouts on Sunday last? The/These last five years have been very difficult for him. The last we heard of her, she was working as an English teacher in France. Each of her paintings has been better than the last.\nMore examplesFewer examplesMost of the diseased trees were chopped down last year.Did you vote Conservative at the last election?Who was she dancing with at the party last night?In their last encounter with Italy, England won 3-2.\"Have you always lived here?\" \"As a matter of fact I've only lived here for the last three years\".\nSMART Vocabulary: related words and phrases\nIn the past\nago\nany more idiom\nanymore\nback in the day idiom\nback then idiom\nclock\ndim\ndot\nflood\nmemory\nmoon\nmore\nno longer idiom\nnon-current\nof late idiom\nsometime\nstep\nstep back (in time) idiom\nthe status quo ante\nuse\nSee more results »\nGrammar\nFinally, at last, lastly or in the end?Finally, at last, lastly and in the end all have a meaning of ‘after a period of time’. However, we use them in different ways. …\nIdiom\nthe week/month/year before last\nB1 to continue to exist: The meeting lasted two hours. The drought lasted for several months. They say the snow will last until the end of next week. I can't see the ceasefire lasting. They haven't had an argument for two weeks, but it's too good to last (= they'll have an argument soon). I doubt their enthusiasm will last. He's working very efficiently at the moment, but it won't last.\nC1 to continue being good or suitable: There's no point buying something that isn't going to last. The cheaper washing machines should last about five years. This pen should last (you) a lifetime if you take care of it. Her previous secretary only lasted a month (= left after this period).\nMore examplesFewer examplesThe exam lasted an hour and a half.The relationship was never going to work, but it was fun while it lasted.The election broadcast, a nine-hour marathon, lasts until seven o'clock in the morning.Apparently this good weather isn't going to last until the weekend.Who can predict how long this uneasy peace between the two countries will last?\nSMART Vocabulary: related words and phrases\nContinue & last\n(it's) business as usual idiom\nbash on\ncarry (something) on\ncease\ncont.\ncontd\ndrag\necho\nimmortally\nin the making idiom\ninsist on doing something\nisochronous\nleg\nprotraction\npush ahead\npush on\nrun on\nrun someone/something over\nspan\nspin\nSee more results »\nIdiom\nnot last longPhrasal verb\nlast out\nlast noun [U]\n(FINAL)\nAdd to word list\nAdd to word list\nthe person or thing after everyone or everything else: Heather was the last to go to bed and the first to get up.\nlast noun [U]\n(NO MORE)\nthe only one or part that is left: Mark ate the last of the ice cream.\nlast noun [U]\n(MOST RECENT)\nthe most recent, or the one before the present one: We had lunch together the week/month before last (= two weeks/months ago). The last we heard, she was teaching English overseas. Each of her novels seems better than the last.\nIdioms\nhave the last laugh\nlast but not least\nlast resort\non its last legs\nthe last minute\nthe last word in something\nlast adjective [not gradable]\n(NOT DESIRABLE)\nbeing the least desirable or least likely: Traveling across the country with two small children is the last thing I want to do.\nlast verb\n(CONTINUE)\nto continue for a period of time, or to continue to exist: [ I ] The tour lasts about an hour. [ I ] She’s into soccer at the moment, but it won’t last.\nTo last is also to continue in a situation although it is difficult: [ L ] Her previous secretary only lasted a month.\nTo last is also to continue to work well or stay in good condition: [ I ] I’d rather pay a little more and buy clothing that’s going to last.\nlast adjective, adverb [not gradable]\n(FINAL)\n(coming) after everyone or everything else: In math tests, American students came in last (= ranked the lowest). He was last in line for tickets. Our house is the last one on the left. Despite recent wins, the team is still in last place (= lowest in rank among it competitors).\nlast adjective, adverb [not gradable]\n(MOST RECENT)\nmost recent, or most recently: last night/week/month/year last spring/summer/fall/winter These last five years have been very difficult for him. Kristal said in her last letter that she might come to visit. When was the last time you went to the movies? We last saw Grandma in 1994.\nlast adverb [not gradable]\n(FINAL)\n(in ending a set of items or a series of thoughts) finally: The men begin the dance, then the women enter, and last, the children join in."}