{"id":209189,"name":"latest","type":"adjective","us_sound":"ˈleɪ.t̬ɪst","us_link":"../audio/l/latest.mp3","uk_sound":"ˈleɪ.tɪst","uk_link":"../audio/l/uklat__012.mp3","content":"Add to word list\nAdd to word list\nA2 newest or most recent or modern: Have you seen her latest movie? the latest fashions Compare\nlast adjective adverb pronoun noun\nThesaurus: synonyms, antonyms, and examples\nfashionablefashionableShe's so fashionable.in fashionTighter trousers for men are back in fashion.inShort jackets are in this season.coolHe was wearing a pair of cool sunglasses.hipWe went to the hip new club in town.trendyHe likes trendy clothes and modern furniture.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nmodernmodernThe building was made using modern construction techniques.up to dateThe hospital has some of the most up-to-date equipment in the country.latestShe always wears the latest fashions.cutting-edgeComputers have brought cutting-edge technology into the classroom.high-techDivers with high-tech equipment discovered the wreck of the ship.\nSee more results »\nMore examplesFewer examplesCharity organizations have chastised the government for not doing enough to prevent the latest famine in Africa.This latest statement from the White House clashes with important aspects of US foreign policy.His latest film is described as a 'romantic comedy'.We enclose a copy of our latest brochure, with our compliments.He's always crowing about his latest triumph.\nSMART Vocabulary: related words and phrases\nNew\nafresh\nbe ahead of the curve idiom\nbox-fresh\nbrand new\nink\ninnovative\ninnovatively\nlatter-day\nnewborn\nnext-gen\nnext-generation\nnovel\nnovelty\noriginal\noriginality\nthe avant-garde\nthe ink is not dry/still wet idiom\nunprecedented\nup-to-the-minute idiom\nyouth\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nModern & fashionable\nthe latest\nthe most recent news or technical development: Have you heard the latest (= the most recent news) about Jilly and Patrick - they're getting a divorce. This machine is the latest in LED technology. at the (very) latest\nC2 used to emphasize that something must happen or be done before a stated time or day: I have to get this finished by Friday at the latest. A decision is expected by the end of May at the latest. Building work should start by early July at the latest. I really must leave by ten to four at the very latest. Prizes have to be claimed by 30th June at the very latest.\nSMART Vocabulary: related words and phrases\nNew\nafresh\nbe ahead of the curve idiom\nbox-fresh\nbrand new\nink\ninnovative\ninnovatively\nlatter-day\nnewborn\nnext-gen\nnext-generation\nnovel\nnovelty\noriginal\noriginality\nthe avant-garde\nthe ink is not dry/still wet idiom\nunprecedented\nup-to-the-minute idiom\nyouth\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFinal and finally\nLate\nAdd to word list\nAdd to word list\nnewest, most recent, or most modern: Did you see her latest movie?\nthe most recent news: Have you heard the latest about Celine and Michael?"}