{"id":209103,"name":"late","type":"adjective","us_sound":"leɪt","us_link":"../audio/l/late.mp3","uk_sound":"leɪt","uk_link":"../audio/l/uklat__004.mp3","content":"late adjective, adverb\n(NEAR THE END)\nAdd to word list\nAdd to word list\nA1 (happening or being) near the end of a period of time: It was late at night. We talked late into the night. Is that the time? I'd no idea it was so late. It was late summer when it happened. It was built in the late 19th century. He's probably in his late twenties. As late (= as recently) as the 1980s they were still using horses on this farm.\nMore examplesFewer examplesFrom the late 19th century, European powers began to gain control of parts of the Ottoman Empire.House music first appeared in the late 1980s.Nowadays many women are in their late thirties when they have their first child.As it was getting late, I decided to book into a hotel.Newcastle seemed to be heading for disaster until a late goal saved the day.\nSMART Vocabulary: related words and phrases\nLate\nbe/come/arrive late to the party idiom\nbehindhand\nbelated\ndelayed\ndoor\neleventh\nlast\nlate adopter\nlate developer\nlate in the day idiom\nnick\nnot a moment too soon idiom\noverdue\nowl\nshut/close the stable/barn door after the horse has bolted idiom\nthe last minute idiom\nunpunctual\nunpunctuality\nuntil all hours idiom\nwire\nSee more results »\nlate adjective, adverb\n(AFTER EXPECTED TIME)\nA1 (happening or arriving) after the planned, expected, usual, or necessary time: This train is always late. You'll be late for your flight if you don't hurry up. Sorry I'm late. I was held up in the traffic. It's too late to start complaining now. We always have a late breakfast on Sunday mornings. Some late news (= news of something that happened after the news programme started) has just come in - a bomb has exploded in central London. Our ferry was two hours late because of the strike. Kathryn's just phoned to say she's working late this evening. See also\nlatecomer\nMore examplesFewer examplesThe bridegroom was late for the ceremony.Is it too late to enrol at the college?We've fallen into the habit of getting up late on Saturday mornings.Due to a slight technical hitch the concert will be starting approximately half an hour late.I missed the start of the exam because my bus was late.\nSMART Vocabulary: related words and phrases\nLate\nbe/come/arrive late to the party idiom\nbehindhand\nbelated\ndelayed\ndoor\neleventh\nlast\nlate adopter\nlate developer\nlate in the day idiom\nnick\nnot a moment too soon idiom\noverdue\nowl\nshut/close the stable/barn door after the horse has bolted idiom\nthe last minute idiom\nunpunctual\nunpunctuality\nuntil all hours idiom\nwire\nSee more results »\nlate adjective, adverb\n(SPORTS)\nin football, if a tackle is late, it is made after the ball has been moved by another player and the player, not the ball, is kicked: He was booked for a late challenge in the first minute.\nSMART Vocabulary: related words and phrases\nGeneral terms used in ball sports\naggregate score\nassist\nback pass\nbackspin\nballplayer\ndump\nkicker\nlay someone off\nlayoff\nlong ball\npace\npassing\npitch\nstroke\nthe long ball game idiom\nundefended\nunderhand\nunderspin\nunhittable\nuppish\nSee more results »\nRelated word\nlatenessGrammar\nLate or lately?Late is both an adverb and an adjective; it means the opposite of early. Lately is also an adverb; it means ‘recently’. …\nLate meaning ‘not on time’Late as an adverb means ‘not on time’: …\nLately meaning ‘recently’We use lately for states or for repeated events, mostly with the present perfect: …\nIdioms\nbe/come/arrive late to the party\nlate in the day\nof late\ntoo little, too late\nC2 used to refer to someone who has died: She gave her late husband's clothes to charity.\nMore examplesFewer examplesShe is the wife of the late Ernest Jones.It belonged to my late father.She is the daughter of the Mr James Field and the late Mrs Daphne Field.My late mother was an opera singer.I knew his late brother.\nSMART Vocabulary: related words and phrases\nDeath and dying\nbereave\nbite\nbleed out\nbuy the farm idiom\ncadaveric\ndeath toll\ndepart this life idiom\nfatality\nghost\nmacabre\npredecease\nraise\nremains\nsnuff\nstarvation\nsuicidally\nterminally\nthose whom the gods love die young idiom\ntoll\nwatery\nSee more results »\nGrammar\nLate or lately?Late is both an adverb and an adjective; it means the opposite of early. Lately is also an adverb; it means ‘recently’. …\nLate meaning ‘not on time’Late as an adverb means ‘not on time’: …\nLately meaning ‘recently’We use lately for states or for repeated events, mostly with the present perfect: …\nlate adjective, adverb [-er/-est only]\n(NEAR THE END)\nAdd to word list\nAdd to word list\n(happening or being) near the end of a period or in the recent past: I expect him home late this afternoon. I’d better get going – I had no idea it was so late! [ + to infinitive ] It’s too late to call now. I think Jody’s in her late twenties. He is a celebrated painter of the late 19th century.\nlate adjective, adverb [-er/-est only]\n(AFTER)\n(happening or arriving) after the planned, expected, usual, or necessary time: Sorry I’m late – I was caught in traffic. You’ll be later than you already are if you don’t hurry up. This is the latest she’s ever worked. Summer came late this year (= The weather became warm after the usual time). It’s too late to do anything about it now. lateness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈleɪt·nəs/\nMy boss doesn’t tolerate lateness.\nlate adjective [not gradable]\n(DEAD)\nno longer alive, esp. having recently died: She gave her late husband’s clothes to charity."}