{"id":209120,"name":"latency","type":"noun","us_sound":"ˈleɪ.tən.si","us_link":"../audio/l/uslasci014.mp3","uk_sound":"ˈleɪ.tən.si","uk_link":"../audio/l/uklat__007.mp3","content":"latency noun [U]\n(NOT YET ACTIVE)\nAdd to word list\nAdd to word list\nthe fact of being present but needing particular conditions to become active, obvious, or completely developed: The latency period for the cancer is 15 years. They measured the latency of the brain's response to a stimulus. See\nlatent\nMore examplesFewer examplesThere is a long latency period between the formation of gallstones and the onset of symptoms. The prolonged latency of epidural analgesia may be unacceptable in some cases.\nSMART Vocabulary: related words and phrases\nPotential\naccident\nan accident waiting to happen idiom\nauspicious\nauspiciously\nbe an actor, cook, etc. in the making idiom\nfertile\nmaking\nnot be beyond the wit of man/someone idiom\npotential\npotentiality\npotentially\npromise\nprospect\nrealizable\nretrievable\nroom\nroom for improvement idiom\nsleeper\nuntapped\nwit\nSee more results »\nlatency noun [U]\n(COMPUTING)\ncomputing\n&#160; specialized the delay between an instruction to transfer (= move) computer information and the information being transferred, for example over the internet: If there is high latency, messages can take minutes or longer to be delivered. We found it impossible to hold choir rehearsals online because of problems with latency.\nMore examplesFewer examplesThe advantage of this technique is that the client and server can communicate with minimal latency.High latency is acceptable in applications that do not require real time response.So the latency between posting an updated version and client detection of that change can be open-ended.Access latency refers to how fast data can be brought from memory to the cache.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\nmeg\noptical\nprotocol\nsimulation\ntethering\ntexturing\nthreading\ntick box\ntimesharing\nSee more results »"}