{"id":209278,"name":"latinized","type":"adjective","us_sound":"ˈlæt̬.ɪn.aɪzd","us_link":"","uk_sound":"ˈlæt.ɪ.naɪzd","uk_link":"","content":"Latinized adjective\n(ANCIENT LATIN)\nAdd to word list\nAdd to word list\n(of a word) made more similar to Latin, the language used by ancient Romans and as a language of educated people in many European countries in the past: The scientific name of the snowy owl is Nyctea scandiaca, \"scandiaca\" being a Latinized word referring to Scandinavia. Many borrowed French words originated in Latin, and some became Latinised in their spelling when they entered English.\n(of a language or words) written in the Roman alphabet, the alphabet used for writing most western European languages including English: Like Hebrew, Arabic reads from right to left, and its graceful script bears no resemblance to the Latinized lettering of the Western world. There was a proposal for the language to become fully Latinised, but this was reversed, leaving Cyrillic the only official script.\nmade more similar to or typical of ancient Roman or Latin styles, customs, beliefs, etc.: It is believed that the Etruscans becane gradually more Latinized under Roman rule.\nMore examplesFewer examplesBotanical nomenclature includes words from various languages, generally Latinised, but not Latin.Georg Eberhard Rumpf is now known by the Latinized name Rumphius.The word Jehovah is formed from the Latinized consonants of the Hebrew word YHWH. Abū Alī Sīnā or Ibn Sīnā is most commonly known in English by his Latinised name Avicenna.In adopting Greek mythology the Romans transferred to it the names of their own divinities, or gave the Greek names a Latinised form.Quoc ngu was the Latinized script which Western missionaries developed for writing the Vietnamese vernacular.\nSMART Vocabulary: related words and phrases\nUsing other languages\nAnglocentric\nAnglocentrism\nbilingual education\nbilingualism\nbilinguality\nmistranslation\nmonolingual\nmother tongue\nmultilingually\nnatively\nnon-native\nnon-native speaker\npolyglot\nrender\nrendering\nspoken\ntarget language\ntranslator\ntransliterate\ntrilingual\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLettering & alphabets\nAncient history: before 500 AD\nArchitecture\nChristian denominations\nLatinized adjective\n(LATIN AMERICA)\ninfluenced by the cultures and languages of Latin America, the areas of North, South, and Central America where Spanish or Portuguese is spoken, for example because of having a large number of people originally from those areas: It is the most Latinized city in the county, with Hispanics making up 30 per cent of its residents.\ninfluenced by or similar to styles of music originally from Latin America: Their music is a punchy combination of Latinized rock, jazz and funk. He did a Latinised cover of \"Every Day I Have The Blues\".\nSMART Vocabulary: related words and phrases\nTypes of music\nAfrobeat\nAfrobeats\nambient music\nanthemic\natonal\ndownbeat\ndrum and bass\ndubstep\nearly music\neasy listening\ninstrumentally\njazz\nKrautrock\nLatinization\nLatinize\nsymphonic\nsymphonically\ntechno\ntonal\ntorchy\nSee more results »"}