{"id":209417,"name":"laughed","type":"verb","us_sound":"læf","us_link":"../audio/l/laugh.mp3","uk_sound":"lɑːf","uk_link":"../audio/l/uklatvi006.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nlaugh\nA2 to smile while making sounds with your voice that show you think something is funny or you are happy: They laughed at her jokes. I couldn't stop laughing. I said he'd have to give a talk and he laughed nervously. She's so funny - she really makes me laugh. It's very rare that a book is so good you actually laugh out loud. It was so funny, I burst out laughing (= laughed suddenly and loudly). I laughed till I cried.\nThesaurus: synonyms, antonyms, and examples\nto laughlaughThe children were laughing at the cartoons.chuckleShe was chuckling as she read the letter.giggleThe girls were giggling at the back of the classroom.sniggerThey sniggered at what she was wearing.snickerUS Stop snickering at that rude joke and get back to your classwork.chortleShe chortled with glee at the news.\nSee more results »\nMore examplesFewer examplesPlease don't laugh - I'm being serious.I could see Emma trying not to laugh and of course that started me off.They joked and laughed as they looked at the photos.The audience was still laughing as the curtain fell.When he laughs he sounds like a horse neighing.\nSMART Vocabulary: related words and phrases\nLaughing and smiling\na gleam in your eye idiom\namused\nbe all smiles idiom\nbe in convulsions idiom\nbe rolling in the aisles idiom\nbe wreathed in smiles idiom\nburst\ncheesy\ncrease\ndissolve\ngiggle\ngiggler\ngigglingly\ngiggly\nnot know whether to laugh or cry idiom\npiss yourself (laughing) idiom\nquake\nrictus\nsay cheese idiom\nsimper\nSee more results »\nIdioms\nbe laughed out of court\nbe laughing\nbe laughing all the way to the bank\nbe laughing on the other side of your face\nbe no laughing matter\ndon't make me laugh!\nhe who laughs last, laughs longest/best\nlaugh your head off\nlaugh in someone's face\nlaugh like a drain\nMore idioms\nlaugh up your sleeve\nyou've got to laugh\nPhrasal verbs\nlaugh at someone/something\nlaugh something off"}