{"id":209412,"name":"laugh","type":"verb","us_sound":"læf","us_link":"../audio/l/laugh.mp3","uk_sound":"lɑːf","uk_link":"../audio/l/uklatvi006.mp3","content":"Add to word list\nAdd to word list\nA2 to smile while making sounds with your voice that show you think something is funny or you are happy: laugh at They laughed at her jokes. I couldn't stop laughing. I said he'd have to give a talk and he laughed nervously.make someone laugh She's so funny - she really makes me laugh.laugh out loud It's very rare that a book is so good you actually laugh out loud.burst out laughing It was so funny, I burst out laughing (= laughed suddenly and loudly). I laughed till I cried.\nThesaurus: synonyms, antonyms, and examples\nto laughlaughThe children were laughing at the cartoons.chuckleShe was chuckling as she read the letter.giggleThe girls were giggling at the back of the classroom.sniggerThey sniggered at what she was wearing.snickerUS Stop snickering at that rude joke and get back to your classwork.chortleShe chortled with glee at the news.\nSee more results »\nMore examplesFewer examplesPlease don't laugh - I'm being serious.I could see Emma trying not to laugh and of course that started me off.They joked and laughed as they looked at the photos.The audience was still laughing as the curtain fell.When he laughs he sounds like a horse neighing.\nSMART Vocabulary: related words and phrases\nLaughing and smiling\na gleam in your eye idiom\namused\nbe all smiles idiom\nbe in convulsions idiom\nbe rolling in the aisles idiom\nbe wreathed in smiles idiom\nburst\ncheesy\ncrease\ndissolve\ngiggle\ngiggler\ngigglingly\ngiggly\nnot know whether to laugh or cry idiom\npiss yourself (laughing) idiom\nquake\nrictus\nsay cheese idiom\nsimper\nSee more results »\nIdioms\nbe laughed out of court\nbe laughing\nbe laughing all the way to the bank\nbe laughing on the other side of your face\nbe no laughing matter\ndon't make me laugh!\nhe who laughs last, laughs longest/best\nlaugh your head off\nlaugh in someone's face\nlaugh like a drain\nMore idioms\nlaugh up your sleeve\nyou've got to laugh\nPhrasal verbs\nlaugh at someone/something\nlaugh something off\nB1 the act or sound of laughing: a loud/nervous laughhave a good laugh I was embarrassed at the time, but I had a good laugh about it later.\ninformal an enjoyable or funny activity: \"How was the party?\" \"Oh, it was a laugh.\"\nThesaurus: synonyms, antonyms, and examples\ncausing laughterfunnyShe told me a funny story about Max.amusingI gave her an article that I thought she would find amusing.humorousShe wrote a humorous account of her teenage years.hilariousIt's the most hilarious comedy on television.hystericalI've just read his autobiography - it's absolutely hysterical.\nSee more results »\nmainly UK informal someone who is funny: a good laugh You'd like Sharon - she's a good laugh.\nThesaurus: synonyms, antonyms, and examples\ncausing laughterfunnyShe told me a funny story about Max.amusingI gave her an article that I thought she would find amusing.humorousShe wrote a humorous account of her teenage years.hilariousIt's the most hilarious comedy on television.hystericalI've just read his autobiography - it's absolutely hysterical.\nSee more results »\nMore examplesFewer examplesShe reacted to his compliments with a deprecating laugh.He's got a really annoying laugh.The announcement raised a laugh.He turned away with a rueful laugh.She gave a loud uninhibited laugh.\nSMART Vocabulary: related words and phrases\nLaughing and smiling\na gleam in your eye idiom\namused\nbe all smiles idiom\nbe in convulsions idiom\nbe rolling in the aisles idiom\nbe wreathed in smiles idiom\nburst\ncheesy\ncrease\ndissolve\ngiggle\ngiggler\ngigglingly\ngiggly\nnot know whether to laugh or cry idiom\npiss yourself (laughing) idiom\nquake\nrictus\nsay cheese idiom\nsimper\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral words for fun\nHumour & humorous\nIdioms\nfor a laugh\nyou're having a laugh\na laugh a minute\nAdd to word list\nAdd to word list\nto make the sounds and movements of the face and body that express happiness or amusement, or that sometimes express ridicule or anxiety: The audience just laughed and laughed. That guy always makes me laugh. When I made a face at Drew, he laughed out loud. We were laughing at the clown.\nSometimes when you laugh at someone, you are ridiculing that person: I don’t want to be laughed at by my classmates. Phrasal verb\nlaugh off something\nthe sounds and movements of the face and body that express happiness or amusement, or that sometimes express ridicule or anxiety: Holly has a very strange laugh – it sounds like she’s screaming.\ninfml A laugh is also an amusing or ridiculous situation or person: You should have seen Sean trying to stay on the skateboard – what a laugh!"}