{"id":209443,"name":"launch","type":"noun","us_sound":"lɑːntʃ","us_link":"../audio/l/launch.mp3","uk_sound":"lɔːntʃ","uk_link":"../audio/l/uklatvi010.mp3","content":"launch noun [C]\n(EVENT)\nAdd to word list\nAdd to word list\nC1 an event to celebrate or introduce something new: How much champagne will we need for the launch? Illness prevented her from attending the launch party for her latest novel.\nMore examplesFewer examplesThe system has been plagued with glitches ever since its launch.The car has enjoyed modest success since its launch, but the Mark 2 version is expected to be far more popular.Our marketing people have come up with a great idea for the launch of the new model.The normally publicity-shy director will be making several public appearances for the launch of the movie.She wore a Dior gown for the launch.\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ncustomer relationship management\ndetoxify\ndifferentiator\ndogfooding\nflyer\no.n.o.\noff-brand\non-brand\noverexpose\noverexposure\ntie (something) in\ntout\nunadvertised\nunbilled\nunbranded\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCelebrations, parties & special occasions\nlaunch noun [C]\n(LEAVE LAND)\nC1 an occasion when a ship is put into water, or a spacecraft is sent into space, for the first time: The launch of the space shuttle was delayed for 24 hours because of bad weather.\nSMART Vocabulary: related words and phrases\nSpace travel\naerospace\nastronautics\nautopilot\nbiosatellite\nblast\ncapsule\ncosmonaut\nearthbound\nescape velocity\nEVA\nflyby\nlauncher\nrocket scientist\nshuttle\nspace capsule\nspace probe\nspace shuttle\nspace tourism\nspace tourist\nspaceman\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArriving & departing by boat or ship\nlaunch noun [C]\n(BOAT)\na boat that has an engine and carries passengers for short distances, especially on a lake or a river, or from the land to a larger boat\nSMART Vocabulary: related words and phrases\nBoats & sailing craft\namphibious\nbuoy\ncabin cruiser\ncanoe\ncoracle\ncutter\ndhow\ndragon boat\ndredger\ndugout\nflatboat\ninflatable\nkayak\nketch\npunt\nrubber dinghy\nsloop\ntall ship\nwater taxi\nyacht\nSee more results »\nlaunch verb\n(BEGIN)\nB2 [ I or T ] to begin something such as a plan or introduce something new such as a product: The programme was launched a year ago. The airline will launch its new transatlantic service next month. A devastating attack was launched on the rebel stronghold. [ + adv/prep ] UK After working for the company for several years she decided to launch out on her own and set up in business.\nThesaurus: synonyms, antonyms, and examples\nto create and operate a business, organization, etc.startI always wanted to start my own business.start (something) up It is more attractive to start up a new enterprise than to invest in existing firms.set something upWe plan on setting up a new manufacturing company at the beginning of next fiscal year.set up shopAfter retiring, he set up shop repairing classic cars.hang (out) a/your shingleUS Once she graduates from medical school, she plans on hanging out a shingle as a family doctor in private practice.\nSee more results »\nMore examplesFewer examplesThere are plans afoot to launch a new radio station.The Glasgow-based company is to launch a stock-market flotation this summer.The company is poised to launch its new advertising campaign.The government is planning to launch a benchmarking scheme to guide consumers.They're about to launch a campaign to unionize workers at all major discount supermarkets in the area.\nSMART Vocabulary: related words and phrases\nInventing, designing and innovation\nabsorptive capacity\narchitect\nartificer\nbionics\nblueprint\ndesign\ndesigner\ndevise\ndream something up\nergonomic\nlead time\nmodularization\nnanotechnology\nnon-imitative\noperational research\nthemed\nthink outside the box idiom\nthink something up\ntrailblaze\nwhole cloth\nSee more results »\nlaunch verb\n(SEND)\nC1 [ T ] to send something out, such as a new ship into the water or a spacecraft into space: A spokesman for the dockyard said they hoped to launch the first submarine within two years. to launch a missile launch yourself mainly UK\nto jump with great force: The defender launched himself at the attacking player, bringing him to the ground.\nThesaurus: synonyms, antonyms, and examples\nto jumpjumpThe kids jumped up and down when they heard we were going to Disneyland.leapThe deer leaped out of the forest.boundHe bounded on stage, punching the air with both fists.launch yourselfShe rocked back and forth on her skis before launching herself down the slope.bounceThe kids were bouncing happily on the trampoline.hopI stubbed my toe and hopped to the kitchen to get some ice.\nSee more results »\nMore examplesFewer examplesA spokesman for the dockyard said they hoped to launch the first submarine within two years.On that type of aircraft carrier, a catapult was used to help launch aircraft.The boats were launched in high seas.When is the rocket due to be launched?They plan to launch the rocket next year.\nSMART Vocabulary: related words and phrases\nSpace travel\naerospace\nastronautics\nautopilot\nbiosatellite\nblast\ncapsule\ncosmonaut\nearthbound\nescape velocity\nEVA\nflyby\nlauncher\nrocket scientist\nshuttle\nspace capsule\nspace probe\nspace shuttle\nspace tourism\nspace tourist\nspaceman\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArriving & departing by boat or ship\nJumping\nPhrasal verb\nlaunch into something\nlaunch verb\n(SEND)\nAdd to word list\nAdd to word list\n[ T ] to send something out, esp. a vehicle into space or a ship onto water: On the last shuttle mission, the crew launched a communications satellite.\nlaunch verb\n(BEGIN)\n[ I/T ] to begin, or to introduce a new plan or product: [ T ] We’re planning to launch a new Internet services company next month. [ I always + adv/prep ] He launched into a verbal attack on her handling of the finances.\nlaunch noun\n(BOAT)\n[ C ] a large, open or partly enclosed motor boat\nlaunch noun\n(BEGINNING)\n[ C usually sing ] an introduction of a new plan or product: Frank went to the launch of Hibichu’s new flat-screen TV.\nlaunch noun\n(SEND)\n[ C ] an act of sending something out, esp. a vehicle into space or a ship onto water: The launch of the space shuttle was delayed by bad weather.\nAdd to word list\nAdd to word list\nMARKETING the introduction of a new product or service for sale to the public: Since its launch, the game console has sold 6.7 million units around the world.brand/product launch The secret to a successful brand launch is planning.launch date/event/party The company has not finalized the exact pricing structure or set a launch date.delay/postpone a launch Bugs in the operating system delayed its launch six months.attend/celebrate/mark a launch The event was held to mark the launch of a new online service. announce/oversee/plan a launch imminent/planned/successful launch commercial/formal/official launch\nthe beginning of something new, such as a plan, business, or job: campaign/career launch It's a fresh start for the lead singer and a career launch for the artists involved.\nto begin something new such as a plan or business: launch a bid/company He has not ruled out launching a takeover bid for the company.launch an inquiry/investigation When an investigation was launched into the deal, two cofounders resigned.launch an assault/attack/offensive The administration launched an attack on organized software piracy.launch a campaign/initiative/scheme We launched a campaign to fight world hunger. launch a site/website\nMARKETING to introduce a new product or service for sale: The manufacturer has launched a new car, which will go on sale this spring.launch a product/range The jeweller is about to launch a range at a well-known department store.\nto start a new job, to start work in a new industry, or to start a new part of your work life: Michael launched his career as a software salesman.launch sb/yourself as sth She launched herself as a designer of high-end handbags."}