{"id":209460,"name":"launderer","type":"noun","us_sound":"ˈlɑːn.dɚ.ɚ","us_link":"../audio/l/cdo0622uslaun0814.mp3","uk_sound":"ˈlɔːn.dər.ər","uk_link":"../audio/l/cdo0622uklaun0880.mp3","content":"launderer noun [C]\n(MONEY)\nAdd to word list\nAdd to word list\nsomeone who moves money that has been obtained illegally through banks and other businesses to make it seem to have been obtained legally: Launderers often export the money to countries with relaxed banking regulations. In the \"loan-back\" scheme, the launderer essentially borrows money from himself. Synonym\nmoney launderer\nMore examplesFewer examplesLaunderers have smuggled cash into offshore countries in everything from coffins to wooden legs.In the film, he plays a launderer of dirty money.Among the favourite targets of launderers are antique dealers, car traders, auction houses, and Rolex watches.\nSMART Vocabulary: related words and phrases\nMiscellaneous criminals\narsonist\nartifice burglar\nbigamist\nbioterrorist\nblack hat\ndistraction burglar\ndistraction thief\ndrug dealer\nembezzler\nexpropriator\nknock-knock burglar\nlooter\nlowlife\nlynch mob\nman of straw\nscofflaw\nshicer\nshoplifter\nsmall-timer\nsmuggler\nSee more results »\nlaunderer noun [C]\n(CLOTHES)\na person or company whose job is washing, drying, and ironing clothes, sheets, etc.: Brother Andrew also performed the duties of launderer, nurse, and barber. Down the street there is a launderer, a hair salon, a restaurant, and a bakery.\nMore examplesFewer examplesSome labourers remained to work as cooks and launderers in mining camps.On Tenth Avenue West, the launderers dumped the contents of their tubs into the street and lanes.The town had three blacksmiths, three store clerks, and three launderers.\nSMART Vocabulary: related words and phrases\nCleaning clothes\nairer\nboil\ncare label\ncleaner\nclothes brush\nclothes horse\ndelouse\nfront-loader\nhandwash\niron box\nironing\nironing board\nspin-dry\nspin-dryer\nstarch\nsteam iron\ntrouser press\ntumble dryer\nwashing\nwashing machine\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShops & auctions"}