{"id":209445,"name":"launched","type":"verb","us_sound":"lɑːntʃ","us_link":"../audio/l/launch.mp3","uk_sound":"lɔːntʃ","uk_link":"../audio/l/uklatvi010.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nlaunch\nlaunch verb\n(BEGIN)\nB2 [ I or T ] to begin something such as a plan or introduce something new such as a product: The programme was launched a year ago. The airline will launch its new transatlantic service next month. A devastating attack was launched on the rebel stronghold. [ + adv/prep ] UK After working for the company for several years she decided to launch out on her own and set up in business.\nMore examplesFewer examplesThere are plans afoot to launch a new radio station.The Glasgow-based company is to launch a stock-market flotation this summer.The company is poised to launch its new advertising campaign.The government is planning to launch a benchmarking scheme to guide consumers.They're about to launch a campaign to unionize workers at all major discount supermarkets in the area.\nSMART Vocabulary: related words and phrases\nInventing, designing and innovation\nabsorptive capacity\narchitect\nartificer\nbionics\nblueprint\ndesign\ndesigner\ndevise\ndream something up\nergonomic\nlead time\nmodularization\nnanotechnology\nnon-imitative\noperational research\nthemed\nthink outside the box idiom\nthink something up\ntrailblaze\nwhole cloth\nSee more results »\nlaunch verb\n(SEND)\nC1 [ T ] to send something out, such as a new ship into the water or a spacecraft into space: A spokesman for the dockyard said they hoped to launch the first submarine within two years. to launch a missile launch yourself mainly UK\nto jump with great force: The defender launched himself at the attacking player, bringing him to the ground.\nMore examplesFewer examplesA spokesman for the dockyard said they hoped to launch the first submarine within two years.On that type of aircraft carrier, a catapult was used to help launch aircraft.The boats were launched in high seas.When is the rocket due to be launched?They plan to launch the rocket next year.\nSMART Vocabulary: related words and phrases\nSpace travel\naerospace\nastronautics\nautopilot\nbiosatellite\nblast\ncapsule\ncosmonaut\nearthbound\nescape velocity\nEVA\nflyby\nlauncher\nrocket scientist\nshuttle\nspace capsule\nspace probe\nspace shuttle\nspace tourism\nspace tourist\nspaceman\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArriving & departing by boat or ship\nJumping\nPhrasal verb\nlaunch into something"}