{"id":209622,"name":"law","type":"noun","us_sound":"lɑː","us_link":"../audio/l/law.mp3","uk_sound":"lɔː","uk_link":"../audio/l/uklatvi026.mp3","content":"law noun\n(RULE)\nAdd to word list\nAdd to word list\nB1 [ C ] a rule, usually made by a government, that is used to order the way in which a society behaves: There are laws against drinking in the street. The laws governing the possession of firearms are being reviewed. They led the fight to impose laws on smoking. [ + -ing verb or + to infinitive ] Many doctors backed plans for a law banning/to ban all tobacco advertising. See also\nbylaw\nlawsuit\nlawyer\nB2 [ U ] (often the law) the system of rules of a particular country, group, or area of activity: What does the law say about having alcohol in the blood while driving? Of course robbery is against the law! The judge ruled that the directors had knowingly broken the law. You can't take that course of action and remain within the law. They have to provide a contract by law. It was a detailed study of international human rights law.\nB2 [ U ] the area of knowledge or work that involves studying or working with the law : She's going to study law at university. a law firm in New York\n[ S ] informal the police: The law was/were out in force at the demonstration. go to law UK\nWhen someone goes to law about something, they ask a court to make a legal judgment about it: These people were known to be very quick to go to law.\nSee more\nMore examplesFewer examplesMany motorcyclists flout the law by not wearing helmets.The law forbids the sale of cigarettes to people under the age of 16.We're campaigning for a repeal of the abortion laws.The police want tougher laws for dealing with drug traffickers.The new law will outlaw smoking in public places.\nSMART Vocabulary: related words and phrases\nRules & laws\nadministrative\nadmiralty\nanti-bribery\nanti-regulatory\nanti-sodomy\nbinding\nblue law\ncivil law\nhumanitarian law\ninvocation\njuridical\njuridically\njuristic\nland tenure\nlegislation\nprovision\nRafferty's rules\nthe rule of law\nuncanonical\nunenforceable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSubjects & disciplines\nThe police generally\nlaw noun\n(PRINCIPLE)\nC2 [ C ] a general rule that states what always happens when the same conditions exist: Newton's laws of motion the laws of nature/physicshumorous The first law of (= the most important principle in) politics is - if you're going to lie, don't get found out! See also\nMurphy's law humorous\nParkinson's law humorous\nSMART Vocabulary: related words and phrases\nPhilosophy\naesthete\naesthetic\naesthetically\nanthropocentric\nanthropocentrism\nessentialism\nexistential\nexistentialism\nexistentialist\nexistentialistic\nnon-deterministic\nnon-philosophical\nnotional\nontological\nontologically\nsolipsistically\nspatio-temporal\nspatiotemporally\nsuperorganic\nsupersensible\nSee more results »\nIdioms\nbe a law unto yourself\nthe law of averages\nthe law of the jungle\ntake the law into your own hands\nthere's one law for the rich and another for the poor\nlaw noun\n(RULE)\nAdd to word list\nAdd to word list\n[ C/U ] a rule made by a government that states how people may and may not behave in society and in business, and that often orders particular punishments if they do not obey, or a system of such rules: [ U ] civil/criminal law [ U ] federal/state law [ C ] We have a law in this state that drivers must wear seatbelts. [ U ] She’s studying law at Georgetown University. [ U ] Playing loud music late at night is against the law.\n[ C/U ] The law is also the police: [ U ] He got in trouble with the law as a young man. Law and order\nLaw and order is the condition of a society in which laws are obeyed, and social life and business go on in an organized way. Law enforcement\nLaw enforcement is the government activity of keeping the public peace and causing laws to be obeyed: Several law enforcement officers were sent to Mexico to bring the prisoner back.\nlaw noun\n(PRINCIPLE)\n[ C ] a general rule that states what always happens when the same conditions exist: the laws of physics\nAdd to word list\nAdd to word list\n[ C ]\n&#160; GOVERNMENT, LAW a rule, usually made by a government, that states how people may and may not behave in a society, and often orders particular punishments if they do not obey: a law against sth There is a law against aggressive telemarketing.a law requires/states sth Senate leaders proposed a law requiring rigorous new scrutiny of all future tax breaks.a law allows/forbids/prohibits sth Checks will be processed more quickly, thanks to a federal law allowing banks to use electronic images of checks.the laws on/governing sth He plans changes to the laws on bankruptcy. tax/anti-trust/environmental laws\n[ S or U ]\n&#160; GOVERNMENT, LAW the set or system of laws made by a government in a particular place: UK/American/Indian, etc. law Promising magical remedies is prosecutable under Indian law.federal/international/state law The hearing was required by federal law.obey/respect the law Even the most powerful people have a duty to obey the law. uphold/enforce the law break/disobey/violate the law It is against the law to hire undocumented workers in the U.S.the law says/states/requires The law requires traders to state clearly what rate of exchange they are using.by law By law, the maximum donation allowed is $5,000.under the law Under the law, private equity is taxed in exactly the same manner as every other investment.outside/within the law He took risks with his business dealings, but was careful to stay within the law.\n[ U ]\n&#160; GOVERNMENT, LAW the part of a set of laws that deals with a particular activity, business, or industry: civil/common/criminal law labour/tax/employment law company/intellectual property/contract law copyright/corporate/employment law\n[ U ] the study of law or the job of being a lawyer: go into/practise/study law Her mother inspired her to study law.law firm/practice/school This isn't just any law school, it's the one that has more judges in more courtrooms than any other. a law degree/graduate/professor\n[ C or U ] the rules set by an organization that control how it and its members should behave: the laws of sth Managers know how to promote a respectful working environment while maintaining the laws of the office. Church law regulates the actions of the bishops.\n[ C, usually plural ] a rule or normal way of behaving which the people who do an activity usually follow: the laws of sth The laws of good business say you shake hands and make eye contact when you leave. Out of all the laws of salesmanship, the first one to learn is to get a prospect's name. Vendors have informal laws of their own about client-stealing.\n[ C ] a rule which states what always happens when the same conditions exist: the law of sth The first law of thermodynamics says that energy is conserved in any process involving a thermodynamic system and its surroundings.the laws of physics/science/economics According to the laws of physics this would not be possible.\nthe law\nLAW the police or other officials who stop crime or catch criminals: He had to swear he wasn't changing his name in order to run from the law. See also\nblue laws\nblue-sky laws\nbylaw\ncase law\ncivil law\ncommercial law\ncommon law\ncompany law\ncompetition law\nconflict of law(s)\nView all\ncourt of law\ncriminal law\nemployment law\ninternational law\nlabour law\nlaw of diminishing returns\nMoore’s law\nMurphy's Law\nthe Pareto principle\nParkinson's Law\nprivate law\npublic law\nstatute law\nsubstantive law\nwage-and-hour laws"}