{"id":207661,"name":"lay","type":"verb","us_sound":"leɪ","us_link":"../audio/l/lay.mp3","uk_sound":"leɪ","uk_link":"../audio/l/uklawle011.mp3","content":"lay verb\n(PUT DOWN)\nAdd to word list\nAdd to word list\nC1 [ T usually + adv/prep ] to put something in especially a flat or horizontal position, usually carefully or for a particular purpose: She laid the baby on the bed. He laid the tray down on the table.lay aside She laid aside her book and went to answer the phone. We're having a new carpet laid in the hall next week. The plan is to lay (= build) the foundations for the new apartments in October.\n[ T ] to prepare a plan or a method of doing something: best laid plans Even the best laid plans go wrong sometimes.\nMore examplesFewer examplesJust lay the suitcase on the bed, would you?He laid the wreath reverently in front of the memorial.The road has been dug up in order to lay cables.Modern office buildings have false floors, under which computer and phone wires can be laid.He took out his gold watch and laid it ostentatiously on the table in front of him.\nSMART Vocabulary: related words and phrases\nPlacing and positioning an object\n-based\nappose\naround\nchange something around\ncircle\nconsign\nfit\ngone\ninstall\nlie\npile (something) up\nplant\nredeposit\nreinstall\nreinstallation\nrelocate\nreorientate\nsuperimpose\ntranspose\ntransposition\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPreparing\nPlanning, expecting and arranging\nlay verb\n(LIE)\npast simple of\nlie\n[ I ] NOT STANDARD to lie somewhere. This use is generally considered to not be correct: \"I was so tired that at one point, I was laying down on the floor,\" he said. My dog just lays there all day in the sun.\nSMART Vocabulary: related words and phrases\nReclining\ncrowd-surfing\nfetal position\nfoetal position\nfull-length\nlean\nlie\nlounge around (something)\nprone\nprone positioning\nproning\nprostrate\nprostration\nrepose\nsink\nsink into something\nsit back\nsprawl\nsprawled\nstretch\nsupine\nSee more results »\nlay verb\n(PRODUCE EGGS)\nB2 [ I or T ] (of an animal or bird) to produce eggs from out of the body: Thousands of turtles drag themselves onto the beach and lay their eggs in the sand.\nSMART Vocabulary: related words and phrases\nAnimal reproduction\nandrogen\nanti-oestrogen\nasexual reproduction\nasexuality\nasexually\nbarrenness\ncalve\nfertile\nfetal\nimpregnate\nnonreproductive\noestrogen\nout-reproduce\npanmictic\npanmixia\nprocreation\nsemen\nspawn\nsterile\nzygote\nSee more results »\nlay verb\n(HAVE SEX)\n[ T ] slang to have sex with someone: get laid So did you get laid (= find someone to have sex with)?\nlay verb\n(RISK MONEY)\n[ T ] to risk something, usually money, on the result of an event: lay something on something She won't get the job - I'd lay money on it!\nSMART Vocabulary: related words and phrases\nGambling & bookmaking\na/the bookmaker's phrase\nante\nanti-gambling\nbank\nbet\nblackjack\ncasino\nchip\nco-favourite\ncockfight\ngaming table\npunt\nraffle\nslot machine\nsmart money\nspread betting\nstake something on something\nstakeholder\ntoss up\ntrifecta\nSee more results »\nlay verb\n(EXPRESS)\n[ T ] to express a claim, legal statement, etc. in a serious or official way: lay the blame on She can't accept she made a mistake and now she's trying to lay the blame on (= accuse) her assistant.lay a charge against Do you understand the seriousness of the charge (= legal accusation) that has been laid against you?\nThesaurus: synonyms, antonyms, and examples\nto blame someone for somethingblameHe blamed his wife for the error.lay the blame onThe bridge's architect was quick to lay the blame on the engineers.pin the blame onNo one should be looking to pin the blame on others.apportion blameWhen a company fails it isn't always possible to apportion blame.hold someone responsibleIf anything goes wrong, I will hold you responsible.take the blameIf we fail, I'll take the blame.\nSee more results »\nlay claim to something\nto say that you own something: Two companies have laid claim to the design.\nSee more\nSMART Vocabulary: related words and phrases\nAnnouncing, informing & stating\nacquaint someone/yourself with something\nannunciation\napprise someone of something\navowedly\nawaken someone to something\nbreak\nbreathe/say a word idiom\ndisseminate\nimpart\nknown\non the record idiom\npass\nproclaim\npropagate\nput something before someone\nput something out\nput something out of its misery idiom\nrapporteur\nreportable\nstatement\nSee more results »\nGrammar\nLay or lie?The verb lay means ‘to put something down carefully in a flat position’. It must have an object. It is a regular verb, but note the spelling of the past simple and -ed form: laid not layed: …\nIdioms\nlay something at someone's door\nlay someone low\nlay something on the line\nlay yourself open to attack, criticism, ridicule, etc.\nlay someone to rest\nlay something to rest\nlay something (to) waste\nlay a finger on someone\nlay a hand on someone\nlay bare something\nMore idioms\nlay it on a bit thick\nlay the basis/foundations for something\nlay the ghost of something (to rest)\nlay up trouble for yourself\nPhrasal verbs\nlay something aside\nlay something down\nlay something in\nlay into someone\nlay someone off\nlay off (something/someone)\nlay something off\nlay something on\nlay something out\nlay someone out\nMore phrasal verbs\nlay someone up\nlay something up\nlay adjective [before noun]\n(NOT TRAINED)\nnot trained in or not having a detailed knowledge of a particular subject: From a lay viewpoint the questionnaire is virtually incomprehensible. See also\nlayman (NOT TRAINED)\nSMART Vocabulary: related words and phrases\nTypes of employment\nadmin\nadministrative\nadministrative assistant\nadministratively\nat the coalface idiom\njobbing\njobless\njoblessness\njobseeker\nlabour-intensive\nqualified\nrecertify\nredundancy\nredundant\nretcon\nWFH\nwhite-collar\nwho's who idiom\nwilderness years idiom\nwork experience\nSee more results »\nlay adjective [before noun]\n(CHURCH)\nhaving a position in a religious organization that is not a full-time job and is not paid: a lay preacher See also\nlayman (CHURCH)\nSMART Vocabulary: related words and phrases\nReligious people: followers of religious groups\nAdventist\nAnglican\nanimist\nanti-cult\nanti-papal\ndruid\nEpiscopalian\nevangelist\nfakir\nFranciscan\nmissionary\nMohammedan\nMoonie\nmoral majority\nMormon\nsectarianism\nSeventh-Day Adventist\nShia\nShiite\nSikh\nSee more results »\nused to describe how good someone is at sex, or how often they have sex: good lay She's a good lay (= sex with her is enjoyable).easy lay She got a reputation as an easy lay (= she was thought to have slept with a lot of people).\nlay verb\n(PUT DOWN)\nAdd to word list\nAdd to word list\n[ T ] to put something down, esp. into a flat or horizontal position: He laid his coat on a chair. She laid the baby (down) in her crib.\n[ T ] To lay is also to put down in a careful or systematic way for a particular purpose: We’re having a new carpet laid in the hall next week.\nlay verb\n(PREPARE)\n[ T ] to prepare something: The initial negotiations laid the groundwork for more detailed talks later on.\nlay verb\n(PRODUCE EGGS)\n[ I/T ] (of an animal or bird) to produce eggs from out of its body\nlay verb\n(RISK)\n[ T ] to risk something on the result of an event: I’ll lay odds (= risk money) that she won’t show up.\nlay verb\n(EXPRESS)\n[ T ] to put or express: He laid emphasis on the fact that he had never been found guilty of a crime. She’s trying to lay the blame on someone else (= blame someone else). Idioms\nlay a finger on someone\nlay down your life\nlay down the law\nlay someone to rest\nlay something to restPhrasal verbs\nlay someone open\nlay down something\nlay down something\nlay in something\nlay into someone\nlay off someone\nlay off (something/someone)\nlay out something\nlay up someone\nlay adjective [not gradable]\n(NOT TRAINED)\nnot trained in or not having a detailed knowledge of a particular subject: To a lay audience, the mathematics would be difficult.\nlay\n(LIE)\npast simple of lie\nAdd to word list\nAdd to word list\nto put something onto a surface or under the ground in a horizontal position: lay a pipe/cable Workmen were digging up the street to lay cables. They prepared the ground, then laid concrete.\nto prepare for doing something or to make it possible for something to happen in the future: lay the basis/foundation/groundwork for sth Perhaps more than anyone, he laid the groundwork for today's digital revolution.\nto bet (= risk) something on the result of an event: lay odds/a wager I'll lay odds that she won't take the job.\nlay blame (on sb/sth)\nto say that someone or something is responsible for something bad that happened: You can't lay blame on the government for all your troubles. When projects go wrong, everyone looks for somewhere to lay the blame.\nlay claim to sth\nto say that you own something or have a right to it: Through a series of buyouts, we laid claim to the best intellectual property of our time.\nlay an egg\ninformal US to make something that does not work well or that fails: They laid an egg by putting last decade's technology in that phone.\nPhrasal verbs\nlay sth aside\nlay sth down\nlay sb off\nlay out (sth) for/on sth\nlay sth out\nlay sth up\nnot expert in or not having a detailed knowledge of a particular subject: lay person/audience/reader Gadget reviews work best when they use less technical jargon for the lay audience. See also\nlayperson"}