{"id":207697,"name":"layered","type":"adjective","us_sound":"ˈleɪ.ɚd","us_link":"../audio/l/uslaund014.mp3","uk_sound":"ˈleɪ.əd","uk_link":"../audio/l/uklawle016.mp3","content":"layered adjective\n(IN LAYERS)\nAdd to word list\nAdd to word list\narranged in layers or thin sheets, one on top of another: A closer look at the layered rocks revealed that long ago, they had been underwater. She wore a silk layered gown.\napproving used to describe something that is complicated and interesting because it has many different levels or features: Though the plot is a little melodramatic, there are vivid, layered characters. Their musical compositions are epic, layered and intensely dynamic.\nMore examplesFewer examplesSpread the grated potato on layered paper towels, and press out excess moisture.The designer will offer tips on using layered fabric and jewelry. There are fifteen different 5 ml vials of eau de parfum to wear singly or layered. The play is constructed out of intricately layered anecdotes.The Simpsons is actually a brainy, densely layered dysfunctional-family sitcom.\nSMART Vocabulary: related words and phrases\nCoverings and layers\na blanket of something idiom\nbeeswax wrap\nblanket\nbrazen\ncasing\ndiaphragm\ninterstratification\ninterstratify\nlagging\nlayer\nlined\nseam\nsheath\nstratum\nsubstratum\nsuperstratum\ntar paper\ntarpaulin\nuncover\nvein\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComplexity\nlayered adjective\n(HAIR)\nLayered hair has been cut so that some top parts of the hair are shorter than the hair underneath, to give it a particular style: Her hair is long and fluffily layered.\nMore examplesFewer examplesThe singer sported layered hair, studded jeans and a denim jacket. The perm is perfect for short, layered or medium-length hair and lasts for about six weeks. He loves the cut of her black hair, layered wisps hanging in her face.Her hair was shorter and softly layered, a more mature look.\nSMART Vocabulary: related words and phrases\nHairstyles\nAfro\nAfro puff\nbandeau\nBantu knots\nbarnet\nblow-dry\nbowl cut\nchignon\nfade\nhair extension\nhairdo\nkiss curl\nplait\npudding basin\nrelaxed\nshake out\nsidelock\nskinhead\nspiked\nundercut\nSee more results »"}