{"id":207694,"name":"layer","type":"noun","us_sound":"ˈleɪ.ɚ","us_link":"../audio/l/layer.mp3","uk_sound":"ˈleɪ.ər","uk_link":"../audio/l/uklawle015.mp3","content":"layer noun [C]\n(MATERIAL)\nAdd to word list\nAdd to word list\nB2 a level of material, such as a type of rock or gas, that is different from the material above or below it, or a thin sheet of a substance: the ozone layer A thick layer of clay lies over the sandstone. There was a thin layer of oil on the surface of the water. We stripped several layers of paint off the door.\nMore examplesFewer examplesCover the meat with a layer of cheese.Women have a layer of subcutaneous fat that provides them with better insulation than men.The eruption had covered the town with a fine layer of ash.A thick layer of dust had accumulated in the room.If the first layer isn't dry before you add the next one, the colours will run into each other .\nSMART Vocabulary: related words and phrases\nCoverings and layers\na blanket of something idiom\nbeeswax wrap\nblanket\nbrazen\ncasing\ndiaphragm\ninterstratification\ninterstratify\nlagging\nlayered\nlined\nseam\nsheath\nstratum\nsubstratum\nsuperstratum\ntar paper\ntarpaulin\nuncover\nvein\nSee more results »\nlayer noun [C]\n(PEOPLE)\nthe group of people at a particular level in an organization: We've cut the number of management layers from five to three.\nSMART Vocabulary: related words and phrases\nBosses & managers\nadministration\nanti-management\nbranch manager\nC-suite\nCAO\nco-partner\nco-president\ncomptroller\ncoo\ncoordinator\nhierarchy\nindustrialist\nline manager\nmajordomo\nmanagement\nslave driver\nsleeping partner\nsuperboard\nsuperintendency\nsuperintendent\nSee more results »\nlayer noun [C]\n(hair)\nlayers\n[ plural ] hair cut so that some top parts of the hair are shorter than the hair underneath, to give it a particular style: I asked the hairdresser to put some layers in my hair.\nSee more\nto arrange something in layers: Layer the pasta with slices of tomato. potatoes layered with onions\nto cut hair so that some top parts of the hair are shorter than the hair underneath, to give it a particular style or shape: Can you layer it a little at the front, please?\nSMART Vocabulary: related words and phrases\nCovering and adding layers\nadditive\nasphalt\nbestrew\nbind\nblanket\nblindfold\ngum\ninlaid\nlag\nlaminate\nobliterate\nobliteration\nseasoned\nslap\nslap something on\nsmother something in/with something\nspeckle\nstudded\ntent\nwax\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHairstyles\nRelated word\nlayered\nAdd to word list\nAdd to word list\na thin sheet of a substance on top of a surface, or a level of material that is different from the material on either side: We put on two layers of paint. The road was built up with layers of crushed stone and asphalt. layered adjective us/ˈleɪ·ərd/\nHer hair is long and fluffily layered.\nto arrange something in layers: Layer the pasta with slices of tomato.\nAdd to word list\nAdd to word list\nHR the group of employees or managers at a particular level of responsibility in an organization: layer of bureaucracy/management She argued that a joint governing board was a needless layer of bureaucracy. We've cut the number of management layers from five to three.\na thin sheet of a substance on top of a surface, or a level of material that is different from the material on either side: layer of paint/soil/plastic, etc. The case was made of layers of plastic, paint, and titanium. a protective/waterproof/insulating layer\none of several related ways of thinking or doing something: a layer of complexity/meaning\nSee also\nmarzipan layer"}