{"id":209739,"name":"lazy","type":"adjective","us_sound":"ˈleɪ.zi","us_link":"../audio/l/lazy.mp3","uk_sound":"ˈleɪ.zi","uk_link":"../audio/l/uklawle025.mp3","content":"Add to word list\nAdd to word list\nA2 disapproving not willing to work or use any effort: Managers had complained that the workers were lazy and unreliable. Get out of bed, you lazy thing! He's too lazy to walk to work.\nThesaurus: synonyms, antonyms, and examples\nnot willing to work or use effortlazyHe's one of the laziest people I've ever met.indolentSome of my classmates are indolent in their health habits.slothfulTelevision and video games have bred a generation of slothful teens.work-shyUK I don't want your work-shy cousin living with us indefinitely!idleUK He's an able student, just idle.\nSee more results »\nB2 approving slow and relaxed: We spent a lazy day on the beach sunbathing.\nMore examplesFewer examplesHe's a classic example of a kid who's clever but lazy.You were very lazy last term, but we'll start again with a clean sheet this term.I'm not being lazy - I'm just conserving my energy for later.We spent a lazy afternoon floating down the river.She told him he was a lazy good-for-nothing and should get a job.\nSMART Vocabulary: related words and phrases\nLaziness and lazy people\nbludger\nbone idle idiom\nbum around\nCBA\nclock-watcher\nindolent\nindolently\nlayabout\nlazily\nlaziness\nshiftless\nshirker\nskiver\nslacker\nslackness\ntime-server\ntime-serving\nunambitious\nvegetable\nwork-shy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeaceful and tranquil\nRelated words\nlazily\nlaziness\nAdd to word list\nAdd to word list\nnot willing or not wanting to work or use effort to do something: If you weren’t so lazy we could start fixing up the house.\nIf you describe an event or activity as lazy, you mean that it is slow and gentle, or does not involve much effort: a lazy breeze We spent a lazy afternoon sunbathing on the beach. laziness noun [ U ] us/ˈleɪ·zi·nəs/\nAdd to word list\nAdd to word list\nnot willing to work hard or make an effort: His line manager felt that he was brilliant but lazy."}