{"id":209818,"name":"leadership","type":"noun","us_sound":"ˈliː.dɚ.ʃɪp","us_link":"../audio/l/leadership.mp3","uk_sound":"ˈliː.də.ʃɪp","uk_link":"../audio/l/ukldriv008.mp3","content":"Add to word list\nAdd to word list\nC1 the set of characteristics that make a good leader: What the company lacks is leadership. He lacks leadership qualities/skills.\nC1 the position or fact of being the leader: The group flourished under her firm leadership. R&amp;M gained market leadership (= sold more goods than other companies) by selling products that were of superior quality. the leadership\nC1 the person or people in charge of an organization: There is growing discontent with the leadership. The election for the leadership of the council will take place on Tuesday.\nMore examplesFewer examplesThe contest for deputy leadership of the party is gathering speed.The country's leadership is in crisis.The country is crying out for a change in leadership.His detractors claim that his fierce temper makes him unsuitable for party leadership.The fight for the leadership gave a fascinating insight into the group's dynamics.\nSMART Vocabulary: related words and phrases\nPower to control\nahold\nall-powerful\nascendancy\nauthoritarianism\nbe above someone's pay grade idiom\nbig beast\ncradle\ndiscretionary\ngrip\nhe who pays the piper calls the tune. idiom\nhegemonic\nhegemonism\nimplant\npower structure\npower struggle\npower vacuum\npredominance\npuissance\nsway\nthe hand that rocks the cradle rules the world idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople in charge of or controlling other people\nleadership noun [U]\n(CONTROL)\nAdd to word list\nAdd to word list\nthe quality or ability that makes a person a leader, or the position of being a leader: The company was extremely successful under Murphy’s leadership.\nLeadership is also the people who are in charge of a government or group: the Democratic leadership in Congress\nAdd to word list\nAdd to word list\n[ U ]\n&#160; HR, MANAGEMENT the position or fact of being a leader: The company has strong leadership and accountability up and down the line. The hospital excelled financially under her leadership. a leadership role/style/team business/corporate/executive leadership\n[ U ]\n&#160; HR, MANAGEMENT the set of characteristics that makes a good leader: He was fired for his lack of leadership. leadership qualities/skills\n[ U ]\n&#160; MARKETING the position of being a company, product, etc. that is more successful than its competitors: Our people are working together to attain leadership in customer service, quality and financial returns. It is the Marketing Division that grapples with the strategic problem of retaining market share and industry leadership.\nthe leadership\nthe person or people in charge of an organization: The new leadership will have complete control over 45,900 employees and a $3.5 billion annual budget. The unions preferred not to alienate the leadership when many of their own policy demands were still under negotiation. See also\nmarket leadership\nprice leadership\ntransactional leadership\ntransformational leadership"}