{"id":209801,"name":"lead","type":"verb","us_sound":"liːd","us_link":"../audio/l/lead_01_00.mp3","uk_sound":"liːd","uk_link":"../audio/l/ukldriv004.mp3","content":"lead verb\n(CONTROL)\nAdd to word list\nAdd to word list\nB2 [ I or T ] to control a group of people, a country, or a situation: I think we've chosen the right person to lead the expedition. I've asked Gemma to lead the discussion. Who will be leading the inquiry into the accident?\nMore examplesFewer examplesThere was nobody strong enough to lead an effective countervailing force against the dictator.Men have always played an active part in leading worship while women have been confined to more passive roles.Gandhi and Martin Luther King both led campaigns of civil disobedience to try to persuade the authorities to change their policies.The opposition leader led a very forceful attack on the government in parliament this morning.The deputy state fire marshal led the arson investigation.\nSMART Vocabulary: related words and phrases\nControlling and being in charge\naggrandize\nassert your authority\nassume\nassumption\nauthoritative\ncynical\nget the better of someone idiom\nget your hooks into someone/something idiom\nget/fall into the wrong hands idiom\ngovern\nguiding principle\npaternalistic\npaternalistically\nperemptorily\nperemptory\nplay God idiom\ntame\nwhat someone says, goes idiom\nwrangle\nwrangler\nSee more results »\nlead verb\n(BE WINNING)\nB2 [ I or T ] (especially in sports or other competitions) to be in front, to be first, or to be winning: After 30 minutes the challengers were leading by two goals. With two laps to go Ngomo led by less than two seconds. The Lions are leading the Hawks 28–9.\nMore examplesFewer examplesThe poll shows that the government is leading by the narrowest of margins.At half-time, United were leading with two goals by Black.She's been leading throughout the race, but it now looks as if she's tiring.The Sonics led by only 2 points at half time.The champion was leading by two sets to one when rain stopped play.\nSMART Vocabulary: related words and phrases\nWinning, losing & scoring in sport\naet\nagainst the run of play idiom\nblow someone away\nboss\nbreak your duck idiom\nclose-run\nconcede\ndraw\nequalizer\npromedios\npull\npull back\nreel something off\nrelegation zone\nromp\nscore\nshutout\nstraight\nstrike\ntreble\nSee more results »\nlead verb\n(INFLUENCE)\nC2 [ T ] to cause someone to do something, especially something bad: [ + to infinitive ] The brochure led me to believe that the price included home delivery. It's worrying that such a prominent politician is so easily led. He was a weak man, led astray by ambition.\nMore examplesFewer examplesThe success of the product led many firms to try to copy them.The seductions of life in a warm climate have led many Britons to live abroad, especially in Spain.It was his instinct for self-preservation that led him to abandon his former friends and transfer his allegiance to the new rulers.He's at that impressionable age when he's very easily led by other children.What led you to make such a drastic decision?\nSMART Vocabulary: related words and phrases\nCausing somebody to act\narm-twisting\nbludgeon\nbounce someone into something\nbulldoze\nbully\ncoercion\nforcible\nforcibly\nhold someone to ransom idiom\nimpel\nimpose\nput/tighten the screws on someone idiom\nram something down someone's throat idiom\nram something into someone\nransom\nreduce\nreduce someone to something\nslap\nsqueeze\nwring\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAffecting and influencing\nlead verb\n(SHOW WAY)\nB1 [ I ] to show the way to a group of people, animals, vehicles, etc. by going in front of them: I don't know the way, so you'd better lead. If you lead in the jeep, we'll follow behind on the horses.\n[ T ] To lead a group of moving people or vehicles is to walk or drive in front of them: The local youth band will lead the parade this weekend. A large black hearse led the funeral procession.\nB1 [ T usually + adv/prep ] to take someone somewhere, by going with them: She led them down the hall. The waiter led us to our table. Our guide led us through the mountains.\nThesaurus: synonyms, antonyms, and examples\nto take someone somewheretakeI have to take my mother to the doctor today.go withI offered to go with him to the police station.come withCan you come to the hospital with me?accompanyChildren under 12 must be accompanied by an adult.driveMy husband usually drives the kids to school.give someone a liftCan you give me a lift into town?\nSee more results »\nB1 [ T usually + adv/prep ] to take hold of a person or animal and take him, her, or it somewhere: She took the child by the hand and led him upstairs to bed. He led the horse out of the stable. lead the way\nto show the way by going in front: You've been there before - why don't you lead the way?\nto make more progress than other people in the development of something: The company has been leading the way in network applications for several years.\nSee more\nMore examplesFewer examplesThey led us into the forest.A group of firefighters led the march.We asked Ralph to lead us through the rough terrain.They led in the car and we followed on bikes.They led us into a small room.\nSMART Vocabulary: related words and phrases\nTaking someone somewhere or telling them the way\naccompanied by someone/something\naccompany\naccompany someone to something\nbring\nbring someone/something along\nchaperone\nconvoy\ndirect\ndrop\nmarch\nrefer to someone/something\nride\nsee someone off\nshepherd\nshow someone around (something)\nshow someone over something\nstick\nusher\nusherette\nwalk\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAhead, in front and beyond\nlead verb\n(DIRECTION)\nB2 [ I or T, usually + adv/prep ] (especially of roads, paths, doors, signs, information, etc.) to go in a particular direction or have a particular result, or to allow or cause this: There's a track that leads directly to the reservoir. The door leads out onto a wide, shady terrace. A narrow trail of blood led directly into the cave. This information led the police to a house near the harbour.\nMore examplesFewer examplesThis door leads to the garden.A narrow path led to their cottage.Muddy footprints led to the door.Where does this road lead?The stepping stones lead across the marsh.\nSMART Vocabulary: related words and phrases\nTaking someone somewhere or telling them the way\naccompanied by someone/something\naccompany\naccompany someone to something\nbring\nbring someone/something along\nchaperone\nconvoy\ndirect\ndrop\nmarch\nrefer to someone/something\nride\nsee someone off\nshepherd\nshow someone around (something)\nshow someone over something\nstick\nusher\nusherette\nwalk\nSee more results »\nlead verb\n(LIVE)\nlead a busy, normal, quiet, etc. life\nB2 to live a particular type of life: He was able to lead a normal life, despite the illness.\nSee more\nlead verb\n(MOVEMENT IN SPORT)\n[ I ] in sports and activities, to move forward first with a particular part of your body, especially as a habit: You can lead with your left or right leg, depending on which feels more comfortable. He was booked for leading with his elbow (= running into an opposing football player and hitting them with an elbow).\n[ I ] in boxing, to make a first attacking punch (= hit), especially with a particular hand: They're used to fighting against boxers who lead with their right.\nMore examplesFewer examplesSome surfers led with their right foot into the cresting waves.It feels more comfortable if you lead with your dominant foot and stay centred over your feet as you slide.\nSMART Vocabulary: related words and phrases\nAdvancing and moving forward\nadvancing\nballistically\nbeeline\ncome\ncome over\ncome up\ncruise\nforward\ngain\nghost\nglide\nhead\nmake for somewhere/something\nmake towards something/someone\nproceed\nprogress\npull\npush\nrun\nslide\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFighting sports\nIdioms\nlead someone a (merry) dance\nlead someone by the nose\nlead someone up the garden path\nlead the field/pack/worldPhrasal verbs\nlead off\nlead someone on\nlead to something\nlead up to something\nlead with something\nlead noun\n(WINNING POSITION)\nB2 [ S ] uk\nYour browser doesn't support HTML5 audio\n/liːd/ us\nYour browser doesn't support HTML5 audio\n/liːd/ a winning position during a race or other situation where people are competing: For the first time in the race Harrison is in the lead. With a final burst of speed she went/moved into the lead. After last night's win Johnson has taken (over) the lead in the championship table. By the end of the day's play Davies had a lead of three points.\nMore examplesFewer examplesThe latest opinion poll puts the Democrats in the lead.The French driver has taken the lead in the Paris-Dakar rally.She succeeded in retaining her lead in the second half of the race.Italy had a comfortable three-goal lead over France by half-time.Lewis held onto the lead until the final lap.\nSMART Vocabulary: related words and phrases\nWinning, losing & scoring in sport\naet\nagainst the run of play idiom\nblow someone away\nboss\nbreak your duck idiom\nclose-run\nconcede\ndraw\nequalizer\npromedios\npull\npull back\nreel something off\nrelegation zone\nromp\nscore\nshutout\nstraight\nstrike\ntreble\nSee more results »\nlead noun\n(SHOWING WAY)\nC2 [ C usually singular ] the act of showing a person or group of people what to do: We'll go through the dance routine again - follow my lead (= do what I do).\nSMART Vocabulary: related words and phrases\nControlling and being in charge\naggrandize\nassert your authority\nassume\nassumption\nauthoritative\ncynical\nget the better of someone idiom\nget your hooks into someone/something idiom\nget/fall into the wrong hands idiom\ngovern\nguiding principle\npaternalistic\npaternalistically\nperemptorily\nperemptory\nplay God idiom\ntame\nwhat someone says, goes idiom\nwrangle\nwrangler\nSee more results »\nlead noun\n(INFORMATION)\n[ C ] a piece of information that allows a discovery to be made or a solution to be found: A lead from an informer enabled the police to make several arrests.\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\nprospectus\nPSA\npush notification\nradiogram\nreadout\nsubtlety\ntelemetry\nSee more results »\nlead noun\n(ACTOR)\nthe lead C2 [ C ]\nthe main part or actor in a film or play: Who's been cast as the lead? Meryl Streep was the lead in that year's Oscar-winning film.\nSMART Vocabulary: related words and phrases\nCinema & theatre: actors & performers\nactor\nactress\nall-star\nalum\nbelly dancer\ncast\nchorus\nheadliner\nimproviser\njuvenile lead\nleading lady\nleading man\nperformer\nscream queen\nspear carrier\nstage name\nstarlet\nstooge\nsuperstar\ntroupe\nSee more results »\nlead noun\n(ELECTRICAL)\n[ C ] (also wire); (UK also flex); (US also cord) a wire covered in plastic and used to connect electrical equipment to the electricity supply\naydinmutlu/E+/GettyImages\nSMART Vocabulary: related words and phrases\nCords, ropes, cables & string\nbell pull\nbowline\nbungee\ncable\ncatgut\nfibre\nflex\nhalter\nhalyard\nharness\nlandline\nlanyard\nlariat\nlashing\nrein\nrope\nshackles\nshock cord\nstringed\nstringy\nSee more results »\nlead noun\n(FOR ANIMAL)\n[ C ] mainly UK (US usually leash) a piece of rope, chain, etc. tied to an animal, especially to a dog at its collar when taking it for a walk: Please keep your dog on a lead when on the beach.\nandrewburgess/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nCords, ropes, cables & string\nbell pull\nbowline\nbungee\ncable\ncatgut\nfibre\nflex\nhalter\nhalyard\nharness\nlandline\nlanyard\nlariat\nlashing\nrein\nrope\nshackles\nshock cord\nstringed\nstringy\nSee more results »\nlead noun\n(BOXING)\n[ C usually singular ] in boxing, a first attacking punch (= hit) by a fighter : A right-hand lead by Haye caught Ruiz on the chin.\nMore examplesFewer examplesHe was able to pick him off with right hooks around his left lead.Froch put him down again with a right-hand lead in the fifth.He came out aggressively, using his southpaw lead to good effect.\nSMART Vocabulary: related words and phrases\nFighting sports\naikido\nall-in wrestling\narm-wrestling\nbantamweight\nblack belt\nfeint\nfull nelson\ngrappler\ngumshield\nhalf nelson\nhammerlock\nleft-hander\npugilist\npugilistic\npunch-drunk\npunchbag\npuncher\npunching bag\nsouthpaw\nwrestler\nSee more results »\nB1 used to describe the main performer or part in a performance: Who played the lead role in the movie? The lead guitarist was good.\nSMART Vocabulary: related words and phrases\nImportant people and describing important people\nAugust\naugustly\nbaron\nbe the cat's whiskers idiom\ndoyen\ndoyenne\nexaltedly\nfirst among equals idiom\nFLOTUS\nget over something/someone\nget over yourself! idiom\nguest of honour\nlynchpin\nMister Big\nmogul\nmoment\nmovers and shakers\nMVP\nnabob\nthe big boys\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema & theatre: actors & performers\nlead noun [U]\n(SUBSTANCE)\n[ U ] (symbol Pb) a chemical element that is a very heavy, soft, dark grey, poisonous metal, used especially in the past on roofs and for pipes and also for protection against radiation: lead pipes\nTomekbudujedomek/Moment/GettyImages\n[ C or U ] (the narrow strip of) coloured material, usually black and made of graphite, in the centre of a pencil\nLivio Maynard/EyeEm/GettyImages\nMore examplesFewer examplesThe pipes were made of lead.They stole lead from the roofs.She was suffering from lead poisoning.The window frames were made of lead.Pencils do not contain real lead nowadays.\nSMART Vocabulary: related words and phrases\nChemical elements\nactinium\nalkali metal\namericium\nastatine\nberkelium\nbrimstone\nbromine\ncalcium\nfluorine\ngermanium\niodine\nlithium\nmanganese\nnickel\nplutonium\nquicksilver\nselenium\nsodium\ntransition metal\nzinc\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPublishing: paper & stationery\nPainting & drawing materials\nIdiom\ngo down like a lead balloon\nlead verb\n(CONTROL)\nAdd to word list\nAdd to word list\n[ T ] to manage or control a group of people; to be the person who makes decisions that other people choose to follow or obey: Her sister is leading an effort to change this law. I’ve asked George to lead the discussion.\nlead verb\n(SHOW WAY)\n[ I/T ] to show the way to someone or something, esp. by going first: [ T ] She led the children along the path out of the forest. [ T ] That research group leads the way in the development of new software. [ T ] Just follow the signs and they will lead you to the exit.\n[ I/T ] If something such as a road or sign leads somewhere, it goes toward something else or shows you how to get to a particular place: [ I ] A flight of narrow stairs leads to the kitchen.\nlead verb\n(CAUSE)\n[ I/T ] to prepare the way for something to happen; cause: [ I ] Ten years of scientific research led to the development of the new drug. [ T ] Discussions with lawyers led him to believe that the company would not sue him.\nlead verb\n(BE FIRST)\n[ I/T ] (esp. in sports or other competitions) to be in front, be first, or be winning: [ I/T ] With only three minutes to go in the football game, New Orleans led (Dallas), 24 to 21.\nlead verb\n(LIVE)\n[ T ] to live a particular type of life: She retired to Florida and still leads a busy life. Idioms\nlead the way\nlead the way (somewhere)Phrasal verbs\nlead off (something)\nlead up to something\nlead with something\nlead noun\n(ANIMAL)\n[ C ] a leash\nlead noun\n(BE FIRST)\n[ U ] A lead is also the amount or distance by which someone is in front: After five games, she was still ahead by a point in the chess tournament, but her lead was shrinking.\nlead noun\n(SHOW WAY)\n[ C ] a piece of information that allows a discovery to be made or a solution to be found: The lead the detectives were following led to several arrests.\nlead noun [U]\n(METAL)\na dense, soft, dark gray metal, used esp. in combination with other metals and in batteries (= devices that produce electricity): Lead pipes in many older houses have been replaced by copper ones. fig. The day after running a marathon, my legs felt like lead (= heavy and tired).\nlead noun [U]\n(PENCIL)\nthe black writing material made of graphite, used esp. in the center of a pencil\nAdd to word list\nAdd to word list\n[ T ] to be in charge of a group of people, an organization, or a situation: They led a management buy-out of the business, raising €10m in capital. She has been promoted to lead a team that focuses on product development. He leads the company's worldwide marketing and sales division.\n[ I or T ] to be in front, be first, or be winning in a particular situation or area of business: German, Swiss, and Scandinavian banks lead the internet-based financial services market in Europe.\n[ T ] to happen before something else happens: The company has improved operating performance, led by cost reduction efforts and productivity gains.\nto influence someone to do sth: lead sb/sth to do sth Sharply lower profit has led the company to begin an aggressive cost-cutting plan.\nlead from the front\nto be actively involved in what you are encouraging others to do: The chairman needs to lead from the front and try to resolve the conflicts.\nlead the field/pack/world\nto be better or more successful than other people or things: For ISAs, building societies again led the pack, with 16 of the 20 top-paying providers.\nlead the way\nto make more progress than other people in the development of something: lead the way in/on sth The nation's largest state has led the way in higher education and energy conservation. Experts said women tend to lead the way on issues related to health. Phrasal verbs\nlead to sth\nlead up to sth\n[ S ] a winning position in a situation in which people are competing: give sb/sth a lead The brand will give the company a commanding lead in the important new sector.have/increase/maintain a lead (over sb/sth) The group's market share rose to 42.9%, increasing its lead over their arch-rival, which has 37.6%. Goldman maintained its lead as top manager of negotiated sales.\n[ C, usually singular ] an action or example that shows a person or group what to do: Most competitors will in any case be only too happy to follow the company's lead in raising prices.take a lead from sb/sth We could take a lead from Finland, where a government programme has dramatically raised the intake of fruit and vegetables.take a lead on sth The supermarket group took a lead on GM food labelling.\n[ C ]\n&#160; MARKETING a piece of information that allows a discovery to be made, customers to be found, or a solution to be found: Our business meeting gave me lots of good leads.\nmost important among a group of people, products, etc.: a lead company/product The company's lead product for lung and certain blood cancers is in Phase II trials in humans. The lead negotiator for the teachers' union said he wasn't surprised by the vote.play a lead role in sth They have played a lead role in the fast and furious growth of e-commerce."}