{"id":209882,"name":"league","type":"noun","us_sound":"liːɡ","us_link":"../audio/l/league.mp3","uk_sound":"liːɡ","uk_link":"../audio/l/ukldriv015.mp3","content":"league noun [C]\n(SPORT)\nAdd to word list\nAdd to word list\nB1 a group of teams playing a sport who take part in competitions between each other: Who do you think will win the league championship this year?UK Liverpool were top of the Football League that year. They are currently bottom of the league.\nMore examplesFewer examplesCambridge United are lying third in the league.New teams won't be admitted to the league if their stadiums don't pass muster.The six-year-old is on a peewee league baseball team.The team are ten points ahead of their closest pursuers in the league.He's thought to be the best shooter in the league.\nSMART Vocabulary: related words and phrases\nCompetitors & participants in sports & games\nback four\nballer\nballplayer\nbase jumper\nbenchwarmer\nchallenger\njumper\nkeeper\nlogroller\nlong-jumper\nlongboarder\nmajor league\nmid-table\nracer\nretire\ntrampolinist\ntrialist\ntriathlete\ntriple jumper\ntriple threat\nSee more results »\nleague noun [C]\n(ORGANIZATION)\na group of people or countries who join together because they have the same interest: the League of Nations\nSMART Vocabulary: related words and phrases\nGroups of people\nalliance\nan\nanti-gang\nassemblage\nbaby boomer\nfirst people\nflashmob\nflock\nfocus group\nfoursome\nline (someone) up\nmafia\nmob\nposse\npublic\nquaternity\nrabble\nretinue\nscratch\nsyndicate\nSee more results »\nIdioms\nbe in a different league\nbe in league with someone\nbe out of your league\nnot be in the same league\nleague noun [C]\n(SPORTS)\nAdd to word list\nAdd to word list\na group of teams or players in a sport who take part in competitions against each other: Our team has the worst record in the league. Do you belong to a bowling league?\nA league is also a group in which all the players, people, or things are on approximately the same level: His new movie is just not in the same league as his last one (= not as good as the one before).\nleague noun [C]\n(ORGANIZATION)\na group of people or countries that join together because they have the same interest: the League of Nations in league with fml\nIf someone is in league with someone else, they have agreed secretly to do something together, esp. something illegal or wrong: They were in league with their accountants to cheat the government by hiding their real income."}