{"id":209893,"name":"leak","type":"verb","us_sound":"liːk","us_link":"../audio/l/leak.mp3","uk_sound":"liːk","uk_link":"../audio/l/ukldriv016.mp3","content":"leak verb [I or T]\n(LIQUID/GAS)\nAdd to word list\nAdd to word list\nB2 (of a liquid or gas) to escape from a hole or crack in a pipe or container; (of a container) to allow liquid or gas to escape: Water was leaking from the pipe. Oil leaked out of the car. The car leaked oil all over the drive. The tin was leaking.\nMore examplesFewer examplesThe kitchen roof is apt to leak when it rains.Make sure the bucket doesn't leak.Water was leaking all over the floor.My boots are leaking.The tank was leaking petrol everywhere.\nSMART Vocabulary: related words and phrases\nBuilding: plumbing, pipes & sewage\nballcock\ncaulking\ncesspit\ncistern\nconduit\nhydrant\ninfluent\nisolator\nmixer tap\noutfall\nplumb\nplunger\nsewage\nsewage works\nsewer\nsiphon\nspigot\nstandpipe\nsyphon\nwaterworks\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMovement of liquids\nleak verb [I or T]\n(INFORMATION)\nC2 to allow secret information to become generally known: He leaked the names to the press. News of the pay cuts had somehow leaked out.\nSMART Vocabulary: related words and phrases\nRevealing secrets & becoming known\nanti-secrecy\nbackchannel\nbare\nbare your heart/soul idiom\nblow someone's cover idiom\nblow/take the lid off something idiom\nbreak\ndeclassify\nhold\nhuddle\nkiss\nrat\nrat on someone/something\nreintroduce\nrevealingly\nrevelatory\nstate's evidence\ntip\ntranspire\nunravel\nSee more results »\nIdiom\nleak like a sieve\nleak noun [C]\n(LIQUID/GAS)\nB2 a hole or crack through which a liquid or gas can flow out of a container, or the liquid or gas that comes out: There's water on the floor - we must have a leak. If you suspect a gas leak, phone the emergency number.\nFirmafotografen/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesA leak in the gas mains caused a major explosion.There's a gas leak and the whole building could go up at any moment.Have you plugged that leak in the pipe?The chemical leak had poisoned the water supply.There was a leak in one of the pipes and water was squirting out all over the kitchen floor.\nSMART Vocabulary: related words and phrases\nMovement of liquids\nbacksplash\nbe dripping with something idiom\ncounter-stream\ndecant\ndrainage\ndrip\nfunnel\nleakage\nreinjection\nrespray\nripple\nrun a bath phrase\nrun someone/something over\nrunnel\nspate\nswash\nswill\nswirl\nswirling\ntop something up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHoles, hollows and dips\nleak noun [C]\n(INFORMATION)\nC2 the origin of secret information that becomes known, or the act of making it known: There have been several security leaks recently. They traced the leak to a secretary in the finance department.\nSMART Vocabulary: related words and phrases\nRevealing secrets & becoming known\nanti-secrecy\nbackchannel\nbare\nbare your heart/soul idiom\nblow someone's cover idiom\nblow/take the lid off something idiom\nbreak\ndeclassify\nhold\nhuddle\nkiss\nrat\nrat on someone/something\nreintroduce\nrevealingly\nrevelatory\nstate's evidence\ntip\ntranspire\nunravel\nSee more results »\nIdiom\ntake a leak/have a leak\nAdd to word list\nAdd to word list\n(of a liquid or gas) to escape from a hole or crack in a pipe or container, or (of a container) to allow liquid or gas to escape: [ I ] He heard the sound of dripping and saw water leaking from a pipe overhead. [ T ] The ship ran aground off the coast and began to leak oil.\nTo leak is also to give out information privately, esp. when people in authority do not want it to be known: [ T ] Someone had leaked the news of the ambassador’s resignation to the press. leaky adjective [ -er/-est only ] us\nYour browser doesn't support HTML5 audio\n/ˈli·ki/\nThere’s a leaky radiator in the bedroom.\nA leak is also the act of giving out information privately, esp. when people in authority do not want it to be known: The Justice Department was investigating security leaks.\nAdd to word list\nAdd to word list\n[ I or T ] if a liquid or gas leaks, or is allowed to leak, from a pipe or container, it escapes through an opening: Textile chemicals leaking from a container started a fire in a cargo compartment. The ship leaked an estimated 70,000 gallons of fuel.\n[ T ] to allow secret information to become generally known: Staff members were accused of leaking information about the deal to the newspapers.\nan opening through which liquid or gas can escape from a pipe or container, or the liquid or gas that escapes: fuel/gas/oil leaks\nthe act of allowing secret information to become publicly known: The leak of the top-secret discussions will be a huge embarrassment to the company."}