{"id":209917,"name":"lean","type":"verb","us_sound":"liːn","us_link":"../audio/l/lean.mp3","uk_sound":"liːn","uk_link":"../audio/l/ukldriv019.mp3","content":"Add to word list\nAdd to word list\nB2 to (cause to) slope in one direction, or to move the top part of the body in a particular direction: She leaned forward and whispered something in my ear. I sat down next to Bernard, who leaned over to me and said \"You're late.\" Lean your head back a little. That fence is leaning to the right.\nMore examplesFewer examplesThe post leans to the right.I leaned over to pick up the letter.He leaned forward to listen more closely.The trees leaned in the wind.The wall is leaning dangerously.\nSMART Vocabulary: related words and phrases\nSlanting, sloping, leaning, tilting\nacclivity\nangled\nanteversion\nanteverted\naskew\nincline\nlopsidedly\nlopsidedness\nobliquely\npitch\npitched\nrake\nraked\nslanting\nslantingly\nslantwise\nslope\nsloping\nsteep\ntilt\nSee more results »\nPhrasal verbs\nlean (something) against/on something\nlean something against/on something\nlean on someone/something\nlean on someone\nlean towards sth\nlean adjective\n(NO FAT)\nLean meat has little fat.\nthin and healthy: lean and fit\nThesaurus: synonyms, antonyms, and examples\nhaving less flesh on the body than averagethinShe's on a diet but I think she's already too thin.skinnyYou should eat more. You're much too skinny.scrawnyHe hated his scrawny legs.slimHe was tall, very slim, with pale, deep-set eyes.slenderHe put his arms around her slender waist.\nSee more results »\nSMART Vocabulary: related words and phrases\nVarious qualities of food\ncandy coat\ncandy-coated\ncitric\ncordon bleu\ncreamily\nfarmhouse\nfruity\nherby\nhomegrown\nhomemade\nhoppy\ninstant\nnutritious\nnutty\nripe\nshelf-stable\nsingle-estate\nstore-bought\nsugar-coated\nsugarcoat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThin and fine\nlean adjective\n(NOT ENOUGH)\nIf a period of time is lean, there is not enough of something, especially money or food, at that time: It has been a particularly lean year for the education department.\nlean adjective\n(EFFICIENT)\napproving A lean company or organization does not use too many people or spend too much money, so that there is no waste: Nowadays even efficient, lean, well-run industries are failing.\nSMART Vocabulary: related words and phrases\nBusiness - general words\naddressable\naddressable market\nAge of Exploration\namortizable\nanti-commercial\ncontract something out\ncontractual\ncontractually\ncoopetition\ncop\ninitial public offering\nIPO\nleanly\nlock something in\nm-commerce\ntransact\nuberization\nultra-commercial\nunbranded\nuncommercialized\nSee more results »\nIdiom\nlean and hungry\nlean verb [I/T]\n(SLOPE)\nAdd to word list\nAdd to word list\nto move your body away from a vertical position so that it is bent forward or resting against something, or to place something in a sloping position against something: [ I always + adv/prep ] The conductor leaned over us and asked for our tickets. [ I always + adv/prep ] She paused for a moment to rest and leaned against a large rock. [ T ] He leaned his bike against the wall. Phrasal verbs\nlean on someone/something\nlean toward something\nlean adjective [-er/-est only]\n(THIN)\n(of a person) thin and in good physical condition: Her body is lean, taut, athletic.\nWhen you describe meat as lean, you mean that it does not have much fat in it: lean hamburger meat\nA lean period is a time during which there is not enough of something, esp. money or food: It is a particularly lean year for science funding.\nWhen you say that a company or business is lean, you mean that it has the fewest employees it needs to do its work.\nAdd to word list\nAdd to word list\nMANAGEMENT using fewer employees or less money in order to decrease waste, while continuing to operate effectively: Companies are downsizing, aiming to be leaner and more efficient, with demands on employees for greater productivity. With the application of lean management principles, suppliers and distributors have streamlined their processes.lean enterprise/operation/organization When it comes to costs, they pride themselves on running a lean operation.get/become leaner The pack-houses and their workers have had to become leaner. lean retailers/suppliers\nif a period of time is lean, there is not enough money or business at that time: lean period/times/years Funding has been increased to some programs suffering from several years of lean budgets.\nif costs, goods for sale, materials, or quantities of workers are lean, they are very low, or kept as low as possible: Cold weather across the U.S. signaled a surge in demand for natural gas products at a time when inventories are uncomfortably lean. Working quickly and cheaply, with lean staffs and even leaner budgets, contract manufacturers have long played a supporting role in the computer business.\nleanness noun [ U ]\nLeanness means eliminating all waste, including time, and ensuring a smooth and predictable output."}