{"id":209960,"name":"learning","type":"noun","us_sound":"ˈlɝː.nɪŋ","us_link":"../audio/l/learning.mp3","uk_sound":"ˈlɜː.nɪŋ","uk_link":"../audio/l/ukldriv030.mp3","content":"Add to word list\nAdd to word list\nB2 [ U ] the activity of obtaining knowledge: This technique makes learning fun. These online learning environments are called virtual universities. For me it was a great learning experience . The role of any assessment will depend on the learning objectives being pursued.\n[ C or U ] knowledge or a piece of information obtained by study or experience: His friends praised his generosity, wit, and learning. I am already incorporating some of these learnings into my work and getting better results.\nMore examplesFewer examplesI'm afraid anything that involves language learning has always defeated me.Some students have a more analytical approach to learning.The idea with young children is to integrate learning with play.Children are encouraged to take an investigative approach to learning.I prefer teaching methods that actively involve students in learning.A lot of really key learnings can come out of these discussions with the owners.\nSMART Vocabulary: related words and phrases\nLearning & knowing\nabsorptive capacity\nacquirable\nacquire\nacquisition\nassimilate\nbone\nfamiliar\nhit the books idiom\nminor\nmislearn\nmug (something) up\nnon-academic\nnon-library\nrecognition\nshadow\nsubspecialty\nswot up (something)\nteachable\nthose\nuncultivated\nSee more results »\nAdd to word list\nAdd to word list\nthe activity of getting knowledge: This technique makes learning fun.\nAdd to word list\nAdd to word list\nthe process of getting an understanding of something by studying it or by experience: Knowledge and learning are essential factors for achieving successful outcomes. Continuous learning and acquiring new skills are pivotal for sustaining achievements. See also\naction learning\ndistance learning\ne-learning\nlifelong learning\norganizational learning\nworkplace learning"}