{"id":209952,"name":"learn","type":"verb","us_sound":"lɝːn","us_link":"../audio/l/learn.mp3","uk_sound":"lɜːn","uk_link":"../audio/l/ukldriv027.mp3","content":"Add to word list\nAdd to word list\nA1 [ I or T ] to get new knowledge or skill in a subject or activity: They learn Russian at school. \"Can you drive?\" \"I'm learning.\"learn about I've learned a lot about computers since I started work here. [ + to infinitive ] I'm learning to play the piano. [ + question word + to infinitive ] First you'll learn (how) to use this machine.\nThesaurus: synonyms, antonyms, and examples\nto learn somethinglearnI'm learning how to play the piano.studyI'm studying Italian right now.masterShe lived in Italy for several years but never quite mastered the language.pick upWhen you live in a country, you soon pick up the language.familiarize yourself withHe prepared for the interview by familiarizing himself with the company's work.get the hang of something\"I've never used this software before.\" \"Don't worry, you'll soon get the hang of it.\"\nSee more results »\nB1 [ T ] to make yourself remember a piece of writing by reading it or repeating it many times: I don't know how actors manage to learn all those lines.learn something by heart We were told to learn Portia's speech by heart (= be able to say it from memory) for homework.\nB2 [ I or T ] to start to understand that you must change the way you behave: She'll have to learn that she can't have everything she wants.learn to She soon learned not to contradict him.learn from your mistakes He's not afraid to learn from his mistakes.\nB1 [ I or T ] to be told facts or information that you did not know: learn of We were all shocked to learn of his death. [ + (that) ] I later learned (that) the message had never arrived.learn about I only learned about the accident later.\nMore examplesFewer examplesMy daughter is just starting to learn how to do joined-up writing at school.Every week our French teacher gives us a list of vocabulary to learn.My youngest child is learning to ride a bike.We learned about the geography of Australia.You're going to have to learn to control your temper.\nSMART Vocabulary: related words and phrases\nLearning & knowing\nabsorptive capacity\nacquirable\nacquire\nacquisition\nassimilate\nbone\nfamiliar\nhit the books idiom\nminor\nmislearn\nmug (something) up\nnon-academic\nnon-library\nrecognition\nshadow\nsubspecialty\nswot up (something)\nteachable\nthose\nuncultivated\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRemembering, reminding and reminders\nUnderstanding and comprehending\nIdioms\nlearn a/your lesson\nlearn to live with something\nAdd to word list\nAdd to word list\nto get knowledge or understanding of facts or ideas or of how to do things: [ T ] We’re learning algebra. [ I ] He’s not much of a cook, but he’s learning. [ I ] Parents learned of the budget cuts in a letter from the school superintendent. [ I ] I hope you’ll learn from your mistakes . [ + to infinitive ] I learned to drive when I was 16. [ + question word ] First you must learn how to use this computer. learner noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈlɜr·nər/\na fast/slow learner Idioms\nlearn a lesson\nlearn something the hard way"}