{"id":209991,"name":"least","type":"adverb","us_sound":"liːst","us_link":"../audio/l/least.mp3","uk_sound":"liːst","uk_link":"../audio/l/uklearn007.mp3","content":"Add to word list\nAdd to word list\nB1 less than anything or anyone else; the smallest amount or number: This group is the least likely of the four to win. Disaster struck when we least expected it. It was the answer she least wanted to hear. I like the green one least of all. He's the relative I like (the) least. No one believed her, least of all (= especially not) the police. They refused to admit her, not least because (= there were several reasons but this was an important one) she didn't have her membership card with her.\nMore examplesFewer examplesThat must be the colour I like least in the whole world!If I only had one course and no drinks, I ought to pay least, surely?Marilyn is the least vain person I know - she's convinced she's ugly!Which of these outfits do you think cost least?Michael, you hardly got any notes right - it's easy to see which of you three has practised least this week.\nSMART Vocabulary: related words and phrases\nMaximum and minimum\n(at) full steam idiom\n(at) full stretch idiom\nat least idiom\nbare\ncredit limit\nflat chat\nflat out phrase\ngive a hundred percent idiom\nlimit\nmass\nmax out\nmaximal\nmaximally\nmaximum\nmin.\npeak\npercent\nthe bare minimum phrase\nthe full monty\nutmost\nSee more results »\nGrammar\nLeast, the least, at leastWe use the quantifier least to talk about quantities, amounts and degree. (The) least is the superlative form of little. …\nIdioms\nat least\nit's the least I can do\nthe least someone can/could do\nleast said soonest mended\nnot in the least\nnot the least\nAdd to word list\nAdd to word list\nless than anything or anyone else; (of) the smallest amount or number; superlative oflittle : I’m not the least bit concerned. That’s the answer I least wanted to hear. Which car costs the least? Idioms\nat least\nleast of all\nthe least someone can do"}