{"id":209968,"name":"lease","type":"verb","us_sound":"liːs","us_link":"../audio/l/lease.mp3","uk_sound":"liːs","uk_link":"../audio/l/uklearn002.mp3","content":"Add to word list\nAdd to word list\nto make a legal agreement by which money is paid in order to use land, a building, a vehicle, or a piece of equipment for an agreed period of time: The building's 60 units are currently leased to students of the university. [ + two objects ] It was agreed they would lease the apartment to him/lease him the apartment.\nSMART Vocabulary: related words and phrases\nRenting & hiring\naccount\ncharge account\ncharter\nchartered\ncredit account\ndeposit\nhire\nhire purchase\nhire something/someone out\nhp\ninstallment plan\nlayaway\nlessee\nlessor\nrent\nrental\nthe never-never\nYou can also find related words, phrases, and synonyms in the topics:\nRenting property\na legal agreement in which you pay money in order to use a building, piece of land, vehicle, etc. for a period: He has the house on a long lease. The lease runs out/expires in two years' time. We signed a three-year lease when we moved into the house.\nSMART Vocabulary: related words and phrases\nRenting property\nabsentee landlord\nBTL\nco-tenant\nfiefdom\nflatshare\nkey money\nleasehold\nlessee\nletting\nlodge\nlodger\npeppercorn rent\nrent strike\nrental\nrenter\nsitting tenant\nsubtenant\ntenancy\ntenanted\nuntenanted\nSee more results »\nAdd to word list\nAdd to word list\nto use or allow someone else to use land, property, etc. for an agreed period of time in exchange for money: I leased my new car instead of buying it. lease noun [ C ] us\nYour browser doesn't support HTML5 audio\n/lis/\nThe lease on this office expires in two years.\nAdd to word list\nAdd to word list\nan agreement to pay money in order to use land, a building, a vehicle, or a piece of equipment for a particular period of time: The company signed a lease for the property in December. The original tenant remains liable throughout the entire term of the lease.a lease expires/runs out The lease expires in 2026.a 10-/20-/30-year lease The company is trying to extend its 30-year lease (with 24 years left to run). a lease agreement/contract/payment a long-term/short-term lease See also\naircraft lease\nbuilding lease\nderivative lease\ndry lease\nequipment lease\nfinance lease\noperating lease\nrepairing lease\nstore lease\nwet lease noun\nto agree to pay money in order to use land, a building, a vehicle, or a piece of equipment for a particular period of time: lease sth (from sb) The firm recently made plans to lease another 8,000 square feet from the property company.\nto make an agreement by which someone pays you money in order to use land, a building, a vehicle, or a piece of equipment for a particular period of time: lease sth (out) (to sb) They are keen to lease out the aircraft to private companies.lease sb sth He gave equity to the firms that leased him office equipment. See also\nlessee\nsublease noun\nsublet\nPhrasal verb\nlease sth back (to sb)"}