{"id":210040,"name":"leave","type":"verb","us_sound":"liːv","us_link":"../audio/l/leave.mp3","uk_sound":"liːv","uk_link":"../audio/l/uklearn013.mp3","content":"leave verb\n(GO AWAY)\nAdd to word list\nAdd to word list\nA1 [ I or T ] to go away from someone or something, for a short time or permanently: I'll be leaving at five o'clock tomorrow. He left the house by the back door. She left the group of people she was with and came over to speak to us. The bus leaves in five minutes.\nMore examplesFewer examplesI didn't leave the office until eight o'clock last night.A young girl was crying, protesting that she didn't want to leave her mother.We gathered our things together and left quickly.Soon we had left the river estuary and were heading towards the open sea .Your flight to Perth will leave from Terminal 4.\nSMART Vocabulary: related words and phrases\nDeparting\nabandon\nabandon ship\nabandonment\nabsquatulate\nbackward\ngone\nmove\np.o.q.\npeel away/off\npiss off\npull\npull something off\npush along\nsea\nstrike\nturf something out\nvacate\nvamoose\nwalk\nwalk off (somewhere)\nSee more results »\nleave verb\n(NOT TAKE)\nA2 [ T ] to not take something or someone with you when you go, either intentionally or by accident: Hey, you've left your keys on the table. Can I leave a message for Sue? Why don't you leave the kids with me on Friday?\nMore examplesFewer examplesGuests are advised not to leave any articles of value in their hotel rooms.Never leave your luggage unattended.It's considered good manners in some societies to leave a little food on your plate.She absent-mindedly left her umbrella on the bus.That's funny - I'm sure I left my keys here.\nSMART Vocabulary: related words and phrases\nDeparting\nabandon\nabandon ship\nabandonment\nabsquatulate\nbackward\ngone\nmove\np.o.q.\npeel away/off\npiss off\npull\npull something off\npush along\nsea\nstrike\nturf something out\nvacate\nvamoose\nwalk\nwalk off (somewhere)\nSee more results »\nleave verb\n(REMAIN)\nA2 If something leaves something else, a part or effect of it stays after it has gone or been used: His shoes left muddy marks on the floor. [ + two objects ] If I give you €50 that won't leave me enough cash to pay the bill. [ + obj + adj ] Far from improving things, the new law has left many people worse off (= they are now in a worse situation) than before.\nB2 [ T ] If you leave something in a particular condition, you do not touch it, move it, or act to change it in any way, so that it stays in the same condition: Leave that chair where it is. He left most of his dinner (= did not eat much of it). [ + obj + adj ] The family were left (= became and continued to be) homeless. I'll have to go back - I think I've left the iron on. You can leave the window open. Leave your sister alone (= stop annoying her).\nC1 [ T + obj + -ing verb ] If you leave something or someone doing something, he, she, or it is still doing it when you go away: I left the children watching television. He left the engine running.\nSMART Vocabulary: related words and phrases\nAffecting and influencing\nacross-the-board\naffect\napplicability\nbe/fall under someone's influence/spell idiom\nbear on something\nbearing\nconflict\near\ninstrumental\ninstrumentality\ninstrumentally\ninterinfluence\ninvolve\npen\nrail\nsphere of influence\nspill\nspill over\nsportswashing\nstart (something) off\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nKeeping and staying the same\nDeparting\nleave verb\n(NOT USE ALL)\nA2 [ T ] to not eat or use all of something: They'd eaten all the cake, but they'd left some sandwiches. Make sure you leave enough hot water for the rest of us. be left (also be left over)\nIf something or someone is left, they remain after the rest of the things or people have gone or been used: Are there any cookies left?\nSee more have something left\nIf you have something left, you have some remaining after the rest has been used, eaten, etc.: I never have any money left at the end of the month.\nSee more\nSMART Vocabulary: related words and phrases\nStaying and remaining\nabrupt halt\nbe left phrase\ncloseted\nhalt\nhang\nnon-migrant\nnon-rotating\nnon-tenured\noutstay\noverstay\nsit\nspot\nstay behind\nstay in\nstay on\nstay put idiom\nstick\nstick around\nsticky\nwait something out\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThings remaining\nleave verb\n(STOP)\nA1 [ T ] to stop doing something, or to leave a place because you have finished an activity: Many children leave school at 16. He left work in June for health reasons. She left home (= stopped living with her parents) at 18. Could we leave that subject (= stop discussing that subject) for the moment and go on to the next item on the agenda?\nMore examplesFewer examplesShe walked straight into a well-paid job after leaving university.I never get to see her now that she's left the company.He left the priesthood to get married.My contract specifies that I must give a month's notice if I leave my job.After I leave college, I want to travel round the world.\nSMART Vocabulary: related words and phrases\nCausing something to end\nabandon\nabandonment\nall good things (must) come to an end idiom\nand have done with it idiom\nbe over the hump idiom\nbrake\ncure\nfreeze\nhalt\nhang\njack something in\nkill something stone-dead idiom\nknock\nlid\nsnap\nsnuff something out\nstamp on something\nstamp something out\nstanch\nstaunch\nSee more results »\nleave verb\n(END RELATIONSHIP)\nB1 [ T ] to end a relationship with a husband, wife, or partner and stop living with them: I'll never leave you. She left her husband for a younger man.\nSMART Vocabulary: related words and phrases\nRelationships: ending & divorce\naffiliation order\nannul\nannulment\nbreak something up\nbreak up with someone\nchild support\nchuck\ndump\nghost\ngive someone the elbow idiom\ngive someone the heave-ho idiom\ngive someone the push idiom\ngo off with someone\ngrow apart\nrebound\nrun out on someone/something\nseparate\nseparation\nsplit up\nthrow\nSee more results »\nleave verb\n(WAIT)\nC2 [ T ] If you leave (doing) something, you wait before you do it: I'll leave these letters till Monday (= write them on Monday). Don't leave it too late (= don't wait too long to do it). [ + -ing verb ] They left booking their holiday till/to the last minute.\nSMART Vocabulary: related words and phrases\nWaiting\nawait\nbacklogged\nbang around\nbreath\nhang\nhang around\nhover\nloiter\nlounge\nlurking\nmark time idiom\nmill\nmill around\ntime and tide wait for no man idiom\ntwiddle\ntwiddle your thumbs idiom\nwait\nwait and see idiom\nwait around\nwaiting room\nSee more results »\nleave verb\n(AFTER DEATH)\n[ T ] To leave a wife, husband, or other close family member is to die while these family members are still alive: He left a wife and two children.\nC2 [ + two objects ] If you leave something that you own to someone, you say they should receive it when you die: He left his nieces all his money./He left all his money to his nieces.\nSMART Vocabulary: related words and phrases\nDeath and dying\nbereave\nbite\nbleed out\nbuy the farm idiom\ncadaveric\ndeath toll\ndepart this life idiom\nfatality\nghost\nmacabre\npredecease\nraise\nremains\nsnuff\nstarvation\nsuicidally\nterminally\nthose whom the gods love die young idiom\ntoll\nwatery\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInheriting & bequeathing\nleave verb\n(GIVE RESPONSIBILITY)\n[ T ] to allow someone to make a choice or decision about something, or to make someone responsible for something: I left the decision (up) to her. [ + to infinitive ] I left it to her to make the decision. Leave it (= the problem) with me, I'll see what I can do. I'll leave it to chance (= wait and see what happens without planning).\nSMART Vocabulary: related words and phrases\nAllowing and permitting\nadmission\nadmit of something\nallow of something\nallowable\nauthorization\nauthorize\nclearance\nconsent\nentrance\ngiven the chance/choice idiom\ngreen-light\nhall pass\nhospital admission\nimprimatur\nliberty\nrelicense\nrelicensure\nsay-so\nsecurity clearance\nsee your way (clear) to doing something idiom\nSee more results »\nGrammar\nForget or leave?We sometimes use forget when we don’t remember to bring something with us: …\nIdioms\nbe left holding the baby\nleave someone be\nleave someone cold\nleave someone hanging\nleave someone in the lurch\nleave someone out in the cold\nleave someone standing\nleave someone to their own devices\nleave a bad taste in someone's mouth\nleave a lot to be desired\nMore idioms\nleave go/hold of something\nleave it at that\nleave it out!\nleave no stone unturned\nleave well alone\nPhrasal verbs\nleave something aside\nleave something/someone behind\nleave something behind\nleave something for/to someone\nleave something/someone off something\nleave off (something/doing something)\nleave off!\nleave someone/something out\nleave noun\n(HOLIDAY)\nC2 [ U ] time allowed away from work for a holiday or illness: How much annual/paid leave do you get? She's (gone) on leave (= holiday). I've asked if I can take a week's unpaid leave. leave of absence\ntime away from your work or studies that is formally given to you by your organization: Luckily I was allowed to take a leave of absence now and then to work on the movies.\nSee more\nMore examplesFewer examplesI haven't got any leave left.He's on leave this week.I get 25 days annual leave.I need to take some leave before the end of the year.We were given an extra day's leave.\nSMART Vocabulary: related words and phrases\nTime off\nabsenteeism\nadministrative leave\nbank holiday\nBoxing Day\ncareer break\ncomp time\nescape\ngardening leave\nhartal\nhols\nlegal holiday\nmaternity leave\nnon-work\nparental leave\nshore leave\nsick\nsick day\nsick leave\nsickie\nskive\nSee more results »\nleave noun\n(PERMISSION)\n[ U ] formal permission or agreement: He did it without (my) leave. [ + to infinitive ] Did you get leave to do that?\nSMART Vocabulary: related words and phrases\nAllowing and permitting\nadmission\nadmit of something\nallow of something\nallowable\nauthorization\nauthorize\nclearance\nconsent\nentrance\ngiven the chance/choice idiom\ngreen-light\nhall pass\nhospital admission\nimprimatur\nliberty\nrelicense\nrelicensure\nsay-so\nsecurity clearance\nsee your way (clear) to doing something idiom\nSee more results »\nleave noun\n(GOODBYE)\ntake leave\nto say goodbye: He decided the time had come to take leave of his home town.\nSee more\nIdioms\ntake leave of your senses\nwithout so much as a by-your-leave\nleave verb\n(GO AWAY)\nAdd to word list\nAdd to word list\n[ I/T ] to go away from someone or something that stays in the same place: [ I ] I’ll be leaving tomorrow. [ T ] He left the house by the back door. [ I/T ] The bus leaves (the station) in five minutes.\n[ I/T ] If you leave a job, you stop working at a place: [ T ] He left work in June.\n[ I/T ] If you leave home, you stop living in your parents’ home.\nleave verb\n(NOT TAKE)\n[ T ] to not take something with you: I mistakenly left my checkbook at home. Hurry up or you’ll get left behind the other hikers.\n[ T ] You can leave something somewhere for a purpose: I’ve left dinner for you on the stove.\n[ T ] If you leave something to someone, you have arranged for that person to receive it after you die: She left all her money to her children.\nleave verb\n(CAUSE TO STAY)\n[ T ] to allow or cause something to stay in a particular place, position, or state: The dog left muddy tracks on the carpet. He left a message for me at the office. Leave the window open. Her rudeness left us all speechless. He left the engine running.\n[ T ] If you leave some activity that involves work, you wait before you do it: I’ll leave the cleaning for tomorrow.\nleave verb\n(MAKE AVAILABLE)\n[ T ] to make something available after some part has been taken or used: There are only four cookies – please leave one for me. Five from twelve leaves seven (= Seven is the result of taking five from twelve). left (over)\nIf something is left (over), it was not previously used or eaten: There’s some pasta left over from dinner.\nleave verb\n(GIVE RESPONSIBILITY)\n[ T ] to allow someone to make a choice or decision about something, or to make someone responsible for something: Leave it to me – I’ll see what I can do. I’ll leave it up to you to choose the gift. Idioms\nleave a bad taste (in your mouth)\nleave a lot to be desired\nleave someone cold\nleave someone hanging\nleave someone high and dry\nleave someone in the lurch\nleave it at that\nleave your mark\nleave someone to his or her own devices\nleave well enough alonePhrasal verbs\nleave someone/something alone\nleave behind something/someone\nleave out something/someone\nleave noun [U]\n(VACATION)\ntime permitted away from work, esp. for a medical condition or illness or for some other special purpose: maternity leave\nleave noun [U]\n(PERMISSION)\nfml permission to do something: He took it without my leave.\nAdd to word list\nAdd to word list\nWORKPLACE, HR a period of time that someone is allowed away from work for holiday, illness, or another special reason: take leave from sth I'm taking 5 days' unpaid leave from work to go to the wedding.be/go on leave from sth Benefits will need to be adjusted when an employee is on leave from their job. The appointee will be entitled to 38 days of annual leave. Higher maternity pay and a longer leave entitlement are likely outcomes of the review. adoption/bereavement/child-care leave educational/medical leave paid/unpaid leave\nformal agreement or permission to do something: be given/granted leave to do sth She has been granted leave to remain in the country. No application should be issued without my leave.\nbe placed/put on leave\nWORKPLACE, HR to be told to take time away from work, usually because you have been accused of doing something wrong: The director of financial aid was recently placed on leave for accepting consulting fees from a loan company.\nleave to appeal\nLAW permission to formally ask for a legal or official decision to be changed: The defendant was given 14 days' leave to appeal against the decision. See also\nadministrative leave\ncompassionate leave\nfamily leave\ngardening leave\nmaternity leave\nparental leave\npaternity leave\nsabbatical\nsick leave\nspecial leave\n[ I, T ] to go away from a place or a situation: I'm leaving work early this afternoon. What time does the bus leave? They left for Paris last night.\n[ I, T ] to go away from a place permanently: She left her home country many years ago.\n[ I, T ] to stop working for an organization or company, or stop attending a school, university, etc. : She left to go to a rival company. Ben Harris? He left about a month ago. How old were you when you left school? Compare\nretire\n[ T ] to not use all of something: Is there any money left in last year's budget?.\n[ T ] to do something later that you could do immediately: He always leaves writing his reports till the very last moment. You should try to decide which tasks need to be done urgently and which ones can be left.\n[ T ] to arrange for someone to receive something after you die: His aunt left him a lot of money. He left the house to this three children.\nleave sb alone\nto stop speaking to or annoying someone: Leave me alone! I'm trying to work. Phrasal verbs\nleave sb/sth behind\nleave behind sth; leave sth behind\nleave sth for/to sb\nleave sb/sth out\nbe left over"}