{"id":210046,"name":"leavening","type":"noun","us_sound":"ˈlev.ən.ɪŋ","us_link":"../audio/l/cdo0123usleav1140.mp3","uk_sound":"ˈlev.ən.ɪŋ","uk_link":"../audio/l/cdo0123ukleav1313.mp3","content":"leavening noun\n(FOOD)\nAdd to word list\nAdd to word list\n[ C or U ] a substance added to a cake, bread, etc. to make it swell and become lighter, especially a chemical powder or yeast : Tip the flour and leavening into the mixture. The leavenings and amount of flour will affect how your cookies turn out.\n[ U ] the process in which a substance added to a cake, bread, etc. causes it to swell and to become lighter: Soda bread contains baking powder to help with leavening. This creates air cells in the batter to allow leavening to occur.\nMore examplesFewer examplesShe says the vinegar helps the leavening, and also keeps the bread fresher for a bit longer.Baking powder is a leavening agent used in baking.In cakes, eggs serve as a leavening agent, making them light and fluffy.\nSMART Vocabulary: related words and phrases\nFlour & yeast\nall-purpose flour\nbaker's yeast\nbesan\nblue corn\ncassava\nfarinha\nflour\nfloury\ngluten\ngraham flour\nmother\nnooch\nnutritional yeast\noatmeal\npatent flour\nsemolina\nsourdough\nstoneground\nunbolted\nwheatmeal\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCookery terms\nleavening noun\n(SITUATION)\n[ C or U ] something that is added to a situation and improves it, for example by making it more interesting, less serious or difficult, or more attractive: The story has a useful leavening of insider knowledge. The scene was included in the film as necessary leavening.\nMore examplesFewer examplesWork was burdensome without the leavening of play.Unfortunately, there are no illustrations in the book - despite its serious themes, a little leavening would help.\nSMART Vocabulary: related words and phrases\nMaking things better\nadd salt to something idiom\nallay\nalleviate\nalleviation\nameliorate\ncultivate\nlevelling up\nlighten\nliven (something) up\nlubricate\nmake a difference idiom\nmake a world of difference idiom\nrectify\nremedial\nrepair\nrepolish\nrestructure\nrevamp\nrevitalize\nsharpen\nSee more results »\nRelated word\nleaven"}