{"id":210163,"name":"lecture","type":"noun","us_sound":"ˈlek.tʃɚ","us_link":"../audio/l/lecture.mp3","uk_sound":"ˈlek.tʃər","uk_link":"../audio/l/uklearn027.mp3","content":"Add to word list\nAdd to word list\nB1 a formal talk on a serious subject given to a group of people, especially students: We went to a lecture on Italian art. Who's giving the lecture this afternoon? Compare\nseminar\nThesaurus: synonyms, antonyms, and examples\na talktalkShe will give a talk on keeping kids safe on the internet.lectureThe lecture is entitled \"War and the Modern American Presidency\".presentationWe were given a presentation of progress made to date.speechYou might have to make a speech when you accept the award.addressHe took the oath of office then delivered his inaugural address.orationIt was to become one of the most famous orations in American history.\nSee more results »\nan angry or serious talk given to someone in order to criticize their behaviour: My dad gave me a lecture on the evils of alcohol last night.\nMore examplesFewer examplesAt the end of the lecture, I'd like all the students to divide into small discussion groups.I couldn't help drifting off in the middle of that lecture - it was so boring!I got the fidgets halfway through the lecture.His lecture was complicated and difficult to follow.I didn't gather much from his lecture.\nSMART Vocabulary: related words and phrases\nClasses & courses\nacademic year\naccess course\nadvanced\nAdvanced Placement\nasynchronous\nfield trip\ngrind\nhomework\nHyFlex\nimmersion course\ninterdisciplinarity\ninterdisciplinary\nnon-class\nnon-degree\nopen admissions\nopen classroom\nplacement\nprep\nwork placement\nworkshop\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLecturing & addressing\nC2 [ I ] to give a formal talk to a group of people, often at a college or university: For ten years she lectured in law. She travelled widely in North America, lecturing on women's rights.\n[ T ] to talk angrily or seriously to someone in order to criticize their behaviour: His parents used to lecture him on his table manners.\nSMART Vocabulary: related words and phrases\nLecturing & addressing\nco-present\ndiscourse\neunoia\nextemporize\nfloor\njawbone\nlead off\nlightning talk\nmaiden speech\nmonologue\nonto\noratorically\npresentation\nsermon\nsermonize\nspeak\nspeech\nspeechify\ntalk at someone\nvalediction\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChastising & rebuking\nTalking angrily\nlecture noun [C]\n(FORMAL TALK)\nAdd to word list\nAdd to word list\na formal, prepared talk given to a group of people, esp. students: a lecture on astronomy\nlecture noun [C]\n(CRITICISM)\na serious talk given to criticize someone or give someone advice: She gave him a lecture about his table manners. lecturer noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈlek·tʃər·ər/\nlecture verb [I/T]\n(TALK FORMALLY)\nto give a formal, prepared talk to a group of people, esp. students: [ I ] She’s lecturing on the geology of the region.\nlecture verb [I/T]\n(CRITICIZE)\nto give someone a serious talk to criticize or give advice to that person: [ T ] He lectured me on the need to keep accurate records."}