{"id":210297,"name":"leg","type":"noun","us_sound":"leɡ","us_link":"../audio/l/leg.mp3","uk_sound":"leɡ","uk_link":"../audio/l/ukledge021.mp3","content":"leg noun [C]\n(PART)\nAdd to word list\nAdd to word list\nA1 one of the parts of the body of a human or animal that is used for standing or walking: My legs were tired after so much walking. He broke his leg skiing. The horse broke its front leg in the fall.\nMichael Htten/EyeEm/GettyImages\nthe part of a piece of clothing that you put your leg in: He rolled up his trouser legs and waded into the water.\none of the thin vertical parts that support an object: a chair/table leg\nMore examplesFewer examplesRobson injured his leg in the second half of the match and had to be carried off.His leg was broken in two places.She likes to wear short skirts to show off her legs.I've been sitting with my legs crossed for so long, my right leg has gone numb.The doctor said I was to keep my leg elevated.\nSMART Vocabulary: related words and phrases\nThe leg\nAchilles tendon\nappendage\nappendicular\nastragalus\nbipedal\ncrural\ncruris\nhamstring\nleggy\npectineus\nperoneal\nperoneus\npes anserinus\npiriformis\nshank\nsubsartorial\nsubtalar\nsurae\nsural\ntalocalcaneal\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe legs & feet of non-human animals\nParts of clothes\nPhysical supports and supporting\nFurniture & fittings - general words\nleg noun [C]\n(STAGE)\na particular stage of a journey, competition, or activity: He has tickets for the first leg of the NCAA Men's Hockey Championship. The last leg of the race was Paris to London.\nSMART Vocabulary: related words and phrases\nStages & phases\nearly-stage\nearly-term\nhome run\nhome straight\nin phase/out of phase idiom\ninterstage\nlandmark\nmulti-step\nmultiphasic\npartway\nperiod\nphase\npoint\nshovel-ready\nstage\nstepping stone\ntertiary\ntwilight\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParts & stages of competitions\nleg noun [C]\n(CRICKET)\n[ U ]\n&#160; sports\n&#160; specialized in cricket, the left side of the field for a right-handed batter (= the player hitting the ball) or the right side of the field for a left-handed batter: He was trying to play the ball to leg but missed it and was out lbw. Synonym\nlegside\nSMART Vocabulary: related words and phrases\nCricket\n12th man\nbails phrase\nball-tampering\nbatswoman\nbatting average\nbowl someone out\nbreak\ncut\ndeclare\ndeep\nglance\nlength\nmaiden\npavilion\nsix\ntest match\nuppish\nuppishly\nwalk\nwicketkeeper\nSee more results »\nIdioms\nget your leg over\ngive someone a leg up\nhave a leg up on someone\nhave legs\nleg before wicket\nnot have a leg to stand on\npull someone's leg\nleg it\nUK informal to run away especially in order to escape from something: They legged it round the corner when they saw the police coming.\nSee more Phrasal verb\nleg something out\nleg noun\n(BODY PART)\nAdd to word list\nAdd to word list\n[ C/U ] one of the parts of a human or animal body that is used for standing or walking, or one of the thin, vertical parts on which a piece of furniture stands: [ C ] He broke his leg skiing. [ C ] The table has carved legs. [ U ] We had leg of lamb for dinner.\n[ C/U ] The leg of a piece of clothing is the part you put your leg into.\nleg noun\n(STAGE)\n[ C ] a part of a trip, competition, or activity that has several stages: the last leg of the race\nleg noun\n(SIDE)\n[ C ]\n&#160; geometry either one of the two sides that form the angle of 90° in a right triangle\nAdd to word list\nAdd to word list\n[ C ]\n&#160; TRANSPORT one of the parts of a long journey: the first/final leg On the final leg of the flight we sat in economy class.\nnot have a leg to stand on\nto not have any way of supporting your opinion or defending your position on something: The State Department doesn't have a leg to stand on if it's going to contradict its own analysis.\nhave legs informal\nan idea or suggestion that has legs is considered to be something worth developing further: We're looking at the proposed legislation and we think it's got legs."}