{"id":210298,"name":"legacy","type":"noun","us_sound":"ˈleɡ.ə.si","us_link":"../audio/l/legacy.mp3","uk_sound":"ˈleɡ.ə.si","uk_link":"../audio/l/ukledge022.mp3","content":"Add to word list\nAdd to word list\nC2 money or property that you receive from someone after they die: An elderly cousin had left her a small legacy.\nC2 something that is a part of your history or that remains from an earlier time: The Greeks have a rich legacy of literature. The war has left a legacy of hatred.\nMore examplesFewer examplesThe scars are the legacy of chicken pox.I received a small legacy from an aunt.The novel will be his legacy.Their argument left a legacy of bitterness.She left a legacy to the hospice.\nSMART Vocabulary: related words and phrases\nInheriting & bequeathing\nadvance directive\nassign\nbeneficiary\nbequeath\nbequest\ncadger\nexecutor\nheir\nheir apparent\nheiress\nheirless\ninherit\ninheritance\npartible\npass something down\npatrimony\npond life\npond scum\ntestament\ntestate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHistory - general words\nAdd to word list\nAdd to word list\nsomething that is a result of events in the past: the bitter legacy of a civil war\nA legacy is also money or property left to a person by someone who has died.\nAdd to word list\nAdd to word list\na situation that has developed as a result of past actions and decisions: legacy of sth The policies of the last ten years are responsible for the legacy of huge consumer debt. The President's greatest legacy was the message he always gave that humans can improve their lives if they try. The success of the Olympic Games left a lasting legacy of benefit to the city.\nLAW money or property that a person or organization receives from someone who has died: Many people want to leave a legacy to a charity they have supported all their lives. See also\ndemonstrative legacy\ngeneral legacy\nresiduary legacy\na legacy product or system is one that is no longer available to buy or no longer used very often, but that is still used by some people or companies: legacy computer/information systems"}