{"id":210300,"name":"legal","type":"adjective","us_sound":"ˈliː.ɡəl","us_link":"../audio/l/legal.mp3","uk_sound":"ˈliː.ɡəl","uk_link":"../audio/l/ukledge023.mp3","content":"legal adjective\n(LAW)\nAdd to word list\nAdd to word list\nB2 connected with the law: legal advice a legal obligation/requirement legal status your legal rights legal action/proceedings my legal representatives (= my lawyers)\nB2 allowed by the law: Is abortion legal in your country? Opposite\nillegal\nMore examplesFewer examplesYou have a legal obligation to ensure your child receives a proper education.It's an organization that offers free legal advice to people on low incomes.She won the court case, but she had to pay an enormous amount in legal fees.Channel 4 is running a series on the unfairness of the legal system.Unless the money is returned, we shall shortly be contacting our legal department.\nSMART Vocabulary: related words and phrases\nLegal & illegal\nbang to rights idiom\nbootleg\nchargeable\nconcealed carry idiom\ncontroverted election\ncriminally\nillegality\nimproper\nlegality\nlegitimately\nlicensed\nlicit\nlicitly\nnon-criminal\nshady\ntreasonable\nunlawful\nunsanctioned\nvalidity\nvalidly\nSee more results »\nlegal adjective\n(PAPER)\nUS used to refer to a standard size of paper in the US, 8.5 inches by 14 inches: Your poster should be on letter or legal size paper.\nSMART Vocabulary: related words and phrases\nPublishing: paper & stationery\nA3\nA5\nacid-free\nassembler\nbackspace\nballpoint pen\nchalk\nfoolscap\nfountain pen\ngift wrap\ngrammage\nhanging chad\nnotepad\npropelling pencil\npulp\nquill\nquire\nqwerty\nream\nvellum\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMass, area, weight & volume in general\nIdiom\nmake legal history\nAdd to word list\nAdd to word list\nconnected with or allowed by the law: the legal profession the legal right to vote legally adverb us\nYour browser doesn't support HTML5 audio\n/ˈli·ɡə·li/\nThe contract is legally binding.\nAdd to word list\nAdd to word list\nconnected with the system of law within a country or area: The department is seeking legal advice on the permitted development rule. There isn't a formal legal agreement that binds us together as a company.a legal battle/dispute Two years of legal battles and delay sent the project's cost spiraling. legal fees\nallowed by law: The report fails to make a distinction between legal and illegal immigrants. Regulators are reviewing the purchase to make sure it is legal."}