{"id":210413,"name":"legislation","type":"noun","us_sound":"ˌledʒ.əˈsleɪ.ʃən","us_link":"../audio/l/legislation.mp3","uk_sound":"ˌledʒ.ɪˈsleɪ.ʃən","uk_link":"../audio/l/uklegal013.mp3","content":"Add to word list\nAdd to word list\nC2 a law or set of laws suggested by a government and made official by a parliament: [ + to infinitive ] The government has promised to introduce legislation to limit fuel emissions from cars.\nMore examplesFewer examplesThere are some ambiguities in the legislation.The effects of this legislation will extend further than the government intends.This legislation is designed to stimulate the faltering economy.Several governments have adopted tough new anti-terrorist legislation in the wake of the attacks.Such unpopular legislation is unlikely to be introduced before the next election.\nSMART Vocabulary: related words and phrases\nRules & laws\nadministrative\nadmiralty\nanti-bribery\nanti-regulatory\nanti-sodomy\nbinding\nblue law\ncivil law\nhumanitarian law\ninvocation\njuridical\njuridically\njuristic\nland tenure\nprovision\nRafferty's rules\nself-regulation\nthe rule of law\nuncanonical\nunenforceable\nSee more results »\nAdd to word list\nAdd to word list\npolitics &amp; government a law or set of laws that is being created: New legislation offers a tax break for young families.\nAdd to word list\nAdd to word list\nrules or laws relating to a particular activity that are made by a government: 75% of Americans support legislation that includes improved fuel-economy rules. The Data Protection Act is a piece of legislation aimed at protecting the privacy of the individual.push for/introduce/pass legislation Legislation was passed in the House earlier this month to double the National Science Foundation grants.proposed/new/tougher legislation Under the proposed legislation, businesses will have to provide detailed evidence of how they pay themselves.legislation to do sth Environmentalists are fighting for legislation to clean up the city-owned ports.\nthe process of making rules or laws: The purpose of think tanks is to have an impact on policy and legislation. See also\ndelegated legislation"}