{"id":210685,"name":"lend","type":"verb","us_sound":"lend","us_link":"../audio/l/lend.mp3","uk_sound":"lend","uk_link":"../audio/l/ukleisu008.mp3","content":"lend verb\n(GIVE)\nAdd to word list\nAdd to word list\nA2 [ T ] to give something to someone for a short period of time, expecting it to be given back: She doesn't like lending her books. [ + two objects ] If you need a coat I can lend you one/lend one to you.\nB2 [ I or T ] If a bank or other organization lends money, it gives money to someone who agrees that they will pay the money back in the future, usually with extra money added to the original amount: The bank refuses to lend to students. [ + two objects ] The bank agreed to lend him $5,000.\nMore examplesFewer examplesVery reluctantly, I've consented to lend her my car.All right, I'll lend you the money.When the bank refused to lend us any more money we realized we'd reached the end of the road.It was most generous of you to lend me the money.Here's the book I said I'd lend you.\nSMART Vocabulary: related words and phrases\nBorrowing & lending\namortizable\namortization\nbad debt\nbonded\nborrow\nborrow something from something\nbridging loan\ncredit limit\nforeclose\nhole\nliquidator\nloan\nnon-prime\nnonaccrual\non the slate idiom\nover-borrowed\noverpay\noverpayment\npay someone/something back\nreceivership\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBanks\nlend verb\n(ADD TO)\n[ T ] If something lends a particular quality to something else, it adds that quality to it: [ + two objects ] Vases of flowers all around the room lent the place a cheerful look/lent a cheerful look to the place.formal These events lend support to the view that the law is inadequate.\nThesaurus: synonyms, antonyms, and examples\nto give something to someonegiveGive me that dirty plate.offerYour doctor should be able to offer advice.provideThis booklet provides useful information about local services.supplyThe lake supplies the whole town with water.donateFour hundred dollars has been donated to the school book fund.\nSee more results »\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nspare\nSee more results »\nlend itself to something C2 formal\nIf something lends itself to something else, it is suitable for that thing or can be considered in that way: The novel's complex, imaginative style does not lend itself to translation.\nSee more\nGrammar\nLend or borrow?Lend means ‘give something to someone for a short time, expecting that you will get it back’. The past simple and the -ed form are lent: …\nIdioms\nlend your name to something\nlend an ear\nAdd to word list\nAdd to word list\nto give something to someone for a short period of time, expecting it to be given back: Can you lend me a few dollars till payday? Idiom\nlend itself to something\nAdd to word list\nAdd to word list\n[ I or T ]\n&#160; BANKING, FINANCE if a bank or other financial organization lends money to someone, it gives them money for a period of time which they then pay back with interest: Britain's building societies chiefly lend money for house purchase.lend $5,000/£2bn/€1m, etc. to sb The Ohio Development Financing Advisory Council agreed to lend $20 million to the Port Authority.lend sb $5,000/£2bn/€1m, etc. A number of prominent businessmen are rumoured to have lent the Party over £20 million.lend to sb/sth Banks have been heavily criticized for lending to people who cannot afford the repayments.\n[ T ] to give someone something for a period of time, after which they will give it back to you: lend sb sth Can you lend me $20?lend sth to sb Her tasks included persuading stores to offer discounts or lend clothes on approval to her boss.\nto give something a quality that makes it better in some way: lend sth to sth We hope that these measures will lend stability to the economy.lend weight (to sth) February's trade figures lend weight to the Fund's less cheerful view.lend credence/credibility (to sth) Other evidence helped lend credibility to their claims.\nlend a (helping) hand\nto do something that helps a company or person: The Federal Reserve is expected to lend a hand by continuing to cut interest rates forcefully.\nlend your support (to sth)\nto support someone or something: I have lent my support to his plan for a private referendum."}