{"id":210699,"name":"length","type":"noun","us_sound":"leŋθ","us_link":"../audio/l/length.mp3","uk_sound":"leŋθ","uk_link":"../audio/l/ukleisu010.mp3","content":"length noun\n(DISTANCE)\nAdd to word list\nAdd to word list\nB1 [ C or U ] the measurement of something from end to end or along its longest side: The boat is ten metres in length. The length of the bay is approximately 200 miles. She planted rose bushes (along) the length of the fence (= the whole distance along it).\n[ C ] a piece of something such as string or pipe: a length of rope\n[ C ] a unit used in describing the distance by which a horse or boat wins a race, equal to the measurement from one end of the horse or boat to the other: We won by two lengths.\n[ C ] the distance from one end of a swimming pool to the other: She swims 40 lengths a day.\n[ C or U ]\n&#160; sports\n&#160; specialized in cricket, the distance that the ball travels before it bounces after it has been bowled (= thrown to the batter): He needs to bring his length back a bit as he's getting driven too much. I was deceived by the length of the delivery which was much fuller than I had expected.\nMore examplesFewer examplesThe impact of the crash reduced the car to a third of its original length.Application forms vary greatly in layout and length.The metre is the standard unit for measuring length in the SI system.The mountains stretch the entire length of the country.Dad, I swam a whole length of the pool underwater !\nSMART Vocabulary: related words and phrases\nMeasurements in general\naltitude\nbathymetric\nbathymetrically\nbathymetry\nbe running at something idiom\ncalibrate\ndrop\nelevation\nfactor\nknee-length\nmetric\nmetrication\nmicro\nmilli-\nscale\nsetting\ntera-\nuncalibrated\nunmeasurable\nunsized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWords meaning small pieces and amounts\nSwimming\nCricket\nlength noun\n(TIME)\nB2 [ C ] the amount of time something lasts: the length of a film/speech/play He is unable to concentrate on his work for any length of time (= for anything more than a short time). Synonym\nduration\nC1 [ C or U ] the amount of writing in a book or document: He's written books of various lengths on the subject. All of your essays will be about the same length. at length\nC2 for a long time: George went on at great length about his various illnesses.\nformal If something happens at length, it happens after a long period of time: At length, the authorities allowed her to go home.\nSee more\nMore examplesFewer examplesApplication forms vary greatly in layout and length.The children are too young for a movie of that length.How can it take that length of time to get dressed?I can't believe the length of time they spend chatting!I asked him to cut the length of his speech.\nSMART Vocabulary: related words and phrases\nMeasurements in general\naltitude\nbathymetric\nbathymetrically\nbathymetry\nbe running at something idiom\ncalibrate\ndrop\nelevation\nfactor\nknee-length\nmetric\nmetrication\nmicro\nmilli-\nscale\nsetting\ntera-\nuncalibrated\nunmeasurable\nunsized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeriods of time - general words\nGrammar\nMeasurementsWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nArea: length, width, depth and heightWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nWeight and volumeWe use the verb weigh to measure weight: …\nFrequency, speed, timeWe use many different expressions to describe frequency, speed and time. Here are some of them: …\nIdioms\ngo to great lengths\nthe length and breadth of somewhere\n-length suffix\n(DISTANCE)\nlong enough to reach the stated place: a knee-length skirt shoulder-length hair\nSMART Vocabulary: related words and phrases\nMeasurements of length & distance\nbreadth\ncm\ndecimetre\nfathom\nft\nin\nkilometre\nkm\nlinear\nmicron\nmile\nmm\nmpg\nnautical mile\nscalar\nsq.\nsquare\nthick\nwidth\nyard\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMeasurements in general\n-length suffix\n(TIME)\nof the stated amount of time: a full-length movie (= one which has not been shortened)\nSMART Vocabulary: related words and phrases\nMeasurements in general\naltitude\nbathymetric\nbathymetrically\nbathymetry\nbe running at something idiom\ncalibrate\ndrop\nelevation\nfactor\nknee-length\nmetric\nmetrication\nmicro\nmilli-\nscale\nsetting\ntera-\nuncalibrated\nunmeasurable\nunsized\nSee more results »\nlength noun\n(DISTANCE)\nAdd to word list\nAdd to word list\n[ C/U ] the measurement of something from end to end or along its longest side, or a measurement of a particular part of something: [ C ] a length of rope [ U ] The boat is 20 feet in length.\n[ C/U ] The length of a piece of writing, such as a book or story, is a measure of the material it contains: [ U ] The length of the poem was 30 lines.\nlength noun\n(TIME)\n[ U ] an amount of time: The movie is nearly three hours in length. George went on about his illnesses at great/some length (= for a long time)."}