{"id":210734,"name":"leninist","type":"noun","us_sound":"ˈlen.ɪ.nɪst","us_link":"../audio/l/uslegat017.mp3","uk_sound":"ˈlen.ɪ.nɪst","uk_link":"../audio/l/ukleisu019.mp3","content":"Add to word list\nAdd to word list\nsomeone who believes in the social, political, and economic principles and theories developed from Marxism by the Russian politician V. I. Lenin, supporting direct rule by workers: Solzhenitsyn was strictly speaking a Leninist. Radek reached an agreement with the Leninists. See\nLeninism\nMore examplesFewer examplesHe was seriously annoyed at being branded a Leninist.During the following months the Leninists succeeded in extending their organizational control.After a government takeover by Marxist Leninists, the emblem was removed from the flag.\nSMART Vocabulary: related words and phrases\nPolitics - general words\nanti-capitalism\nanti-capitalist\nanti-communism\nanti-communist\nanti-fascism\ninterparty\ninterpellate\ninterpellation\ninterventionist\nlab\nOrwellian\noverstep\nparliament\nparty politics\npersonality cult\nstatesmanlike\nstateswoman\nsubsidiarity\nsuper-conservative\nThatcherism\nSee more results »\nbelieving in the social, political, and economic principles and theories developed from Marxism by the Russian politician V. I. Lenin, supporting direct rule by workers: The world was ready to overlook the party's Leninist ideology. Adopting tough Leninist language, he declared: \"The oligarchs will cease to exist as a class.\"\nMore examplesFewer examplesHis broad strategy is in the Leninist tradition.The Communist Party is taking on younger members with social democratic rather than Leninist tendencies. A more moralistic diplomat might have been thrown off course by the thought of dealing with a Leninist dictatorship.\nSMART Vocabulary: related words and phrases\nPolitics - general words\nanti-capitalism\nanti-capitalist\nanti-communism\nanti-communist\nanti-fascism\ninterparty\ninterpellate\ninterpellation\ninterventionist\nlab\nOrwellian\noverstep\nparliament\nparty politics\npersonality cult\nstatesmanlike\nstateswoman\nsubsidiarity\nsuper-conservative\nThatcherism\nSee more results »"}