{"id":211135,"name":"less","type":"determiner","us_sound":"les","us_link":"../audio/l/less.mp3","uk_sound":"les","uk_link":"../audio/l/ukles__006.mp3","content":"Add to word list\nAdd to word list\nA2 a smaller amount (of), or to a smaller degree: We must try to spend less money. Exercise more and eat less. I eat less chocolate and fewer biscuits than I used to. Getting out of bed in summer is less difficult than in winter. less than ...\nused to say that something does not have the good or attractive characteristic that is stated: I think he was less than honest with me.\nSee more less and less\nIf something happens less and less, it becomes gradually smaller in amount or happens less often: He's less and less able to look after himself.\nSee more\nMore examplesFewer examplesThe buses run less frequently on Sundays.The survey reveals that two-thirds of married women earn less than their husbands.The students accomplished the task in less than ten minutes.Do you pay less tax if you're self-employed?If you eat three good meals a day, you're less likely to snack on biscuits and crisps.\nSMART Vocabulary: related words and phrases\nSmall in number and quantity\nbeggarly\nbelow\nbupkis\ncertain\ncould count something on (the fingers of) one hand idiom\nlimitedness\nmeasly\nmild\nmildness\nmingy\nminimal\nmodest\nonly so much/many idiom\npiffling\nremote\nscantly\nslenderly\nstrength\nsuggestion\nthin\nSee more results »\nGrammar\nLessWe use the quantifier less to talk about reduced quantities, amounts or degree. Less is a comparative word. …\nLess: positionWe use less with different classes of words. We use less after verbs but before every other word class: …\nLess with nounsWe use less on its own with singular uncountable nouns: …\nLess ofWhenever we use less before articles (a/an, the), demonstratives (this, that), possessives (my, your) or pronouns (him, it), we need of: …\nLess without a noun (as a pronoun)We usually leave out the noun after less when the noun is understood: …\nLess and lessWe often use less and less to emphasise a decrease in something: …\nLess or fewer?We use the quantifiers less and fewer to talk about quantities, amounts and degree. Less and fewer are comparative words. …\nLess and fewer with a nounWe usually use less with uncountable nouns. We use fewer with plural nouns: …\nLess and fewer with ofWhen we use fewer or less before articles (a/an, the), demonstratives (this, that), possessives (my, your) or pronouns (him, them), we need to use of. We use less of with singular nouns and fewer of with plural nouns: …\nLess and fewer without a nounWe can leave out the noun when it is obvious: …\nMoreorlessMore or less means ‘mostly’, ‘nearly’ or ‘approximately’. We use it in mid position (between the subject and main verb, or after the modal verb or first auxiliary verb, or after be as a main verb). It is slightly informal: …\nIdioms\nmuch/still less\nno less\nno less than\n→\nminus : The total is 30 dollars, less the five dollars deposit that you paid.\nSMART Vocabulary: related words and phrases\nAddition, subtraction, multiplication & division\nadd\nadd (something) up\naddition sign\nadditive\narithmetical\ndeduction\nhalf\nhalve\nhighest common factor\nlong division\npower\nquadruply\nquintuple\nquotient\nrecursion\nround something down\nsquare\nsubtraction sign\ntable\ntreble\nSee more results »\nGrammar\nMoreorlessMore or less means ‘mostly’, ‘nearly’ or ‘approximately’. We use it in mid position (between the subject and main verb, or after the modal verb or first auxiliary verb, or after be as a main verb). It is slightly informal: …\nused to form adjectives meaning \"without (the thing mentioned)\": meaningless friendless\nSMART Vocabulary: related words and phrases\nLacking things\nbankrupt\nbankruptcy\nbe hard up (for something) idiom\nbereft\ncry out for something\ninappeasable\nlack\nlacking\nminus\nneed\nneed something like you need a hole in the head idiom\nscrape\nscream\nshortage\nshy\nskimpily\nstarve someone/something of something\nstarved\ntaken\nunaccompanied\nSee more results »\nless adjective, adverb\n(SMALLER AMOUNT)\nAdd to word list\nAdd to word list\na smaller amount of something, to a smaller degree, or not as much; comparative oflittle : We’ve got to spend less money. It was less than a mile to the nearest gas station. She had less reason to complain than I. Skiing conditions this year are less than ideal (= not good). There were no less than (= as many as) a thousand people buying tickets. Idiom\nless and less\nless preposition\n(SUBTRACT)\nminus ; after subtracting: $30, less the discount of 15%, is $25.50.\nAdd to word list\nAdd to word list\nafter subtracting a particular number or amount: The account will pay at least base rate less 0.25% until 31 March next year."}