{"id":211168,"name":"let","type":"verb","us_sound":"let","us_link":"../audio/l/let.mp3","uk_sound":"let","uk_link":"../audio/l/ukles__010.mp3","content":"let verb\n(ALLOW)\nAdd to word list\nAdd to word list\nB1 [ T + infinitive without to ] to allow something to happen or someone to do something by not doing anything to stop an action or by giving your permission: She wanted to go but her parents wouldn't let her. He decided to let his hair grow long. Let your shoes dry completely before putting them on. I'm letting you stay up late, just this once. Don't let it worry you. If he needs money, let him (= he should) earn it!\nThesaurus: synonyms, antonyms, and examples\nto allow someone to do somethingallowAm I allowed to go to the park?letShe wanted to go but her parents wouldn't let her.permitSmoking is not permitted in any part of the building.have your permissionYou have my permission to stay out past midnight on Friday.authorizeWho authorized this expenditure?give something the go-aheadThe government has given the go-ahead for a multi-billion pound road-building project.\nSee more results »\n[ T + obj + infinitive without to , not in past tenses ] used to show that you accept what is going to happen, although you do not like it: Let it rain - it won't spoil our afternoon.\n[ T + obj + infinitive without to , not in past tenses ] used to say that you wish something to happen very much: Oh, please let him get the job!\nMore examplesFewer examplesThey agreed to let us live there rent-free.It isn't hygienic to let the cat sit on the dining table.We were asked to show some identification before the security guards would let us in.The dog's scratching at the door - shall I let him in?Kyle's mum lets him stay up late on the weekends.\nSMART Vocabulary: related words and phrases\nAllowing and permitting\nadmission\nadmit of something\nallow of something\nallowable\nauthorization\nauthorize\nclearance\nconsent\nentrance\ngiven the chance/choice idiom\ngreen-light\nhall pass\nhospital admission\nimprimatur\nliberty\nrelicense\nrelicensure\nsay-so\nsecurity clearance\nsee your way (clear) to doing something idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccepting & agreeing reluctantly\nHoping and hopefulness\nlet verb\n(SUGGEST)\nlet's (also formal let us)\nA2 used to express a suggestion or request that includes you and the other person or people: Let's go out to dinner.\nSee more\nlet verb\n(RENT)\n[ T ] mainly UK (US usually rent) to allow your house or land to be lived in or used by someone else in exchange for a regular payment: They are letting their house (out) for the summer. He's let his flat to a young couple. She has a room to let in her house.\nSMART Vocabulary: related words and phrases\nMortgages & real estate\nblockbusting\nbrick\nbricks and mortar idiom\nBTL\nbuy-to-let\nchain\nequity\nlandlady\nletting\nmortgagee\nplanning blight\nreal estate broker\nreal estate office\nRealtor\nrealty\nrealty office\nrefinance\nremortgage\nrepo\nrepossess\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRenting property\nGrammar\nAllow, permit or let?Allow, permit and let are verbs that all have a similar meaning: ‘give permission or make it possible for somebody to do or have something’. …\nPermit/allow someone + to do somethingWe use a direct object + to-infinitive after permit and allow: …\nLet someone + do somethingWe use an infinitive without to after let: …\nPassive with permit and allowWe often use the passive with permit and allow. Permit is often used for official public notices: …\nLet, let’sWe use let to talk about permission. Let is followed by an object and an infinitive without to: …\nLet: permissionWe use let to talk about permission. Let is followed by an object and an infinitive without to: …\nLet’s, let: suggestions, offers, imperativesLet us is the first person plural imperative, which we only use in very formal situations. Let’s is the short form, which we often use to make suggestions which include ourselves: …\nLet meaning ‘rent’We use let with a direct object meaning ‘rent something to someone’: …\nImperatives with let (let’s)We use let to form first person and third person imperatives. …\nNegative imperative of let’sWe often use the phrase let’s not: …\nIdioms\nlet someone be\nlet go\nlet someone go\nlet something go/pass\nlet yourself go\nlet your hair down\nlet someone have it\nlet someone in on a secret\nlet someone know\nlet something slip\nMore idioms\nlet something go\nlet it all hang out\nlet it be known\nlet it lie\nlet rip/fly\nlet the side down\nlet's face it\nlet's see\nPhrasal verbs\nlet someone down\nlet something down\nlet someone/something in\nlet yourself in for something\nlet someone in on something\nlet something into something\nlet someone off\nlet something off\nlet on\nlet someone/something out\nMore phrasal verbs\nlet something out\nlet out\nlet up\nlet alone\nC1 used after a negative statement to emphasize how unlikely a situation is because something much more likely has never happened: Some people never even read a newspaper, let alone a book.\nSee more\nlet noun\n(SPORT)\n[ C ]\n&#160; sports (in tennis or similar games) a situation in which the ball touches the net as it crosses it, so that you have to play the point again\nSMART Vocabulary: related words and phrases\nTennis & racket sports\nadvantage\nbackhand\nball boy\nball girl\nbaseline\nbird\nbreak\ncode violation\ncourt\ndouble fault\ngroundstroke\nlob\noverhead\nserve\nsquash\nsweet spot\ntennis\nunreturnable\nunseeded\nvolley\nSee more results »\nlet noun\n(LAW)\nwithout let or hindrance law\n&#160; UK specialized\nwithout being prevented from doing something: People will be able to travel from country to country without let or hindrance.\nSee more\nlet noun\n(RENT)\n[ C ] UK the act of allowing someone to use your house, land, etc. in exchange for regular payments: a five-year let on a flat\nSMART Vocabulary: related words and phrases\nMortgages & real estate\nblockbusting\nbrick\nbricks and mortar idiom\nBTL\nbuy-to-let\nchain\nequity\nlandlady\nletting\nmortgagee\nplanning blight\nreal estate broker\nreal estate office\nRealtor\nrealty\nrealty office\nrefinance\nremortgage\nrepo\nrepossess\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRenting property\nsmall, not very important: piglet\nSMART Vocabulary: related words and phrases\nSmall\nbaby\nbijou\nbite-sized\nclaustrophobically\ncompactly\ndwarf\nelfin\nmidget\nminiaturized\nmissy\nmodestly\nno/not enough room to swing a cat idiom\non the large, small, etc. side idiom\nS, s\nsampler\nscaled-down\nscrubby\nshoe box\nshrunken\nwee\nSee more results »\nGrammar\nDiminutives (-let, -y and mini-)A diminutive creates a meaning of ‘small’ or ‘little’. The most common diminutives are formed with the prefix mini- and with suffixes such as -let and -y. We often use a diminutive with names or with abbreviated names when we want to be more informal, or to express affection for someone or something: …\nlet verb [T]\n(ALLOW)\nAdd to word list\nAdd to word list\npresent participle -tt- | past tense and past participle let to allow something to happen or someone to do something by giving permission or by not doing anything to stop it from happening: Fraya’s parents let her go to the movie. He decided to let his hair grow long. She opened the door and let me in (= allowed me to enter). After questioning him for six hours, the police finally let him go (= released him).\nlet verb [T]\n(CAUSE)\npresent participle letting | past tense and past participle let to cause something to happen or to be in a particular condition, or to cause someone to understand something: He let the pool empty. Let me know if you need help. He let out a shout (= He shouted).\nlet verb [T]\n(SUGGEST)\nlet us fml\nlet us I suggest that we: For the sake of argument, let us assume that Rochelle is right. After visiting the gift shop, let us proceed into Graceland itself.\nIdioms\nlet alone do something\nlet someone/something alone\nlet something be known\nlet go\nlet someone go\nlet yourself go\nlet go (of something/someone)\nlet someone have it\nlet nature take its course\nlet off steam\nMore idioms\nlet something/someone slide\nlet’s face it\nlet’s see\nPhrasal verbs\nlet someone in on something\nlet down someone\nlet off someone\nlet on\nlet out\nlet out something\nlet up\nlet up on someone/something\nAdd to word list\nAdd to word list\nto allow something to happen, or to allow someone to do something, by giving your permission or by not doing anything to stop an action: We do not let our staff use social networking sites at work. They had let the office accommodation become rundown and shabby.\nUK (US rent) to allow your house or land to be lived in or used by someone else in exchange for a regular payment: let sth (out) to sb They are letting their house out for the summer. He's let his flat to a young couple. The Technology Park has office accommodation and business units to let.let on sth The property is let on a 10-year lease. The holiday apartments are let on a weekly basis.\nlet sb go\nHR\n&#160; informal to make someone leave their job: Sales are down considerably and we've had to let some staff go. I've only been let go twice in my career.\nthe act of allowing someone to use your house, land, etc. in exchange for regular payments: let on sth a five-year let on a flat short-term/long-term let We've taken the studios on a short-term let.\nwithout let or hindrance\nLAW without being prevented from doing something: People will be able to travel from country to country without let or hindrance."}