{"id":211213,"name":"letter","type":"noun","us_sound":"ˈlet̬.ɚ","us_link":"../audio/l/letter.mp3","uk_sound":"ˈlet.ər","uk_link":"../audio/l/ukles__018.mp3","content":"letter noun [C]\n(MESSAGE)\nAdd to word list\nAdd to word list\nA1 a written message from one person to another, usually put in an envelope and sent by post: I got a letter from the bank this morning. Synonyms\ncommunication formal\ndispatch\nepistle formal\nmessage (INFORMATION)\nmissive\nMore examplesFewer examplesHe read her letter aloud to the rest of the family.I folded the letter in half and put it in an envelope.We try to answer readers' letters as promptly as we can.In those days people used to write a lot more letters.I had a lovely, long, chatty letter from my friend this morning.\nSMART Vocabulary: related words and phrases\nLetters, notes and cards\naerogramme\nair letter\nbillet-doux\nchain letter\nChristmas card\ncorrespondence\nget-well card\ngreetings card\nhandbill\nhate mail\ninvitation\njunk mail\nplace card\npoison-pen letter\npostcard\nPPS\nPS\nrejection\nround robin\nwire\nSee more results »\nletter noun [C]\n(SYMBOL)\nA2 any of the set of symbols used to write a language, representing a sound in the language: the letter D the letter of the law formal\nthe exact words of the law and not its more important general meaning: She abided by the letter of the law, but not the spirit of the law.\nSee more\nMore examplesFewer examplesWhat letter does it start with?How many letters are there in the alphabet?Z is the last letter of the alphabet.Our names all start with the letter P.Letter S is the longest letter in the English dictionary.\nSMART Vocabulary: related words and phrases\nLettering & alphabets\nall caps\nalphabet\nalphabetical\nalphabetically\nascender\nBraillist\ncamel case\nhieroglyph\nideogram\nIPA\nLatinize\nLatinized\nmulti-character\nnon-phonetic\nnotation\npaleographical\nroman\nsentence case\nstenography\ntitle case\nSee more results »\nletter noun [C]\n(PRIZE)\nUS a prize in the shape of the first letter of the name of a high school or university, given to a student for achievement in sport and sometimes other activities, and often worn on a special jacket or sweater: A naturally gifted athlete, he earned four letters in basketball and two more in baseball at high school. Her mission was to win a letter in basketball by the time she was a senior in high school.\nMore examplesFewer examplesShe won a letter in tennis at the university.Students receive 5 points for an award received in the activity, like an athletic letter or a writing prize.He earned seven varsity letters: four in wrestling and three in athletics.\nSMART Vocabulary: related words and phrases\nPrizes, rewards and medals\n(the/a pot of gold at) the end of the rainbow idiom\nAcademy Award\naward\nbemedalled\nblue ribbon\nbooby prize\nbronze\ngong\ngrab bag\nGrammy\nhand something out\nhonour\nOscar\nplatinum disc\nprize\nPulitzer Prize\nstake\nthe golden boot\nthe wooden spoon\nVC\nSee more results »\nIdiom\nto the letter\nused to refer to a standard size of paper in the US, 8.5 inches by 11 inches: Fliers are usually printed either on letter size or legal size paper.\nSMART Vocabulary: related words and phrases\nPublishing: paper & stationery\nA3\nA5\nacid-free\nassembler\nbackspace\nballpoint pen\nchalk\nfoolscap\nfountain pen\ngift wrap\ngrammage\nhanging chad\nnotepad\npropelling pencil\npulp\nquill\nquire\nqwerty\nream\nvellum\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMass, area, weight & volume in general\nIf a student letters in a particular sport, they are given a prize for achievement in sport in the shape of the first letter of the name of their high school or university, which is often worn on a special jacket or sweater: She lettered in five varsity sports in high school. Twelve juniors lettered for the Tigers last season.\nMore examplesFewer examplesShe was president of her high school class all four years and lettered in several sports.He was the first UCLA student to letter in four sports (baseball, football, basketball, and athletics) in a single year.She was a three-sport star, lettering in football, tennis, and basketball.\nSMART Vocabulary: related words and phrases\nPrizes, rewards and medals\n(the/a pot of gold at) the end of the rainbow idiom\nAcademy Award\naward\nbemedalled\nblue ribbon\nbooby prize\nbronze\ngong\ngrab bag\nGrammy\nhand something out\nhonour\nOscar\nplatinum disc\nprize\nPulitzer Prize\nstake\nthe golden boot\nthe wooden spoon\nVC\nSee more results »\nletter noun [C]\n(MESSAGE)\nAdd to word list\nAdd to word list\na written or printed message from one person to another, usually put in an envelope and delivered as mail: I got a letter from the bank this morning.\nletter noun [C]\n(SYMBOL)\nany of the set of symbols used to write a language, in many languages, representing a sound in the language: She wrote her name on the board in large letters.\nAdd to word list\nAdd to word list\nCOMMUNICATIONS a written message from one person to another, usually put in an envelope and sent by mail: by letter You will receive an acknowledgement by letter.get/receive a letter (from sb) I got a letter from my lawyer this morning.deliver/post/send a letter I sent a letter about the problem to HQ last week.draft/write/sign a letter The letter was signed by the managing director.reply to/acknowledge/answer a letter I wrote to the company but they did not even acknowledge my letter.a confirmation/rejection/warning letter You will receive a confirmation letter within 10 working days.an accompanying/a covering letter Please find enclosed my CV and a covering letter.a formal/an informal letter He wrote a formal letter of resignation. The letter was addressed to John Clarke. a letter dated 3rd March 2010\nany of the set of symbols used to write a language, representing a sound in the language: the letter D an upper-case/lower-case letter (= A/a or B/b)\nthe letter of the law formal\nLAW the exact words of a law and not its more important general meaning: The bank was operating within the letter of the law.\nto the letter\nif you obey instructions or rules to the letter, you do exactly what you have been told to do, giving great attention to every detail: I followed the instructions to the letter and it still went wrong. See also\nallocation letter\napplication letter\nappointment letter\nbank authorization letter\ncommitment letter\ncovering letter\ncover letter\ncredit dispute letter\nengagement letter\nform letter\nView all\nletter of comfort\nregret letter\nUS →\nletter-size"}