{"id":211485,"name":"level","type":"noun","us_sound":"ˈlev.əl","us_link":"../audio/l/level.mp3","uk_sound":"ˈlev.əl","uk_link":"../audio/l/ukles__029.mp3","content":"level noun [C]\n(HEIGHT)\nAdd to word list\nAdd to word list\nB2 the height of something: The water level in the lake is much higher after heavy rain.\nB2 the amount or number of something: Inflation is going to rise two percent from its present level. Chess requires a very high level of concentration. There is some danger of low level (= a continuing small amount of) radiation.\nMore examplesFewer examplesFish struggle for survival when the water level drops in the lake.The top of Mount Everest is 8,848 m above sea level.\"How tall is he next to you?\" \"Oh, about so big, \" she said, indicating the level of her neck.The grass has grown nearly to the level of the windows!The bullet entered the body at chest level.\nSMART Vocabulary: related words and phrases\nMeasurements of length & distance\nbreadth\ndecimetre\nfathom\nft\nin\nkilometre\nkm\nlength\nlinear\nmicron\nmile\nmm\nmpg\nnautical mile\nscalar\nsq.\nsquare\nthick\nwidth\nyard\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMeasurements in general\nGeneral words for size and amount\nlevel noun [C]\n(ABILITY)\nA2 someone's ability compared to other people: a class for advanced level students Students at this level require a lot of help. The exam can be taken at three levels.\nMore examplesFewer examplesHe reached a reasonable level of competence in his English.Gymnastics is a sport that requires a considerable level of coordination.A teacher's got to pitch a lesson at the right level for the students.She reached a high level on the piano.All these students are beginner level.\nSMART Vocabulary: related words and phrases\nQuality and standard\nbar\nbenchmark\ncachet\ncalibre\nclass\nconform\nconform to/with something\nideal\nmark\nmulti-levelled\nmultilevel\nnotch\nqualitative\nstar\nstarred\nstatus\nstyle\ntake first/second place idiom\nunranked\nupscale\nSee more results »\nlevel noun [C]\n(FLOOR)\na floor in a large building: The library has three levels, with a conference centre at ground level. The exhibition is on level three of the building.\nMore examplesFewer examplesThe toilets are on the next level.The garage has five levels.Kitchen goods are on level three.Go down a level to find the academic books.He works on a different level from me.\nSMART Vocabulary: related words and phrases\nParts of buildings: floors & parts of floors\nbasement\ncatwalk\nceiling\ndais\ndecking\ngallery\nground level\nloft\nlow slung\nmachicolation\nmezzanine\npodium\nrostrum\nrunway\nsoapbox\nsplit-level\nthe ground floor\nthe second floor\nupstairs\nwoodblock\nSee more results »\nlevel noun [C]\n(RANK)\nC1 a position within a system in which people are arranged according to their importance: These are subjects for discussion at management level. at local/national level UK (US at the local/national level)\nrelating to a particular area of the country/the whole of the country: These sorts of policies are made at local level.\nSee more\nMore examplesFewer examplesOn a personal level, they came to be cordially disliked.E-commerce is presenting a lot of new jobs at entry level.The new law met with a good deal of opposition at local level.He reached ministerial level in the Diplomatic Service.The central office sets/establishes the parameters which guide policy at the local level.\nSMART Vocabulary: related words and phrases\nOrganizations - position & status\nambassador\nanti-elite\nanti-elitist\napparatchik\nback seat\nbrother\ncounterpart\nfish\ngrassroots\nhigh-ranking\nopposite number\nrank\nseat\nspokeswoman\nsuper-elite\nsuperboard\nsuperiority\nsuperordinate\nthane\ntitularly\nSee more results »\nlevel noun [C]\n(TOOL)\nUS (UK spirit level) a tool that contains a tube of liquid with an air bubble in it, used to show if a surface is level\nBelyaevskiy/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nMeasuring, weighing, & counting devices\ndial\ndipstick\nfitness tracker\ngage\ngamma counter\ngamma meter\ngauge\ngradation\nhydrograph\nindicator\nmicrometer\nplumb line\nprobe\nsensor\nsmart meter\nstraight edge\ntracker\nvoltmeter\nwand\nweather balloon\nSee more results »\nIdioms\nbe on the level\nfind your own level\non one level...on another level\nthe next level\nlevel adjective\n(AT SAME HEIGHT)\n[ after verb ] at the same height: The top of the tree is level with his bedroom window.\nMore examplesFewer examplesThe water was level with the edge of the bowl.The top of the screen should be level with your eyes.The trees are level with the window.The mixture should be level with the sides of the dish.The oil should be level with this mark.\nSMART Vocabulary: related words and phrases\nStraight, even and level\nbe (as) flat as a pancake idiom\nclean-cut\ncleanly\nconsistency\nflat\nflatness\nflush\nplane\nrelax\nrhythm\nseamless\nsleek\nsleekly\nsmooth\nsteady\nstraight\nstraight edge\nstraightness\nsuper-smooth\ntrue\nSee more results »\nlevel adjective\n(FLAT)\nB2 flat or horizontal: Make sure the camera is level before you take the picture. Before I bang the nails in, would you say this picture was level? level spoonful/cupful\nan amount of a liquid or substance that fills a spoon/cup but does not go above the edges, used as a measure in cooking: Add two level spoonfuls of cocoa powder to the mixture.\nSee more\nMore examplesFewer examplesIs this painting level?His glasses were never level.Make sure the cake mixture is level.We looked for a level piece of land to pitch our tent.This table isn't level.\nSMART Vocabulary: related words and phrases\nStraight, even and level\nbe (as) flat as a pancake idiom\nclean-cut\ncleanly\nconsistency\nflat\nflatness\nflush\nplane\nrelax\nrhythm\nseamless\nsleek\nsleekly\nsmooth\nsteady\nstraight\nstraight edge\nstraightness\nsuper-smooth\ntrue\nSee more results »\nlevel adjective\n(EQUAL)\nhaving the same value, amount, number of points, etc.: Pieretti would have to win the next three stages in order to draw level with (= reach the same position as) Le Sage in the Tour de France.mainly UK The unions are fighting to keep wages level (US usually even) with inflation.\nSMART Vocabulary: related words and phrases\nPeaceful and tranquil\nbeatitude\nconsonance\ncoolness\ndust\nlow-traffic\nlull\nnon-militant\npeaceable\npeaceably\nquieten\nrestfully\nrestfulness\nsequestered\nsleepiness\nsleepy\nsoothing\nthe calm before the storm idiom\nthe dust settles idiom\nthe lull before the storm idiom\nunwarlike\nSee more results »\nlevel adjective\n(CONTROLLED)\n[ before noun ] If you speak in a level voice or give someone a level look, you do it in a calm and controlled way: In a level voice, he ordered the soldiers to aim and fire.\nSMART Vocabulary: related words and phrases\nSelf-control and moderation\nanti-pleasure\nascetically\nasceticism\nbe in command (of yourself) idiom\nboundary\ngo easy idiom\ngo steady on something idiom\ngrip\nimperviously\nmind over matter idiom\npuritanically\npuritanism\nrestrained\nrestrainedly\nrestraint\nsteady\nstint\ntemperance\nundignified\nunsensational\nSee more results »\nRelated word\nlevellyIdioms\ndo your level best\nlevel pegging\na level playing field\nlevel verb [T]\n(MAKE FLAT)\nto make a surface flat: Level the wet cement before it sets.\nSMART Vocabulary: related words and phrases\nStraight, even and level\nbe (as) flat as a pancake idiom\nclean-cut\ncleanly\nconsistency\nflat\nflatness\nflush\nplane\nrelax\nrhythm\nseamless\nsleek\nsleekly\nsmooth\nsteady\nstraight\nstraight edge\nstraightness\nsuper-smooth\ntrue\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDestroying and demolishing\nlevel verb [T]\n(DESTROY)\nto completely destroy a building or area: The bombing levelled the village.\nSMART Vocabulary: related words and phrases\nStraight, even and level\nbe (as) flat as a pancake idiom\nclean-cut\ncleanly\nconsistency\nflat\nflatness\nflush\nplane\nrelax\nrhythm\nseamless\nsleek\nsleekly\nsmooth\nsteady\nstraight\nstraight edge\nstraightness\nsuper-smooth\ntrue\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLow, short and shallow\nPhrasal verbs\nlevel something against/at someone\nlevel something at someone\nlevel off\nlevel off/out\nlevel up\nlevel something up\nlevel with someone\nlevel adjective\n(HORIZONTAL)\nAdd to word list\nAdd to word list\n(of a surface) not rising or falling or higher on one side, but even in all directions; horizontal or flat: The table wobbles because the floor is not level.\nSomething that is level with something else is at the same height: The top of the tree is level with his bedroom window.\nA level spoon or cup is filled with something just to the top edge.\nIf you speak in a level voice, you speak in a calm and controlled way. Idioms\na level playing field\non the level\nlevel noun\n(POSITION)\n[ C/U ] a particular position, degree, or amount of something, esp. compared with other possible positions, degrees, or amounts: [ C ] The water level in the lake is higher after a heavy rain. [ U ] The big debate is whether more decisions should be made at the local level or at the national level. [ C ] He achieved a high level of skill as an interpreter. [ U ] We publish a dictionary for intermediate level students.\n[ C/U ] A level is also one of several floors at different heights in a building: [ C ] The reception area is on the ground level.\nlevel noun\n(HORIZONTAL)\n[ C ] a tool containing a tube of liquid with an air bubble in it, which shows whether a surface is horizontal by the position of the bubble\nlevel verb [T]\n(AIM)\nto aim or direct something at someone or something: Soldiers leveled their weapons. Criticism of the program was leveled by a number of politicians.\nlevel verb [T]\n(HORIZONTAL)\nto make something level: We had to level the backyard before putting up the pool.\nTo level buildings or other structures is to destroy them by causing them to fall down: Her grandfather survived the 1906 earthquake that leveled San Francisco. Phrasal verbs\nlevel off\nlevel with someone\nAdd to word list\nAdd to word list\n[ C ] the amount of something that exists, especially when it is counted or measured: Unions are calling for pay increases above the current level of inflation. We must reduce the risks to an acceptable level.a high/low level of sth The city has high levels of unemployment. The FTSE 100 index rose to its highest level since July 2009. increase/raise/reduce the level of sth This policy reduces the level of demand in the economy. There are increased levels of consumer debt. Staff currently receive the minimum level of pay allowable by law.\n[ C or U ] a degree or standard of something: a high/low level of sth We provide a high level of customer support.an advanced/basic/minimum level of sth Users expect a basic level of service.achieve/reach a level We hope to achieve improved levels of performance.\n[ C or U ] a position or rank within an organization or a system: at a high/low/senior level (within sth) Candidates must have significant experience at a senior level. Training is available to staff at all levels within the organization. Managers at every level are tasked with cutting costs. These decisions are made at board level.\n[ C or U ] one of the floors in a building: The rest rooms are situated at ground level.\nat/on (a) global/local/national, etc. level\nrelating to a particular area in which something happens: We carry out research at a regional level. Many quality standards are set at European level. These policies can have positive effects on a global level. See also\nentry-level\nhigh-level\nlow-level\nprice level\ntop-level\nwage level\nhaving the same value, amount, etc. as before, or as something else: Interest rates are expected to remain level for the next six months.level with sth Overall, sales were level with those for the same period last year."}