{"id":211505,"name":"lever","type":"noun","us_sound":"ˈlev.ɚ","us_link":"../audio/l/cdo0318usleve2726.mp3","uk_sound":"ˈliː.vər","uk_link":"../audio/l/uklearn016.mp3","content":"lever noun [C]\n(BAR/HANDLE)\nAdd to word list\nAdd to word list\na bar or handle that moves around a fixed point, so that one end of it can be pushed or pulled in order to control the operation of a machine or move a heavy or stiff object\nSMART Vocabulary: related words and phrases\nMachines - parts\nair compressor\nair filter\naxle\ncogwheel\ncompressor\nconsole\ncontrol panel\ncontroller\ncowl\nguard\ninstrumentation\njet\npivot\nslide\nspline\nsplit pin\nstepney\nuniversal joint\nvee belt\nwheel\nSee more results »\nlever noun [C]\n(ADVANTAGE)\nsomething you use, often unfairly, to try to persuade someone to do what you want\nSMART Vocabulary: related words and phrases\nPower to control\nahold\nall-powerful\nascendancy\nauthoritarianism\nbe above someone's pay grade idiom\nbig beast\ndiscretionary\ngrip\nhe who pays the piper calls the tune. idiom\nhegemonic\nhegemonism\nimplant\npower structure\npower struggle\npower vacuum\npower-sharing\npredominance\nsway\nthe hand that rocks the cradle rules the world idiom\nyoke\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdvantage and disadvantage\nlever verb [T usually + adv/prep]\n(MOVE)\nto move a bar or handle around a fixed point, so that one end of it can be pushed or pulled in order to control the operation of a machine or move a heavy or stiff object: She levered up the drain cover. He levered open the engine compartment and released a great cloud of blue smoke.\nIf you lever someone or something to a place, you move them there with great physical effort: He levered himself out of his chair with the usual difficulty and opened his arms wide. Jim fought to pull himself up, levering his arms down.\nMore examplesFewer examplesShe levered off the lid to reveal bags and boxes of sweets.Lever the wood off as gently as you can.She thrust back the bright patchwork quilt and levered herself to a sitting position.\nSMART Vocabulary: related words and phrases\nRaising and lowering\ndepress\nelevate\nelevated\nhike\nhike something up\nhoick\nhoist\njack\njack something up\nprise\nprize\npry\nput something up\nraise\nre-erect\nride\nride up\nrun\nwinch\nyo-yo\nSee more results »\nlever verb [T usually + adv/prep]\n(GET ADVANTAGE)\nto change a situation in order to suit yourself, often using unfair methods: The company gobbles up rivals or levers them out of the market. They accused the companies of using political pressure to lever out competition.\nMore examplesFewer examplesShe was allowed to lever him out of the job he enjoyed so much.The team need to lever themselves a little further away from the relegation zone.He has used his background to lever himself up in his military career.\nSMART Vocabulary: related words and phrases\nPower to control\nahold\nall-powerful\nascendancy\nauthoritarianism\nbe above someone's pay grade idiom\nbig beast\ndiscretionary\ngrip\nhe who pays the piper calls the tune. idiom\nhegemonic\nhegemonism\nimplant\npower structure\npower struggle\npower vacuum\npower-sharing\npredominance\nsway\nthe hand that rocks the cradle rules the world idiom\nyoke\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdvantage and disadvantage\nAdd to word list\nAdd to word list\na handle that you move to control the operation of a machine: He pushed the lever into the \"on\" position and started the machine.\nphysics A lever is also a bar, moving over a fixed point, that when pressed down at one end can move or lift something at the other end.\nAdd to word list\nAdd to word list\na bar or handle which moves around a fixed point, so that one end of it can be pushed or pulled in order to control a machine or move a heavy object: Lower the lever to lock the machine into place.\nECONOMICS, POLITICS, FINANCE something you use to try to persuade someone to do what you want or to get the result you want: Using trade or other economic tools as a lever of diplomacy is not new.a lever for (doing) sth If your mortgage offer is less than you wanted, it may be a useful lever for getting the price of the house down.\nto try to persuade someone to do what you want, or try to get a particular result: lever sb into (doing) sth But the government has not allowed the market to lever employers into that position."}