{"id":211507,"name":"leveraged","type":"adjective","us_sound":"ˈlev.ɚ.ɪdʒd","us_link":"../audio/l/uslev__004.mp3","uk_sound":"ˈliː.vər.ɪdʒd","uk_link":"../audio/l/uklevel003.mp3","content":"Add to word list\nAdd to word list\nbusiness , finance &amp; economics\n&#160; specialized A leveraged company or organization owes a large amount of money in relation to its value: The company is highly leveraged and struggling with interest payments.\nbusiness , finance &amp; economics\n&#160; specialized A leveraged deal or investment has been paid for using borrowed money. : He owns some highly leveraged investment property. The company was acquired by a consortium in a highly leveraged takeover.\nMore examplesFewer examplesSlowing growth is hurting leveraged companies, which are often owned by private equity.He has acknowledged that his company is so leveraged that \"the person that owns the debt controls the company\".There are lessons for regulators in terms of how leveraged a bank should be. In the first quarter of this year, 35% of new syndicated loans were leveraged.The leveraged deal left the company saddled with hundreds of millions of euros in debt.Credit markets have turned extremely cautious, making it difficult to gain funding for leveraged transactions.\nSMART Vocabulary: related words and phrases\nBorrowing & lending\namortizable\namortization\nbad debt\nbonded\nborrow\nborrow something from something\ncredit limit\nforeclose\nhole\nliquidate\nliquidator\nloan\nnonaccrual\non the slate idiom\nover-borrowed\noverpay\noverpayment\npay down something\npay someone/something back\nreceivership\nSee more results »\nAdd to word list\nAdd to word list\nused to describe a company or organization that owes a large amount of money in relation to its value: Like other theater chains, it will be a highly leveraged company, carrying about $550 million in debt. Compare\nhighly geared\nused to describe an investment which has been bought with a large amount of borrowed money: leveraged deal/purchase/transaction They will have to reduce costs significantly to pay the borrowings to finance the highly leveraged deal. Compare\ngeared See also\nover-leveraged"}