{"id":211514,"name":"levering","type":"verb","us_sound":"ˈlev.ɚ","us_link":"../audio/l/cdo0319usleve1044.mp3","uk_sound":"ˈliː.vər","uk_link":"../audio/l/uklearn016.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nlever\nlever verb [T usually + adv/prep]\n(MOVE)\nto move a bar or handle around a fixed point, so that one end of it can be pushed or pulled in order to control the operation of a machine or move a heavy or stiff object: She levered up the drain cover. He levered open the engine compartment and released a great cloud of blue smoke.\nIf you lever someone or something to a place, you move them there with great physical effort: He levered himself out of his chair with the usual difficulty and opened his arms wide. Jim fought to pull himself up, levering his arms down.\nMore examplesFewer examplesShe levered off the lid to reveal bags and boxes of sweets.Lever the wood off as gently as you can.She thrust back the bright patchwork quilt and levered herself to a sitting position.\nSMART Vocabulary: related words and phrases\nRaising and lowering\ndepress\nelevate\nelevated\nhike\nhike something up\nhoick\nhoist\njack\njack something up\nlift\nprise\nprize\npry\nput something up\nraise\nre-erect\nride\nride up\nwinch\nyo-yo\nSee more results »\nlever verb [T usually + adv/prep]\n(GET ADVANTAGE)\nto change a situation in order to suit yourself, often using unfair methods: The company gobbles up rivals or levers them out of the market. They accused the companies of using political pressure to lever out competition.\nMore examplesFewer examplesShe was allowed to lever him out of the job he enjoyed so much.The team need to lever themselves a little further away from the relegation zone.He has used his background to lever himself up in his military career.\nSMART Vocabulary: related words and phrases\nPower to control\nall-powerful\nascendancy\nauthoritarianism\nbe above someone's pay grade idiom\nbig beast\ncradle\nhe who pays the piper calls the tune. idiom\nhegemonic\nhegemonism\nhegemony\nimplant\nleverage\npower struggle\npower vacuum\npredominance\npuissance\npull\nsway\nthe hand that rocks the cradle rules the world idiom\ntooth\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdvantage and disadvantage"}