{"id":211506,"name":"leverage","type":"noun","us_sound":"ˈlev.ɚ.ɪdʒ","us_link":"../audio/l/leverage.mp3","uk_sound":"ˈliː.vər.ɪdʒ","uk_link":"../audio/l/uklevel002.mp3","content":"leverage noun [U]\n(ACTION)\nAdd to word list\nAdd to word list\nthe action or advantage of using a lever: Using ropes and wooden poles for leverage, they haul sacks of cement up the track.\nSMART Vocabulary: related words and phrases\nRaising and lowering\ndepress\nelevate\nelevated\nhike\nhike something up\nhoick\nhoist\njack\njack something up\nprise\nprize\npry\nput something up\nraise\nre-erect\nride\nride up\nrun\nwinch\nyo-yo\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPower to control\nleverage noun [U]\n(POWER)\npower to influence people and get the results you want: If the United Nations had more troops in the area, it would have greater leverage.\nSMART Vocabulary: related words and phrases\nPower to control\nahold\nall-powerful\nascendancy\nauthoritarianism\nbe above someone's pay grade idiom\nbig beast\ndiscretionary\ngrip\nhe who pays the piper calls the tune. idiom\nhegemonic\nhegemonism\nimplant\npower structure\npower struggle\npower vacuum\npower-sharing\npredominance\nsway\nthe hand that rocks the cradle rules the world idiom\nyoke\nSee more results »\nleverage noun [U]\n(BUSINESS)\nfinance &amp; economics\n&#160; specialized the relationship between the amount of money that a company owes to banks and the value of the company\nfinance &amp; economics\n&#160; specialized the act of using borrowed money to buy an investment or a company: With leverage, the investor's $100,000 buys $500,000 or more of stock if he wants. Synonym\ngearing\nSMART Vocabulary: related words and phrases\nBorrowing & lending\namortizable\namortization\nbad debt\nbonded\nborrow\nborrow something from something\nbridging loan\ncredit limit\nforeclose\nhole\nliquidator\nloan\nnon-prime\nnonaccrual\non the slate idiom\nover-borrowed\noverpay\noverpayment\npay someone/something back\nreceivership\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMergers & acquisitions\nleverage verb [T]\n(USE)\nto use something that you already have in order to achieve something new or better: We can gain a market advantage by leveraging our network of partners.\nSMART Vocabulary: related words and phrases\nAffecting and influencing\nacross-the-board\naffect\napplicability\nbe/fall under someone's influence/spell idiom\nbear on something\ncolour\nconflict\near\ninstrumental\ninstrumentality\ninstrumentally\ninterinfluence\ninvolve\npen\nrail\nsphere of influence\nspill\nspill over\nsportswashing\nstart (something) off\nSee more results »\nleverage verb [T]\n(BUSINESS)\nfinance &amp; economics\n&#160; specialized to use borrowed money to buy an investment or company: Home equity is invaluable if you leverage it to build wealth.\nfinance &amp; economics\n&#160; specialized to use money to get more money: One of the easiest ways to leverage a charitable gift is to get your employer to match it.\nSMART Vocabulary: related words and phrases\nBorrowing & lending\namortizable\namortization\nbad debt\nbonded\nborrow\nborrow something from something\nbridging loan\ncredit limit\nforeclose\nhole\nliquidator\nloan\nnon-prime\nnonaccrual\non the slate idiom\nover-borrowed\noverpay\noverpayment\npay someone/something back\nreceivership\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMergers & acquisitions\nEarning money\nRelated word\nleveraged\nAdd to word list\nAdd to word list\nthe power to influence results: financial/political leverage The US has very little leverage in that part of the world.\nto use borrowed money for investments, esp. in order to buy a large enough part of a business so that you can control it: They can leverage a very small investment into millions of dollars.\nAdd to word list\nAdd to word list\nthe power to influence people and get the results you want: This gives advertisers more leverage when it comes time to negotiate rates. Campaigners are trying to get as much political leverage on the situation as possible. States do not have the economic leverage to influence a foreign country. Labor experts say a service economy can give leverage to unionized workers.\nFINANCE the relationship between the amount of money that a company owes and its share capital or value: The company plans to reduce the leverage to between 40% and 60% by the year end. The bank was asked to improve its capitalization and reduce its leverage. The figure shows that they had high growth rates of bank lending and high leverage. Even if banks were able to rush back into heavy leverage soon, investors wouldn't stand for it. Compare\ngearing\nFINANCE the act of using borrowed money to buy an investment or a company: With leverage, the investor's $100,000 buys $500,000 or more of stock if he wants.\nSee also\ndebt leverage\nfinancial leverage\nloan leverage\nto use something that you already have, such as a resource, in order to achieve something new or better: This new strategy is about leveraging the relationships we have with our customers.leverage sth into sth If you enjoy the work, it should be possible to leverage your temporary assignment into a full-time job.\nFINANCE to use borrowed money to buy an investment or a company: The money could be used to leverage millions of additional dollars. leveraging noun [ U ]\nFINANCE Through aggressive leveraging, it grew into one of the largest private enterprises in the country. Phrasal verb\nleverage (sth) up"}