{"id":211522,"name":"levy","type":"noun","us_sound":"ˈlev.i","us_link":"../audio/l/levy.mp3","uk_sound":"ˈlev.i","uk_link":"../audio/l/uklevel009.mp3","content":"Add to word list\nAdd to word list\nan amount of money, such as a tax, that you have to pay to a government or organization: They imposed a five percent levy on alcohol.\nSMART Vocabulary: related words and phrases\nTaxation\namortizable\nanti-dumping\nanti-progressive\nanti-tax\nat source phrase\nfinancial year\nfiscal year\nflat tax\ngas tax\nHMRC\nregressively\nroad tax\nsales tax\nself-assessment\nshelter\ntaxpayer\ntithe\ntop rate\nunprogressive\nuntaxed\nSee more results »\n(of a government or organization) to demand an amount of money, such as a tax, from a person or organization: A new tax was levied on consumers of luxury goods. The City Council can levy a fine of $250 for a first offence.\nMore examplesFewer examplesThe proposal would allow the school to levy additional fees.US citizens are charged $20 on arrival, in retaliation for a similar charge levied for US visa applications.The system would levy significant penalties on hospitals that don't report medical errors.\nSMART Vocabulary: related words and phrases\nTaxation\namortizable\nanti-dumping\nanti-progressive\nanti-tax\nat source phrase\nfinancial year\nfiscal year\nflat tax\ngas tax\nHMRC\nregressively\nroad tax\nsales tax\nself-assessment\nshelter\ntaxpayer\ntithe\ntop rate\nunprogressive\nuntaxed\nSee more results »\nAdd to word list\nAdd to word list\nan amount of money, such as a tax, that you have to pay to a government or organization: A levy was imposed on cotton imports. levy verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈlev·i/\nTaxes and fees levied on motorists would pay for the new highway.\nAdd to word list\nAdd to word list\nan amount of money, such as a tax, that has to be paid to a government or organization: The financial authority is to impose a levy on every financial product sold.be exempt from/pay a levy Social Security income that resides in a bank account is exempt from a levy.abolish/end a levy The government plans to abolish a levy on equities trading. Compare\ncapital tax\nimport duty\nto officially ask for an amount of money, such as a tax, for a government or organization: levy a tax on sth The tax is levied on companies' energy use."}