{"id":211673,"name":"liable","type":"adjective","us_sound":"ˈlaɪ.ə.bəl","us_link":"../audio/l/liable.mp3","uk_sound":"ˈlaɪ.ə.bəl","uk_link":"../audio/l/uklevel021.mp3","content":"liable adjective [after verb]\n(RESPONSIBLE)\nAdd to word list\nAdd to word list\nC1 law\n&#160; specialized having (legal) responsibility for something or someone: The law holds parents liable if a child does not attend school. If we lose the case we may be liable for (= have to pay) the costs of the whole trial.\nSMART Vocabulary: related words and phrases\nDuty, obligation and responsibility\naccountable\naccountable to someone\naccountably\nanswer for something\nbear\nbrother\nfail\nfall to someone\nfiefdom\ngotta\nhad better/best do something idiom\nhat\nought to\nowe someone a living idiom\npass the buck idiom\npay your dues idiom\npigeon\nportfolio\nsomeone's answer to someone/something idiom\nstick\nSee more results »\nliable adjective [after verb]\n(LIKELY)\nC2 very likely to do something: The areas of town near the river are liable to flooding (= are often flooded). [ + to infinitive ] He's liable to make a fuss if you wake him.\nSMART Vocabulary: related words and phrases\nPossible and probable\nalways\nanything's possible idiom\narguably\nas never before idiom\nauspiciously\nbet\nfair\nhouseroom\nI shouldn't wonder idiom\nit isn't over until the fat lady sings idiom\nlean\nlean towards sth\nmanage\nprobable\nprobably\nprospective\nprospectively\nrealm\ntend\ntip\nSee more results »\nAdd to word list\nAdd to word list\nlikely to do, happen, or experience something: If you don’t take care of yourself, you’re liable to get sick. He’s liable to say anything that comes into his head.\nhaving legal responsibility for something: He is still liable for repaying his student loan.\nAdd to word list\nAdd to word list\nLAW legally responsible for something or someone: liable for sth The sellers were liable for all the damage. This is a serious crime and they can be held liable.\nLAW, TAX responsible for paying something: If you are self-employed, you are still liable to pay National Insurance Contributions.liable to sth You will be liable to tax on the interest.\nLAW if someone is liable to a punishment, they will receive that punishment: liable to sth He is guilty of an offence and liable to 14 years' imprisonment.\nlikely to do something: liable to do sth They're liable to give you problems over your business proposal."}