{"id":211813,"name":"liberty","type":"noun","us_sound":"ˈlɪb.ɚ.t̬i","us_link":"../audio/l/eus72777.mp3","uk_sound":"ˈlɪb.ə.ti","uk_link":"../audio/l/ukliber015.mp3","content":"liberty noun\n(FREEDOM)\nAdd to word list\nAdd to word list\nB2 [ U ] formal the freedom to live as you wish or go where you want: For most citizens, liberty means the freedom to practise their religious or political beliefs. Hundreds of political prisoners are to be given their liberty (= released from prison). Of the ten men who escaped this morning from Dartmoor Prison, only two are still at liberty (= free or not yet caught). be at liberty to do something C2 formal\nto be allowed to do something: I'm not at liberty to reveal any names.\nSee more liberties [ plural ] formal\nfreedom to live as you wish or go where you want: These laws will restrict our ancient rights and liberties.\nSee more\nMore examplesFewer examplesHe was an apostle of world liberty.'Happiness', 'honesty' and 'liberty' are abstract nouns.He fought for his liberty.She bought her liberty with hard work.I am not at liberty to tell you the facts.\nSMART Vocabulary: related words and phrases\nFreedom to act\n(as) free as a bird idiom\nagency\nat will idiom\nautonomist\nautonomous\nblank cheque\nfree hand\nfree pass\nfree rein idiom\nfree spirit\nfree time\nno holds barred idiom\nnon-didactic\nnon-directed\nnon-restricted\nnon-restrictive\nthe world is someone's oyster idiom\nwalk free idiom\nwiggle room\nwriggle room\nSee more results »\nliberty noun\n(BAD BEHAVIOUR)\n[ C ] an example of speech or behaviour that upsets other people because it shows little respect or does not follow what is thought to be polite or acceptable: What a liberty, to refuse the invitation on your behalf, without even asking you! take liberties (with something)\nto change something, such as a piece of writing or information, usually in a way that people disagree with: There have been several legal clashes when other artists have taken liberties with the melodies.\nSee more take liberties (with someone) old-fashioned\nto be too friendly with someone, usually in a sexual way: Some of the younger women complained that he'd been taking liberties with them.\nSee more\nSMART Vocabulary: related words and phrases\nRude and cheeky\ncheekily\ncheekiness\ncheeky\nchurlishly\nchurlishness\ncoarsely\nfruity\ngall\ngraceless\nincivility\nindelicate\nobnoxiously\nobnoxiousness\noffensively\noffensiveness\npertly\npresume\nscatological\nunpleasant\nunprintable\nSee more results »\nIdiom\ntake the liberty of doing something\nAdd to word list\nAdd to word list\nsocial studies the freedom to live as you wish and go where you want: [ C ] individual liberties [ U ] Our group is fighting for independence, liberty, democracy, and peace. at liberty\nSomeone who is at liberty to do something has permission to do it: I’m not at liberty to discuss this with you."}