{"id":211765,"name":"liberal","type":"adjective","us_sound":"ˈlɪb.ər.əl","us_link":"../audio/l/liberal.mp3","uk_sound":"ˈlɪb.ər.əl","uk_link":"../audio/l/uklevel030.mp3","content":"liberal adjective\n(SOCIETY)\nAdd to word list\nAdd to word list\nC1 respecting and allowing many different types of beliefs or behaviour: a liberal society/attitude Her parents were far more liberal than mine. Opposite\nilliberal formal\nThesaurus: synonyms, antonyms, and examples\nwilling to consider new or different ideasopen-mindedThe campaign attracts progressive, open-minded people.tolerantThey are very tolerant of different religions in that country.broad-mindedTravel helps you become more broad-minded.receptiveHe was very receptive to the idea.\nSee more results »\nMore examplesFewer examplesEspousal of such liberal ideas won't make her very popular around here.Despite his apparent liberal views, he's really something of a puritan.His natural supporters are the urban poor, and educated people of a liberal turn of mind.He has very liberal attitudes towards sex.My family are very liberal-minded.\nSMART Vocabulary: related words and phrases\nOpen-minded\nanti-liberal\nanti-liberalism\nbig tent\nbroad-minded\nbroad-mindedness\ninclusively\nliberalism\nliberality\nliberally\nlive\nlive and let live idiom\nopen-minded\nopen-mindedly\nopen-mindedness\npermissive society\nreceptive\ntolerance\ntolerantly\nunblinkered\nundogmatic\nSee more results »\nliberal adjective\n(POLITICS)\nC1 believing in or allowing a lot of personal freedom, and believing that society should change gradually so that money, property, and power are shared more fairly: He absorbed the attitudes of his politically liberal parents.\nbelieving in or allowing a lot of freedom for businesses to buy, sell, and make money without many rules or limits, and with low taxes: Polling data shows these voters are socially conservative and economically liberal.\nMore examplesFewer examplesHer politics have become more liberal over the past few years.I'm sick of bleeding-heart liberal politicians.She is interested in liberal policies.He believes that the liberal agenda is damaging to our country.Discussions on farming will quickly turn into a dispute with liberal free-marketeers.\nSMART Vocabulary: related words and phrases\nPolitics - general words\nanti-capitalism\nanti-capitalist\nanti-communism\nanti-communist\nanti-fascism\ninterparty\ninterpellate\ninterpellation\ninterventionist\nlab\nOrwellian\noverstep\nparliament\nparty politics\npersonality cult\nstatesmanlike\nstateswoman\nsubsidiarity\nsuper-conservative\nThatcherism\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEconomics\nliberal adjective\n(GENEROUS)\nformal giving or given in a generous way: He was very liberal with the wine.\nThesaurus: synonyms, antonyms, and examples\nfreely giving money, help, etc. to othersgenerousThey were quite generous, donating to several charities.open-handedShe is incredibly open-handed and won't hesitate to donate whenever asked.free withOur professor is quite free with his time and will often extend office hours to accommodate extra students.philanthropicThere are fewer philanthropic billionaires than one would assume.charitableOxfam is a well-known charitable organization working to end global poverty.\nSee more results »\nSMART Vocabulary: related words and phrases\nPlenty and abundant\nabound\nabound in/with something\nabundance\nabundant\nabundantly\ndrip\ngenerous\ngenerously\nhandsomely\nhealthily\nin abundance\nlavish\nluxuriant\nplenteously\nplentiful\nplentifully\nplenty\nprofuse\nrichly\nwell off\nSee more results »\nliberal adjective\n(NOT EXACT)\nnot exact; without attention to or interest in detail: a liberal interpretation of the law\nSMART Vocabulary: related words and phrases\nWrong\naberrant\naberrantly\nabnormal\namiss\nanomalous\nbark\nfallaciousness\nfalse\nfalse negative\nfalse positive\nfalsely\niniquity\ninvalidly\nirregular\nirregularly\nliberally\nmal-\nquarrel\nwrongheadedly\nwrongly\nSee more results »\nRelated words\nliberalism\nliberality\nliberally\nliberal noun [C]\n(SOCIETY)\nsomeone who respects many different types of beliefs or behaviour: I am a liberal who believes in tolerance.\nMore examplesFewer examplesThe city has a reputation for equality and tolerance, and has traditionally been a haven for liberals.Liberals preach freedom of thought.They are the sort of fake liberals who proclaim tolerance out of one side of their mouths and issue snobbish put-downs out of the other.\nSMART Vocabulary: related words and phrases\nOpen-minded\nanti-liberal\nanti-liberalism\nbig tent\nbroad-minded\nbroad-mindedness\ninclusively\nliberalism\nliberality\nliberally\nlive\nlive and let live idiom\nopen-minded\nopen-mindedly\nopen-mindedness\npermissive society\nreceptive\ntolerance\ntolerantly\nunblinkered\nundogmatic\nSee more results »\nliberal noun [C]\n(POLITICS)\nsomeone who believes in personal freedom and that society should change gradually so that money, property, and power are shared more fairly: She says she is proud to identify herself as a liberal and a feminist.\nfinance &amp; economics\n&#160; specialized someone who believes businesses should have a lot of freedom to buy, sell, and make money without many rules or limits, and with low taxes: Three strands make up the party: the moderate reforming centre, the Thatcherite economic liberals, and the pro-clerical conservatives.\nMore examplesFewer examples\"This is the first time anyone has referred to me as a liberal,\" he said. \"Usually I'm pretty far over on the right.\"Dole portrayed the president in campaign speeches as a \"closet liberal\".Most of them are economic liberals or populists, and support tax cuts and government-spending reductions.Economic liberals eventually became Republicans, political liberals Democrats.\nSMART Vocabulary: related words and phrases\nPolitics - general words\nanti-capitalism\nanti-capitalist\nanti-communism\nanti-communist\nanti-fascism\ninterparty\ninterpellate\ninterpellation\ninterventionist\nlab\nOrwellian\noverstep\nparliament\nparty politics\npersonality cult\nstatesmanlike\nstateswoman\nsubsidiarity\nsuper-conservative\nThatcherism\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEconomics\nliberal adjective\n(SOCIAL)\nAdd to word list\nAdd to word list\nallowing many different types of beliefs or behavior: a liberal society/person\nliberal adjective\n(POLITICS)\npolitics &amp; government tending to emphasize the need to make new laws when necessary because of changing conditions and to depend on the government to provide social services: a liberal policy/position\nliberal adjective\n(GENEROUS)\ngiving or given in a generous way: Some merchants offer very liberal return policies, but others are strict.\nliberal adjective\n(NOT EXACT)\nwithout attention to or interest in small details: Other teachers are a lot more liberal about spelling errors than Mr. Brady.\nliberal noun [C]\n(POLITICALLY LIBERAL PERSON)\na person who thinks the government needs to make new laws when necessary because of changing conditions and who believes that the government should provide social services: Liberals in Congress support the bill.\nAdd to word list\nAdd to word list\nrespecting and allowing many different types of beliefs or behaviour: a liberal society/attitude/view Changing attitudes to sexuality are a reflection of a more liberal society.a liberal policy/stance The government defends its liberal policy on soft drugs.\nPOLITICS used to describe political beliefs and groups that support more personal freedom and a fairer sharing of wealth and power in society: The federal government is bound to be a coalition involving the liberal party.\nECONOMICS, POLITICS used to describe an economic system that allows industry to be free to develop without the involvement of government: The successes of liberal economic policies in the US and Britain act as powerful examples.\ngiving or given in a generous way: Terms were liberal, with small down payments and government financing.\nnot exact, and without attention to or interest in detail: They now take a more liberal interpretation of their powers.\nsomeone who respects many different types of beliefs or behaviour: Liberals believe that in order to defend our own freedom we ought to defend those of our fellow citizens.\nsomeone who supports personal freedom and a fairer sharing of wealth and power in society: He described his opponent as a liberal who would tax the rich."}