{"id":211733,"name":"libel","type":"noun","us_sound":"ˈlaɪ.bəl","us_link":"../audio/l/eus72774.mp3","uk_sound":"ˈlaɪ.bəl","uk_link":"../audio/l/uklevel028.mp3","content":"Add to word list\nAdd to word list\na piece of writing that contains bad and false things about a person: She threatened to sue the magazine for libel. Compare\nslander noun\nSMART Vocabulary: related words and phrases\nDamaging reputation\nanti-defamation\naspersion\nbesmirch\nblack mark\nblacken\nblot\ndefame\ndemonize\ndog\ndrag someone's name through the mire/mud idiom\ngive a dog a bad name idiom\nscurrilously\nself-immolation\nshow someone in a bad light idiom\nslander\nslanderer\nslur\nsmear\nstab\ntarnish\nSee more results »\nRelated word\nlibellous\nto write and publish something that contains bad and false things about a person: She claims the newspaper libelled her in editorials and news articles. With a few exceptions, no writer consciously sits down with the aim of libelling anyone. Compare\nslander noun\nMore examplesFewer examplesHe was arrested and held briefly on charges of libelling the president.She cited several instances in which he allegedly libelled her.They feel they have been libelled by media outlets.\nSMART Vocabulary: related words and phrases\nDamaging reputation\nanti-defamation\naspersion\nbesmirch\nblack mark\nblacken\nblot\ndefame\ndemonize\ndog\ndrag someone's name through the mire/mud idiom\ngive a dog a bad name idiom\nscurrilously\nself-immolation\nshow someone in a bad light idiom\nslander\nslanderer\nslur\nsmear\nstab\ntarnish\nSee more results »\nAdd to word list\nAdd to word list\na piece of writing that says bad, false, and harmful things about a person, or the legal claim you make when you accuse someone in court of writing such things about you: [ C ] The whole story was a vicious libel. [ U ] Angry at what the newspaper had printed, she sued for libel. libel verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈlɑɪ·bəl/\nThe general contends the network libeled him in a television broadcast. libelous adjective us\nYour browser doesn't support HTML5 audio\n/ˈlɑɪ·bə·ləs/\nlibelous articles\nAdd to word list\nAdd to word list\nsomething written or published that makes false or unfair statements that are likely to damage the reputation of a person or organization: libel suit/lawsuit They filed a libel lawsuit against the person responsible for the web posting. He was sentenced to 18 months' imprisonment after the collapse of his libel action against the newspaper. He was determined to sue any publication that repeated the libels. Compare\nslander\nto write or publish something which makes false or unfair statements that are likely to damage the reputation of a person or organization: He pardoned two journalists who had been sentenced to prison for libelling the foreign minister. Compare\nslander"}