{"id":211785,"name":"liberally","type":"adverb","us_sound":"ˈlɪb.ər.əl.i","us_link":"../audio/l/liberally.mp3","uk_sound":"ˈlɪb.ər.əl.i","uk_link":"../audio/l/ukliber005.mp3","content":"liberally adverb\n(IN LARGE AMOUNTS)\nAdd to word list\nAdd to word list\nin a way that is involves large amounts of something: Apply the cream liberally to the affected area. Banks are lending money more liberally than ever.\nMore examplesFewer examplesThe author sprinkles her English prose liberally with Spanish words. Season the steak liberally before grilling.Walt Whitman is liberally quoted in the piece.Unlike US consumers, many of whom use credit liberally, Chinese workers opt to save.Place the remaining stuffing on the top, and dot liberally with the butter.\nSMART Vocabulary: related words and phrases\nPlenty and abundant\nabound\nabound in/with something\nabundance\nabundant\nabundantly\ndrip\ngenerous\ngenerously\nhandsomely\nhealthily\nin abundance\nlavish\nluxuriant\nplenteously\nplentiful\nplentifully\nplenty\nprofuse\nrichly\nwell off\nSee more results »\nliberally adverb\n(NOT EXACTLY)\nin a way that is not exact or exactly correct: In describing him as an author I guess you're using the word very liberally?\nMore examplesFewer examplesDo concepts such as \"resistance\" have much force when employed so liberally? He uses the description \"soap opera\" a little liberally.In this context I'm using the word \"compound\" a bit more liberally.\nSMART Vocabulary: related words and phrases\nWrong\naberrant\naberrantly\nabnormal\namiss\nanomalous\nbark\nfallaciousness\nfalse\nfalse negative\nfalse positive\nfalsely\niniquity\ninvalidly\nirregular\nirregularly\nliberal\nmal-\nquarrel\nwrongheadedly\nwrongly\nSee more results »\nliberally adverb\n(ATTITUDES)\nin a way that allows a lot of freedom for different types of belief or behavior: She was raised very liberally by her parents.\nin a way that is politically liberal: He mistakenly thought he could vote as liberally as he wanted in Washington.\nMore examplesFewer examplesLincoln himself said after the victory, \"I want no one punished; treat them liberally all around.\"The MP condemned the decision to pardon the men as \"deplorable\" and said the four had been treated \"far too liberally\".Polls show a big shift against racism and that we now think more liberally about race.\nSMART Vocabulary: related words and phrases\nOpen-minded\nanti-liberal\nanti-liberalism\nbig tent\nbroad-minded\nbroad-mindedness\ninclusively\nliberal\nliberalism\nliberality\nlive\nlive and let live idiom\nopen-minded\nopen-mindedly\nopen-mindedness\npermissive society\nreceptive\ntolerance\ntolerantly\nunblinkered\nundogmatic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPolitics - general words\nSee\nliberal\nAdd to word list\nAdd to word list\ngiven or used generously: The food was liberally seasoned with salt."}