{"id":211854,"name":"library","type":"noun","us_sound":"ˈlaɪ.brer.i","us_link":"../audio/l/library.mp3","uk_sound":"ˈlaɪ.brər.i","uk_link":"../audio/l/cdo0123uklibr1319.mp3","content":"Add to word list\nAdd to word list\nA2 a building, room, or organization that has a collection of books, documents, music, and sometimes things such as tools or artwork, for people to borrow, usually without payment: a public/university library a library book Some libraries were lending MP3 players to students. She set up a toy library for local parents and toddlers.\nRobert Nicholas/OJO Images/GettyImages\na collection or set of books or recordings, all produced in the same style or about the same subject: the Penguin Shakespeare Library\na collection of songs or pieces of music on an online music service: You can share your music library with other users. The music streaming service is growing its library by tens of thousands of tracks per week.\nMore examplesFewer examplesThe library has three levels, with a conference centre at ground level.This library loans books, CDs and videotapes.Jill spent the past few months doing research in the library.A date stamp inside the front cover of a library book shows when it should be returned.The council has decided that the local public libraries will close on Mondays.\nSMART Vocabulary: related words and phrases\nParts of buildings: rooms\nantechamber\nanteroom\natelier\nattic\nballroom\ndressing room\nefficiency room\nen suite\neyrie\nfamily room\nmeat locker\nmulti-chambered\nmulti-room\nobservation lounge\npanic room\nutility room\nvestibule\nwaiting room\nwet room\nworkroom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPublic buildings\nGroups and collections of things\nBooks & parts of books\nComputer concepts\nAdd to word list\nAdd to word list\na building, room, or organization that has a collection esp. of books, music, and information that can be accessed by computer for people to read, use, or borrow: a library book a public library"}