{"id":212094,"name":"lie","type":"verb","us_sound":"laɪ","us_link":"../audio/l/lie.mp3","uk_sound":"laɪ","uk_link":"../audio/l/uklicen013.mp3","content":"lie verb\n(POSITION)\nAdd to word list\nAdd to word list\nA2 [ I + adv/prep, L ] present participle lying | past tense lay | past participle lain to be in or move into a horizontal position on a surface: to lie in bed to lie on a beach to lie on your side A cat lay in front of the fire. He lies awake at night, worrying. A pen lay on the desk.\nB1 [ I + adv/prep, L ] present participle lying | past tense lay | past participle lain If something lies in a particular place, position, or direction, it is in that place, position, or direction: There's an old pair of shoes of yours lying at/in the bottom of the wardrobe. The river lies 30 km to the south. The team is lying third in the league. Here lies the body of Mary Taylor (= this is where Mary Taylor is buried). There are several houses lying empty in the town. The town lay in ruins. The ship lies off (= is positioned near) the coast of Spain.\n[ I + adv/prep ] present participle lying | past tense lay | past participle lain to exist: The hardest part of the competition still lies ahead of us.\nC2 [ I usually + adv/prep ] present participle lying | past tense lay | past participle lain If responsibility, blame, a decision, a choice, etc. lies with someone, they have responsibility, must make the decision, etc.: Responsibility for the disaster must ultimately lie with the government. Where does the blame lie?\nThesaurus: synonyms, antonyms, and examples\nbe to blame for somethingbe to blameNo one can decide who is to blame.be at faultBoth the fans and the players were at fault.be someone's faultThis is all my fault.be responsibleWe're still trying to determine who was responsible for the attacks.the blame lies withSome of the blame lies with investors.the blame rests withMuch of the blame rests with the government, which has confused people with conflicting health messages\nSee more results »\nlie in state present participle lying | past tense lay | past participle lain\nWhen the dead body of an important person lies in state, it is arranged so that the public can see and honour it before it is buried: Thousands of people came to pay their respects as his body lay in state.\nSee more\nMore examplesFewer examplesIt was very uncomfortable lying on the hospital bed with my legs suspended in the air.He was lying under the table in a drunken stupor.The ship has been lying on the seabed for more than 50 years.My dog loves lying on the rug in front of the fire.The town lies halfway between Rome and Florence.\nSMART Vocabulary: related words and phrases\nReclining\ncrowd-surfing\nfallen\nfetal position\nfoetal position\nfull-length\nlean\nlounge around (something)\nprone\nprone positioning\nproning\nprostrate\nprostration\nrepose\nsink\nsink into something\nsit back\nsprawl\nsprawled\nstretch\nsupine\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlacing and positioning an object\nExisting and being\nDuty, obligation and responsibility\nlie verb\n(SPEAK FALSELY)\nB1 [ I ] present participle lying | past tense lied | past participle lied to say or write something that is not true in order to deceive someone: Are you lying to me? Don't trust her - she's lying. I suspect he lies about his age. See also\nliar\nThesaurus: synonyms, antonyms, and examples\nto say something not true in order to deceivelieAll she does is lie - you can't believe a word she says.tell a lieI cannot tell a lie: I chopped down the cherry tree.lie through your teethHe lied through his teeth that he didn't go to the cinema, though he was still holding the ticket stub in his hand as he said it.fibI don't like fibbing, but I didn't want to hurt his feelings by saying his gift was awful.misleadI'm afraid you've been misled. She is, in fact, married.deludeHe's deluding himself if he thinks that he's getting that promotion.\nSee more results »\nMore examplesFewer examplesIf you're both going to lie, at least stick to the same story and don't contradict each other!He studied the men's faces carefully, trying to work out who was lying.Are you accusing me of lying?The prime minister reacted angrily to claims that he had lied to the House of Commons.He's never lied to me before, so I have no reason to doubt his word.\nSMART Vocabulary: related words and phrases\nLies, lying & hypocrisy\na pack of lies idiom\nartifice\nbad faith\nblack is white idiom\ncakeism\ncanard\nfalsehood\nfalsification\nfeed someone a line idiom\nfib\nfiction\nmythologically\nmythologize\nperjure\nperjury\nstretch the truth idiom\nwashing\nweasel words\nwhite lie\nwhopper\nSee more results »\nGrammar\nLay or lie?The verb lay means ‘to put something down carefully in a flat position’. It must have an object. It is a regular verb, but note the spelling of the past simple and -ed form: laid not layed: …\nIdioms\nlie doggo\nlie down on the job\nlie low\nlie through your teeth\nnot take something lying downPhrasal verbs\nlie around\nlie back\nlie behind something\nlie down\nlie in\nlie in something\nlie up\nB1 something you say that you know is not true: I told a lie when I said I liked her haircut.\nMore examplesFewer examplesIt's embarrassing to be caught telling a lie.I wasn't entirely honest with him, I admit, but I didn't actually tell him any lies.The story was nothing but lies.Under cross-examination, the witness admitted her evidence had been mostly lies.It's difficult to disentangle hard fact from myth, or truth from lies.\nSMART Vocabulary: related words and phrases\nLies, lying & hypocrisy\na pack of lies idiom\nartifice\nbad faith\nblack is white idiom\ncakeism\ncanard\nfalsehood\nfalsification\nfeed someone a line idiom\nfib\nfiction\nmythologically\nmythologize\nperjure\nperjury\nstretch the truth idiom\nwashing\nweasel words\nwhite lie\nwhopper\nSee more results »\nIdioms\ngive the lie to something\nI tell a lie\nthe lie of the land\nlie verb\n(POSITION)\nAdd to word list\nAdd to word list\npresent participle lying us/ˈlɑɪ·ɪŋ/ | past tense lay us/leɪ/ | past participle lain us/leɪn/ to be in or move into a horizontal position on a surface: [ I always + adv/prep ] The mechanic was lying on his back underneath my car. [ I always + adv/prep ] I love to lie down in front of the fire and read. [ L ] He lies awake at night, worrying.\npresent participle lying us/ˈlɑɪ·ɪŋ/ | past tense lay us/leɪ/ | past participle lain us/leɪn/ If something lies in a particular place, position, condition, or direction it is in that place, position, condition, or direction: [ I always + adv/prep ] The river lies 40 miles to the south of us. [ I always + adv/prep ] You shouldn’t leave that check lying around (= not in its place).\nlie verb\n(SPEAK FALSELY)\n[ I/T ] present participle lying us/ˈlɑi·ɪŋ/ | past tense and past participle lied to say something that is not true in order to deceive: [ I ] Both witnesses lied to the police about what happened. [ T always + adv/prep ] She lied her way past the guards. lie noun [ C ] us\nYour browser doesn't support HTML5 audio\n/lɑɪ/\n(SPEAKING FALSELY)\nHer report is full of lies and misinformation. Idiom\nlie lowPhrasal verbs\nlie ahead (of someone)\nlie behind something"}