{"id":212183,"name":"life","type":"noun","us_sound":"laɪf","us_link":"../audio/l/life.mp3","uk_sound":"laɪf","uk_link":"../audio/l/uklicen020.mp3","content":"life noun\n(TIME ALIVE)\nAdd to word list\nAdd to word list\nA1 [ C or U ] the period between birth and death, or the experience or state of being alive: Life's too short to worry about money! I'm not sure I want to spend the rest of my life with him. Unfortunately, accidents are part of life. He went mad towards the end of his life. Cats are supposed to have nine lives. He doesn't know what he really wants in/out of life. The accident changed my whole outlook on life. He lost his life (= died suddenly because of a violent event or accident) in the Great War. A simple mixture of glucose and water can save lives in many parts of the world. He ran off with her life savings (= all the money she had saved). See also\nafterlife for life\nC1 for the whole of a person's life: I believe marriage is for life.\nSee more give your life (also lay down your life)\nto be willing to die in order to defend or support someone or something: They were ready to give their lives for their country.\nSee more life after death\nIf you believe in life after death, you believe that people continue to exist in some form after they die: He truly believes that there is life after death.\nSee more\nMore examplesFewer examplesShe seems like a woman who is contented with her life.Your life changes dramatically when you have a baby.Her time at university was the most eventful period of her life.The new drug might help save the lives of cancer victims.It was only later in life that she found happiness and peace of mind.\nSMART Vocabulary: related words and phrases\nLife and living\nalive\nanimate\nborrow\ncheat\ncheat death idiom\nco-exist\ncradle\nimmortal\nlast out\nlife cycle\nlife expectancy\nlife form\nlife history\nraise\nraise someone from the dead idiom\nrevenant\nsocial life\nstay alive\nsubsist\nvital\nSee more results »\nlife noun\n(WAY OF LIVING)\nB1 [ C or U ] a way of living or a particular part of someone's life: her family/private/sex life my working life We interviewed senior politicians, famous writers, and others in public life. Drugs and violence are deeply rooted in American life. I left home at 16 to see life (= have different experiences with a lot of people in lots of places). Teaching has been her life (= the most important and enjoyable thing in her life). start a new life (also make a new life for yourself)\nto completely change how or where you live: She decided to start a new life in Australia.\nSee more\nSMART Vocabulary: related words and phrases\nLife and living\nalive\nanimate\nborrow\ncheat\ncheat death idiom\nco-exist\ncradle\nimmortal\nlast out\nlife cycle\nlife expectancy\nlife form\nlife history\nraise\nraise someone from the dead idiom\nrevenant\nsocial life\nstay alive\nsubsist\nvital\nSee more results »\nlife noun\n(TIME OF OPERATION)\nC2 [ C usually singular ] the period for which a machine or organization lasts: The newer batteries have a much longer life. Careful use will prolong the life of your machine. The legislation won't be passed during the life of the present parliament.\nSMART Vocabulary: related words and phrases\nPeriods of time - general words\nage\nat/in one sitting idiom\nchapter\nday\ndigital age\nduration\nleeway\nlength\nlife cycle\nlifetime\nmaking\nme time\nperiod\nsession\nsleep\nspasm\ntide\ntime lag\ntime span\ntimescale\nSee more results »\nlife noun\n(BEING ALIVE)\n[ U ] the quality that makes people, animals, and plants different from objects, substances, and things that are dead: The doctor could find no sign of life in the old man's body.figurative I looked through the window but I couldn't see any signs of life (= people moving).\nSMART Vocabulary: related words and phrases\nLife and living\nalive\nanimate\nborrow\ncheat\ncheat death idiom\nco-exist\ncradle\nimmortal\nlast out\nlife cycle\nlife expectancy\nlife form\nlife history\nraise\nraise someone from the dead idiom\nrevenant\nsocial life\nstay alive\nsubsist\nvital\nSee more results »\nlife noun\n(ENERGY)\nB2 [ U ] the quality of having a lot of energy, interest, or excitement: She's so full of life. Los Angeles was a great place to live, really full of life. The bright colours bring more life to the painting.\nThesaurus: synonyms, antonyms, and examples\nactivityactivityThere were several police vans and a lot of activity in the area.hubbubI couldn't find her with all the hubbub going on.bustleI miss the bustle of the big city.hustle and bustleShe got used to the hustle and bustle of daily life.flurry of activityWhat was the reason behind this sudden flurry of activity?burst of activityIt's usually quiet in the shop, but occasionally we have a sudden burst of activity.\nSee more results »\nbring something to life\nto make something more real or exciting: It's always been an interesting period in history and this film really brought it to life.\nSee more come to life\nto start to be alive or to grow, or start to function: Just install batteries, and watch the robot come to life.\nto become more exciting or start to seem more real: The game really came to life in the second half.\nSee more back to life\nalive or growing again, or starting to function again: I wish Shakespeare could come back to life and tell us what he thinks. In spring, the earth comes back to life as seeds begin to germinate. Pent-up demand brought the economy roaring back to life.\nmore exciting or more real again: Urged on by the crowd, he brought the match back to life. This show brings an almost forgotten novel brilliantly back to life.\nSMART Vocabulary: related words and phrases\nExcitement, interest, energy and enthusiasm\nalacrity\nanimation\nardour\navidity\nboosterism\ncommotion\nflirtation\nfrenzy\nfriskiness\nfrisson\nget-up-and-go\nhubbub\npep\nperkiness\nphysicality\npiquancy\npizzazz\nwoot\nzeal\nzealousness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLife and living\nMachines - Functioning\nlife noun\n(LIVING THINGS)\nB1 [ U ] everything that is alive: human/marine/plant life\nSMART Vocabulary: related words and phrases\nLife and living\nalive\nanimate\nborrow\ncheat\ncheat death idiom\nco-exist\ncradle\nimmortal\nlast out\nlife cycle\nlife expectancy\nlife form\nlife history\nraise\nraise someone from the dead idiom\nrevenant\nsocial life\nstay alive\nsubsist\nvital\nSee more results »\nlife noun\n(IN ART)\n[ U ]\n&#160; art\n&#160; specialized In art, if you work from life, you paint, draw, etc. real people or objects, usually while they are in front of you rather than from memory: life drawing classes\nSMART Vocabulary: related words and phrases\nArt history & artistic movements\nabstract\naesthetic\nanti-modern\nanti-modernism\nanti-modernist\ncubist\nexpressionism\nexpressionist\nexpressionistic\nexpressionistically\nmodernism\nmodernist\nmontage\nnaturalism\nnaturalistic\nregency\nrococo\nromantic\nromanticism\nscreen printing\nSee more results »\nlife noun\n(IN GAMES)\n[ C ] informal especially in children's games, one of the limited number of times that you can lose, but still continue playing: Every time the little man gets hit, you lose a life.\nSMART Vocabulary: related words and phrases\nChildren's games\nblind man's buff\nconker\ndingbat\ndouble Dutch\ndress-up box\ndressing-up box\nFrench cricket\ngo fish\nhide-and-seek\nhopscotch\njack\nmagnet fishing\nmarble\npainting\npainting by numbers idiom\npeekaboo\npig Latin\npiggy in the middle\npiggyback\nwarm\nSee more results »\nlife noun\n(BIOGRAPHY)\n[ C ] the life story of a person written by someone else: What moved him to write a life of John O'Hara? Synonym\nbiography\nSMART Vocabulary: related words and phrases\nBooks: kinds of books\nabridgment\nannual\nanthology\naudiobook\nbacklist\ndigest\ndime novel\ne-reader\neasy read\nexercise book\nmulti-volume\nmust-read\nnovel\nnovelette\nnovelistic\ntome\ntrilogy\nvade mecum\nworkbook\nya\nSee more results »\nIdioms\nbe (all) part of life's rich tapestry/pageant\nbe one/another of life's great mysteries\nsomething come to life\nfor the life of you\nget a life!\ngive your life to something\nhow's life (treating you)?\nlead/live the life of Riley\nthe life and soul of the party\nthe man/woman in someone's life\nMore idioms\nnot on your life!\nscare/frighten the life out of someone\nthe school/university of life\ntake your (own) life\ntake someone's life\ntake your life in your hands\nthat's life!\nthis is the life!\nto the life\nlife noun\n(TIME BEING ALIVE)\nAdd to word list\nAdd to word list\n[ C/U ] plural lives us/lɑɪvz/ the period between birth and death, or the state of being alive: [ U ] Life is too short to worry about money! [ C ] Cats are supposed to have nine lives.\n[ C/U ] plural lives us/lɑɪvz/ Life is also anything that is alive: [ U ] animal/plant life life after death\nIf you believe in life after death, you believe that a person continues to exist in some way after dying.\nlife noun\n(EXPERIENCE)\n[ C/U ] a particular type or part of someone’s experience: [ U ] She appreciates life in the United States. [ U ] A vacation is a pleasant change from everyday life. [ C ] He rarely talks about his private life.\nlife noun\n(TIME SOMETHING WORKS)\n[ U ] the period during which a machine or object that produces power works: The newer batteries have a much longer life – up to 100 hours.\nlife noun\n(ENERGY)\n[ U ] energy or enthusiasm: The show was full of life.\nAdd to word list\nAdd to word list\n[ C ] the amount of time that something exists or works: the life of a mortgage/loan/investment He would reach retirement during the life of the mortgage.begin/start life The firm began life as a direct marketing company.\n[ C ] the amount of time that something can be used: Increasing the battery life of the phone is important. If the maintenance continues at its current level, the useful life of the facility will be significantly shortened.\n[ C or U ] the time that someone is alive, the things that happen to them, and the way they spend their time: The hit TV series was inspired by the life of the comedian Chris Rock. She says she was inspired to a life of public service by her father. Matt is someone who enjoys life to the full.\n[ C ] the time that someone spends doing particular things: personal/private life This job doesn't leave much time for a personal life. I've met a lot of interesting people in my working life.\n[ U ] a way of living that is typical of a particular place or situation: city/country/town life I'm not somebody who longs for city life. corporate/civilian/military life daily/day-to-day/everyday life See also\ndepreciable life\neconomic life\nexpectation of life\njob for life\nnon-life\nshelf life"}