{"id":212296,"name":"light","type":"noun","us_sound":"laɪt","us_link":"../audio/l/light.mp3","uk_sound":"laɪt","uk_link":"../audio/l/uklifes006.mp3","content":"light noun\n(BRIGHTNESS)\nAdd to word list\nAdd to word list\nB1 [ U ] the brightness that comes from the sun, fire, etc. and from electrical devices, and that allows things to be seen: a bright light fluorescent/ultraviolet light a beam/ray of light Light was streaming in through the open door. It's a north-facing room so it doesn't get much light (= brightness from the sun).\nThesaurus: synonyms, antonyms, and examples\nbrightness that allows you to seelightLight streamed in through the window.brightnessThe brightness of the sun hurt his eyes.illuminationFor professional-quality photos, it is best to use several sources of illumination. sunThis plant needs to be in full sun.sunlightSunlight streamed in through the windows.daylightHow much daylight does this room get?\nSee more results »\nA2 [ C ] a piece of equipment that produces light, such as a lamp or a bulb: Could you switch/turn the light on/off, please? She could see the city lights in the distance. As the lights went down, the audience grew quiet. My front bike light isn't working. the lights UK (also the light)\ntraffic lights (= a set of red, yellow, and green lights that control the movement of vehicles, usually at a point where two or more roads join): She stopped at the lights and saw him on the other side of the road.\nSee more\nMore examplesFewer examplesThe light was so bright that I had to cover my eyes.The bomb exploded in a flash of yellow light.The torch sends out a powerful beam of light.She pulled the duvet over her head to try to shut out the light.We saw a glimmer of light in the distance.\nSMART Vocabulary: related words and phrases\nLight\nbeam\nbrilliance\ncandlelight\ncoruscation\ndaylight\nfluorescence\nhelio-\nillumination\nincandescence\nincident light\ninfrared\nlamplight\nmoonbeam\nphosphene\nphosphorescence\nphoto\nshininess\nstarlight\nsunlight\ntorchlight\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLighting & light fittings in the home\nlight noun\n(FLAME)\na light\nsomething that will produce a flame and cause burning, such as a match or a cigarette lighter: Have you got a light, please?\nMore examplesFewer examplesHe asked me for a light.She gave me a light.I didn't have a light.Can you give me a light?I needed a light.\nset light to something UK\nto cause something to start burning: The lamp caught fire and set light to the curtains.\nSee more\nSMART Vocabulary: related words and phrases\nTobacco & smoking\nanti-tobacco\nbig tobacco\nbong\nbriar\nchain-smoker\ncigarette\ncigarette butt\ncigarette holder\nfag\nfilter tip\nnicotine patch\npuff\npuffer\nroll up! idiom\nroll-your-own\nsecond-hand smoke\nshisha\nsmokeless\ntobacco\ntobacconist\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHeaters & burners\nlight noun\n(LUNGS)\nlights\n[ plural ] mainly UK animal lungs eaten as food: The French like to poach lights before frying them with onions, tomatoes, and a wine sauce.\nSee more\nIdioms\nbring something to light\ncast/shed/throw light on something\ncome to light\ngo out like a light\nin the light of something\nkeep the lights on\nlight at the end of the tunnel\nthe light of your life\nshow someone in a bad light\nlight adjective\n(NOT HEAVY)\nA2 not weighing a lot: Here, take this bag - it's quite light. He's a few pounds lighter than he used to be. How do you get your cakes so wonderfully light, Amy? He has a very light (= gentle) touch, which is what is required in massage. She's very light on her feet (= she moves gracefully).\nThesaurus: synonyms, antonyms, and examples\nnot weighing muchlightThis is one of the lightest vacuum cleaners on the market.lightweightI'm looking to buy a lightweight suitcase for my trip.superlightMy new racing bike has a superlight frame.ultra-lightweightThey've just released the latest in ultra-lightweight laptops.\nSee more results »\nA2 Light clothes are made of thin material that allows you to be cool: a light summer dress\nThesaurus: synonyms, antonyms, and examples\nmade of thin materiallightAll you'll need is a light jacket to keep warm.lightweightThese pants are made from a lightweight denim that is less stiff.airyHer gown was made of an airy, delicate organza.floatyThe ballerinas were in floaty tutus that fluttered as they danced. etherealThe designer is known for his ethereal cocktail dresses that shimmer.\nSee more results »\nMore examplesFewer examplesWill you be able to carry these bags to the car? There're quite light.This umbrella is very light and it fits easily into my bag.I can't carry you around any more - you're not as light as you were, my girl!My suitcase is fairly light as I didn't have time to pack very much.The kitten was so light I could hardly feel it sitting on my lap.\nSMART Vocabulary: related words and phrases\nLight and weightless\n(as) light as a feather idiom\nairiness\nairy\nethereal\nethereally\nfluffy\nfoamy\nfrothily\nfrothy\ninsubstantial\nlightweight\nportability\nportable\nsheer\nsuperlight\nultra-lightweight\nweightlessness\nwispily\nwispy\nzero gravity\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStyle & appearance of clothes\nlight adjective\n(BRIGHT)\nB1 lit by the natural light of the day: The big windows make the room feel wonderfully light and airy. It gets light very early these summer mornings. Summer is coming and the evenings are getting lighter (= getting dark later).\nThesaurus: synonyms, antonyms, and examples\nfull of light so you can seelightI'll wait until it's light outside before I go for a jog.brightIt was quite bright in the examination room.sunnyThe baby's nursery was bright and sunny.sunlitThe house boasts a sunlit parlour with floor-to-ceiling windows.sun-drenchedThey spent a week on the sun-drenched beaches of Bali.\nSee more results »\nMore examplesFewer examplesThe new offices are light and airy.It doesn't get light until nine.The hall was light and decorated in a modern style.I wanted the summer room to be very light.Her house is light and airy.\nSMART Vocabulary: related words and phrases\nThe qualities of light\nbacklit\nbrightly\nbrilliantly\ncoruscating\ndazzlingly\ndullness\nflickering\nfloodlit\nglittering\nincandescent\nlambent\nluminescence\nluminosity\nlustrously\nnon-fluorescent\nnon-solar\nopalescent\novercast\nspangly\nunshaded\nSee more results »\nlight adjective\n(PALE)\nA1 (of colours) pale: light blue/green Opposite\ndark\nMore examplesFewer examplesHe had spiky light brown hair, shaved at the sides and gelled on top.A dark carpet won't mark as easily as a light one.The walls are painted light blue.I prefer to wear light colours.They have a light brown carpet.\nSMART Vocabulary: related words and phrases\nColourless or causing colour to fade\nashen-faced\ncolourlessly\ndiscoloration\ndiscolour\ndrab\ndrably\ndrabness\ndull\nfade\nfrost\nghostly\nlighten\nmuted\npale\npalish\npastel\nsubdued\nwashed out\nwashy\nweathered\nSee more results »\nlight adjective\n(NOT SERIOUS)\nentertaining and easily understood, but not serious and not intended to make you think: I want some light reading for the summer holidays - a romance or something. A lively argument between the two main speakers provided some light relief (= something enjoyable or amusing) in an otherwise dull conference. make light of something\nC2 to behave as if a situation, especially a problem, is not serious or important: It is easy to make light of other people's problems.\nSee more\nMore examplesFewer examplesI found her novels rather light.The programmes are intended as light entertainment.I did a little light reading.She enjoys light opera.The movie was light but fun.\nSMART Vocabulary: related words and phrases\nHumour & humorous\namusingly\nbitingly\nblackly\nbone dry idiom\nbring\ndrily\ngag\ngeddit?\nGSOH\njocose\nlightly\nmordancy\nnon-serious\npawky\nphotobomb\nphotobombing\nrib\nstanding joke\nwag\nwisecrack\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of music\nlight adjective\n(NOT MUCH)\nB1 not great in strength or amount: A light wind was blowing. The traffic was quite light so we got through London quickly. It's only light rain - you don't need an umbrella.\nThesaurus: synonyms, antonyms, and examples\nnot strong or forcefulgentleA gentle breeze stirred the leaves.mildThe children just have a mild cold.softHer voice was so soft, I could barely hear her.lightThe temperature in London is 24 degrees, with light winds out of the west.lowKeep your voices low while the baby's sleeping.\nSee more results »\nlight eater/drinker/smoker\nsomeone who eats/drinks/smokes only a little: The recipe will feed eight light eaters or six hungry people.\nSee more light sleeper\nsomeone who is easily woken up by noise, etc.: I'm a very light sleeper.\nSee more\nMore examplesFewer examplesThere was a light covering of snow.This wine has a light, fruity flavour .The sauce itself was light, fragrant and slightly sweet.The boat goes fast, even in light winds.There is only light traffic on the roads tonight.\nSMART Vocabulary: related words and phrases\nWeakness and vulnerability\nAchilles heel\nat a low ebb idiom\nbe (only) flesh and blood idiom\nbe someone's poodle idiom\nbrittle\nfrail\nhelpless\nhelplessly\nhelplessness\nhouse of cards idiom\nshakiness\nshaky\nsitting duck\nsitting target\nsoft target\nweakling\nweakly\nweakness\nweedy\nwetly\nSee more results »\nlight adjective\n(MEAL/DRINK)\nA light meal is small and easy to digest: I don't eat much for lunch - just a light snack.\nused to describe alcoholic drinks that are not strong in flavour: It's described on the label as \"light, fruity wine\".\nSMART Vocabulary: related words and phrases\nMeals & parts of meals\naccompaniment\nafternoon tea\nafters\namuse-bouche\nantipasto\nelevenses\nEnglish breakfast\nfeast\nfeeding\nfinger buffet\nplat du jour\nplate meal\nploughman's lunch\npostprandial\npot luck\ntakeout\ntapas\ntea\ntea party\nteatime\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDrinking alcohol\nlight adjective\n(NOT SEVERE)\nneeding only a very small amount of effort: light exercise, such as walking a little light housework\nA light sentence in prison is a short one: He got off with a fairly light sentence because it was his first conviction. make light work of something/doing something\nto do something quickly and easily: Heather made light work of painting the walls.\nSee more\nSMART Vocabulary: related words and phrases\nEasiness and simplicity\n(as) easy as pie/ABC/anything/falling off a log idiom\na walk in the park idiom\naccessibility\nat the push of a button idiom\nat the stroke of a pen idiom\nbe a matter of something idiom\nfacilely\nfail-safe\nfoolproof\nfrictionless\nfrictionlessly\nover-facile\nover-simple\nover-simply\npainlessly\npainting\nUX\nwalk\nwalk into something\nwieldy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPutting people in prison\nIdiom\n(as) light as a feather\nlight verb\n(START FLAMES)\nB1 [ I or T ] to start to burn or to make something start to burn: to light a fire I can't get the cooker to light. He lit his fifth cigarette in half an hour.\nMore examplesFewer examplesThe room was lit by candles.A full moon lit up the sky.A dim torch lit the cave.Laser beams lit up the night.A white light lit up the screen.\nSMART Vocabulary: related words and phrases\nStarting fires\narsonist\nbellows\ncombust\nfire\nfire starter\nfirelighter\nignite\nignition\nkindle\nkindling\nmake\nmake something up\nmatch\nput\nput something out\nreignition\nset fire to something/someone idiom\nset something/someone on fire idiom\ntinder\ntorch\nSee more results »\nlight verb\n(MAKE BRIGHT)\nB2 [ T ] to produce light that makes an object or area bright or easy to see: The stage had been lit with candles. Fireworks lit up the sky (= made the sky bright).\nSMART Vocabulary: related words and phrases\nGiving out light\nafire\nalbedo\nbeam\nbeamy\nbioluminescence\nburnished\nflicker\ngleam\nglimmer\nglitter\nglow\nluminescent\nluminously\nnoctilucent\nnon-glare\nnon-luminous\nout-glitter\nreflected ray\nshine\nwink\nSee more results »\nIdioms\nlight a fire under someone\nlight the lampPhrasal verbs\nlight on/upon something\nlight (something) up\nlight noun\n(ENERGY)\nAdd to word list\nAdd to word list\n[ C/U ] the energy from the sun or fire and from electrical devices that allows you to see clearly: [ U ] Light was streaming through the windows. [ U ] The light was so bright that it hurt my eyes.\n[ C/U ] A light is also anything that provides light, esp. an electric lamp: [ C ] Don’t forget to turn off the lights when you leave.\n[ C/U ] A light is also a traffic light: Let’s go – you’ve got a green light.\nlight noun\n(FLAME)\n[ U ] a device used to produce a flame, such as a match: Excuse me, have you got a light? Idioms\nin (the) light of\nlight at the end of the tunnel\nlight adjective\n(NOT HEAVY)\n[ -er/-est only ] having little weight; not heavy: This suitcase is pretty light. Ty’s a few pounds lighter than he used to be.\n[ -er/-est only ] Clothes that are light are made of thin material which allows you to be cool: a light summer dress\n[ -er/-est only ] A light meal is a small one: a light snack\nlight adjective\n(NOT FAT)\n(also lite) (of food) having less fat or fewer calories than usual: light cream cheese\nlight adjective\n(NOT SERIOUS)\n[ -er/-est only ] intended to entertain; not serious: Take along some light reading for the trip.\nlight adjective\n(NOT A LOT)\n[ -er/-est only ] not great in strength or amount; slight: a light rain light traffic The doctor said it was OK to take light exercise, such as walking.\n[ -er/-est only ] A light sentence in prison is a short one.\n[ -er/-est only ] Tastes and smells described as light are not obvious: a light scent of wildflowers light eater/drinker\nA light eater/drinker eats or drinks only a little.\nlight adjective\n(ENERGY)\n[ -er/-est only ] providing energy from the sun that allows you to see clearly: It was still light out at eight in the evening. Idiom\n(as) light as a feather\nlight adjective, adverb [-er/-est only]\n(PALE)\n(of colors) pale: a light-colored car The walls were light green.\nlight verb\n(ENERGY)\n[ T ] to provide with energy from the sun, fire, or electrical devices that allow you to see clearly: The house was lit with candles for the dinner party.\nlight verb\n(FLAME)\n[ I/T ] to produce a flame: [ I ] I can’t get the barbecue to light. [ T ] I tried to light the fire, but the wood was wet. Idiom\nlight a fire under someonePhrasal verbs\nlight up\nlight up something\nAdd to word list\nAdd to word list\nnot great in size, strength, or amount: Air traffic was very light at Heathrow so we were not delayed. We had a light meal before we began negotiations.\nTRANSPORT used for describing forms of transport that are smaller or that use less power than the usual kind: Fleets of light trucks deliver furniture to households throughout the region. Light aircraft allow busy executives to fly anywhere at a moment's notice. A contest for light rail development drew interest from urban planners.\nneeding only a very small amount of work or effort: light chores/cleaning/work\nlight on sth\nnot having a lot of something: light on details/facts/information His presentation was light on details as to how he would spend the money.\nmake light work of (doing) sth\nto do something quickly or easily: Workers from the second shift stayed late so we were able to make light work of unloading the deliveries.\na way of thinking about or understanding something: a bad/good/new light After they won all those awards, we saw them in a new light and decided they were serious competitors.a negative/positive light We want to show our country in a positive light.\ncast/shed light on sth\nto show something about a situation that was previously unknown: This sheds new light on why e-business investment does not always lead to improved firm performance.\ngive sth a/the green light\nto give someone permission to do something: Contractors were given a green light to install the infrastructure for the industrial park.\nin the light of\nUK (US in light of) because of something or as a result of something: In light of problems we're having, we have no choice but to close the business."}