{"id":212472,"name":"likely","type":"adjective","us_sound":"ˈlaɪ.kli","us_link":"../audio/l/likely.mp3","uk_sound":"ˈlaɪ.kli","uk_link":"../audio/l/uklifes021.mp3","content":"Add to word list\nAdd to word list\nB1 If something is likely, it will probably happen or is expected: Do remind me because I'm likely to forget. What's the likely outcome of this whole business? I suppose that might happen but it's not very likely. [ + that ] It's quite likely that we'll be in Spain this time next year. Opposite\nunlikely\nMore examplesFewer examplesChildren from an underprivileged family background are statistically more likely to become involved in crime.She made a rough estimate of the likely cost.Disney's latest production looks likely to be their most successful ever.It is likely that the suspects have left the country by now.The study showed that one in twelve women is likely to develop breast cancer.\nSMART Vocabulary: related words and phrases\nPossible and probable\nalways\nanything's possible idiom\narguably\nas never before idiom\nauspiciously\nbet\nfair\nhouseroom\nI shouldn't wonder idiom\nit isn't over until the fat lady sings idiom\nlean\nlean towards sth\nmanage\nprobable\nprobably\nprospective\nprospectively\nrealm\ntend\ntip\nSee more results »\nGrammar\nBe likely toBe likely to is used to talk about how probable things are: …\nLikely and unlikelyLikely and unlikely are adjectives. We use them to say that something will probably happen or not happen in the future. We can use them before a noun, or with the verbs be, seem and appear: …\nIdiom\n(that's) a likely story!\nprobably: She will likely need surgery. as likely as not\nC1 probably: As likely as not, she'll end up in court over this problem.\nSee more most/very likely\nC1 very probably: Most likely he'll turn up late.\nSee more not likely!\nB1 informal certainly not!: \"Do you want to come running with me?\" \"Not likely!\"\nSee more\nAdd to word list\nAdd to word list\nexpected to happen; probable: [ + to infinitive ] If I don’t write it down, I’m likely to forget.\nprobably: I’ll most likely get there at about ten o’clock."}