{"id":212469,"name":"liked","type":"verb","us_sound":"laɪk","us_link":"../audio/l/like.mp3","uk_sound":"laɪk","uk_link":"../audio/l/uklifes017.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nlike\nlike verb [T]\n(ENJOY)\nA1 to enjoy or approve of something or someone: I like your new haircut. Do you like fish? I like it when a book is so good that you can't put it down. I quite like wine but I could live without it. He's very well-liked (= popular) at work. I like the way he just assumes we'll listen to him when he doesn't take in a word anyone else says! (= I don't like it and it annoys me.) [ + -ing verb ] I don't like upsetting people. [ + to infinitive ] He likes to spend his evenings in front of the television. [ + past participle ] He likes his steak well-done.\nThesaurus: synonyms, antonyms, and examples\nto get pleasure from somethingenjoyEnjoy your meal!enjoy yourselfHe's enjoying himself at his job.likeI like hiking a lot.loveAfter working in the garden, I love a good soak in the tub.relishJonathan always relishes a challenge.lap upHe lapped up all the attention they gave him.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto like someone or somethinglikeDo you like pasta?loveI love seafood.adoreI adore a good book.think the world of someoneAnnabel's like a daughter to him - he thinks the world of her.have a soft spot for someoneI've always had a soft spot for Rebecca ever since she was tiny.\nSee more results »\nto show that you think something is good on a social networking website by clicking on a symbol or the word 'like': Like us on Facebook! More than 200 people liked my post.\nMore examplesFewer examples\"Did you like the film?\" \"I thought it was brilliant.\"I'm one of the few people who doesn't actually like champagne.He used to like spending Friday nights with the boys.It's just as well you're not here - you wouldn't like the noise.I like films with a lot of action.\nSMART Vocabulary: related words and phrases\nLiking\nadorkable\naffection\nappreciate\napprove of someone\nattached\nbe a glutton for something idiom\ndig\ngravitate towards/to something/someone\ngrow on someone\nhatefully\nhave a lot of time for someone idiom\nhave a thing about something/someone idiom\nprotective\nshook\nsmile\nsmile on something/someone\nsmitten\ntaste\ntight\nwarm\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternet terminology\nlike verb [T]\n(WANT)\nwould like (or formal should like...)\nA1 used to say politely that you want something: I think I'd like the soup for my starter. I'd like to go to Moscow. I would like to say a big thank you to everyone who's helped to make our wedding such a special occasion!\nMore examplesFewer examplesI'll sing the verses and I'd like you all to join in the chorus.I'd like a black coffee , please.In conclusion, I would like to thank our guest speaker.I've run out of milk - would you like some creamer instead?Would you like an aisle seat or would you prefer to be by the window?\nA1 used in requests: I'd like one of the round loaves, please. [ + to infinitive ] I'd like to book a seat for tonight's performance. [ + obj + to infinitive ] I'd like you to send this for me, please. [ + past participle ] I would like the whole lot finished by the weekend.\nSMART Vocabulary: related words and phrases\nWanting things\nache for something\nacquisitive\nambitious\nambitiously\nangle for something\ndesperate\nexpense\nhave your eye on something idiom\nhunger\nhunger after/for something\nhungrily\nimpulse\npine\nseeker\nset your heart on something/doing something idiom\nset your sights on something idiom\nshook\nshopping list\nsight\nsomeone's heart's desire idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking appeals & requests\nGrammar\nHate, like, love and preferWe can use hate, like, love and prefer with an -ing form or with a to-infinitive: …\nLikeLike has a number of meanings and uses. …\nLike as a verb meaning ‘enjoy’We use like to talk about things or people which we enjoy or feel positive about: …\nWould like in offers and requestsWe use would like or ’d like to offer something to someone in a polite way or to ask them to do something politely (requests), or politely to say what we want. We use the to-infinitive form of verbs that follow: …\nLike as a preposition meaning ‘similar to’Like means ‘similar to’. We often use it with verbs of the senses such as look, sound, feel, taste, seem: …\nLike as a conjunctionIn informal contexts, we can use like as a conjunction instead of as. Traditional grammar books consider this use of like incorrect: …\nLike as a suffixWe can use like as a suffix at the end of a noun to mean ‘similar to’: …\nLike in spoken EnglishIn informal speaking, you will hear like used very commonly. It has a number of functions. It is important not to use these forms in formal writing such as academic essays. …\nBe like or what is … like?We can use be like to ask for a description of someone or something (e.g. their appearance, their character, their behaviour): …\nBe like or look like?We use be like to talk about someone’s character or personality. We use look like to talk about someone’s appearance: …\nIdioms\nhow do you like...?\nhow would you like...?\nI'd like to see...\nif you like\nlike it or lump it\nwhat's not to like?\nwould you like...?"}