{"id":212691,"name":"limited","type":"adjective","us_sound":"ˈlɪm.ɪ.t̬ɪd","us_link":"../audio/l/eus72845.mp3","uk_sound":"ˈlɪm.ɪ.tɪd","uk_link":"../audio/l/uklilt_017.mp3","content":"Add to word list\nAdd to word list\nB1 small in amount or number: a limited choice limited resources\nB2 kept within a particular size, range, time, etc.: Places on the bus are limited to 50 - so book early! The problem of stress is certainly not limited to people who work (= it exists for others too).\n(written abbreviation Ltd) used in the name of a limited company\nMore examplesFewer examplesMy culinary skills are rather limited, I'm afraid !I'm afraid my grasp of economics is rather limited.I only have a limited knowledge of Spanish.Most people only have a limited amount of leisure time.Abortion rates are high because the availability of contraceptives is limited.\nSMART Vocabulary: related words and phrases\nSmall in number and quantity\nbeggarly\nbelow\nbupkis\ncertain\ncould count something on (the fingers of) one hand idiom\nmeasly\nmild\nmildness\nmingy\nminimal\nminimally\npiffling\nremote\nscantly\nslenderly\nslenderness\nspeak\nstrength\nsuggestion\nthin\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRange and limits\nEnterprises\nAdd to word list\nAdd to word list\nLimited also means kept within a particular size, range, time, or group: The advanced course is limited to those who have already taken the introductory course.\nAdd to word list\nAdd to word list\nkept within a particular size or amount: We have a limited budget so it forces us to be imaginative with advertising.a limited number/amount A limited number of tickets will be on sale from tomorrow.limited to sth The other driver's policy was limited to $50,000.\nsmall in amount, number, or degree: To a limited extent, we control the market because we are the most respected brand. There is a limited availability of reinsurance cover for pollution cleanup. We are doing what we can with limited resources. The selection of jobs on offer is fairly limited.\nLAW\n&#160; written abbreviation (Ltd.) used in the name of a limited company: Honda Motor Company Limited is a client.\nSee also\nunlimited"}