{"id":213015,"name":"line","type":"noun","us_sound":"laɪn","us_link":"../audio/l/line.mp3","uk_sound":"laɪn","uk_link":"../audio/l/uklinct003.mp3","content":"line noun\n(LONG MARK)\nAdd to word list\nAdd to word list\nA2 [ C ] a long, thin mark on the surface of something: a straight line Sign your name on the dotted line. She was very old and her face was covered with lines. My legs felt all wobbly when I stood up and I couldn't walk in a straight line (= walk without moving to the side while moving forward).\nMore examplesFewer examplesApply a fine line of highlighter along the middle of your top lip.Draw a horizontal line across the bottom of the page.Cut on or just inside the pencil line.Draw a pair of parallel lines.Join the points A and B together on the diagram with a straight line.\nSMART Vocabulary: related words and phrases\nPatterns and shapes\namorphous\narabesque\nargyle\nasymmetrically\nasymmetry\nfigure of eight\nfishbone\nfishhook\nflecked\nformless\npalmate\nreticulation\nrhomboid\nscissor\nsemilunaris\nshapeable\nshaped\nshapeless\nwillow pattern\nzigzag\nSee more results »\nline noun\n(ROW)\nC2 [ C ] a group of people or things arranged in a row: a line of trees The prisoners formed a line against the wall.\n[ C ] US (UK queue) a group of people standing one behind the other who are waiting for something: Just get in line and wait your turn like everyone else. I had to wait/stand in line for three hours to get tickets.\nYellow Dog Productions/Stone/GettyImages\nin some team sports, a number of players in a team who typically play next to or near to each other: The team looked good going forward, but their back line looked shaky. She exploited her speed to generate scoring opportunities, to the left side of a three-player forward line. The Chargers have a strong offensive line. a long line of\na series of people or things that follow each other in time: She is the latest in a long line of controversial leaders.\nSee more\nMore examplesFewer examplesA long line of traffic edged its way forward.A ragged line of people were waiting at the bus stop.There was a solid line of traffic in front of us.We were asked to stand in two lines three metres apart.She arranged all her teddies in a line on the carpet.The Patriots have an awesome defensive line this season.\nSMART Vocabulary: related words and phrases\nThings collected in lines or rings\nchain\ncolumn\ncrocodile\nfile\ninterrow\nqueue\nrank\nring\nrope\nrow\nsingle file\nstring\nthread\ntier\ntrain\ntwo-tier\nYou can also find related words, phrases, and synonyms in the topics:\nCompetitors & participants in sports & games\nline noun\n(DIVISION)\nC2 [ C ] a long, thin and sometimes imaginary mark that forms the edge, border, or limit of something: The police couldn't arrest him because he'd fled across the state line. For many television viewers the dividing line between fact and fiction is becoming increasingly blurred.\n[ C ] in sport, one of the painted marks that form the limits of the playing area or of part of the playing area: Carter bundled the ball over the line for the opening goal. His long-range shot was caught on the line by the goalkeeper. That ball was definitely in! It was nowhere near the line!\n[ C ] in sport, the painted mark that signals the finishing point of a race: The British pair crossed the line more than four seconds clear of the field. She was leading into the last 10 metres, but was pipped onthe line. Synonym\nfinishing line\nMore examplesFewer examplesThe river serves as the line of demarcation between the two counties.This path marks the dividing line between my land and my neighbour's.The president said NATO expansion will finally erase the boundary line in Europe artificially created by the Cold War.The ball rose in a high arc and fell behind the boundary line.He thought the ball had bounced on the line, but the umpire said it was out.\nSMART Vocabulary: related words and phrases\nEdges & extremities of objects\napex\napical\napices\nbevel\nborder\nbottom\nbrow\ncap\ncircumference\ncrown\nedge\nextremity\nfoot\npalm-fringed\nperimeter\nperipherally\nperiphery\nrim\nrimless\nspout\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSurfaces on which sports take place\nRefereeing & judging in sport\nline noun\n(PHONE)\nB2 [ C ] a connection to a phone system: I'm afraid your line's been disconnected because your last bill hasn't been paid. If you want to air your opinions live on the radio, the lines will be open (= you can phone) from eight o'clock. I've got Chris Foster on the line for you. Do you want to take it now or call her back later?formal Please hold the line (= wait). I'll see if she's available.\nMore examplesFewer examplesIf you'll hold the line a moment I'll hand you over to someone who might be able to help.She's on the phone at the moment - will you hold the line?I've got John on the line for you.His line's busy at the moment - will you call back later?My mother came on the line to tell me to eat properly.\nSMART Vocabulary: related words and phrases\nCommunications - telephone equipment\nanswering machine\nblower\nbrick\nburner\ncall box\ncell phone\ndevice\ndumbphone\nextension\nmouthpiece\nphablet\npowerbank\nsim\nSIM card\nsmartphone\nspeakerphone\nswitchboard\ntelephone\ntelephone booth\ntelephone exchange\nSee more results »\nline noun\n(RAILWAY)\nB1 [ C ] (the route followed by) a railway track: The train was delayed, apparently due to leaves on the line. The Northern Line is the worst on the London Underground. Mainline services can be very quick, but travelling on the branch lines is much slower.\nMore examplesFewer examplesDue to wet leaves on the line, this train will arrive an hour late.The rebels had dynamited the railway line .The east coast railway line has been electrified.Trains may be subject to delay on the Northern Line - we apologize for any inconvenience caused.the main line between Belfast and Dublin\nSMART Vocabulary: related words and phrases\nRailways & railway lines\nAmtrak\nartery\nbranch line\nelectrify\nfunicular\njunction\nlevel crossing\nlight rail\nlight railway\nmetro\nmonorail\nrailroad\nrailroad tie\nRR\nsiding\nsignal\nsignal box\nswitch\nswitchback\nunderground\nSee more results »\nline noun\n(APPROACH TO SUBJECT)\nC2 [ C ] a way of dealing with or thinking about something or someone: The government's official line has always been to refuse to negotiate with terrorists. The courts should take a tougher line with (= punish more severely) sex offenders. Several Labour MPs disagree with their party's line on taxation. What sort of line (= method of arguing) do you think we should take in the pay negotiations? The police are confident that this new line of inquiry will lead them to the murderer. It seems inevitable that the country will be divided along ethnic lines. line of reasoning, thinking, etc.\nC2 a way of thinking about a particular subject: We cannot agree with their line of reasoning.\nSee more\nMore examplesFewer examplesHer speech deviated little from the official party line.The government can't be seen to be taking a soft line with criminals.Ministers who wouldn't toe the party line were swiftly got rid of.The government is continuing to take a tough line on terrorism.The new head teacher takes a tough line on bullying.\nSMART Vocabulary: related words and phrases\nWays of achieving things\nactively\nanother\navenue\nbases\nbasis\ndevice\nformula\nmedia\nmethod\nmethodological\nmethodologically\nmethodologist\nprocedure\nstandard operating procedure\nstrategy\nstyleless\nstylistic\nstylistically\nthus\nvehicle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOpinions, beliefs and points of view\nline noun\n(MILITARY)\nC2 [ C ] a row of positions used to defend against enemy attack, especially the ones closest to enemy positions: They were taken prisoner while on a reconnaissance mission behind enemy lines.figurative In a game of football, the goalkeeper is the last line of defence.\nMore examplesFewer examplesJournalists had insisted on getting to the front line of the battle, heedless of the risks.The troops took up their battle positions at the front line.We managed to break through enemy lines.There was panic on the enemy lines.We simply had to wait in our lines.\nSMART Vocabulary: related words and phrases\nPlaces involved in military activity\nair bridge\nair corridor\nbases\nBastille\nbattlefield\nbattleground\ncamp\nemplacement\nenceinte\nfort\nfront-line\ngarrison\nMartello tower\nmulti-front\nobservation post\nobstacle course\nparade ground\nPX\ntheatre\nunmanned\nSee more results »\nline noun\n(ICE HOCKEY)\n[ C ] in ice hockey, a group of players in a team who play at the same time : He is a left winger on the team's third line. The coach used the delay as an opportunity to change lines. See also\nline change\nSMART Vocabulary: related words and phrases\nHockey\nbiscuit\nblocker\nbroomball\ncooler\negg\neleven\nfive-hole\ngoaltender\nhockey\nlight the lamp idiom\nmajor penalty\nminor penalty\npenalty box\npipe\nquad hockey\nrhombus\nringette\nstick\nstreet hockey\ntarget man\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSports & games generally\nline noun\n(SHAPE)\n[ C ] the shape of something that has been designed or created: They have a reputation for designing cars with elegant aerodynamic lines.\nSMART Vocabulary: related words and phrases\nPatterns and shapes\namorphous\narabesque\nargyle\nasymmetrically\nasymmetry\nfigure of eight\nfishbone\nfishhook\nflecked\nformless\npalmate\nreticulation\nrhomboid\nscissor\nsemilunaris\nshapeable\nshaped\nshapeless\nwillow pattern\nzigzag\nSee more results »\nline noun\n(SUPPORT)\n[ C ] a long, strong, thin piece of material, such as string, rope, or wire, used to support something: I'd hung the washing out on the clothes line. Can you feel the fish tugging on the line?\nSMART Vocabulary: related words and phrases\nCords, ropes, cables & string\nbell pull\nbowline\nbungee\ncable\ncatgut\nfibre\nflex\nhalter\nhalyard\nharness\nlandline\nlanyard\nlariat\nlashing\nrein\nrope\nshackles\nshock cord\nstringed\nstringy\nSee more results »\nline noun\n(COMPANY)\n[ C ] a company that transports people or goods: a shipping line\nSMART Vocabulary: related words and phrases\nEnterprises\nacquiree\nacquirer\nacquiror\nagency\nagribusiness\nanswering service\nclicks and mortar idiom\nconglomerate\nconsortium\nfintech\nfirm\nfranchise\nfranchisee\nfranchiser\norganizationally\nparent company\npartner up\npartnership\nplc\nzombie company\nSee more results »\nline noun\n(REMARK)\n[ C ] a remark that is intended to entertain, persuade, or deceive: a speech full of memorable lines He keeps giving me that line about not being able to do any work because his computer is down. Who was it who came up with that famous line about \"lies, damned lies and statistics?\"\nSMART Vocabulary: related words and phrases\nRemarks & remarking\nair\nannotate\nannotation\nannotator\naside\nbackbite\nbackbiting\nbarb\ncommentary\ndog whistle\nfelicity\ninnuendo\nlast word\nmalediction\nmention\nplatitude\nprofundity\nremark\nsideswipe\nthrowaway\nSee more results »\nline noun\n(WORDS)\nB1 [ C ] a row of words that form part of a text: We could get more lines on the page if we reduced the type size. The computer screen displays 80 characters per line.\n[ C usually plural ] the words that an actor speaks when performing in a film, play, etc.: I only had two lines in the whole play. She hasn't learned her lines yet, and we've got our first rehearsal tomorrow. I'm terrified of forgetting my lines. lines [ plural ] UK\na punishment for school students in which a sentence has to be written repeatedly: She got 200 lines for swearing at her teacher.\nSee more\nSMART Vocabulary: related words and phrases\nPieces of writing\nannotation\nbiographic\nblog post\ncaption\nChyron\ncreative writing\ncutting\ndraft\nfanfiction\nfemslash\nintertextual\nintertextuality\nintertextually\nlegend\npassage\nself-portrait\nsubheading\ntranscript\ntypescript\nversification\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema & theatre: casting, roles & scripts\nline noun\n(MUSIC)\n[ C ] a short series of musical notes See also\nbass line\nSMART Vocabulary: related words and phrases\nTechnical music terms\naccidental\nadagio\naleatory\nandante\nantiphonal\narpeggio\narr.\ncadence\ngiusto\ngroove\nharmonic\nharmonic progression\nharmony\nlegato\nsyncopated\nsyncopation\ntempered\ntempo\ntimbre\ntime signature\nSee more results »\nline noun\n(JOB)\n[ C usually singular ] the type of job someone does: \"What line of work are you in?\" \"I'm a teacher.\" You meet some very interesting people in my line of business.\nline noun\n(GOODS)\nC1 [ C ] a range of similar things that are for sale: There are discounts on many items from our older lines. I was shown all their new lines.\nSMART Vocabulary: related words and phrases\nProducts & producers\nanti-dumping\nbadging\nbegetter\nbig pharma\nbig tobacco\ndeliverable\ndry goods\ndumping\nend product\nfabricator\ngeneral-purpose\ngenerator\nhaul\nmover\nmulti-line\nmulti-product\nnon-proprietary\nnotion\noutput\nspecialize\nSee more results »\nSee also\ndraw the line\ndraw a line under somethingIdioms\nall along the line\nalong the lines of something\nalong the same lines\nbe in line for something\nbe in line to do something\nbe in line to the throne\nin line with something\noff his/her line\nbe on the line\nbe out of line with something\nMore idioms\nget a line on someone\nhave a nice, good, etc. line in something\nin the line of duty\nline of sight\nput/lay something on the line\nsomewhere along the line\nstep/be out of line\nline verb [T]\n(FORM ROW)\nC2 to form a row along the side of something: Thousands of people lined the streets to watch the presidential procession pass by. Police lined the route of the demonstration. country lanes lined with trees\nSMART Vocabulary: related words and phrases\nSitting and standing\nakimbo\nastride\nbestride\ncross-legged\ncrouch\non all fours idiom\npew\nplump (someone/something) down\npose\nrampant\nreseat\nseat\nsit\nstance\nstand around\nstand aside\nstand round\nstand up\nstrike\nsurface\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeometry: parts of geometrical shapes\nline verb [T]\n(COVER)\nto cover the inside surface of something: I lined the drawers with old wallpaper. How much would it cost to have this jacket lined? Full-length mirrors lined each wall of the bathroom.\nSMART Vocabulary: related words and phrases\nCovering and adding layers\nadditive\nasphalt\nbestrew\nbind\nblanket\nblindfold\nbury\ngum\ninlaid\nlag\nlaminate\nlayer\nobliterate\nretread\nseasoned\nslap\nslap something on\nsmother something in/with something\nspeckle\ntent\nSee more results »\nIdiom\nline your pocket(s)Phrasal verbs\nline (someone) up\nline something up\nline noun\n(LONG MARK)\nAdd to word list\nAdd to word list\n[ C ] a long, thin mark on the surface of something: Draw a straight line. You shouldn’t drive across the double yellow lines. As I grow older, lines and wrinkles show on my face.\n[ C ]\n&#160; geometry A line is a row of points that continues in both directions and is usually represented by a long thin mark.\nline noun\n(EDGE)\n[ C ] a real or imaginary mark that forms the edge, border, or limit of something: The police caught him before he crossed the state line.\n[ C ] A line is also a mark on a sports field which shows where things can or cannot happen, or which measures the field: the foul line the 50-yard line the free-throw line\nline noun\n(STRING)\n[ C ] a length of string, rope, or wire that is used to support something: fishing line Would you help me hang the wash out on the line?\nline noun\n(ROW)\n[ C ] a row of people or things: There was a long line at the movie theater. Just get in/on line and wait your turn.\n[ C ] In football, the lines are the two front rows of opposing players who face one another at the start of a play: the offensive/defensive line\nline noun\n(SERIES)\n[ C usually sing ] a series of people, esp. members of the same family, following one another in time: He comes from a long line of doctors.\nline noun\n(MILITARY)\n[ C ] a row of military positions, particularly the ones closest to enemy positions: the front line behind enemy lines\nline noun\n(WIRE/CONNECTION)\n[ C ] an electrical or telephone wire or connection: Power lines were down after the storm. That line is busy – may I take a message?\nline noun\n(PIPE)\n[ C ] a system of pipes: a water/gas line\nline noun\n(RAILROAD)\n[ C ] a train route, or a railroad track: rail/commuter lines\nline noun\n(COMPANY)\n[ C ] a company that has an organized system of transport by ship, truck, aircraft, or bus: a shipping line\nline noun\n(WORDS)\n[ C ] a row of words that form part of a text: Limericks are humorous five-line poems.\n[ C ] A line is also a short written message: Drop me a line when you get a chance.\n[ C ] A line is also a remark that is intended to amuse, persuade, or deceive: He gave me some line about how his father is the mayor.\n[ C ] Lines are also the words that actors speak when performing.\nline noun\n(DIRECTION)\n[ C usually sing ] a direction or path: Fortunately, the pedestrian wasn’t in the line of fire.\nline noun\n(WAY OF DEALING)\n[ C ] a way of dealing with or thinking about something or someone: I couldn’t follow his line of reasoning.\nline noun\n(JOB)\n[ C ] a job, interest, or activity: \"What line of work are you in?\" \"I’m a teacher.\"\nline noun\n(GOODS)\n[ C ] a type of goods: Our new swimwear line will be in stores shortly. Idioms\na fine line\nin line for something\nin line with something\nin the line of duty\non the line\nline verb [T]\n(COVER)\nto cover the inside surface of an object with another material: I lined the kitchen cabinets with shelf paper. Idiom\nline your pocket(s)Phrasal verbs\nline someone/something up\nline up (someone/something)\nAdd to word list\nAdd to word list\nCOMMERCE a range of similar products: There are discounts on many items from our older lines. As with other books in this publisher's line, this one is written for a popular audience. I showed them all our new product lines.line of sth The company's spring line of handbags is wonderful.lines of bonds/stocks/shares The state is selling three lines of bonds.\nPRODUCTION a system of making goods in which a worker repeatedly does the same tasks on every item and then passes it to the next worker: The first year they had me on the line putting wheels on Cadillacs.assembly/processing/production line Eight additional production lines were installed in the town's only factory. a line foreman/supervisor\nCOMMUNICATIONS a connection to a telephone or data system: I'm afraid your phone line has been disconnected. The company's first fibre-optic lines were installed in 1998. Keep the lines open in case the boss calls with a final decision.on the line Mike Saunders is on the line for you.\na connection to a public service for water, liquid waste, or electricity: Power transmission lines were out for three weeks after the hurricane. Interference from the electric lines caused the equipment to malfunction. Construction workers installed a water line where Walnut Avenue and First Street intersect.\na series of people that follow each other in time: He comes from a long line of entrepreneurs.\na series of people in order of importance: the first/second, etc. in line He is second in line to take over the company.\nsomeone's job, industry, or area of activity: \"What line of work are you in?\" \"I'm a professor.\" You meet some very interesting people in my line of business.\nBANKING a way of getting money: line of credit/revenue Your bank can raise your line of credit if you have a good payment history.\na group of people or things arranged in a row: march/stand/wait in line If you don't like standing in line, do your part to make sure you're an efficient customer.\nTRANSPORT a company that transports people or goods: a railway/shipping line The shipping line carried fewer containers last year\nbring sth into line (with sth)\nto make something the same as or similar to something else: He'd like to bring the pay of an Army private into line with that of a police constable.\ncome/get/fall into line\nto start to officially agree with a plan or idea or to do something in the same way as other people, organizations, companies, etc.: We are considering legal action if they do not come into line soon.\nin the firing line (also in the line of fire)\nlikely to receive criticism or to lose a job: Next in the environment firing line are the CEOs of the world's biggest chemical companies. Jack put himself in the line of fire by talking to the press about our problems.\nget sb in line\nto make someone agree to your way of doing something: If we have to change supervisors to get everybody in line, we will. You better get your people in line, or you'll lose the battle for market share.\nhold the line\nCOMMUNICATIONS to keep a someone waiting on the telephone: Will you hold the line while I check my calendar?\nto continue to have an opinion, especially after a lot of argument: She must hold the line against this kind of criticism.\nto keep a price or amount of money at the same level: The aim of the current administration is to hold the line on taxes. The chancellor has agreed to hold the line on tuition costs for in-state students next year.\nin line for sth\nlikely to get something: American banks are first in line for the small, low-risk deals. Mortgage brokers could be next in line for a ban on commissions.\nin line to do sth\nto have a very good chance of doing something: The water company is in line to make a 7% efficiency cost-saving on the project.\nin line with sth\nsimilar to something or at the same level as something: The company's results are in line withstock market expectations. We are seeking a pay rise that's in line with inflation.\non the line\nif something is on the line, it could easily be lost or destroyed: When it's your personal credibility on the line, it's best to stop making crude jokes in meetings. He put his career on the line when he went public about his employer's lies.\ntoe the line (US also toe the mark)\nto behave according to an official rule, especially when you do not agree with it: The new guy is better salesman and will toe the marketing department's line much more closely. See also\nairline\nassembly line\nbottom line\ncredit line\nfixed-line\nfull line\nhelpline\nlandline\noffline\nonline adverb\nView all\nproduction line\nwireline\nline sb's pockets\nto make someone richer, especially in illegal or dishonest ways: They're the sort of Washington politicians who would line the pockets of their Wall Street friends. These are simply clutching, greedy people who are just manipulating society at large to line their pockets. Phrasal verbs\nline up\nline sb/sth up"}