{"id":213036,"name":"linearity","type":"noun","us_sound":"ˌlɪn.iˈer.ə.t̬i","us_link":"../audio/l/cdo0319usline1048.mp3","uk_sound":"ˌlɪn.iˈær.ə.ti","uk_link":"../audio/l/cdo0319ukline0939.mp3","content":"linearity noun [U]\n(ORDER)\nAdd to word list\nAdd to word list\nthe fact of involving a series of events or thoughts in which one follows another one directly: Linearity is rare in true autobiographies. We don't live in a straight line. The conventional linearity of the narrative is constantly subverted.\nMore examplesFewer examplesFilm sequences that once were run together by a studio demanding linearity have now been fractured and intercut in accordance with Welles' intentions.I'd rather let an offensive post stand and see an apology than have it deleted. I hate having the linearity of the discussion destroyed.She plays with sentence format and punctuation as fearlessly as she disregards linearity of story line. His approach to narrative replaces the rigid linearity of the three-act model with complex, impressionistic forms.\nSMART Vocabulary: related words and phrases\nOrder and sequence - general words\nalphabetize\naround\nback end\nbe a chapter of accidents idiom\ncatalogue\nchapter\ncycle\ninconsecutive\ninline\nlinearly\nlitany\nmerry-go-round\npriority\nprocession\nsecondly\nsequence\nsequencing\nstring\ntrain\nwave\nSee more results »\nlinearity noun [U]\n(LINES)\nthe fact of consisting of straight lines: It is the beautiful linearity of the compositions that predominates in this exhibition.\nMore examplesFewer examplesThe strict linearity of the prints is at times offset by curves.In her art, the harsh linearity and semi-abstraction of cubism are apparent.\nSMART Vocabulary: related words and phrases\nPatterns and shapes\namorphous\narabesque\nargyle\nasymmetrically\nasymmetry\nfigure of eight\nfishbone\nfishhook\nflecked\nformless\npalmate\nreticulation\nrhomboid\nsemilunaris\nshapeable\nshaped\nshapeless\nshapelessly\nsilhouetted\nzigzag\nSee more results »"}