{"id":213089,"name":"liner","type":"noun","us_sound":"ˈlaɪ.nɚ","us_link":"../audio/l/liner.mp3","uk_sound":"ˈlaɪ.nər","uk_link":"../audio/l/uklinct012.mp3","content":"liner noun\n(INSIDE OR AROUND)\nAdd to word list\nAdd to word list\n[ C ] an object or material that is used to cover the inside surface of something: Heat the oven to 170°C350°F and fill your baking tin with paper cupcake liners. The plants growing on the roof sit on top of a waterproof liner. See also\nbin liner\ntrash can liner\npanty liner\n[ C or U ] something, especially a type of make-up, that is used to make a line around the edges of something: Using a black liquid liner, trace a line above your upper eyelashes. Outline your lips with liner first, she advises. See also\neyeliner\nlip liner\nMore examplesFewer examplesFill the pond with water to within 12 inches of the top of the liner.We save the liners of our cereal boxes and reuse them. Fold the plastic liner of the disposable nappy outward so that only the soft part touches the baby's skin.She applied lipstick and put the finishing touches to the liner around her eyes.\nSMART Vocabulary: related words and phrases\nLids, covers and stoppers\nbezel\nbottle cap\nbottle top\ncoozy\ncosy\ncrystal\njacket\nKoozie\nlid\nnozzle\npen lid\npiano lid\nplug\nsleeve\nstopper\nstubby holder\ntab\ntea cosy\ntight-fitting\nzarf\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMake-up & skin care\nliner noun\n(SHIP)\n[ C ] a large ship for carrying passengers in comfort on long journeys: 650,000 tourists come to the port each summer aboard giant cruise liners. He was an entertainer working on an ocean liner. See also\nairliner\njetliner\nWILLIAM WEST/AFP/GettyImages\nMore examplesFewer examplesHundreds of large commercial ships, including cruise liners, use the harbour. She made the long, slow trip across the Atlantic in an ocean liner.He tried to flee on an Atlantic liner, but was arrested on board.Many Europeans came to Madeira on board liners bound for South Africa or South America.\nSMART Vocabulary: related words and phrases\nPassenger, cargo & military ships\nbanana boat\ncar ferry\nclipper\ncoaster\ncollier\ncontainer ship\nCorvette\ncutter\nflagship\nhovercraft\nQ-boat\nschooner\nsemi-submersible\nship\nstoreship\nsubmersible\ntall ship\ntransport ship\ntrawler\nwarship\nSee more results »\nliner noun\n(SPORT)\nUS informal another name for a\nline drive : He hit a soft liner to the first baseman.\nSMART Vocabulary: related words and phrases\nBaseball & rounders\naround the horn idiom\nbag\nball\nballgame\nballplayer\nbase hit\nbases\nbottom\nchopper\nfarm\nflare\nfoul\nglove\nhomer\nsafe\nsecond base\nshag\nshortstop\nslider\nthe World Series\nSee more results »\nAdd to word list\nAdd to word list\na large ship operated by a transport company: an ocean/cruise liner\nAdd to word list\nAdd to word list\na large ship for carrying passengers in comfort on long journeys: cruise/luxury/ocean liner The ocean liner set out from Miami for Port-au-Prince."}