{"id":213223,"name":"link","type":"noun","us_sound":"lɪŋk","us_link":"../audio/l/link.mp3","uk_sound":"lɪŋk","uk_link":"../audio/l/uklink_001.mp3","content":"link noun [C]\n(CONNECTION)\nAdd to word list\nAdd to word list\nB2 a connection between two people, things, or ideas: There's a direct link between diet and heart disease. Their links with Mexico are still strong. diplomatic links between the two countries\nB1 a connection between documents on the internet: Click on this link to visit our online bookshop.\nMore examplesFewer examplesThis research confirms the link between aggression and alcohol.The police have found no evidence of a terrorist link with the murder.There is a direct link between smoking and lung cancer.Strong trading links exist between us and many South American countries.Despite living in different countries, the two families have maintained close links.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconverge\nconvergence\ncor\ncross-Channel\ncumulate\njointed\njunction\nkludge\nknit\nknock\nunified\nunify\nunion\nunseparated\nwad\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternet terminology\nlink noun [C]\n(CHAIN)\none of the rings in a chain\nSMART Vocabulary: related words and phrases\nJewelry\nankle bracelet\nbangle\nbauble\nbe dripping with something idiom\nbutterfly\ncirclet\nclip-on\ncuff\ndrip\nearring\nengagement ring\nfinery\njewelled\njewellery\njewellery box\nrhinestone\nsignet ring\nsleeper\nsparkler\ntreasure\nSee more results »\nB2 [ T ] to make a connection between two or more people, things, or ideas: The explosions are not thought to be linked in any way. The use of CFCs was linked to the depletion of the ozone layer.\n[ T ] to connect two objects or places physically: It can play MP3 music files and can be linked to an iPod with an extra lead. Turkey, because of its location linking the European and Asian continents, has become a primary transit point for the efforts.\n[ I or T ] to make a connection with a website, social media post, video, etc. on the internet: We will link to this post from the project website. She linked a video about finding work on social media.\nMore examplesFewer examplesThe group has been linked with recent bombings.Police think the murders may be linked.The two events are linked in my mind.He has been linked with the pop star.These connectors were originally used to link computers together to transfer large files.The East River bridges link Manhattan to Queens and Brooklyn. You can link or embed a WAV file.The portal links to other sites with useful information.\nSMART Vocabulary: related words and phrases\nLinking and relating\naffiliated\nAL\nappertain to something\napplicable\naround\ncollateral\necosystem\nequation\nincestuously\ninterconnect\ninterconnected\ninterconnectedness\ninterconnection\nrecoupling\nrelatability\nrelatable\nrelate\nrelate to someone/something\nrelatedly\nweld\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nElectrical switches & connections\nConnecting and combining\nInternet terminology\nPhrasal verb\nlink (something) up\nlink noun [C]\n(CONNECTION)\nAdd to word list\nAdd to word list\na connection between two things: There is a clear link between poverty and malnutrition. A high-speed rail link brings you to the airport.\nlink noun [C]\n(CHAIN)\none of the rings in a chain\nlink noun [C]\n(WORD)\na word or image on a website that can take you to another document or website\nAdd to word list\nAdd to word list\nTRANSPORT, COMMUNICATIONS a way of travelling or communicating between two places or systems: a bus/rail/road link transport/transportation linkslink between sth (and sth) There are plans to upgrade the road links between the two countries. a phone/video link Interviews can be carried out by video link. This device creates a link between computers, enabling you to share files, no matter what their size.\n[ usually plural ] a relationship between two or more people, countries, companies, etc.: link with sb/sth Their links with Britain are still strong.build/establish/strengthen links We need to strengthen our links with colleges doing similar work to ours. business/trade links\na connection between two or more facts, events, etc.: link between sth (and sth) The key thing here is the link between consumer confidence and spending on non-essentials.direct/clear/strong link There is a direct link between the value of the used car and new car prices for the same model.clear/close/strong link Historical data show the clear link between income tax rates and the size of domestic government spending.\nINTERNET, IT a word or image in an electronic document or on a website that you can click on to take you to another part of the document, another document, or another website: Read this tutorial for web developers in order to find out how to add a link to another website. Click on this link to visit our online bookstore. See also\nhotlink\nhyperlink noun\n[ T ] to connect two or more places, people, or things: link sth to/with sth This corridor links the new offices to the main building. a new motorway in Ireland, linking Dublin with Galway All our workstations are linked together with each other.\n[ T ] to make or show a connection between two or more people, things, or ideas: link sth to/with sth The objective is to link the strategy of the corporation with the reality of its business.be linked to sth Asbestos-related diseases are generally linked to sustained exposure over many years. Her name is being linked to one of the top jobs in the company.\n[ T, usually passive ]\n&#160; FINANCE if the value of money, investments, payments, etc. is linked to something else, it will change when that thing changes: linked to sth Over a long period, investments linked to stock markets are likely to give the best returns. See also\nindex-linked\n[ I or T ]\n&#160; INTERNET, IT to make a connection between websites on the internet, or from part of one website to another: Anyone who has a website can link theirs to another site. Does this website link to other client sites the company has designed?\n[ I ]\n&#160; INTERNET, IT to follow a link to go to another website or part of a website on the internet: Click here to link to our customer service website.\nPhrasal verbs\nlink up\nlink (sth) up"}