{"id":213594,"name":"liquidate","type":"verb","us_sound":"ˈlɪk.wə.deɪt","us_link":"../audio/l/liquidate.mp3","uk_sound":"ˈlɪk.wə.deɪt","uk_link":"../audio/l/uklink_021.mp3","content":"liquidate verb\n(CLOSE)\nAdd to word list\nAdd to word list\n[ I or T ] to cause a business to close, so that its assets can be sold to pay its debts\nThesaurus: synonyms, antonyms, and examples\nto stop operating permanentlyclose downWith sales down, the company closed one factory down and reduced the workforce at another. closeMany of the shops in the High Street have closed recently. shut downThe bookshop is shutting down after 25 years of business.shutUK Several of the bank's local branches are shutting.shut up shopUK The seaside businesses all shut up shop during the winter.go/put out of businessMy favourite ice cream shop went out of business last summer.\nSee more results »\nSMART Vocabulary: related words and phrases\nSuccess & failure in business\nadministration\naxe\nbankrupt\nbankruptcy\nbe running on fumes idiom\nbelly\ncharter\ndying\nfold\ngo dark idiom\ngo into administration\ngo to the wall idiom\ngrowth hacker\ngrowth hacking\nreceiver\nshut up shop idiom\nsinking ship idiom\nsoft launch\nspin something off\nstart (something) up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBorrowing & lending\nliquidate verb\n(KILL)\n[ T ] to kill someone\nSMART Vocabulary: related words and phrases\nKilling\n-cide\nabattoir\nanti-suicide\nassisted suicide\nbutchery\nclaim someone's life idiom\ncommit\nculpable homicide\ndeadly\ndestroy\nexterminate\nmisery\nmortal\nneutralization\nneutralize\nnon-fatal\noverlie\npoison\nsuicide pact\nwring\nSee more results »\nRelated word\nliquidation\nAdd to word list\nAdd to word list\nto sell your investments or property to make them available in the form of money: Investors have started to liquidate their mutual funds.\nSomeone who liquidates a business closes it and sells what it owns. liquidation noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌlɪk·wɪˈdeɪ·ʃən/\nThe company was forced into liquidation.\nAdd to word list\nAdd to word list\n[ I or T ]\n&#160; LAW, FINANCE if a business liquidates or is liquidated, it is closed so that its assets can be sold to pay its debts: The only way for management to return value to shareholders in the short term is to liquidate the company and return the cash. As the customer of a brokerage that's being liquidated, you should receive a warning in the mail or see notices in the newspaper.\n[ T ]\n&#160; ACCOUNTING, FINANCE to sell something in order to get cash: She liquidated the stock and pulled about $10,000 from savings to pay off her debt. In the event of a reclamation, the Fund may liquidate sufficient shares from a shareholder's account to reimburse the government or the private source.\n[ T ]\n&#160; ACCOUNTING, FINANCE to pay off a debt: They were required to liquidate the debt within 30 days of the date due."}