{"id":213598,"name":"liquidation","type":"noun","us_sound":"ˌlɪk.wəˈdeɪ.ʃən","us_link":"../audio/l/liquidation.mp3","uk_sound":"ˌlɪk.wəˈdeɪ.ʃən","uk_link":"../audio/l/uklink_022.mp3","content":"Add to word list\nAdd to word list\nthe process of closing a business, so that its assets can be sold to pay its debts, or an instance of this: After three years of heavy losses the company went into liquidation with debts totalling £100 million. The construction industry is noted for its high rate of liquidations. See\nliquidate\nThesaurus: synonyms, antonyms, and examples\nto stop operating permanentlyclose downWith sales down, the company closed one factory down and reduced the workforce at another. closeMany of the shops in the High Street have closed recently. shut downThe bookshop is shutting down after 25 years of business.shutUK Several of the bank's local branches are shutting.shut up shopUK The seaside businesses all shut up shop during the winter.go/put out of businessMy favourite ice cream shop went out of business last summer.\nSee more results »\nMore examplesFewer examplesThe airline is facing possible liquidation.The company went into liquidation, owing substantial amounts to creditors.We have seen an increasing rate of both bankruptcies and liquidations.\nSMART Vocabulary: related words and phrases\nSuccess & failure in business\nadministration\naxe\nbankrupt\nbankruptcy\nbe running on fumes idiom\nbelly\ncharter\ndying\nfold\ngo dark idiom\ngo into administration\ngo to the wall idiom\ngrowth hacker\ngrowth hacking\nreceiver\nsinking ship idiom\nsoft launch\nspin something off\nstart (something) up\nsubscale\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBorrowing & lending\nAdd to word list\nAdd to word list\nLAW, FINANCE a situation in which a company stops operating and sells all its assets in order to pay its debts: go into liquidation After three years of heavy losses the company went into liquidation with debts totalling £100 million.put sth into liquidation They were forced to put the company into liquidation in June.\nACCOUNTING, FINANCE a situation in which an asset is sold in order to get cash: Analysts generally regard the liquidation of shares by corporate insiders as bad news. See also\ncompulsory liquidation\nforced liquidation\ninvoluntary liquidation\nvoluntary liquidation"}