{"id":213791,"name":"list","type":"noun","us_sound":"lɪst","us_link":"../audio/l/list.mp3","uk_sound":"lɪst","uk_link":"../audio/l/uklisp_003.mp3","content":"list noun\n(RECORD)\nAdd to word list\nAdd to word list\nA2 [ C ] a record of short pieces of information, such as people's names, usually written or printed with a single thing on each line and often ordered in a way that makes a particular thing easy to find: a shopping list Is your name on the list? I've made a list of places I'd like to visit while we're in Paris.\nMore examplesFewer examplesHe checked off their names on the list as they got on the coach.Did you cross her name off the guest list?I've drawn up a list of candidates that I'd like to interview.On page two of your handout you will find a list of the books that I have referred to during the lecture.The list of ingredients included 250 g of almonds.\nSMART Vocabulary: related words and phrases\nLists and catalogues\nagenda\narchivist\nbibliographical\nbibliographically\nbirthday honours\nglycaemic index\nhit list\nhonor roll\nhonours list\nindices\nquestionnaire\nrecital\nregistrable\nroll of honour\nroster\nthe White Pages\nunregistered\nwait list\nwaiting list\nwedding list\nSee more results »\nlist noun\n(LEAN)\nIf a ship has a list, it leans to one side.\nSMART Vocabulary: related words and phrases\nSlanting, sloping, leaning, tilting\nacclivity\nangled\nanteversion\nanteverted\naskew\ninclination\nincline\nlopsided\nlopsidedly\nlopsidedness\nobliquely\npitched\nrake\nslant\nslanting\nslantingly\nslantwise\nslope\nsloping\nsteep\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSailing & boating\nIdiom\na list as long as your arm\nlist verb\n(MAKE RECORD)\nB2 [ T ] to make a list, or to include something in a list: I've listed some useful reading material on the handout.\nMore examplesFewer examplesThe document lists all his achievements.Can you list the items that are missing?The items are listed alphabetically.The actors are listed in order of appearance.I can't begin to list his faults.\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nconcordance\ndescribe\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nset something up\nshake someone down\nshort-list\nshortlist\nsort\ntick\nSee more results »\nlist verb\n(LEAN)\n[ I ] (of a ship) to lean to one side, especially as a result of damage: The tanker is listing badly and liable to sink at any moment.\nSMART Vocabulary: related words and phrases\nSlanting, sloping, leaning, tilting\nacclivity\nangled\nanteversion\nanteverted\naskew\ninclination\nincline\nlopsided\nlopsidedly\nlopsidedness\nobliquely\npitched\nrake\nslant\nslanting\nslantingly\nslantwise\nslope\nsloping\nsteep\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSailing & boating\nlist verb\n(MAKE AVAILABLE)\n[ T ] to make a company's shares available on a particular financial market: Last year, eight new companies were listed on the Lahore stock exchange.\n[ I or T ] mainly US to make something, especially a property, available for people to buy: The actor has listed his 5,000-sq.-ft. house and plans to find a new place in the Los Angeles area. If you look on the internet, you'll find the product listed on several websites.US The real estate agent suggested we list at $700,000.\nSMART Vocabulary: related words and phrases\nStock markets\nalgo\nanti-city\nanti-dilution\nanti-speculation\nanti-speculative\nbond\nbroker\nbull market\ndead cat bounce\nequity\nfootsie\ngilt\nICO\ninconvertible\ninitial coin offering\nintangible asset\nnon-controlling\nrentier\nrogue trader\nthe Nikkei index\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSelling\nlist noun [C]\n(RECORD)\nAdd to word list\nAdd to word list\na record of short pieces of information usually arranged one below the other so that they can be read easily or counted: I have a long list of things we need to get for our new house.\nlist verb\n(LEAN)\n[ I ] (esp. of a ship) to lean to one side: The tanker is listing badly and may sink.\nlist verb\n(RECORD)\n[ T ] to make a record of short pieces of information, usually arranging one below the other so that they can be read easily or counted: The professor gave us a handout in which she listed the books we were supposed to read for the course.\nAdd to word list\nAdd to word list\na record of short pieces of information, such as people's names, usually written or printed with a single thing on each line and often ordered in a way that makes a particular thing easy to find: a list of possible candidates for the job I've made a list of this week's orders.on a list Is your name on the list? New office furniture is not high on our list of priorities. See also\nA-list\nDaily Official List\nfocus list\nhit list\nlaundry list\nlegal list\nLloyd's List\nmailing list\nprice list\nshopping list\nView all\nwatch list\nwish list\n[ T ] to make a list, or to include something in a list: I've listed some useful reading material on the handout.\n[ I or T ]\n&#160; STOCK MARKET to make a company's shares available on a particular stock market: list sth on/in sth Eight new companies were listed on the Lahore stock exchange. A growing number of Latin American companies have their shares listed in the US. Many have decided not to list in New York, mainly because of the high cost of regulatory compliance there. Compare\nquote verb\n[ I or T ]\n&#160; COMMERCE\n&#160; US when something lists, or is listed, at a particular price, it is for sale at that price: list (sth) at/for sth The property in W 4th Street has just been listed at over $2 million. See also\ncross-list"}