{"id":213891,"name":"literature","type":"noun","us_sound":"ˈlɪt̬.ɚ.ə.tʃɚ","us_link":"../audio/l/eus72803.mp3","uk_sound":"ˈlɪt.rə.tʃər","uk_link":"../audio/l/uklisp_021.mp3","content":"literature noun [U]\n(WRITING)\nAdd to word list\nAdd to word list\nB1 written artistic works, especially those with a high and lasting artistic value: classical/modern literature \"Wuthering Heights\" is a classic of English literature.\nMore examplesFewer examplesHe's very knowledgeable about German literature.I had a brilliant English teacher who fired me with enthusiasm for literature at an early age.She's studying for an MA in French literature.Classic literature never goes out of print.The festival is to encompass everything from music, theatre and ballet to literature, cinema and the visual arts.\nSMART Vocabulary: related words and phrases\nLiterature\naccentual\naction hero\nalliterative\nalternative history\nanapest\nfemslash\nfiction\nfictionality\nfictionally\nfictive\nnon-character\nnon-literary\nnon-metrical\nnon-poetic\nnonsense verse\nswashbuckler\nsympathetically\ntanka\ntartan noir\ntheatrics\nSee more results »\nliterature noun [U]\n(SPECIALIST TEXTS)\nall the information relating to a subject, especially information written by experts: It's important to keep up-to-date with the literature in your field. There is very little literature on the disease.\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\npostscript\nPSA\npush notification\nradiogram\nreadout\ntelemetry\nthe real deal\nSee more results »\nliterature noun [U]\n(INFORMATION)\nprinted material published by a company that is intended to encourage people to buy that company's products or services; material that an organization publishes in order to persuade people to agree with its opinions: Could you send me your literature on/about car insurance policies, please? The Republicans were quick to highlight the Democrats' proposed tax increases in their campaign literature.\nThesaurus: synonyms, antonyms, and examples\ninformationinformationCan I get some information on uni courses?detailsPlease send me details of your training courses.directionsJust follow the directions on the label.instructionsHave you read the instructions all the way through?directionsWe had to stop and ask for directions.guidelinesThe government has issued new guidelines on health and safety at work.\nSee more results »\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ncustomer relationship management\ndetoxify\ndifferentiator\ndogfooding\nflyer\no.n.o.\non-brand\noverexpose\noverexposure\noverhype\ntout\nunadvertised\nunbilled\nunbranded\nunmarketable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInformation and messages\nliterature noun [U]\n(WRITING)\nAdd to word list\nAdd to word list\nwriting that has lasting value as art: The course in English literature covers Shakespeare’s plays.\nliterature noun [U]\n(INFORMATION)\nall the information written about a subject: The medical literature is full of examples of accidental discoveries that led to important advances in science.\nLiterature is also printed material published by a company that informs people about its products or services: They handed out literature at the meeting about their new software.\nAdd to word list\nAdd to word list\nall the information relating to a subject, especially information written by specialists: It's important to keep up-to-date with the literature in your field. Studies in technology management literature propose that radical innovations increase company performance and competitive advantage.\nprinted material published by a company, etc. to encourage people to buy its products or services: sales/promotional literatureliterature on/about sth Could you send me your literature on car insurance policies, please?"}