{"id":213879,"name":"literate","type":"adjective","us_sound":"ˈlɪt̬.ɚ.ət","us_link":"../audio/l/literate.mp3","uk_sound":"ˈlɪt.ər.ət","uk_link":"../audio/l/uklisp_019.mp3","content":"Add to word list\nAdd to word list\nC2 able to read and write: Only 25% of the country's population is literate. The court heard that the defendant was not literate, had little schooling and was unemployed.\nhaving knowledge of a particular subject, or a particular type of knowledge: Some people are extremely financially literate and already have their own investment portfolios. The teenagers chattering away online are media literate, but they are not media wise. See also\ncomputer-literate\nMore examplesFewer examplesHighly literate and educated people are not voting.If we want a more literate population, we need more teachers.To the theologically literate, such a view presents major difficulties.Students must be science literate when they graduate to contribute to our nation's competitiveness in the global marketplace.\nSMART Vocabulary: related words and phrases\nIntelligence\nacuity\nacumen\nagility\napt\naptness\nbrain\ngumption\nhighbrow\nhorse sense\nhyper-intelligent\nimaginative\nperceptively\npercipient\npercipiently\nperspicacious\nperspicaciously\nperspicacity\nprofundity\nsubtlety\nwisdom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAware\nAdd to word list\nAdd to word list\nable to read and write: The man was barely literate and took a long time to write his name.\nLiterate also means having a good education or showing it in your writing: He wrote a literate, colorful column and reviewed plays.\nLiterate also means having a basic skill or knowledge of a subject: They wanted to make sure their child was computer literate.\nAdd to word list\nAdd to word list\nable to read and write: a literate workforce barely/highly literate The top priority must be ensuring young people are literate, numerate, and ready for work.\nhaving knowledge of a particular subject, or a particular type of knowledge: computer/IT literate Candidates for this appointment should be computer literate. financially/technically/technologically literate Compare\nilliterate"}