{"id":213845,"name":"lite","type":"adjective","us_sound":"laɪt","us_link":"../audio/l/light.mp3","uk_sound":"laɪt","uk_link":"../audio/l/uklifes006.mp3","content":"lite adjective\n(FOOD)\nAdd to word list\nAdd to word list\nused for describing food or drink that contains fewer calories than usual and is therefore less likely to make you fat: a lite yogurt\nSMART Vocabulary: related words and phrases\nWords meaning small pieces and amounts\nby a nose idiom\nclipping\ncrumb\ndab\ndash\ndollop\ngrain\nparing\npeewee\npinch\npotsherd\nray\nskinny\nspark\ntad\nthimbleful\ntidbit\ntiddler\ntitbit\ntrace\nSee more results »\nlite adjective\n(NOT SERIOUS)\nused for describing things that are not serious and that are easy to understand and enjoy: lite news about celebrities\n[ after noun ] humorous or disapproving not as serious or as good quality as the real thing: She described their relationship as \"marriage lite\".\nSMART Vocabulary: related words and phrases\nEasy to understand\n(as) clear as day idiom\nabundantly clear\naccessible\naccessibly\nassimilable\ndigestible\nexplicitly\nexplicitness\nexpressly\nfathomable\nhang\nin words of one syllable idiom\nlimpid\nlucid\nperspicuity\nperspicuous\nperspicuously\npikestaff\nput/set someone straight idiom\ntaut\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWorse and worst\nAdd to word list\nAdd to word list\ncontaining less fat or sugar than similar types of food and therefore less likely to make you increase your weight: lite beer Note: This spelling of light is used in advertising products. If used otherwise, it is usually intended to be humorous.\nAdd to word list\nAdd to word list\nused in advertising to describe food or drink that contains less fat or sugar than usual: lite vanilla ice cream lite foods A \"lite bites\" menu includes sandwiches, soups, and tortilla wraps.\n[ after noun ] not as good, complete, serious, etc. as other things of the same type: Such behaviour is part of the phenomenon of management lite - managing by numbers and formulas rather than judgment and method. The new laws have been dubbed \"child care lite\" because of the radically reduced amount of funding attached."}