{"id":214362,"name":"load","type":"noun","us_sound":"loʊd","us_link":"../audio/l/load.mp3","uk_sound":"ləʊd","uk_link":"../audio/l/ukload_001.mp3","content":"load noun\n(AMOUNT CARRIED)\nAdd to word list\nAdd to word list\nB2 [ C ] the amount of weight carried, especially by a vehicle, a structure such as a bridge, or an animal: The maximum load for this elevator is eight persons. One truck involved in the accident was carrying a heavy load of coal. Synonyms\ncargo\nconsignment\ndelivery (OF PACKAGE ETC.)\nfreight\nshipmentSee also\nboatload\npayload\ntruckload a load informal (also loads)\nB1 a lot: I've got a load of work to get through before tomorrow. There were a load of people there. Have some more food - there's loads. She looks loads better with her new haircut.\n[ C ]\n&#160; physics\n&#160; specialized the amount of electrical power that is supplied\nMore examplesFewer examplesThe old man was carrying a load of sticks.The safe load for a truck of this size works out at nearly 20 tons.The rope gave under the weight of the load.An articulated lorry has overturned on the south-bound carriageway, shedding its load.He laboured up the hill with his heavy load.\nSMART Vocabulary: related words and phrases\nGeneral words for size and amount\n-sized\namount\nbulk\ncontent\nelement\nextent\nfootprint\ngood things come in small packages idiom\nhaul\nlevel\nlot\nmeasure\nmuch\norder\npercent\nquantity\nquota\nration\nsmall-scale\nstrong\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLarge in number or quantity\nElectricity & electronics\nload noun\n(AMOUNT TO DO)\n[ C ] the amount of work to be done by a person: If we share the organization of the party, that will help spread the load. I've got a heavy/light teaching load this term. See also\ncaseload\nworkload\n[ S ] a painful, difficult, or tiring situation to deal with: I wish I could do something to lighten your load (= make your situation easier).\nSMART Vocabulary: related words and phrases\nWork, working and the workplace\nact as something\nall work and no play (makes Jack a dull boy) idiom\nassignment\nbandh\nbe at work idiom\ngrind\nhoop\nhot-desking\nhotelling\nhousekeeping\nin the line of duty idiom\ninduction\nindustry\nmoonlight\nskivvy\nslave\nslog\nslouch\nspadework\nsweat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDifficult situations and unpleasant experiences\nIdioms\nget a load of that!\na load of crap, nonsense, rubbish, etc.\nload verb\n(PUT INTO/ONTO)\nB2 [ I or T ] to put a lot of things into a vehicle or machine: How long will it take to load this sand onto the lorry? Let's load up the car and then we can go. to load the dishwasher/washing machine See also\noverload verbOpposite\nunload be loaded down with something\nto have too much to carry, or too much work to do: I was loaded down with shopping. be loaded with something\nto contain a lot of something: Most fast foods are loaded with fat.\nMore examplesFewer examplesThey loaded the lorry with potatoes.It's your turn to load the dishwasher.They loaded the boxes onto the ship.We will need a fork-lift truck to load these crates.\nSMART Vocabulary: related words and phrases\nWrapping, packing and loading\nblister pack\nbottle\nbottling\nBubble Wrap\nbundle\nfreighter\npack something away\npackaged\npackaging\npacker\npacket\npacking\nparcel\nparcel something up\nrewrap\nsheathe\nshrink-wrap\ntinned\ntraffic light\nwrapping\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nToo much and unnecessary\nFull\nload verb\n(FILL WITH FOOD)\n[ T ] to fill or cover something with a lot of food: Guests loaded up their plates at the restaurant buffet. On the day of the party the table was loaded with food. a buttermilk biscuit loaded with bacon, egg and cheese\nSMART Vocabulary: related words and phrases\nFilling and completing\nbackfill\nbow\nbox ticking\nbrick\nbrick something up\nbrim\nfill\njam\novercrowd\noverrun\npack something/somewhere out\npermeate\npermeation\nplug\nsaturable\nsqueeze (someone/something) in/squeeze (someone/something) into something\nstuffing\nsuffuse\nsupersaturated\ntank\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCovering and adding layers\nload verb\n(CAMERA/GUN)\n[ T ] to put film in a camera or bullets in a gun: Do not load the film (= put it into the camera) in bright light.\nSMART Vocabulary: related words and phrases\nFilling and completing\nbackfill\nbow\nbox ticking\nbrick\nbrick something up\nbrim\nfill\njam\novercrowd\noverrun\npack something/somewhere out\npermeate\npermeation\nplug\nsaturable\nsqueeze (someone/something) in/squeeze (someone/something) into something\nstuffing\nsuffuse\nsupersaturated\ntank\nSee more results »\nload verb\n(COMPUTER)\nB2 [ I or T ] to put information or a program onto a computer: You need to load this program onto your computer. The software is easy to load.\n[ I or T ] If a web page or an application loads or is loaded, it appears on a screen: My browser wouldn't load the page. Some of the apps on my smart TV are quite slow to load.\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntap\ntoolbar\nvectorization\nvectorize\nvirtualization\nvirtualize\nwake word\nzip file\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer programming & software\nComputer concepts\nInternet terminology\nPhrasal verb\nload up on something\nall the people or goods in the stated type of vehicle or container: a coachload of football fans Busloads of tourists pour into this place in the summer. Truckloads of food and medical supplies arrived in the refugee camp.\nSMART Vocabulary: related words and phrases\nMeasurements of volume: informal\n-ful\narmload\nbasin\nbasketful\nbucketful\neyeful\nfistful\nforkful\nglass\nglassful\njugful\nplate\npocketful\npot\nscoop\nspoonful\ntablespoonful\ntankful\ntbs\ntruckload\nSee more results »\nload noun [C]\n(WEIGHT CARRIED)\nAdd to word list\nAdd to word list\nthe amount or weight of something carried by a vehicle, a structure such as a bridge, or a person or animal: The truck had a load of bricks. The maximum load for this elevator is eight persons.\nphysics Load is also the weight being moved by a lever.\nload noun [C]\n(AMOUNT OF WORK)\nthe amount of work to be done by a person: The normal teaching load at this university is three courses each semester. Idioms\nloaded down with things\nloads of something\nload verb [T]\n(PUT INTO)\nto put into a piece of equipment something it uses to make it work: Bill loaded and aimed his crossbow. The technician loaded a sample into the device. You need to load the new software before you can use the computer.\nload verb [T]\n(WEIGHT CARRIED)\nto put something in or on a vehicle: He could load more hay into the wagon. Phrasal verbs\nload up something\nload up on something\nAdd to word list\nAdd to word list\nused with other nouns to refer to a vehicle, large container, etc. that is completely full: truckload/planeload/busload Planeloads of aid sent to the disaster region remain undistributed. The auditors have requested boxloads of documents.\nTRANSPORT an amount of goods or people transported by road, railway, or air: The total maximum load is four hundred kilograms. heavy/large/full load Heavy passenger loads put stress on the nation's aviation system. carry/deliver/transport a loada load of sth The tanker was commissioned to pick up a load of hazardous materials.\nWORKPLACE the amount of work to be done by a person, an organization, or a machine: lighten/reduce a load Workers have asked whether the bank intends to lighten their load by hiring more staff.share/spread the load British manufacturing is looking to other sectors to help share the load of investing in infrastructure. heavy/light/increased load\nFINANCE a charge that you pay when you buy or sell shares in an investment company\nECONOMICS, FINANCE an amount of money, usually a large amount, that a person, company, or country has to pay: debt/tax load A ruling by the European Union lightened the tax load on investors buying gold. See also\nback-end load\ncaseload\ndeadweight\nfront-end load\nFull Container Load\nless-than-container load\nload factor\npayload\nsales load\nworkload\n[ I or T ]\n&#160; TRANSPORT to put goods onto a vehicle to transport them: A surge in trade has seen up to 90 vessels a week at the port waiting to load their cargoes. Trucks were loading and unloading at the warehouse.load sth with sth The tanker was loaded with four million gallons of diesel oil. Compare\nunload\n[ I or T ]\n&#160; IT to put a program or data onto a computer or website: load software/a file/a program The software is very easy to load. The updates don't take long to load.\n[ T ]\n&#160; FINANCE to include charges in an investment, loan, etc.: load sth with sth The card is designed to attract customers with poor credit and comes loaded with lots of fees and a very low credit limit. Phrasal verbs\nload (sth) up with sth\nload up on sth"}