{"id":214464,"name":"lobby","type":"verb","us_sound":"ˈlɑː.bi","us_link":"../audio/l/lobby.mp3","uk_sound":"ˈlɒb.i","uk_link":"../audio/l/ukload_018.mp3","content":"Add to word list\nAdd to word list\nC2 to try to persuade a politician, the government, or an official group that a particular thing should or should not happen, or that a law should be changed: Small businesses have lobbied hard for/against changes in the tax laws. [ + to infinitive ] Local residents lobbied to have the factory shut down. [ + obj + to infinitive ] They have been lobbying Congress to change the legislation concerning guns.\nMore examplesFewer examplesThey are lobbying for tax cuts.We are lobbying for changes to the law on drinking and driving.Farmers lobbied hard against the export bans.They lobbied to have the head teacher removed.They are lobbying for better healthcare facilities.\nSMART Vocabulary: related words and phrases\nUrging & persuading\nambulance-chasing\nargumentation\nbe/go on at someone idiom\nblag\nblagger\nfob\ninduce\ninfluencer\njockey\njockey someone into something\njolly\nlean\nlean on someone/something\nlove bomb\nsucker\nunsellable\nurging\nwell argued\nwheedling\nwin someone over\nSee more results »\nlobby noun [C]\n(PRESSURE GROUP)\na group of people who try to persuade the government or an official group to do something: the anti-smoking lobby\nSMART Vocabulary: related words and phrases\nGroups of people\nalliance\nan\nanti-gang\nassemblage\nbaby boomer\nfirst people\nflashmob\nflock\nfocus group\nfoursome\nline (someone) up\nmafia\nmob\nposse\npublic\nquaternity\nrabble\nretinue\nsquad\nsyndicate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nActivism & pressure groups\nlobby noun [C]\n(ROOM)\nB2 the (large) room into which the main entrance door opens in a hotel or other large building\nsihuo0860371/E+/GettyImages\nin the UK parliament, a room where someone meets a member of parliament who they have arranged to talk to, or one of the two passages that members of parliament walk through as a way of voting\nSMART Vocabulary: related words and phrases\nParts of buildings: passages & entrance areas\narcade\narchway\nbreezeway\nconcourse\ndesk\nentryway\ngangway\ngateway\nhall\nhallway\nmarquee\npassage\npatio\nportal\nportico\nreception\nside entrance\nside return\nterrace\nvestibule\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHotels & hostels\nUK politics: government departments & organizations\nlobby noun [C]\n(SPACE)\nAdd to word list\nAdd to word list\na large, open space just inside the main entrance of a public building such as a hotel, office building, or theater: As you enter the lobby, you’ll see the elevators on your right.\nlobby noun [C]\n(PERSUADE)\npolitics &amp; government a group of people who represent a particular industry or interest in dealing with a politician, official, etc.: the environmental lobby\nlobby verb [I/T]\n(PERSUADE)\npolitics &amp; government to try to persuade an elected official to take a particular action or change a law: [ T ] Council members have been lobbying colleagues on how to vote.\nlobbyist noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈlɑb·i·ɪst/\nlobbyists for the banking industry\nAdd to word list\nAdd to word list\nto try to persuade someone in authority, usually an elected member of a government, to support laws or rules that give your organization or industry an advantage: lobby against/for sth He lobbies against restrictions on investment.lobby hard/heavily A coalition of business groups lobbied hard to have the legislation changed.lobby congress/lawmakers/ministers He said private schools would lobby the General Assembly to restore the funding.lobby to do sth After the fatal crash, safety experts blamed the fuel-tank design and lobbied to make the cars safer.\na group of people that lobbies someone in authority: The leading employers' lobby called for less government regulation.a powerful/strong/influential lobby A powerful lobby of property companies and retailers is being formed.the pro-euro/pro-business/anti-gun lobby His firm has given £25,000 to the pro-euro lobby.a business/consumer/trade lobby The government is under pressure from business lobbies who want taxes on companies reduced. environmental/farmer's/energy lobby"}