{"id":214604,"name":"location","type":"noun","us_sound":"loʊˈkeɪ.ʃən","us_link":"../audio/l/location.mp3","uk_sound":"ləʊˈkeɪ.ʃən","uk_link":"../audio/l/ukload_030.mp3","content":"location noun\n(POSITION)\nAdd to word list\nAdd to word list\nB1 [ C ] a place or position: The hotel is in a beautiful location overlooking the lake. A map showing the location of the property will be sent to you.\nMore examplesFewer examplesShe elected to take early retirement instead of moving to the new location.The exact location of the factory has yet to be decided.The exact location of the hotel where the royal couple is staying is a jealously guarded secret.Because of their location, these offices attract a premium.The best thing about the location of the house is its proximity to the town centre.\nSMART Vocabulary: related words and phrases\nPlaces and locations\nanatopism\nbehind\ncapital\ncoign of vantage\ncore\ndirection\ndrop-in\nfar from the madding crowd idiom\nhill\nmakerspace\nMecca\nmulti-location\nmulti-site\nnatal\nstation\nstronghold\nsubsite\ntechnology park\nvenue\nWorld Heritage Site\nSee more results »\nlocation noun\n(FILM)\nC1 [ C or U ] a place away from a studio where all or part of a film or a television show is recorded: The documentary was made on location in the Gobi desert.\nSMART Vocabulary: related words and phrases\nCinema - general words\n12A\nanimation\nanimator\naudio described\naudio description\nfade\nfilmic\nfilmically\nfilming\nfilmstrip\nflick\nfootage\nprojection\nremake\nrerelease\nrescreen\nreshoot\nreshow\nsting\ntheatrical\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBroadcasting in general\nlocation noun\n(FINDING)\n[ U ] formal the act of finding the exact position of something: The latest navigational aids make the location of the airfield quite easy.\nSMART Vocabulary: related words and phrases\nFinding and discovering\nascertain\nbreak (fresh/new) ground idiom\nbreakthrough\nbring something to light idiom\ncatch someone red-handed idiom\nflush someone/something out\nfossick\nfound\ngeocache\ngeocaching\npinpoint\nrake\nrediscover\nrediscovery\nrefind\nrefound\nretrievable\nrumble\nsniff\nuncover\nSee more results »\nAdd to word list\nAdd to word list\na particular place or position: a good location for a bookstore The map showed the location of an old mine. on location\nIf a movie is filmed on location, it is made in an actual place away from where the company producing the movie is: The documentary was filmed on location in San Francisco.\nAdd to word list\nAdd to word list\n[ C ] the place or position that something is in or where something happens: Come visit us at our new location!an ideal/prime/suitable location (for sth) The strong economy and availability of staff makes the area a prime location for a business.\n[ U ] the act of choosing where to start a new business: The location of the factory inside city limits resulted in problems for the city council."}