{"id":214597,"name":"locate","type":"verb","us_sound":"loʊˈkeɪt","us_link":"../audio/l/locate.mp3","uk_sound":"ləʊˈkeɪt","uk_link":"../audio/l/ukload_029.mp3","content":"locate verb\n(BE SITUATED)\nbe located in, near, on, etc.\nAdd to word list\nAdd to word list\nB1 to be in a particular place: Our office is located in midtown Manhattan.\nSee more\nlocate verb\n(FIND)\nB2 [ T ] to find or discover the exact position of something: Police are still trying to locate the suspect.\nThesaurus: synonyms, antonyms, and examples\nto find someone or somethingfindI've looked everywhere for my keys but can't find them.discoverThe missing wallet was discovered under the chair.locatePolice are still trying to locate the suspect.uncoverReporters uncovered evidence of corruption.unearthOur investigation unearthed mountains of evidence that implicated the city.come acrossWe came across a lovely little restaurant in the village.\nSee more results »\nMore examplesFewer examplesEngineers are endeavouring to locate the source of the problem.Using their high-tech wizardry, the police were able to locate the owners of the stolen property within hours of it being seized.Sniffer dogs located the drugs.They were unable to locate the murder weapon.We are trying to locate a new supplier for our coffee.\nSMART Vocabulary: related words and phrases\nFinding and discovering\nascertain\nbreak (fresh/new) ground idiom\nbreakthrough\nbring something to light idiom\ncatch someone red-handed idiom\nflush someone/something out\nfossick\nfound\ngeocache\ngeocaching\npinpoint\nrake\nrediscover\nrediscovery\nrefind\nrefound\nretrievable\nrumble\nsniff\nuncover\nSee more results »\nlocate verb\n(MOVE)\n[ I + adv/prep ] US to move to a place to do business: The company hopes to locate in its new offices by June.\nSMART Vocabulary: related words and phrases\nSuccess & failure in business\nadministration\naxe\nbankrupt\nbankruptcy\nbe running on fumes idiom\nbelly\ncharter\ndying\nfold\ngo dark idiom\ngo into administration\ngo to the wall idiom\ngrowth hacker\ngrowth hacking\nreceiver\nsinking ship idiom\nsoft launch\nspin something off\nstart (something) up\nsubscale\nSee more results »\nlocate verb\n(FIND POSITION)\nAdd to word list\nAdd to word list\n[ T ] to find or discover the exact position of something: Archeologists have located the remains of an ancient temple.\nlocate verb\n(PUT IN PLACE)\n[ I/T ] to put or establish something in a particular place: [ T ] The company decided to locate its headquarters in Denver.\nAdd to word list\nAdd to word list\n[ I or T ] to choose a particular place to start or build a business: locate (sth) in sth Payments were offered to encourage companies to locate in Kansas. We help people determine the most ideal cities to locate their businesses. Compare\nrelocate\nbe located\nto be in a particular place: They have substantial R&amp;D activities which are located abroad.be located at/in/on somewhere The company is located at 7100 Bayside Street, Fremont.be located just outside/near/west of, etc. somewhere He is the co-owner of the Canyon mine, located 15 miles west of Hunter.be centrally/conveniently located The resort is centrally located in an area visited by millions of tourists each year.\n[ T ] formal to find someone or something: After a period of time, a landlord is entitled to keep items left in the property if he is unable to locate the tenant."}