{"id":214647,"name":"lockbox","type":"noun","us_sound":"ˈlɑːk.bɑːks","us_link":"../audio/l/cdo1121uslock2641.mp3","uk_sound":"ˈlɒk.bɒks","uk_link":"../audio/l/cdo1121uklock2341.mp3","content":"lockbox noun [C]\n(CONTAINER)\nAdd to word list\nAdd to word list\n(UK keysafe) a small box with a button or dials (= moving parts) that allow you to enter a particular series of numbers in order to open the box and get the keys kept inside it: A lockbox gives agents access to your house key so they can show your home any time a buyer wants to see it. A lock box is a small, sturdy metal box that’s affixed to your front door, with a key to your house inside.\nBalkansCat/iStock/Getty Images Plus/GettyImages\nany box that can be locked shut: Most players keep jewelry in a lockbox when they play. Pending federal approval, the airline plans to install the guns in electronically coded lock boxes in all planes.\nMore examplesFewer examplesState law requires that elevator keys be secured within 10 feet of the main entrance of high-rise buildings in a readily accessible lockbox. There are the notices taped to doors and the string of lock boxes in the foyer, which he said would put off potential buyers.He kept his tapes in a lockbox in the barracks.\nSMART Vocabulary: related words and phrases\nGeneral and miscellaneous containers\nBall jar\nbin\nbindle\nbiscuit tin\ncaddy\ndrum\nflowerpot\ngeocache\ngift box\ngunnysack\npaintbox\npallet\npiggy bank\nplanter\npunnet\nurn\nvivarium\nworkbasket\nworkbox\nwormery\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBuilding: locks & locksmithing\nlockbox noun [C]\n(IN BANKING)\nfinance &amp; economics\n&#160; specialized a service provided by banks in which a company's customers send payments directly to a bank so that the money can be paid immediately into the company's bank account: Our lockbox service provides your business quicker access to your accounts receivables. Banks can set up \"lock boxes\" where receipts can go directly into the account without employees handling it.\nMore examplesFewer examplesThe problem centers on checks sent to an IRS post office box in Pittsburgh, to be processed through a the bank's lockbox facility.The bank took over the operation of \"lockbox\" offices set up to deposit passport fees and forward applications. The company plans to keep customers' deposits in an electronic lock box that will be operated by the bank.\nSMART Vocabulary: related words and phrases\nBanks\nanti-city\napex\nbancassurance\nbank\nbank manager\nbank statement\nbuilding society\ncash drawer\nchallenger bank\nclearing bank\ndebit\nelectronic banking\ngiro\ninvestment bank\nlandbanking\npay\nsafe deposit box\nstatement\nstress test\nsuperbank\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPayment methods\nAdd to word list\nAdd to word list\na service provided by banks in which a company's customers send payments directly to a bank so that the money can be paid immediately into the company's bank account: lockbox facility/service Checks are sent to a post office box in Pittsburgh, to be processed through the bank's lockbox facility.\na strong, locked container used for storing money and valuable possessions: He has a lockbox at the back of the office where he stores cash and other valuables."}