{"id":214834,"name":"loftiness","type":"noun","us_sound":"ˈlɑːf.ti.nəs","us_link":"../audio/l/uslodge004.mp3","uk_sound":"ˈlɒf.ti.nəs","uk_link":"../audio/l/ukloch_027.mp3","content":"loftiness noun [U]\n(SUPERIORITY)\nAdd to word list\nAdd to word list\nthe quality of being very serious and important, or morally good: We must appreciate the loftiness and nobleness of the task which he set for himself.\ndisapproving the quality of behaving as if you think you are better than other people: His refusal to even discuss her ideas came across as loftiness and condescension.\nMore examplesFewer examplesFor all his loftiness of purpose, he did not take himself that seriously. Her natural loftiness of spirit shows when she is threatened and does not waver. The speech sounded good in French, which conveys a certain loftiness.He does sometimes slip into a lordly professorial loftiness.\"And who are YOU?\" she retorted, with some loftiness.\nSMART Vocabulary: related words and phrases\nVirtue and moral good\naltruism\nangel\nangelic\nangelically\nbe as pure as the driven snow idiom\njustifiable\njustifiably\njustified\nlofty\nmagnanimity\nrightly\nrightness\nsaintly\nself-forgetful\nthe road to hell is paved with good intentions idiom\nuprightly\nuprightness\nupstanding\nvirtuous\nvirtuously\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFeeling morally superior\nShowing arrogance and conceit\nloftiness noun [U]\n(HEIGHT)\nthe quality of being high or tall: The beech tree was pale and slender, yet strong in its loftiness.\nMore examplesFewer examplesGiven the loftiness of the hall, the acoustics were quite good.\nSMART Vocabulary: related words and phrases\nSaddening, shocking and upsetting\naffecting\nagonizingly\narrogance\nbaleful\nbe cold comfort idiom\ndisrespect\ndistressful\ndistressfully\ndistressing\ndistressingly\nhubris\nhurtful\nhurtfully\nimpiously\nimpiousness\nteary\ntouching\ntouchingly\ntragically\ntraumatic\nSee more results »"}