{"id":214896,"name":"logic","type":"noun","us_sound":"ˈlɑː.dʒɪk","us_link":"../audio/l/logic.mp3","uk_sound":"ˈlɒdʒ.ɪk","uk_link":"../audio/l/uklogar007.mp3","content":"logic noun [U]\n(REASONABLE THINKING)\nAdd to word list\nAdd to word list\nC1 a particular way of thinking, especially one that is reasonable and based on good judgment: I fail to see the logic behind his argument. If prices go up, wages will go up too - that's just logic. There's no logic in the decision to reduce staff when orders are the highest they have been for years. The internal logic of her argument is undeniable.\nMore examplesFewer examplesI can't fault you on your logic.Her logic is utterly incontrovertible.There are irredeemable flaws in the logic of the argument.There is no logic in his position.Her arguments lack logic.\nSMART Vocabulary: related words and phrases\nLogic and reason\na fortiori\na posteriori\na priori\nanalytic\nantinomy\nhypothetical\nhypothetico-deductive\nillogical\nillogicality\nillogically\nnon sequitur\nnon-logical\nnon-rational\nnon-theoretical\nnon-verbal\ntautologically\nteleological\nteleology\ntheoretical\ntheoretically\nSee more results »\nlogic noun [U]\n(FORMAL THINKING)\na formal scientific method of examining or thinking about ideas: a treatise on formal logic\nSMART Vocabulary: related words and phrases\nLogic and reason\na fortiori\na posteriori\na priori\nanalytic\nantinomy\nhypothetical\nhypothetico-deductive\nillogical\nillogicality\nillogically\nnon sequitur\nnon-logical\nnon-rational\nnon-theoretical\nnon-verbal\ntautologically\nteleological\nteleology\ntheoretical\ntheoretically\nSee more results »\nlogic noun [U]\n(REASONABLE THINKING)\nAdd to word list\nAdd to word list\na particular way of thinking, esp. one that is reasonable and based on good judgment: I fail to see the logic of your argument.\nlogic noun [U]\n(FORMAL THINKING)\na formal, scientific method of examining or thinking about ideas\nAdd to word list\nAdd to word list\nsensible methods of thinking and making good decisions: business/economic/commercial logicthe logic of sth Customers support what we're doing, because they see the logic of using renewable resources.there is logic in/to sth There is clear logic in putting the two businesses together. If there's any logic to privatization, it's that competition creates more efficiency.\nIT\n&#160; (also programming logic) actions that a computer performs, such as comparing and matching, that involve simple yes or no choices, rather than more complicated mathematics: Logic controls how the computer code is executed."}