{"id":215162,"name":"lonely","type":"adjective","us_sound":"ˈloʊn.li","us_link":"../audio/l/lonely.mp3","uk_sound":"ˈləʊn.li","uk_link":"../audio/l/uklonel001.mp3","content":"Add to word list\nAdd to word list\nB1 unhappy because you are not with other people: She gets lonely now that all the kids have left home. the lonely life of a widower\nThesaurus: synonyms, antonyms, and examples\nfeeling sad and alonelonelyI've been lonely since my friends moved away.lonesomeUS I'm feeling lonesome.isolatedI wouldn't like living out in the country - I'd feel isolated from the rest of the world.forlornThe characters, a flighty heiress and her forlorn suitor, are a delight.lornHe's a lone, lorn creature.desolateAfter the market crash, desolate financiers left the field.\nSee more results »\nB2 A lonely place is a long way from where people live: a lonely stretch of Arizona highway\nMore examplesFewer examplesDa Silva plays a bright, lonely student from New York, adrift in small-town Arizona.He couldn't bear to think of the lonely year ahead.He felt lonely and far from home.I know what it's like to be lonely, so I do feel for her.You can't complain of being lonely when you don't make any effort to meet people.\nSMART Vocabulary: related words and phrases\nFeeling sad and unhappy\na dog's life idiom\nabjection\nangsty\nbe cut up idiom\nbe down in the mouth idiom\nbe in a funk idiom\ndistraught\ndistressed\ndog\ndoleful\nlovelorn\nlovesick\nlow-spirited\nlugubrious\nlugubriously\nwistfully\nwoe\nwoe is me idiom\nwoebegone\nwoeful\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAlone\nDistant in space and time\nGrammar\nAlone, lonely, or lonesome?Alone is an adjective and an adverb meaning that no other person is with you. When we use alone as an adjective, it never comes before the noun (predicative adjective): …\nAlone or lonely?Alone is an adjective and an adverb meaning that no other person is with you. When we use alone as an adjective, it never comes before the noun (predicative adjective): …\nLonesomeIn American English, lonesome means the same as lonely: …\nIdiom\nlonely hearts\nAdd to word list\nAdd to word list\n(of someone) feeling sad because you are alone, or (of something) causing this feeling: a lonely child my lonely room\nA lonely place has no people, buildings, etc.: a lonely and deserted road loneliness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈloʊn·li·nəs/\nSome elderly people live in isolation and loneliness."}