{"id":215176,"name":"long","type":"adjective","us_sound":"lɑːŋ","us_link":"../audio/l/long.mp3","uk_sound":"lɒŋ","uk_link":"../audio/l/uklonel004.mp3","content":"long adjective\n(TIME)\nAdd to word list\nAdd to word list\nA1 continuing for a large amount of time: a long film/meeting I've been waiting a long time. It's a long time since I worked there. Apparently the sessions are an hour long. Synonyms\ndrawn-out\nextended\nlengthy\nprolonged\nprotracted\nThesaurus: synonyms, antonyms, and examples\ncontinuing for a large amount of timelongHe's been gone a long time.prolongedShe returned to work after a prolonged illness.lengthyAirline passengers may face lengthy delays during holiday travel.sustainedWe continue to see sustained economic growth.extendedStanding for extended periods of time can be bad for your back.\nSee more results »\nMore examplesFewer examplesPassengers could face long delays.She had a long career in films.She gave him a long, lingering kiss.They had a long and happy marriage.After a long, awkward pause someone asked a question.\nSMART Vocabulary: related words and phrases\nLasting for a long time\nall-night\nancient\nbe going strong idiom\nchangeless\ndateless\nfull time\nimmemorial\nimmemorially\nincorruptibility\nincorruptible\nlong-time\nlongevity\nman and boy idiom\nnever-ending\nnondurable\nsustainedly\ntime-consuming\ntimeless\ntimelessly\ntimelessness\nSee more results »\nlong adjective\n(DISTANCE)\nA1 being a distance between two points that is more than average or usual: long hair long legs a long dress There was a long queue at the post office. We're still a long way from the station.\nMore examplesFewer examplesHe noticed her long delicate fingers.It's a heck of a long way to the nearest shop from here.I love going on long journeys.There's a long flight of steps ascending to the cathedral doors.The island has long golden beaches fringed by palm trees.\nSMART Vocabulary: related words and phrases\nLow, short and shallow\nbrief\nfubsy\nknee-high\nlevel\nlongish\nlow\nlow slung\nmini\nshallow\nshort\nshort-range\nshorten\nshortness\nshorty\nshrimp\nsquatty\nstumpy\nstunted\ntitch\nundersized\nSee more results »\nlong adjective\n(MANY WORDS)\nA2 used to describe a piece of writing that has a lot of pages or words: a long letter/book/report\nMore examplesFewer examplesI got a lovely long newsy letter from Bec.His speech was long and dull.He is well known to the police and has a long criminal record .Your conclusion is good, but the final sentence is too long and complicated.It gives you a sense of achievement if you actually make it to the end of a very long book.\nSMART Vocabulary: related words and phrases\nLasting for a long time\nall-night\nancient\nbe going strong idiom\nchangeless\ndateless\nfull time\nimmemorial\nimmemorially\nincorruptibility\nincorruptible\nlong-time\nlongevity\nman and boy idiom\nnever-ending\nnondurable\nsustainedly\ntime-consuming\ntimeless\ntimelessly\ntimelessness\nSee more results »\nGrammar\nLongLong is an adjective or an adverb. …\nMeasurementsWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nArea: length, width, depth and heightWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nWeight and volumeWe use the verb weigh to measure weight: …\nFrequency, speed, timeWe use many different expressions to describe frequency, speed and time. Here are some of them: …\nNo longer, not any longerWe use no longer or not any longer to talk about the end of an action or state. No longer is more formal: …\nIdioms\nbe long in the tooth\nbefore (very/too) long\ngo a long way\ngo a long way toward(s) doing something\ngo back a long way\nhave come a long way\nhow long is a piece of string?\nit's a long story\nthe long arm of the law\n(as) long as your arm\nMore idioms\na long face\nlong live someone/something!\nlong on something and short on something\nlong story short\nlong time no see\na long way to go\nno longer\nnot by a long shot\nnot long for this world\nso long\ntake a long, hard look at something\ntake the long view\nlong adverb\n(TIME)\nA2 used to mean \"(for) a long time\", especially in questions and negative sentences: Have you been waiting (for) long? I'm just writing a letter but it won't take long. How long have you been in England? Don't rush - take as long as you like. We've been walking all day long. I've known her longer than you have. I won't be staying much longer.\nC2 a long period of time before or after something: She left the house long before I arrived. It wasn't long before he was back with his family. He did not join them until long after they had eaten.\nused with the past participle or the -ing form of the verb to mean that a state or activity has continued for a long time: a long-awaited letter long-serving employees\nMore examplesFewer examplesSo how long have you been married to Nicky?Changes to the tax system are long overdue.How long did Queen Victoria reign?He's been single so long now, I don't think he'll ever marry.I do apologize - my train was delayed. I hope you haven't been waiting long.\nSMART Vocabulary: related words and phrases\nLasting for a long time\nall-night\nancient\nbe going strong idiom\nchangeless\ndateless\nfull time\nimmemorial\nimmemorially\nincorruptibility\nincorruptible\nlong-time\nlongevity\nman and boy idiom\nnever-ending\nnondurable\nsustainedly\ntime-consuming\ntimeless\ntimelessly\ntimelessness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLong periods of time\nlong adverb\n(IF)\nas/so long as\nB1 used to say that something must happen before something else can happen: I can come as long as I can leave by 4.00. Bring your friends by all means - just so long as I know how many are coming.\nMore examplesFewer examplesWindsurfing is perfectly safe as long as you use some common sense.So long as he's happy - that's all that matters .Goods are exchangeable as long as they are returned in good condition.I don't foresee any difficulties so long as we keep within budget.I don't mind being woken up once or twice in the middle of the night by my flatmate so long as she doesn't make a habit of it .\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a condition\nassuming (that)\nat\nat the risk of doing something idiom\nby\nceteris paribus\neven\ngranted\nif\nlest\nprovided (that)\nrisk\nsuppose\nunless\nwhether\nGrammar\nLongLong is an adjective or an adverb. …\nMeasurementsWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nArea: length, width, depth and heightWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nWeight and volumeWe use the verb weigh to measure weight: …\nFrequency, speed, timeWe use many different expressions to describe frequency, speed and time. Here are some of them: …\nAs long as and so long asAs long as and so long as are conjunctions. …\nShould you (Should with inversion)In formal situations, we can use should + subject (s) + verb (v) instead of if: …\nHad you (Had with inversion)In formal situations, we can use had + subject + verb instead of if in third conditional sentences: …\n+ In formal situations, we can use if + were to when we talk about things that might happen but which we think are unlikely: …\nAs long as, so long as, providing, etc.Sometimes we need to impose specific conditions or set limits on a situation. In these cases, conditional clauses can begin with phrases such as as long as, so long as, only if, on condition that, providing (that), provided (that). …\nOr and otherwiseWe often use or and otherwise with conditional meanings: …\nSupposingSupposing may be used with a conditional meaning. It can be used in first, second or third conditional sentences. The speaker invites the listener to imagine a situation: …\nConditionals: other expressions (unless, should, as long as)Conditional clauses can begin with unless. Unless means something similar to ‘if … not’ or ‘except if’. …\nUnlessConditional clauses can begin with unless. Unless means something similar to ‘if … not’ or ‘except if’. …\nlong for something; long to do something\nC2 to want something very much: She longed to see him again. I'm longing for news of him. Synonym\nyearn\nSMART Vocabulary: related words and phrases\nWanting things\nache for something\nacquisitive\nambitious\nambitiously\nangle for something\ndesperate\nexpense\nhave your eye on something idiom\nhunger\nhunger after/for something\nhungrily\nimpulse\npine\nseeker\nset your heart on something/doing something idiom\nset your sights on something idiom\nshook\nshopping list\nsight\nsomeone's heart's desire idiom\nSee more results »\nGrammar\nMeasurementsWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nArea: length, width, depth and heightWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nWeight and volumeWe use the verb weigh to measure weight: …\nFrequency, speed, timeWe use many different expressions to describe frequency, speed and time. Here are some of them: …\nwritten abbreviation for\nlongitude\nSMART Vocabulary: related words and phrases\nCountries, nationalities & continents: continents & regions of the world\nAfrocentric\nAfrocentrism\namazonian\nAntarctica\nAntipodean\nblack Africa\ngulf\nlat.\nLATAM\nLatin America\nlatitudinal\nlatitudinally\nlongitude\nmeridian\nparallel\npole\nthe Antipodes\nthe South Pole\nthe subtropics\nthe Tropic of Cancer\nSee more results »\nGrammar\nMeasurementsWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nArea: length, width, depth and heightWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nWeight and volumeWe use the verb weigh to measure weight: …\nFrequency, speed, timeWe use many different expressions to describe frequency, speed and time. Here are some of them: …\nIdiom\nthe long and the short of it\nwritten abbreviation for\nlongitude\nSMART Vocabulary: related words and phrases\nCountries, nationalities & continents: continents & regions of the world\nAfrocentric\nAfrocentrism\namazonian\nAntarctica\nAntipodean\nblack Africa\ngulf\nlat.\nLATAM\nLatin America\nlatitudinal\nlatitudinally\nlongitude\nmeridian\nparallel\npole\nthe Antipodes\nthe South Pole\nthe subtropics\nthe Tropic of Cancer\nSee more results »\nlong adjective [-er/-est only]\n(DISTANCE)\nAdd to word list\nAdd to word list\nbeing a distance between two points that is more than average or usual, or being of a particular length: There was a long line at the post office. When I was young I wore my hair long. We’re still a long way from the station (= a great distance).\nA long piece of writing, such as a book or story, has many words: It’s a long book – over 600 pages. Long underwear\nLong underwear is long johns.\nlong adjective [-er/-est only]\n(TIME)\nbeing an amount of time that is more than average or usual, or being of a particular amount of time: The days are longer in summer than in winter. We had to wait a long time to see the doctor. We went away for a long weekend in April (= Saturday, Sunday, and an extra day or days).\nSomething that is long-lost has not been seen for many years before appearing suddenly: A long-lost diary was discovered among his papers. Idioms\na long way to go\nat long last\nin the long run\nthe long haul\nlong verb [I]\n(WANT)\nto want something very much: [ + to infinitive ] She longed to move out of the city.\nAdd to word list\nAdd to word list\nFINANCE, STOCK MARKET used to describe the situation in which you buy and keep shares, etc. because you expect them to rise in value and make a profit: Nobody wants to be long on stocks over a weekend of economic uncertainty, because stocks may fall sharply in value when markets reopen on Monday.\ndo/have/work long hours/days\nWORKPLACE to work more hours each day than people usually do: In spite of the New Deal, junior doctors are still working dangerously long hours. See also\nlong-hours culture\ngo long (on sth)\nFINANCE, STOCK MARKET to buy or keep shares, etc. because you expect their price to rise, so that you can make a profit: The prospects for domestic demand growth in the eurozone are not great, so why not go long on sterling, where the prospects for domestic demand growth are still looking optimistic? Compare\nshort adjectiveSee also\nlong position\nlongs"}