{"id":215296,"name":"longsightedness","type":"noun","us_sound":"ˌlɑːŋˈsaɪ.t̬ɪd.nəs","us_link":"../audio/l/cdo0318uslong2795.mp3","uk_sound":"ˌlɒŋˈsaɪ.tɪd.nəs","uk_link":"../audio/l/cdo0317longuk2260.mp3","content":"longsightedness noun [U]\n(JUDGMENT)\nAdd to word list\nAdd to word list\n(also far-sightedness) good judgment about what will be needed in the future and the ability to make wise decisions based on this: The partners have both entrepreneurial spirit and longsightedness. It was with long-sightedness and determination that he reached his goals. Opposite\nshortsightednessRelated word\nlongsighted\nMore examplesFewer examplesIt takes a certain longsightedness to invest time and effort in collecting.The program needs to be reviewed, which should be undertaken seriously with longsightedness.Things like declaring a major or starting a job require long-sightedness, dedication, and commitment.\nSMART Vocabulary: related words and phrases\nWise and sensible\nbe a victory for common sense idiom\ncannily\ncanny\nclear-headed\nclear-headedly\njudicious\njudiciously\nlevel-headed\nlong-sightedness\nmethod\nreasoned\nresponsibility\nresponsible\nresponsibly\nright-minded\nto be wise after the event idiom\nvictory\nwell advised\nwily\nwisdom\nSee more results »\nlongsightedness noun [U]\n(EYES)\nmainly UK (US usually far-sightedness) the conditon of only being able to clearly see things that are far away from you: Thousands of people suffer from longsightedness. Eyeglasses with convex lenses are prescribed for long-sightedness. Synonym\nhyperopiaOpposite\nshortsightedness\nMore examplesFewer examplesAt one to three months old, there may be some longsightedness which adjusts to the norm as the baby grows.Longsightedness is caused by the eyeball being too short from front to back.Genes account for 87 percent of the variation in short- and long-sightedness.\nSMART Vocabulary: related words and phrases\nEyesight, glasses & lenses\naccommodative\nafterimage\nage-related macular degeneration\nAMD\nastigmatic\nbespectacled\nboss-eyed\neyestrain\nhorn-rimmed\nlong-sighted\nmacular degeneration\nmonocular\nmultifocal\nmyopically\nnaked\nnearsighted\nocular\nophthalmology\nsightless\nsty\nSee more results »"}