{"id":215295,"name":"longsighted","type":"adjective","us_sound":"ˌlɑːŋˈsaɪ.t̬ɪd","us_link":"../audio/l/uscld00836.mp3","uk_sound":"ˌlɒŋˈsaɪ.tɪd","uk_link":"../audio/l/ukcld00836.mp3","content":"longsighted adjective\n(JUDGMENT)\nAdd to word list\nAdd to word list\n(also far-sighted) having good judgment about what will happen in the future and the ability to make wise decisions based on this: His foreign policy was a combination of longsighted achievements and short-sighted blunders. They showed themselves to be broad-minded, mature, and long-sighted. Opposite\nnearsightedRelated word\nlongsightedness\nMore examplesFewer examplesYou need to be longsighted when it comes to calling the bottom of bear markets. Where would English literature be today, were it not for some long-sighted publishers seeing the potential of these writers?\nSMART Vocabulary: related words and phrases\nWise and sensible\nbe a victory for common sense idiom\ncannily\ncanny\nclear-headed\nclear-headedly\njudicious\njudiciously\nlevel-headed\nlong-sightedness\nmethod\nreasoned\nresponsibility\nresponsible\nresponsibly\nright-minded\nto be wise after the event idiom\nvictory\nwell advised\nwily\nwisdom\nSee more results »\nlongsighted adjective\n(EYES)\nmainly UK (US usually far-sighted) A longsighted person can only clearly see objects that are far away: Convex lenses help those who are longsighted; concave lenses those who are short-sighted. Long-sighted people are unable to see close objects clearly. Opposite\nnearsightedRelated word\nlongsightedness\nMore examplesFewer examplesIt's fairly common for young babies who are longsighted at six months to have normal vision by the time they're four. We become more longsighted as we grow older.Long-sighted children may be reluctant to read and suffer from headaches.\nSMART Vocabulary: related words and phrases\nEyesight, glasses & lenses\naccommodative\nafterimage\nage-related macular degeneration\nAMD\nastigmatic\nbespectacled\nboss-eyed\neyestrain\nhorn-rimmed\nlong-sighted\nmacular degeneration\nmonocular\nmultifocal\nmyopically\nnaked\nnearsighted\nocular\nophthalmology\nsightless\nsty\nSee more results »"}