{"id":215386,"name":"loop","type":"noun","us_sound":"luːp","us_link":"../audio/l/loop.mp3","uk_sound":"luːp","uk_link":"../audio/l/uklonel025.mp3","content":"loop noun [C]\n(SHAPE)\nAdd to word list\nAdd to word list\nthe curved shape made when something long and thin, such as a piece of string, bends until one part of it nearly touches or crosses another part of it: Tie the ends of the rope together in a loop. the loop of the river\nSiri Stafford/DigitalVision/GettyImages\na piece of string, thread, material, etc. bent into a curved shape: a loop of string belt loops\nSMART Vocabulary: related words and phrases\nGeometry: bends, loops & curves\nanfractuous\narc\nconic\ncurl\ncurve\nfishhook\nhelically\nhelix\nhyperbola\nhyperbolic\nkink\nparabola\npeaked\ntight\ntrajectory\nturn\ntwist\nwhirl\nwhorl\nwraparound\nSee more results »\nloop noun [C]\n(MOVEMENT)\na vertical circle made by an aircraft in the sky: The pilot swung the plane into a tight loop. Planes flew acrobatics, loops, and rolls.\na turning or curving movement made in ice skating (= the sport of moving on ice wearing special boots): She practised her axels and toe loops.\nSMART Vocabulary: related words and phrases\nMovement through the air\nairborne\nbuoyantly\nbuzz\nflight\nfloat\nfly\nglide\nhover\nlevitate\nlevitation\nmid-air\nnon-flying\nskim\nsoar\nsoaring\nsomersault\nswishy\nswoop\nwaft\nwheel\nSee more results »\nloop noun [C]\n(REPEATED SECTION)\na short section of recorded music that is repeated all through a song or part of a song: His piping and fiddle-playing blend traditional music with sampled beats and loops. Full songs are divided into sections such as choruses, verses, intros and endings in order to make it easier for songwriters to choose the most appropriate loops for their music.\ncomputing\n&#160; specialized a series of instructions that is repeated until a particular thing happens: The CPU world relies upon condition variables, branches, and loops. in/on a loop\nIf something runs in a loop, or is on a loop, it runs continuously, so that the same things are repeated again and again: The tape ran in a continuous loop, repeating the same songs over and over.\nSee more\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\ndrill down\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntoolbar\nvectorization\nvectorize\nvirtualization\nvirtualize\nwake word\nzip file\nSee more results »\nIdioms\nbe in the loop/be out of the loop\nknock/throw someone for a loop\nloop verb [I or T, usually + adv/prep]\n(make a curve)\nto make a loop or curve: Loop the rope over the bar. Turn left where the road loops round the farm buildings.\nSMART Vocabulary: related words and phrases\nBending, twisting and curving\narch your back\nball up\nbendy\nbent\nbowed\ndescribe\nentwine\nflex\nflexion\nflexure\nfluted\nrewind\nswirlingly\nswoopy\ntangle\ntangled\ntangly\nwristy\nwrithe\nzigzag\nSee more results »\nloop verb [I or T, usually + adv/prep]\n(repeat)\n(of a short piece of recorded music) to be repeated all through a song or part of a song: The sample is automatically looped to repeat continuously until you tell it to stop. Idiom\nloop the loop\nAdd to word list\nAdd to word list\na circular shape made by something long and narrow in which the two ends cross each other, leaving an open space within: A loop of thread from my sweater caught on a nail. The exit ramp makes a loop under the elevated highway. loop verb [ I/T ] us\nYour browser doesn't support HTML5 audio\n/lup/\n[ I always + adv/prep ] The nature trail loops around and comes back to where you start.\nAdd to word list\nAdd to word list\nIT one or more instructions given repeatedly by a computer program until a particular result is achieved\nbe in the loop informal\nto be one of a group of people who have particular knowledge, make important decisions, or deal with important situations: Entry-level workers want to feel like they're in the loop.\nbe out of the loop informal\nto not be one of a group of people who have particular knowledge, make important decisions, or deal with important situations: A group of senior staff at the plant have just told her they are as much out of the loop as the workers."}