{"id":215427,"name":"loot","type":"verb","us_sound":"luːt","us_link":"../audio/l/loot.mp3","uk_sound":"luːt","uk_link":"../audio/l/ukloose003.mp3","content":"Add to word list\nAdd to word list\n(usually of large numbers of people during a violent event) to steal from shops and houses: During the riot shops were looted and cars damaged or set on fire.\nThesaurus: synonyms, antonyms, and examples\nto steal somethingstealI caught him trying to steal my bike.takeSomeone took their car from outside the house.shopliftHe was caught shoplifting by a security guard.robHe robbed a bank.burgleUK When she got home from work, she discovered that her house had been burgled.pilferEmployees pilfering paper, pens, etc. can cost employers a lot.\nSee more results »\nIndian English to steal something from a place or person: Burglars looted cash and mobiles from a shop in Tagore Town. The passengers in the general compartment of Shramjivi Express were looted and robbed of their valuables.\nSMART Vocabulary: related words and phrases\nStealing\nabscond\nabscond with someone/something\naggravated burglary\nanti-burglar\nanti-burglary\neavesdrop\nhome invasion\nhot-wire\nhousebreaking\njemmy\njimmy\nkleptomania\npiratical\npiratically\nplunder\npoach\npoaching\nrustle\nsnaffle\nsnarf\nSee more results »\nRelated word\nlooter\nmoney and valuable objects that have been stolen, especially by an army from a defeated enemy or by thieves: The thief must have been very disappointed when he examined his loot. He was captured and his loot was returned to the store.\nin computer games, the things you get as rewards, for example for defeating an enemy, that you can use in the games: It provides the same experiences as larger dungeon games: fighting monsters, disarming traps, advancing characters, and collecting loot. Enjoy this free online adventure game - battle demons with your friends, earn loot and build the ultimate castle!\nSMART Vocabulary: related words and phrases\nStealing\nabscond\nabscond with someone/something\naggravated burglary\nanti-burglar\nanti-burglary\neavesdrop\nhome invasion\nhot-wire\nhousebreaking\njemmy\njimmy\nkleptomania\npiratical\npiratically\nplunder\npoach\npoaching\nrustle\nsnaffle\nsnarf\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSports & games generally\nAdd to word list\nAdd to word list\n(said esp. of large numbers of people) to steal from stores: [ I ] Riot police were sent to prevent the mob from looting.\nTo loot something is also to take a lot of money away from it that does not belong to you: [ T ] The officers of the corporation looted the company of millions of dollars.\nmoney or valuable objects that have been stolen: Three men have been sentenced to prison for taking part in the robbery, but the loot was never recovered.\nAdd to word list\nAdd to word list\nmoney or valuable objects that have been stolen: They hauled the loot, worth $10 million, to a warehouse."}