{"id":215631,"name":"lose","type":"verb","us_sound":"luːz","us_link":"../audio/l/lose.mp3","uk_sound":"luːz","uk_link":"../audio/l/ukloose017.mp3","content":"lose verb\n(NOT HAVE)\nAdd to word list\nAdd to word list\nA2 [ T ] to no longer have something because you do not know where it is: I've lost my ticket. He's always losing his car keys.\nA2 [ T ] to have something or someone taken away from you: At least 600 staff will lose their jobs if the factory closes. He lost his leg in a car accident. She lost her mother (= her mother died) last year.\nB2 [ T ] to stop feeling something: to lose confidence/faith I lost interest halfway through the book. He kept on crying and I lost my patience.\nB1 [ T ] to have less of something than you had before: I'm trying to lose weight. He's losing his hair. She lost a lot of blood in the accident. to lose your memory/sight\nThesaurus: synonyms, antonyms, and examples\nto get slowerslow downA car slowed down and stopped beside her.slowEconomic growth slowed sharply in the spring.decelerateShe decelerated as soon as she saw the police vehicle.lose speedAs the car ran out of petrol, we lost speed and rolled to a stop.\nSee more results »\nB2 [ T ] If you lose time, you waste it: Four million hours were lost last year through stress-related illnesses. We lost valuable time stuck in traffic.\n[ T ] If a clock loses time, it goes more slowly than it should: My watch loses ten minutes every day.\n[ T ] informal to get rid of something: Lose the belt and let's see how the dress looks. lose money, dollars, pounds, etc.\nC1 A business that is losing money is spending more money than it is receiving: Banks will lose millions of pounds because of new legislation.\nSee more\nMore examplesFewer examplesAnyone who gambles on the stock exchange has to be prepared to lose money.\"I'm afraid I've lost that wallet you gave me.\" \"Well, never mind, I can easily buy you another one.\"I lost my notes so I had to make up the speech as I went along.He hasn't written to me recently - perhaps he's lost my address.He moaned with pain before losing consciousness.\nSMART Vocabulary: related words and phrases\nLosing and loss\naction\nastray\nblack hole\ndisappear\nescape\nforfeit\nget to\nkiss\nloss\nlost\nmislay\nmisplace\nmisroute\nmiss\nslip through someone's fingers idiom\nunaccounted for\nunrecoverable\nunrecovered\nwalkabout\nwave\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTaking things away from someone or somewhere\nStop having or doing something\nWasting\nWatches & clocks\nRemoving and getting rid of things\nlose verb\n(BE DEFEATED)\nB1 [ I or T ] to fail to succeed in a game, competition, etc.: If we lose this game, we're out of the championship. They're losing 3–1. They lost to Cincinnati. Everyone hates losing an argument. They hadn't lost an election in 15 years.\nMore examplesFewer examplesI won the first game, and then lost the next two.Our team lost when we scored an own goal late in the second half.They boasted that they had never lost a single game.He was bitterly disappointed when he lost the leadership contest.She says that she will resign if she loses the vote.\nSMART Vocabulary: related words and phrases\nLosing and being defeated\nadmit\nbattering\nchase\nchase shadows idiom\nconcede\ndefeat\ndownfall\nfallen\ngive\ngive in\ngo down\nknuckle\nmeet\nnon-winning\nsay\nsay uncle idiom\nsuccumb\ntake a battering idiom\nunwinnable\nwhipsaw\nSee more results »\nIdioms\nbe losing it\nlose your head\nlose your heart to someone\nlose your life\nlose your mind\nlose your rag\nlose your shirt\nlose your touch\nlose your way\nlose ground\nMore idioms\nlose heart\nlose it\nlose sight of something\nlose sleep over/about something\nlose the plot\nyou've got nothing to lose\nPhrasal verb\nlose out\nlose verb\n(NOT BE ABLE TO FIND)\nAdd to word list\nAdd to word list\n[ T ] to not be able to find something: I lost my keys somewhere in the house. Two officers chased the suspect, but he turned down an alley and they lost sight of him (= could no longer see him).\nlose verb\n(NO LONGER POSSESS)\n[ T ] to no longer have something, because it has been taken away from you, either by accident or purposely: Workers will lose their jobs if the plant closes. He lost his leg in a car accident.\n[ T ] If you lose someone, that person dies: George lost his wife in 1990.\n[ T ] If you lose money you have risked, you do not make a profit and do not get your money back.\n[ T ] A business that is losing money is spending more money than it is receiving.\nlose verb\n(BE DEFEATED)\n[ I/T ] to fail to succeed in a game or competition: [ I ] If we lose again, we’re out of the playoffs. [ T ] Anderson lost the election by a narrow margin.\nlose verb\n(NOT MAINTAIN)\n[ T ] to not maintain or no longer have control over a quality or ability: She used to play tennis regularly, but lately she’s lost interest in it. The driver lost control of her car. The dog is losing her eyesight/hearing/sense of smell. Carl lost his balance and fell down the stairs.\n[ T ] If you lose time or an opportunity, you waste it.\n[ T ] If a clock loses time, it goes more slowly than it should.\nlose verb\n(HAVE LESS OF)\n[ T ] to have less of something, esp. in the body: to lose blood/weight\nlose verb\n(CONFUSE)\n[ T ] to confuse someone: I’m sorry, you’ve lost me – would you go over that again?\nIdioms\nlose count of something\nlose face\nlose your head\nlose heart\nlose your mind\nlose sight of\nlose sleep (over something)\nlose your temper\nlose track\nlose your touch\nMore idioms\nlose touch (with someone)\nlose touch (with something/someone)\nAdd to word list\nAdd to word list\n[ T ] to no longer have something or have less of something, because it has been taken away from you, or you fail to keep it: Manufacturing lost 11,000 jobs in June after several months of small increases. She was among 40 people who lost their jobs when the plant closed.lose business/market share/sales The company has steadily lost market share over the past 15 years. The company has lost its place as the world's number one automaker.lose sth to sth Last year, the company lost at least 30 working days to strikes.lose sth to sb The business began to lose clients to the new supermarket. The organization has lost the finest director it has ever had. Homeowners technically could still lose their homes over unpaid rent.\n[ T ] if you lose time, you waste it: Four million working hours were lost last year through stress-related illnesses. There is no time to be lost in securing the deal. See also\nlost time\n[ I or T ] to spend more money than you receive, fail to keep money that you had, or cause a loss of money: The airline lost £40m from a strike at the airport in the summer. Companies must compensate employees who lose financially because of a misleading, inaccurate, or unfair reference.lose sb sth We cannot continue with an area of business that is losing us millions.lose sth on sth He lost $50000 on the stock market. The company has lost money over the last few years.\n[ T ] to go down in price or value: The company's shares lost 10.75p to 416p . The Dow Jones Industrial Average lost 107.42 points in the past two days.\nlose face\nto lose the respect of other people because of something you have done: Both companies are denying responsibility for the crisis, as neither wants to lose face. See also\nloss\nlose ground\nto become less popular, fall in value, or be given less support: California still tops the 50 states in tech exports but is losing ground. The stock started losing ground with the rest of the market in midmorning and closed down 18p.\nlose sight of sth\nto forget about an important idea or fact because you are thinking about other things: In their attempts to increase profits, they have lost sight of the importance of customer satisfaction.\nlose your shirt informal\nto lose a lot of money: It would be wrong to suggest that all investors have lost their shirts. Phrasal verb\nlose out"}