{"id":215644,"name":"loss","type":"noun","us_sound":"lɑːs","us_link":"../audio/l/loss.mp3","uk_sound":"lɒs","uk_link":"../audio/l/ukloose019.mp3","content":"Add to word list\nAdd to word list\nB2 [ C or U ] the fact that you no longer have something or have less of something: Many parents feel a sense of loss when their children leave home. He suffered a gradual loss of memory. There will be substantial job losses if the factory closes down. He suffered hearing loss from testing aircraft engines. blood/hair/weight loss\nC2 [ S ] a disadvantage caused by someone leaving or by something being taken away: It would be a great loss to the department if you left.\nB2 [ C or U ] the death of a person: They never got over the loss of their son.\nC1 [ C ] a situation in which a business spends more money than it earns: The company announced a pre-tax loss of three million dollars. loss of life\nan occasion when a number of people die: The plane crashed with serious loss of life.\nSee more\nMore examplesFewer examplesBoth viruses cause fever and loss of appetite.Her death is a grievous loss to the whole of the community.The bomb explosion resulted in a tragic loss of life.The club does not accept responsibility for loss of or damage to club members' personal property.Naturally we want to see as few job losses in the industry as possible.\nSMART Vocabulary: related words and phrases\nLosing and loss\naction\nastray\nblack hole\ndisappear\nescape\nforfeit\nget to\nkiss\nlose\nlost\nmislay\nmisplace\nmisroute\nmiss\nslip through someone's fingers idiom\nunaccounted for\nunrecoverable\nunrecovered\nwalkabout\nwave\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdvantage and disadvantage\nDeath and dying\nAccounting\nProfits & losses\nIdioms\nbe at a loss\nsorry for your loss\none man's loss is another man's gain\nloss noun [C/U]\n(NOT HAVING)\nAdd to word list\nAdd to word list\nthe action or state of not having or keeping something any more: [ C ] The company’s losses over the last few years have been staggering.\nLoss may mean death: [ U ] They never got over the loss of their son.\nloss noun [C/U]\n(NOT CONTROLLING)\nthe action or state of not maintaining or having control over something any more: [ C ] He suffered a gradual loss of memory in his later years. Idiom\nat a loss\nAdd to word list\nAdd to word list\n[ C or U ] a situation in which you no longer have something or have less of something, or the process that causes this: The loss of jobs in the convenience food industry seems inevitable.loss of earnings/income/pay She received compensation for loss of earnings through the illness.a loss in sth The new road will cause losses in economic value to many local properties.\n[ C ]\n&#160; FINANCE, COMMERCE a situation in which a business or an organization spends more money than it earns, or loses money in another way: announce/post/report a loss (of sth) The company announced a loss of €1.3m last year. a loss in revenue big/financial/heavy losses a net/operating loss a pre-tax/after-tax lossincur/make/realize a loss In a bid to attract customers, some insurers may even be making a loss on contracts marketed to certain key buyers. a loss on an investment/a sale\n[ C ]\n&#160; STOCK MARKET a situation in which the value of shares goes down: a loss in sth Gains in oil and gas were partly offset by losses in consumer products and precious metals.\n[ U ]\n&#160; INSURANCE a situation in which property is damaged, lost, or stolen, and an insurance company must pay to replace it: We will cover your house contents against accidental loss or damage during the removal.\n[ C ] a disadvantage caused by someone leaving an organization: be a loss to sb/sth It would be a great loss to the department if you left.\nloss of face\na situation in which someone loses the respect of other people because of something they have done: His first deal with the company had turned into a very public loss of face. See also\nlose\noperate, run, etc. at a loss\nFINANCE, COMMERCE to fail to make a profit in a business: Of the 235 large industrial projects, 46 are running at a loss. Compare\ngain noun\nprofit nounSee also\nactual loss\nall-loss\nannual loss\ncapital loss\ncredit loss\nexceptional loss\nfirst-half loss\nfull-year loss\ngross loss\njob loss\nloan loss\nnet loss\none-time loss\noperating loss\npaper loss\npassive loss\nquarterly loss\ntax loss\ntrading loss\nunderwriting loss"}