{"id":215654,"name":"lost","type":"adjective","us_sound":"lɑːst","us_link":"../audio/l/lost_lose.mp3","uk_sound":"lɒst","uk_link":"../audio/l/ukloose020.mp3","content":"lost adjective\n(PLACE UNKNOWN)\nAdd to word list\nAdd to word list\nA2 not knowing where you are and how to get to a place: I got lost in the New York subway system. You look lost - can I help you?\nB1 If something is lost, no one knows where it is: Things tend to get lost when you move. Lost: black cat with white paws. Mikey turned up with the lost book.\nMore examplesFewer examplesStick to the main roads and you won't get lost.When you got lost in the forest you must have been very frightened.He gazed pensively at the glass in front of him, lost in thought.My letter must have got lost in the post.After three days lost in the mountains, all the climbers arrived home safe and sound.\nSMART Vocabulary: related words and phrases\nLosing and loss\naction\nastray\nblack hole\ndisappear\nforfeit\nget to\nkiss\nlose\nloss\nmislay\nmisplace\nmisroute\nmiss\nproximately\nunaccounted for\nunrecoverable\nunrecovered\nwalkabout\nwave\nwave/say goodbye to something idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnavailable and inaccessible\nlost adjective\n(CONFUSED)\nC1 not confident and not knowing what to do in a particular situation: It was his first day in the office and he seemed a little lost.\nSMART Vocabulary: related words and phrases\nPaying attention and being careful\nattention span\nattentiveness\nbe good, and if you can't be good, be careful idiom\nbe on (your) guard idiom\ncared-for\nguard\nhandle/treat someone with kid gloves idiom\nhang\nhang on/upon something\nhave a care idiom\nreligion\nrevolve\nrevolve around someone/something\nsafety\nsafety first idiom\nsee past something\nsit\nthe/a glare of something idiom\nzero\nZoom\nSee more results »\nlost adjective\n(ATTENTION)\nbe lost in something\ngiving so much attention to what you are doing that you are not conscious of anything else that is happening around you: Ann was completely lost in her book.\nSee more\nIdioms\nbe lost for words\nbe lost on someone\nbe lost without someone/something\nget lost!\nlost in the shuffle\nlost adjective\n(CANNOT BE FOUND)\nAdd to word list\nAdd to word list\n(of a person) unable to find your way, or (of an item) not to be found: a lost child/pet/earring We got lost on the way home. fig. I’d be lost without you (= I would not know what to do).\nlost adjective\n(CONFUSED)\nconfused, or not able to understand or appreciate: His explanation was so complicated, I got lost after the first example. Everyone else thought it was funny, but that joke was lost on me.\nlost\n(LOSE)\npast simple and past participle of lose"}