{"id":215658,"name":"lot","type":"noun","us_sound":"lɑːt","us_link":"../audio/l/lot.mp3","uk_sound":"lɒt","uk_link":"../audio/l/ukloose021.mp3","content":"lot noun\n(LARGE AMOUNT)\na lot (of) informal\nAdd to word list\nAdd to word list\nA1 lots (of) a large amount or number of people or things: She eats lots of fruit.\nSee more a lot\nA1 very much or very often: Your sister looks a lot like you. I'm feeling a lot better today. He looks a lot older than his wife. We used to go there a lot. have a lot to answer for\nto be the main cause of a problem or an unpleasant situation: People who sell drugs to kids have a lot to answer for.\nSee more the lot informal\neverything: I made enough curry for three people and he ate the lot. Have I got everything? Is that the lot? I'll sell you the whole lot for only £50. I'm sick of the lot of them.\nSMART Vocabulary: related words and phrases\nLarge in number or quantity\nabove and beyond something idiom\namount\nand then some idiom\nanother\nany amount of idiom\nbag\nbillion\nin buckets idiom\nin spades idiom\nincalculable\nincomputable\ninnumerable\npoly\nscore\nshower\nso much so idiom\nsome\nstrength\nsuper-large\nsupererogation\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFrequency & regularity - general words\nSomething, anything, nothing, and everything\nlot noun\n(GROUP)\n[ C ] UK an amount or set of things, especially when there are several of these amounts: I've already done one lot of washing. Another lot of visitors will be here this afternoon.\nSMART Vocabulary: related words and phrases\nGroups and collections of things\nage bracket\nagglomerate\nagglomeration\nAladdin's cave\nanthology\nbasket\ncrop\ndataset\nempty set\nensemble\nfamily\nfeast\npackage\npermutation\npool\nportfolio\nselection\nsheaf\nsheaves\nstarter pack\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral words for size and amount\nlot noun\n(SALE)\n[ C ] in an auction (= public sale), an object or set of objects that are being sold: Lot number 134 is a fine old walnut bureau. See also\njob lot informal\nSMART Vocabulary: related words and phrases\nObjects - general words\naffair\nAmericana\nartefact\nblank\ncolumn\nconversation piece\ncurio\nentity\nephemera\nextrusion\nforensics\ngewgaw\nnon-abstract\nobject\nphenomenon\npiece\nshape\nsnow globe\nsuch and such\ntchotchke\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGroups and collections of things\nlot noun\n(LAND)\n[ C ] mainly US an area of land: an empty lot a parking lot They're planning to build a house on a vacant lot on 35th Street.\n[ C ] US a film studio and the land around it\nSMART Vocabulary: related words and phrases\nPlaces and locations\nanatopism\ncapital\ncoign of vantage\ncore\ndirection\ndrop-in\nfar from the madding crowd idiom\nhill\nmadding\nmakerspace\nMecca\nmulti-location\nmulti-site\nsituation\nspot\nstation\nstronghold\nsubsite\ntechnology park\nvenue\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeography: areas of land in general\nCinema - general words\nlot noun\n(LIFE)\nsomeone's lot/the lot of someone\nthe quality of someone's life and the experiences that they have: They should do something to improve the lot of the lowest-paid workers.\nSee more\nlot noun\n(CHANCE)\ndraw lots\nto make a decision by choosing from a set of objects such as pieces of paper or sticks that are all the same except for one: We drew lots to decide who would go.\nSee more\nGrammar\nLots, a lot, plentyWe use lots, a lot and plenty in informal styles to talk about quantities, amounts and degree. Lots and a lot are similar in meaning to much and many. Plenty means ‘enough’ or ‘more than enough’. Lots is even more informal than a lot: …\nMuch, many, a lot of, lots of: quantifiersWe use the quantifiers much, many, a lot of, lots of to talk about quantities, amounts and degree. We can use them with a noun (as a determiner) or without a noun (as a pronoun). …\nMuch, many with a nounWe use much with singular uncountable nouns and many with plural nouns: …\nA lot of, lots of with a nounWe use a lot of and lots of in informal styles. Lots of is more informal than a lot of. A lot of and lots of can both be used with plural countable nouns and with singular uncountable nouns for affirmatives, negatives, and questions: …\nMuch, many, a lot of, lots of: negative questionsWhen we use much and many in negative questions, we are usually expecting that a large quantity of something isn’t there. When we use a lot of and lots of in negative questions, we are usually expecting a large quantity of something. …\nMuch, many, a lot, lots: without a nounWe usually leave out the noun after much, many and a lot, lots when the noun is obvious: …\nMuch with comparative adjectives and adverbs: much older, much fasterWe can use much before comparative adjectives and adverbs to make a stronger comparison: …\nToo much, too many and so much, so manyWe often use too before much and many. It means ‘more than necessary’. We can use too much before an uncountable noun and too many before a plural noun, or without a noun when the noun is obvious: …\nAs much as, as many asWhen we want to make comparisons connected with quantity, we use as much as and as many as: …\nMuch, many and a lot of, lots of: typical errorsWe use much with uncountable nouns and many with countable nouns: …\nMuch, a lot, lots, a good deal: adverbsWe use much, a lot, lots and a good deal as adverbs to refer to frequency, quantity and degree. …\nMuchWe use much in questions and negative clauses to talk about degrees of something. We put it in end position: …\nA lot, a good deal and a great dealWe can use a lot, a good deal and a great deal as adverbs of frequency, quantity or degree: …\nIdiom\nthere's a lot of it about\na group of people: You're an ignorant lot! Are you lot coming to lunch? My lot (= children and family generally) won't eat spinach.\nSMART Vocabulary: related words and phrases\nGroups of people\nalliance\nan\nanti-gang\nassemblage\nbaby boomer\nfirst people\nflashmob\nflock\nfocus group\nfoursome\nline (someone) up\nmafia\nmob\nposse\npublic\nquaternity\nrabble\nretinue\nscratch\nsyndicate\nSee more results »\nlot noun\n(LARGE AMOUNT)\na lot\nAdd to word list\nAdd to word list\nA lot can mean much or often: You look a lot like your sister. We eat out a lot. a lot of (also lots of)\nA lot of or lots of means a large amount or number of something: I saved a lot of money with those coupons. They want to have lots of children.\nlot noun\n(LAND)\n[ C ] an area of land: They purchased a lot last summer and built a house on it the following year.\nAdd to word list\nAdd to word list\nCOMMERCE in an auction (= a sale of goods or property to the person who offers the most money), an object or set of objects that are being sold: Lot 57 is a mahogany work desk. Do I have a bid?\nPRODUCTION an amount or set of goods that is produced at the same time or sold together: The manufacturer sells to a wholesaler or agent, who sells in smaller lots to other customers. Ingredients should be clearly listed on the manufacturer's label with the lot number and the date of expiration.\nPROPERTY an area of land used for a particular purpose: a building/vacant lot We have residential and commercial building lots and acreage for sale. a parking lot\nSTOCK MARKET an amount of shares that is sold together: The Stock Exchange asked companies to reduce the smallest traded lot of shares to 100 from 1,000. See also\njob lot"}