{"id":215694,"name":"lottery","type":"noun","us_sound":"ˈlɑː.t̬ɚ.i","us_link":"../audio/l/lottery.mp3","uk_sound":"ˈlɒt.ər.i","uk_link":"../audio/l/ukloose024.mp3","content":"Add to word list\nAdd to word list\nB1 [ C ] a game, often organized by the state or a charity in order to make money, in which tickets with numbers are sold to people who then have a chance of winning a prize if their number is chosen\n[ S ] disapproving something that depends only on luck and is not fair: Education in England is something of a lottery.\nMore examplesFewer examplesPaul had a dream that he won the lottery.Did Chris tell you about his winning some money in the lottery?The idea behind the national lottery is to raise money for good causes.Winning the lottery has set them up for life.Statistically speaking, you're more likely to die from a bee sting than win the lottery.\nSMART Vocabulary: related words and phrases\nGambling & bookmaking\na/the bookmaker's phrase\nante\nanti-gambling\nbank\nbet\nblackjack\ncasino\nchip\nco-favourite\ncockfight\ngaming table\npunt\nraffle\nslot machine\nsmart money\nspread betting\nstake something on something\nstakeholder\ntoss up\ntrifecta\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChance and randomness\nAdd to word list\nAdd to word list\na system of selling numbered tickets and giving prizes to those people whose numbers are chosen by chance: Even if she won the lottery, Paige says she’d still keep her job.\nAdd to word list\nAdd to word list\n[ C ] a game of chance, often organized by the government to raise money, in which people win cash if they have bought a winning ticket: The council applied for a £40m grant from the national lottery to redevelop local facilities.lottery ticket/jackpot/winner Last night's national lottery jackpot of €2.8m was won by two lucky ticket-holders.lottery funding/money/revenue The state is expected to have $15.6 billion in general fund and lottery revenues for the two-year budget period.\n[ S ] something that is affected by luck rather than being controlled by a fair process: With interest rates rising, some people feel that the property market is a bit of a lottery at the moment."}