{"id":215827,"name":"love","type":"verb","us_sound":"lʌv","us_link":"../audio/l/love.mp3","uk_sound":"lʌv","uk_link":"../audio/l/ukloudn014.mp3","content":"love verb [T]\n(LIKE SOMEONE)\nAdd to word list\nAdd to word list\nA1 to like another adult very much and be romantically and sexually attracted to them, or to have strong feelings of liking a friend or person in your family: I love you. Last night he told me he loved me. I've only ever loved one man. I'm sure he loves his kids.\nThesaurus: synonyms, antonyms, and examples\nto love someoneloveI love you.adoreHe absolutely adores his wife.dote onShe dotes on her grandkids.be crazy aboutI'm just crazy about our new daughter-in-law - she's perfect for our son. be mad aboutUK He's absolutely mad about his new boyfriend.be in loveI think I'm in love with her.\nSee more results »\nMore examplesFewer examplesYou may love someone without necessarily wanting to marry them.He said he would always love her .I think Phil has to face the fact that she no longer loves him.She faces the dilemma of disobeying her father or losing the man she loves.When I tried to tell her that I loved her it just came out all wrong.\nSMART Vocabulary: related words and phrases\nLoving and in love\nabsence\nabsence makes the heart grow fonder idiom\nadore\nadoring\nadoringly\nadorkable\ndotty\nendearment\never-loving\nfall for someone\nfall in love idiom\nlurve\nmadly\nmoon\nmoon over someone/something\npash\nshine\nsteal\ntreasure\nworship\nSee more results »\nlove verb [T]\n(LIKE SOMETHING)\nA1 to like something very much: She loves animals. I absolutely love chocolate. He really loves his job. [ + -ing verb ] I love skiing. Love it or hate it, reality TV is here to stay.\nThesaurus: synonyms, antonyms, and examples\nto get pleasure from somethingenjoyEnjoy your meal!enjoy yourselfHe's enjoying himself at his job.likeI like hiking a lot.loveAfter working in the garden, I love a good soak in the tub.relishJonathan always relishes a challenge.lap upHe lapped up all the attention they gave him.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto like someone or somethinglikeDo you like pasta?loveI love seafood.adoreI adore a good book.think the world of someoneAnnabel's like a daughter to him - he thinks the world of her.have a soft spot for someoneI've always had a soft spot for Rebecca ever since she was tiny.\nSee more results »\nwould love\nA2 used, often in requests, to say that you would very much like something: I'd love a cup of coffee if you're making one.\nSee more\nMore examplesFewer examplesWe would dearly love to sell our flat and move to the country.The kids love feeding bread to the ducks.I love Fridays because I leave work early.I've never been keen on classical music, but I love jazz.I'd love to go to Australia. I only wish I could afford to.\nSMART Vocabulary: related words and phrases\nLiking\nadorkable\naffection\nappreciate\napprove of someone\nattached\nbe a glutton for something idiom\ndig\ngravitate towards/to something/someone\ngrow on someone\nhatefully\nhave a lot of time for someone idiom\nhave a thing about something/someone idiom\nprotective\nshook\nsmile\nsmile on something/someone\nsmitten\ntaste\ntight\nwarm\nSee more results »\nGrammar\nHate, like, love and preferWe can use hate, like, love and prefer with an -ing form or with a to-infinitive: …\nIdioms\nlove someone to bits\nlove me, love my dog\nlove noun\n(LIKING SOMEONE)\nB1 [ U ] the feeling of liking another adult very much and being romantically and sexually attracted to them, or strong feelings of liking a friend or person in your family: \"I've been seeing him over a year now.\" \"Is it love?\" Children need to be shown lots of love. \"I'm seeing Laura next week.\" \"Oh, please give her my love\" (= tell her I am thinking about her with affection). Maggie asked me to send her love to you and the kids (= tell you that she is thinking about you with affection).informal How's your love life (= your romantic and/or sexual relationships) these days?\nThesaurus: synonyms, antonyms, and examples\nloveloveI have a great love and respect for her.adorationShe described her complete adoration of her brother.romanceTheir relationship was nothing but romance and bliss.passionThe passion had gone out of their relationship.infatuationNo one expected their infatuation with each other to last.crushHe had a crush on his French tutor.\nSee more results »\nB1 [ C ] a person that you love and feel attracted to: He was the love of my life. She was my first love.\n[ as form of address ] UK informal used as a friendly form of address: You look tired, love. That'll be four pounds exactly, love.\nA2 [ U ] informal (also love from); (all my love) used before your name at the end of letters, cards, etc. to friends or family: See you at Christmas. Love, Kate. be in love\nB1 to love someone in a romantic and sexual way: I'm in love for the first time and it's wonderful.\nSee more fall in love (with someone)\nB1 to start to love someone romantically and sexually: I was 20 when I first fell in love.\nSee more\nMore examplesFewer examplesOver the years, her love for him deepened.He wrote her a poem as an expression of his love.I give you this ring as a pledge of my everlasting love for you.Her latest novel is a searing tale of love and hate.She was torn between loyalty to her father and love for her husband .\nSMART Vocabulary: related words and phrases\nLoving and in love\nabsence\nabsence makes the heart grow fonder idiom\nadore\nadoring\nadoringly\nadorkable\ndotty\nendearment\never-loving\nfall for someone\nfall in love idiom\nlurve\nmadly\nmoon\nmoon over someone/something\npash\nshine\nsteal\ntreasure\nworship\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWritten greetings\nlove noun\n(LIKING SOMETHING)\nB2 [ U ] strong liking for: I don't share my boyfriend's love of cooking.\nB2 [ C ] something that you like very much: Music is one of her greatest loves.\nMore examplesFewer examplesShe never hid her love of diamonds.Food is my greatest love.Opera was my first love.I have a love of expensive clothes.His love of gambling drove us apart.\nSMART Vocabulary: related words and phrases\nLiking\nadorkable\naffection\nappreciate\napprove of someone\nattached\nbe a glutton for something idiom\ndig\ngravitate towards/to something/someone\ngrow on someone\nhatefully\nhave a lot of time for someone idiom\nhave a thing about something/someone idiom\nprotective\nshook\nsmile\nsmile on something/someone\nsmitten\ntaste\ntight\nwarm\nSee more results »\nlove noun\n(TENNIS)\n[ U ] (in tennis) the state of having no points: The score now stands at 40–love.\nSMART Vocabulary: related words and phrases\nTennis & racket sports\nadvantage\nbackhand\nball boy\nball girl\nbaseline\nbird\nbreak\ncode violation\ncourt\ndouble fault\ngroundstroke\nlob\noverhead\nserve\nsquash\nsweet spot\ntennis\nunreturnable\nunseeded\nvolley\nSee more results »\nIdioms\nbe no/little love lost between\nfor love nor money\nmake love\nmake love to someone\nlove verb\n(LIKE SOMEONE)\nAdd to word list\nAdd to word list\n[ T ] to have a strong affection for someone, which can be combined with a strong romantic attraction: Susan loved her brother dearly. \"I love you and want to marry you, Emily,\" he said.\nlove verb\n(LIKE SOMETHING)\nto like something very much: [ T ] My kids love cartoons. [ + to infinitive ] We’d love to own our own home.\nlove noun\n(LIKING SOMEONE)\nfall in love\nIf you fall in love you begin to love someone: She’s fallen in love and made plans to marry.\n[ U ] You can write love/love from/all my love/lots of love before your name at the end of letters to family and friends. in love\nA person who is in love is experiencing a romantic attraction for another person: I think he's in love with Anna."}