{"id":215894,"name":"low","type":"adjective","us_sound":"loʊ","us_link":"../audio/l/low.mp3","uk_sound":"ləʊ","uk_link":"../audio/l/uklitig030.mp3","content":"low adjective\n(NOT HIGH)\nAdd to word list\nAdd to word list\nB1 not measuring much from the base to the top: a low fence\nThesaurus: synonyms, antonyms, and examples\nhaving a small distance from the bottom to the toplowThe garden was surrounded by a low hedge.shortHe's much shorter than I thought.shallowStay in the shallow end of the pool, please.low-lyingLow-lying areas are prone to flooding.squatI wish they'd tear down that squat block of flats.\nSee more results »\nB1 close to the ground or the bottom of something: a low ceiling When we went skiing, I only went on the lower slopes.\nMore examplesFewer examplesHigh vehicles must take an alternative route because of low clearance under the bridge.The boundary of the car park is delineated by a low brick wall.That new shelf in the bathroom is too low - I just hit my head on it.We could see a low range of hills in the distance.\nSMART Vocabulary: related words and phrases\nLow, short and shallow\nbrief\nfubsy\nknee-high\nlevel\nlong\nlongish\nlow slung\nmini\nshallow\nshort\nshort-range\nshorten\nshortness\nshorty\nshrimp\nsquatty\nstumpy\nstunted\ntitch\nundersized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParts of buildings: floors & parts of floors\nlow adjective\n(LEVEL)\nA2 below the usual level: Temperatures are very low for the time of year. The big supermarket offers the lowest prices in town. These people are living on relatively low incomes. There is a tremendous need for more low-cost housing. a low-fat diet low-alcohol beer Vegetables are generally low in (= do not contain many) calories.\nThesaurus: synonyms, antonyms, and examples\ncosting less money than expectedcheapThe meal was cheaper than I expected.affordableThere's very little affordable housing around here.inexpensiveThey sell inexpensive children's clothes.reasonableI thought the food was very reasonable.dirt cheapMost of the books they sell are dirt cheap.\nSee more results »\nA2 producing only a small amount of sound, heat, or light: They spoke in low voices so I would not hear what they were saying. Turn the oven to a low heat. Soft music was playing and the lights were low.\nThesaurus: synonyms, antonyms, and examples\nnot strong or forcefulgentleA gentle breeze stirred the leaves.mildThe children just have a mild cold.softHer voice was so soft, I could barely hear her.lightThe temperature in London is 24 degrees, with light winds out of the west.lowKeep your voices low while the baby's sleeping.\nSee more results »\nB2 of bad quality, especially when referring to something that is not as good as it should be: low standards I have a very low opinion of him. She has very low self-esteem.\nMore examplesFewer examplesNo-one can be expected to exist on such a low salary.Cover the fish with aluminium foil and cook over a low heat.I have a rather low opinion of my sister's boyfriend .We thought they were asking a very low price.The success rate for this operation is very low.\nSMART Vocabulary: related words and phrases\nUnder & below\nbelow\nbeneath\nlower\nneath\nnether\nsub\nsubjacent\nultra-low\nunder\nunderfoot\nunderlying\nunderneath\nYou can also find related words, phrases, and synonyms in the topics:\nWeakness and vulnerability\nNot of good quality\nlow adjective\n(NOT IMPORTANT)\nC1 not considered important because of being at or near the bottom of a range of things, especially jobs or social positions: low status jobs a low priority task\nSMART Vocabulary: related words and phrases\nOrganizations - position & status\nambassador\nanti-elite\nanti-elitist\napparatchik\nback seat\nbrother\ncounterpart\nfish\ngrassroots\nhigh-ranking\nopposite number\nrank\nseat\nspokeswoman\nsuper-elite\nsuperboard\nsuperiority\nsuperordinate\nthane\ntitularly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOf little or less importance\nlow adjective\n(NOT HONEST)\nnot honest or fair: How low can you get? That was a pretty low trick to play.\nSMART Vocabulary: related words and phrases\nDishonest\nartificiality\nbad faith\nbe rotten to the core idiom\nbent\ncowboy\ndubiously\nfalse\nfinagle\nfishy\nfly-by-night\nmalfeasance\nmendacious\nmendaciously\nmisleading\nmisleadingly\nuncandid\nunder false pretences phrase\nunderhand\nunreliability\nunreliable\nSee more results »\nlow adjective\n(SOUND)\nB2 (of a sound or voice) near or at the bottom of the range of sounds: He has a very low voice. Those low notes are played by the double bass.\nThesaurus: synonyms, antonyms, and examples\nnear the bottom of a range of soundslowThose notes are too low for me.low-pitchedThe low-pitched rumble of the train shook the house.gutturalArabic contains guttural sounds that are difficult for non-Arabic speakers to say properly.throatyShe gave a loud, throaty laugh.\nSee more results »\nSMART Vocabulary: related words and phrases\nDescribing qualities of sound\naudibly\nboomy\nchocolatey\nchuff\nclomp\ncrackling\near-splitting\nlistenable\nmellifluously\nmelodically\nmelodious\nmelodiously\nmetallically\nraucous\nstaccato\nsymphonically\ntextured\nthready\ntinnily\ntunefully\nSee more results »\nlow adjective\n(SAD)\nC1 unhappy: Illness of any sort can leave you feeling low. He seemed in low spirits.\nThesaurus: synonyms, antonyms, and examples\nfeeling sadsadShe's been sad ever since her cat died.unhappyShe'd had a very unhappy childhood.miserableI just woke up feeling miserable.upsetThey'd had an argument and he was still upset about it.broken-heartedShe was broken-hearted when her partner left.\nSee more results »\nSMART Vocabulary: related words and phrases\nFeeling sad and unhappy\na dog's life idiom\na long face idiom\nabjection\nangsty\nbe cut up idiom\nbe down in the mouth idiom\nbe in a funk idiom\ndistraught\ndistressed\ndog\ndoleful\nlovelorn\nlovesick\nlow-spirited\nlugubrious\nwistful\nwistfully\nwoe\nwoe is me idiom\nwoebegone\nSee more results »\nlow adjective\n(BASKETBALL)\nin basketball, relating to the playing area near to the basket (= the post with a ring and a net at the top where players throw the ball to score): They wanted someone who would be a threat in the low post (= the area near the basket).\nMore examplesFewer examplesWith his size and strength, he's a difficult matchup in the low post.He was forced to work on his low post game.She's equally comfortable at point guard, on the wing, or on the low block.\nSMART Vocabulary: related words and phrases\nBasketball, netball & volleyball\nairball\nbackboard\nballer\nbasketball\nbeach volleyball\nbrick\ncatch and face idiom\ncharge\ncoast\ndunk\nelbow\nfoul\nfree throw\ninbounds pass\nkorfball\nlay someone up\nlay something in\nnetball\noutrebound\nsquare\nSee more results »\nGrammar\nLow or short?We use low for things which are not high, or which are close to the ground or to the bottom of something: …\nIdiom\nthe low man on the totem pole\nlow adverb\n(NOT HIGH)\nB1 close to the ground or the bottom of something: The planes fly low across enemy territory.\nSMART Vocabulary: related words and phrases\nLow, short and shallow\nbrief\nfubsy\nknee-high\nlevel\nlong\nlongish\nlow slung\nmini\nshallow\nshort\nshort-range\nshorten\nshortness\nshorty\nshrimp\nsquatty\nstumpy\nstunted\ntitch\nundersized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParts of buildings: floors & parts of floors\nlow adverb\n(LEVEL)\nB1 at or to a low level: low-paid workers Turn the oven on low. be/get/run low (on something)\nto have nearly finished a supply of something: We're running low on milk - could you buy some more?\nSee more\nSMART Vocabulary: related words and phrases\nLow, short and shallow\nbrief\nfubsy\nknee-high\nlevel\nlong\nlongish\nlow slung\nmini\nshallow\nshort\nshort-range\nshorten\nshortness\nshorty\nshrimp\nsquatty\nstumpy\nstunted\ntitch\nundersized\nSee more results »\nGrammar\nLow or short?We use low for things which are not high, or which are close to the ground or to the bottom of something: …\nto make the deep, long sound of a cow\nSMART Vocabulary: related words and phrases\nAnimal (non-human) sounds\nbarky\nbray\nbuzzy\ncaterwauling\nchatter\ncheep\nchirp\nclip-clop\ncockcrow\ncoo\nhonk\nmew\nmiaow\nmoo\npurr\nroar\nsqueal\ntu-whit tu-whoo\nwarble\nwhinny\nSee more results »\na bad time in someone's life: the highs and lows of an acting career a new/record/all-time low\nthe lowest level: The dollar has hit an all-time low against the Japanese yen.\nSee more\nSMART Vocabulary: related words and phrases\nDifficult situations and unpleasant experiences\na (heavy) cross to bear idiom\na rough ride idiom\nabyss\nadversity\nat your worst idiom\nAugean\nbad hair day\ncrunch\nemergence\ngenie\nhardness\nhave a bumpy ride idiom\nhave someone over a barrel idiom\nhell\nrabbit hole\nreversal\nrigour\nrollercoaster\nthe Augean Stables idiom\nvortex\nSee more results »\nIdiom\nthe lowest of the low\nlow adjective, adverb [-er/-est only]\n(NOT HIGH)\nAdd to word list\nAdd to word list\nnot high or tall; close to the ground, or near the bottom of something: a low fence/ceiling Until I’m a better skier, I’ll stay on the lower slopes. That plane is flying awfully low.\nlow adjective, adverb [-er/-est only]\n(SMALLER THAN USUAL)\nsmaller than the usual or average size, number, value, or amount: They have the lowest food prices in town. Temperatures will dip lower near the end of the week. Believe it or not, this dessert is low in calories.\nIf a supply of something becomes low, you have very little of it left: We’re running low on gas.\nLow can also mean producing only a small amount of sound, heat, or light: They spoke in low voices. She turned the heat down low.\nLow can also mean of bad quality: My test results were disappointingly low.\nlow adjective\n(NOT IMPORTANT)\n[ -er/-est only ] not important, or not of high rank: low social status\nlow adjective\n(SOUND)\n(of a sound or voice) near or at the bottom of the range of sounds: a low voice/note low-pitched\nIf a sound is low-pitched, it is at the bottom of the range of sounds: He gave a low-pitched whistle and his dog came running.\nlow adjective\n(NOT KIND)\n(of behavior or speech) mean or unfair: What a cruel comment – how low can you get?\nlow adjective\n(UNHAPPY)\n[ -er/-est only ] unhappy or discouraged: She’s feeling pretty low because she failed her driver’s test.\nlow noun [C]\n(SMALLER THAN USUAL)\na smaller than usual amount or level, or the smallest amount or level: Enrollment at the college reached new lows this fall. The temperature in Boston reached a record low last night.\nAdd to word list\nAdd to word list\nbelow the usual or expected level or amount: The offer was rejected on the grounds that it was too low.low inflation/interest rates/taxes The housing boom coincided with a flat economy, low inflation, and a falling stock market. Interest rates fell to their lowest level since records began in January 1975.low prices/costs/fees Higher profits and lower prices lift demand and keep inflation in check. The manufacturing industry has been hit by low productivity, falling sales and mounting losses. Developers are focusing on building more affordable housing targeted at families on low incomes. These dedicated staff put up with long hours and low pay, because they love the job.low unemployment/crime Unemployment in the region is lower than the national average.\nnot very good or acceptable: low quality/standards Attempts at voluntary regulation had failed because too many companies with low standards had not joined the system.\nnot important because of being at the bottom of a range or group of things: Transport was a low priority for the new administration. More flexible working conditions are changing the traditionally low status of part-time jobs.\nbe/get/run low (on sth)\nto have very little of something left: Gas stations were running low on supplies due to the blockade. This symbol means the printer ink is getting low. Compare\nhigh adjective\nat a level which is less than usual or expected: Working from home and communicating online helped them keep costs low while they were setting up their new business.\nat or to a position of less importance: Ethics training ranks low on the manager's priority list.\nthe lowest level that something has reached since it has been measured or during a particular period: hit/fall to a low The company's stock fell to a six-month low.a new/record/all-time low The dollar hit a record low against the euro and was down sharply against the Japanese yen. The price of oil has nearly doubled from last year's lows. Compare\nhigh noun See also\nhistoric low"}