{"id":215918,"name":"lowercase","type":"noun","us_sound":"ˌloʊ.ɚˈkeɪs","us_link":"../audio/l/cdo1121uslowe2673.mp3","uk_sound":"ˌləʊ.əˈkeɪs","uk_link":"../audio/l/cdo1121uklowe2365.mp3","content":"Add to word list\nAdd to word list\nIf letters are in lowercase, they are written as a, b, c, etc. not A, B, C, etc.: Everything must be in lowercase — no capitals! I had to change the tags used in the news and sidebar pages from uppercase to lowercase. In this context, consider upper- and lower-case to be the same. Compare\nuppercase noun mainly US\nMore examplesFewer examplesThe ear hears the name and doesn’t distinguish between uppercase and lowercase.While capital letters appear as one big block, mixing upper and lowercase gives words distinctive patterns.Suddenly I'm realizing that my name is in lowercase.\nSMART Vocabulary: related words and phrases\nPunctuation\nabbreviated\naccent\nacute\napostrophe\nat sign\nblock capitals\nbracket\ncaron\ncolon\ncomma\ndiacritical\ndouble prime\npunctuation mark\nsemicolon\nsmall cap\nsmall capitals\nsolidus\ntilde\nunbracketed\nuncapitalized\nSee more results »\n(of letters) written as a, b, c, etc. not A, B, C, etc.: She has a chart of the alphabet with capitalized and lowercase letters. A single binary digit is called a bit (abbreviated with a lowercase b). The Hostname must be all lower-case letters. Compare\nuppercase adjective\nMore examplesFewer examplesIt is better to use a combination of uppercase and lowercase letters and include numbers in your password.Some fonts have inherent small caps, i.e. they use smaller capital letters in place of the lowercase characters.What’s up with the lowercase “g” in the “we’re thanking our god” quote?\nSMART Vocabulary: related words and phrases\nLettering & alphabets\nABC\nall caps\nalphabet\nalphabetically\nascender\nBraillist\ncamel case\ncopperplate\ndemotic\nhieroglyph\nideogram\ninitial\nLatinized\nmulti-character\nnon-phonetic\npaleographical\npenmanship\nroman\nstenography\nupper case\nSee more results »\nAdd to word list\nAdd to word list\nwriting the small form of letters when they are printed or written lowercase adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈloʊ·ərˈkeɪs/"}