{"id":215916,"name":"lower","type":"verb","us_sound":"ˈloʊ.ɚ","us_link":"../audio/l/eus72843.mp3","uk_sound":"ˈləʊ.ər","uk_link":"../audio/l/ukloudn026.mp3","content":"lower verb [T]\n(MOVE)\nAdd to word list\nAdd to word list\nB2 to move something into a low position: They lowered the coffin into the grave. Heavily pregnant by now, she lowered herself carefully into the chair. He lowered his eyes (= looked down) in embarrassment when he saw me.\nMore examplesFewer examplesWe lowered the floors to give more space in the rooms.He lowered the flag and the cars were off.They lowered the old man into a chair.We lowered the wall to let in more light.She lowered her hand so that I could see what she was holding.\nSMART Vocabulary: related words and phrases\nRaising and lowering\ndepress\nelevate\nelevated\nerect\nhike\nhike something up\nhoick\nhoist\njack\njack something up\nprize\npry\nput something up\nraise\nre-erect\nride\nride up\nrun\nrun something up\nyo-yo\nSee more results »\nlower verb [T]\n(REDUCE)\nB2 to reduce something: Interest rates have been lowered again. Boil for five minutes, then lower the heat and simmer for half an hour. Please lower your voice (= speak more quietly).\nThesaurus: synonyms, antonyms, and examples\nto become smaller or lessdecreaseThe tests show that the tumour has decreased in size since we started treatment. lessenA healthy diet lessens your risk for cardiovascular disease.lowerThey've just lowered the age at which you can join.reduceThey've just reduced the price.bring downThey are bringing down their prices.dropStock prices dropped today after the company's announcement.\nSee more results »\nto make something worse than it was before: a lowering of standardshumorous Dale lowered the tone of the evening (= made it less socially acceptable) by telling a dirty joke.\nMore examplesFewer examplesHe had hoped to become a doctor, but he had to lower his sights after his disappointing exam results.You should lower your speed as you approach a junction.The doctor told me to sponge Erik down with cold water in order to lower his temperature.The government has done much to lower unemployment.We are trying to lower absence due to ill health.\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nabridgment\nattenuate\nattenuated\nattenuating\nattenuation\nboil\ndamp\nfall off\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nroll back something\nrollback\nrun someone/something down\nrundown\nsag\nshave\ntelescope\ntumble\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDeteriorating and making worse\nlower verb [T]\n(BEHAVE BADLY)\nlower yourself\nto behave in a way that makes people lose respect for you: [ + to infinitive ] I wouldn't lower myself to respond to his insults if I were you.\nSMART Vocabulary: related words and phrases\nBad and wrong behaviour\nact out\nangel\nASB\nastray\nat your worst idiom\nbe up to no good idiom\nget up to something\ngo off the rails idiom\ngo round\ngross misconduct\nhellion\nprofligacy\nprofligate\nraise hell idiom\nrakish\nrakishly\nunprofessionally\nunworthily\nunworthy\nvillainy\nSee more results »\npositioned below one or more similar things, or of the bottom part of something: the lower deck of a ship Her lower lip trembled as if she were about to cry. I've got a pain in my lower (= the bottom part of my) back. Opposite\nupper\nSMART Vocabulary: related words and phrases\nUnder & below\nbelow\nbeneath\nlow\nneath\nnether\nsub\nsubjacent\nultra-low\nunder\nunderfoot\nunderlying\nunderneath\nlower verb\n(SMALLER THAN USUAL)\nAdd to word list\nAdd to word list\n[ I/T ] to reduce something, or to become less: [ T ] They lowered the asking price of their house. [ T ] Please lower your voice (= speak more softly).\nlower verb\n(NOT HIGH)\n[ T ] to let or bring someone or something down, or make something less high: She lowered the blinds to block out the afternoon sun.\nAdd to word list\nAdd to word list\nto reduce the level, price, etc. of something: lower costs/rates/prices There was growing pressure on banks to lower interest rates and ease the availability of credit. Landmark legislation requires California to lower greenhouse gas emissions by 25% by 2020. He accused universities of lowering standards in order to raise income. Compare\nraise verb"}