{"id":215026,"name":"loyal","type":"adjective","us_sound":"ˈlɔɪ.əl","us_link":"../audio/l/loyal.mp3","uk_sound":"ˈlɔɪ.əl","uk_link":"../audio/l/ukloyal001.mp3","content":"Add to word list\nAdd to word list\nB2 firm and not changing in your friendship with or support for a person or an organization, or in your belief in your principles: Jack has been a loyal worker in this company for almost 50 years. When all her other friends deserted her, Steve remained loyal. She's very loyal to her friends. Synonyms\ncommitted\ndedicated\ndevoted\nfaithful (LOYAL)\nfirm (CERTAIN)\nstalwart (LOYAL)\nstaunch\nsteadfast approving\nsteady\ntrue (SINCERE)\nunfaltering\nunshakeable mainlyUK\nunswerving\nunwaveringOpposite\ndisloyalCompare\nloyalist\npatriotic\nMore examplesFewer examplesAfter years of loyal service, his boss gave him the shaft by firing him just before he would have qualified for a pension.My family are staunchly loyal.The shop attracted a loyal following among the well-heeled.I have always been a loyal supporter of Arsenal.All my friends remained loyal to me.\nSMART Vocabulary: related words and phrases\nLoyal, faithful & dependable\na safe pair of hands idiom\nallegiance\naudaciously\nbe as good as your word idiom\nbe here for someone idiom\nbe there for someone idiom\nfaithful\nfaithfully\nfaithfulness\nfealty\nfidelity\nfiduciary\nreliable\nreliably\nself\nstalwart\nstalwartly\nultra-reliable\nundependable\nunto thine own self be true idiom\nSee more results »\nRelated word\nloyally\nAdd to word list\nAdd to word list\nalways giving help and encouragement: People close to Woodruff are fiercely loyal and quick to shower her with superlatives. loyalty noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/ˈlɔɪ·əl·ti/\n[ C ] My loyalties to my family come before my loyalties to my work.\nAdd to word list\nAdd to word list\nCOMMERCE, MARKETING a loyal customer always buys the same product, uses the same store, etc.: Supermarkets should reward their most loyal customers.loyal to sb/sth Our customers remain loyal to the brand.\nHR a loyal employee works for the same company for many years: loyal to sb/sth Training programmes encourage workers to remain loyal to their employers."}