{"id":216131,"name":"luck","type":"noun","us_sound":"lʌk","us_link":"../audio/l/luck.mp3","uk_sound":"lʌk","uk_link":"../audio/l/ukloyal030.mp3","content":"Add to word list\nAdd to word list\nA2 the force that causes things, especially good things, to happen to you by chance and not as a result of your own efforts or abilities: It was just luck that I asked for a job at the right time. Then I met this gorgeous woman and I couldn't believe my luck. She wears a charm that she thinks brings her good luck. He seems to have had a lot of bad luck in his life. So your interview's tomorrow? Good luck! The best of luck in/with your exams!\nB2 success: Have you had any luck with booking your flight? He tried to get into teacher training college but with no luck.\nMore examplesFewer examplesWith a bit of luck, we should be back in time for dinner.As she waited to go into the exam, he squeezed her hand and wished her good luck.He hasn't been having much luck recently.I'm sorry to hear that you failed your driving test. Better luck next time, eh!Are the company's current difficulties a result of bad luck or bad judgment?\nSMART Vocabulary: related words and phrases\nChance and randomness\naccident\naccident of birth\naleatory\narbitrarily\narbitrariness\ncrapshoot\neven-money\nfluke\nfluky\nfortuitous\nluck into something\nmore by accident than design idiom\nmore by luck than judgment idiom\nnon-purposive\nnoncausal\nserendipitous\nserendipitously\nsortition\nstumble into something\nunsystematic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSuccess and achievements\nGrammar\nLuck and luckyWe use the noun luck and the adjective lucky to talk about good things happening by chance, and not because of our own efforts: …\nIdioms\nas luck would have it\nbad/hard/tough luck!\nbe bad luck on someone\nbe down on your luck\nbe in/out of luck\nbe the luck of the draw\nfor (good) luck\nfor luck\nmore by luck than judgment\nno such luck\nMore idioms\nwith any luck\nyour luck's in!"}