{"id":216135,"name":"lucky","type":"adjective","us_sound":"ˈlʌk.i","us_link":"../audio/l/lucky.mp3","uk_sound":"ˈlʌk.i","uk_link":"../audio/l/uklucki003.mp3","content":"Add to word list\nAdd to word list\nA2 having good things happen to you by chance: \"I'm going to Japan.\" \"Lucky you!\" The lucky winner will be able to choose from three different holidays. [ + to infinitive ] They're lucky to have such a nice office to work in. He's lucky that he wasn't fired. It sounds as if you had a lucky escape (= by good chance you were able to avoid something dangerous or unpleasant). We'll be lucky if we get there by midnight at this rate (= we might get there by midnight or it might be later).\nThesaurus: synonyms, antonyms, and examples\nhaving good things happen by chanceluckyTwo lucky winners will be treated to an all-expenses paid trip to the Bahamas!fortunateIt was fortunate that he wasn't injured in the accident.it's a good thingIt's a good thing we bought travel insurance for our trip since it was cancelled.it's a good jobUK It's a good job they didn't go camping this weekend - the weather's been awful.luck outUS The Giants really lucked out in last night's game.\nSee more results »\nB1 bringing good luck: a lucky charm Six is my lucky number.\nMore examplesFewer examplesThe front passengers were lucky to survive the accident.Some lucky person will win more than $1 000 000 in the competition.The youth of today don't know how lucky they are.We were very lucky with the weather for our village barbecue.My horoscope said I was going to be lucky in love this month.\nSMART Vocabulary: related words and phrases\nGood luck and bad luck\nalign\nbad/hard/tough luck! idiom\nbe bad luck on someone idiom\nbe down on your luck idiom\nbe in/out of luck idiom\nblessing\nfortune cookie\nfortune smiles on someone idiom\nget the short end of the stick idiom\ngodsend\ngrace\nmercifully\nmercy\nmiracle\nmisadventure\nmischance\nstreak\nvoodoo\nwith any luck idiom\nyour luck's in! idiom\nSee more results »\nGrammar\nLuck and luckyWe use the noun luck and the adjective lucky to talk about good things happening by chance, and not because of our own efforts: …\nIdioms\nget lucky\nyou should be so lucky!"}