{"id":216409,"name":"luminosity","type":"noun","us_sound":"ˌluː.məˈnɑː.sə.t̬i","us_link":"../audio/l/uslumin001.mp3","uk_sound":"ˌluː.mɪˈnɒs.ə.tɪ","uk_link":"../audio/l/uklucki030.mp3","content":"Add to word list\nAdd to word list\n[ U or S ] the state of producing or reflecting bright light; the state of appearing to shine: The photographer achieved the luminosity in the image through careful manipulation in the darkroom. The light was crystalline, giving everything a shimmering luminosity.\nThesaurus: synonyms, antonyms, and examples\nbrightness that allows you to seelightLight streamed in through the window.brightnessThe brightness of the sun hurt his eyes.illuminationFor professional-quality photos, it is best to use several sources of illumination. sunThis plant needs to be in full sun.sunlightSunlight streamed in through the windows.daylightHow much daylight does this room get?\nSee more results »\n[ U or C ]\n&#160; environment , physics\n&#160; specialized the brightness of a star, comet, etc.: The object of the project is to investigate the mass and luminosity of nearby stars. The stars have high surface temperatures (50,000 kelvins and up) and luminosities (100,000 suns and greater).\n[ U ]\n&#160; physics\n&#160; specialized the measurement of the rate at which an object produces radiation: The X-ray luminosity from a galaxy cluster can be used to find its centre very accurately. See\nluminous\nMore examplesFewer examplesThe amount of light entering the building is controlled, allowing maximum brightness and luminosity.The sheer peach lotion gives skin a warm kiss of luminosity , as though you'd just had a facial. Cool and red, AU Mic shines with about a tenth the Sun's luminosity and has about half its mass.The system independently detects brightness and luminosity for the best quality photo.\nSMART Vocabulary: related words and phrases\nGiving out light\nafire\nalbedo\nbeam\nbeamy\nbioluminescence\nburnished\nflicker\ngleam\nglimmer\nglitter\nilluminate\nnoctilucent\nnon-glare\nnon-luminous\nout-glitter\npearlescence\nreflected ray\nshine\nspotlight\nwink\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe qualities of light\nAstronomy\nPhysics: radiation & radioactivity\nAdd to word list\nAdd to word list\nearth science the total amount of energy produced by a star in one second"}