{"id":216474,"name":"lunch","type":"noun","us_sound":"lʌntʃ","us_link":"../audio/l/lunch.mp3","uk_sound":"lʌntʃ","uk_link":"../audio/l/uklumin012.mp3","content":"Add to word list\nAdd to word list\nA1 a meal that is eaten in the middle of the day: What's for lunch?UK We had a pub lunch. I'm sorry, Joanna isn't here at the moment, she's (gone) out to/gone to lunch. We must do lunch sometime (= have lunch together). Compare\ndinner\nMore examplesFewer examplesWhy don't we have lunch together on Friday?He managed to eat a big lunch despite having eaten an enormous breakfast.Shall I heat up some soup for lunch?We enjoyed a leisurely picnic lunch on the lawn.We stopped at a roadside café for lunch.\nSMART Vocabulary: related words and phrases\nMeals & parts of meals\naccompaniment\nafternoon tea\nafters\namuse-bouche\nantipasto\nelevenses\nEnglish breakfast\nfeast\nfeeding\nfinger buffet\nplate meal\nploughman's lunch\npostprandial\npot luck\npower breakfast\ntapas\ntea\ntea party\nteatime\ntiffin\nSee more results »\nIdiom\nbe out to lunch\nto eat lunch: I'm lunching with Giles.\nSMART Vocabulary: related words and phrases\nMeals & parts of meals\naccompaniment\nafternoon tea\nafters\namuse-bouche\nantipasto\nelevenses\nEnglish breakfast\nfeast\nfeeding\nfinger buffet\nplate meal\nploughman's lunch\npostprandial\npot luck\npower breakfast\ntapas\ntea\ntea party\nteatime\ntiffin\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEating\nAdd to word list\nAdd to word list\na meal eaten in the middle of the day, or the food prepared for this meal: [ U ] We had soup and sandwiches for lunch. [ C ] I take my lunch to work. lunch verb [ I ] us\nYour browser doesn't support HTML5 audio\n/lʌntʃ/\nWe lunched on crackers and cheese.\nAdd to word list\nAdd to word list\na meal that is eaten in the middle of the day: be at/have/eat lunch I'm having lunch with Tomoko on Monday.go (out) to lunch I'm sorry, Joanna isn't here at the moment, she's gone out to lunch.take sb (out) for lunch I often take my clients out for lunch. We must do lunch sometime.over lunch I look forward to continuing our discussion over lunch. Our company provides buffet lunches for business meetings.\nthere is no such thing as a free lunch\nused for saying that you cannot get something for nothing: We all like the idea of more time off work but there is no such thing as a free lunch. See also\nbusiness lunch\npower lunch\nto eat a meal in the middle of the day: lunch with sb I'm lunching with Giles."}