{"id":216617,"name":"lurch","type":"verb","us_sound":"lɝːtʃ","us_link":"../audio/l/lurch.mp3","uk_sound":"lɜːtʃ","uk_link":"../audio/l/uklumin021.mp3","content":"Add to word list\nAdd to word list\n[ I ] to move in a way that is not regular or normal, especially making sudden movements backwards or forwards or from side to side: The train lurched forward and some of the people standing fell over.\nThesaurus: synonyms, antonyms, and examples\nto walk in a way that is not controlled or evenstumbleHe was stumbling around the house like he was drunk.lumberWe held our breath as a black bear lumbered across the hiking trail ahead of us.galumphThe children galumphed down the steps and raced outside to play.bumbleHe bumbled into her and spilled her drink down her gown.falterThe dancer faltered right before the jump and landed awkwardly.totterHe tottered carefully down the gangplank, clutching at the railing.\nSee more results »\n[ I + adv/prep ] to act or continue in a way that is uncontrolled and not regular, often with sudden changes: We seem to lurch from crisis to crisis. She just lurches from one bad relationship to another.\nSMART Vocabulary: related words and phrases\nMoving unsteadily or with difficulty\nblunder\nbumble\ndodder\ndodderer\ndoddery\nfavour\nhobble\ninflexibly\nlimp\nlollop\nlumber\nlumpily\nreel\nsqueeze\nteeter\ntoddle\ntoil\ntotter\ntottering\ntumble\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking short, sudden movements\na sudden movement or change that is not smooth or normal: The truck gave a sudden lurch as it was hit by a strong gust of wind. The party's lurch (= sudden change) to the left will lose it a lot of support. Synonym\nstagger\nSMART Vocabulary: related words and phrases\nMoving unsteadily or with difficulty\nblunder\nbumble\ndodder\ndodderer\ndoddery\nfavour\nhobble\ninflexibly\nlimp\nlollop\nlumber\nlumpily\nreel\nsqueeze\nteeter\ntoddle\ntoil\ntotter\ntottering\ntumble\nSee more results »\nAdd to word list\nAdd to word list\nto move in an irregular way, esp. making sudden movements forward or to the side: When he put the truck into gear, it lurched forward."}