{"id":216631,"name":"lure","type":"noun","us_sound":"lʊr","us_link":"../audio/l/lure.mp3","uk_sound":"lʊər","uk_link":"../audio/l/uklumin022.mp3","content":"Add to word list\nAdd to word list\nC2 [ C usually singular ] the quality or power that something or someone has that makes it, him, or her attractive: the lure of fame/power/money\n[ C ] an artificial insect or other small animal that is put on the end of a fishing line to attract fish\nandylid/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesHe could not resist the lure of great riches.I don't understand the lure of fame.She succumbed to the lure of a life of luxury.He resisted the lure of Hollywood.We were attracted by the lure of quick money.\nSMART Vocabulary: related words and phrases\nAttracting and tempting\naffinity\nallure\nalluringly\narrest\nattract\ncatnip\ncharisma\ncharm offensive\ncharm the pants off someone idiom\nchum\nglamorousness\nglamour\nhoney trap\nincentive\njump out at someone\ntantalizingly\ntempt\ntemptation\ntemptingly\ntickle someone's fancy idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHunting & fishing\nC2 to persuade someone to do something or go somewhere by offering them something exciting: She was lured into the job by the offer of a high salary. He had lured his victim to a deserted house. Supermarket chains try to lure customers with price discounts. Synonyms\nattract\nentice\ntempt\nThesaurus: synonyms, antonyms, and examples\nto draw your attention and interest youattractWe were attracted to the high street, with its variety of shops and cafés.drawThe game drew a crowd of 30,000.enticeThe smell of coffee enticed people to enter the shop.lureI was lured into the store by the smell of fresh bread.temptI was tempted by the offer of a free phone.seduceI wouldn't normally have bought this but I was seduced by the low price.\nSee more results »\nSMART Vocabulary: related words and phrases\nAttracting and tempting\naffinity\nallure\nalluringly\narrest\nattract\ncatnip\ncharisma\ncharm offensive\ncharm the pants off someone idiom\nchum\nglamorousness\nglamour\nhoney trap\nincentive\njump out at someone\ntantalizingly\ntempt\ntemptation\ntemptingly\ntickle someone's fancy idiom\nSee more results »\nAdd to word list\nAdd to word list\nanything that attracts people or animals, or the qualities that make something attractive: [ U ] The lure of the city for creative people has existed for centuries.\nA lure is an object used to attract fish or wild animals in order to catch them.\nto attract a person or animal: The university hopes to lure a new coach with an attractive salary package.\nAdd to word list\nAdd to word list\nto persuade someone to do something or go somewhere by offering them something they would like to have: lure sb with sth Supermarket chains try to lure customers with price discounts.lure sb away (from sth) He was lured away from the US retailer by a French cosmetics company.\nthe quality or power that something has that attracts people: the lure of fame/money/wealth He could not resist the lure of easy money."}