{"id":216664,"name":"lusciousness","type":"noun","us_sound":"ˈlʌʃ.əs.nəs","us_link":"../audio/l/uslumin016.mp3","uk_sound":"ˈlʌʃ.əs.nəs","uk_link":"../audio/l/uklusci003.mp3","content":"lusciousness noun [U]\n(TASTE)\nAdd to word list\nAdd to word list\nthe fact of having a pleasant sweet taste or containing a lot of juice: Strawberries picked before they are ripe will never quite achieve full lusciousness. Cottage cheese lends a creamy lusciousness to baked pasta recipes.\nMore examplesFewer examplesPears can produce the finest tarts of all, possessing a lusciousness that apples lack.A dollop of mayonnaise adds lusciousness to the bean cakes. Fava-bean soup has a lusciousness that tastes like fresh, sweet new season broad beans.\nSMART Vocabulary: related words and phrases\nPleasant to eat or drink\nambrosia\nambrosial\nappetizing\nappetizingly\ncooked/done to a turn idiom\njuicy\nlekker\nlip-smacking\nluscious\nlusciously\nscrumptious\nscrumptiously\nslap-up\nsmoothness\nsucculence\nultra-smooth\nuncloying\nwarming\nyummy\nzestily\nSee more results »\nlusciousness noun [U]\n(BEAUTY)\nthe quality of being very sexually attractive: She is unaware of her own lusciousness. Her beauty has a lipglossed lusciousness.\nthe quality of being very attractive and pleasing to hear, look at, read, feel, etc.: He admired the lusciousness of the flowers and the brilliance of the crystal. The film’s pictorial lusciousness can't really compensate for the plot's lack of excitement. See\nluscious\nMore examplesFewer examplesThe character, a young woman returning to her hometown, excites the local menfolk with her lusciousness.Artists talk about the lusciousness of paint or brushwork.The lusciousness and sensuality of the writer’s use of language is beguiling.\nSMART Vocabulary: related words and phrases\nBeauty and attractiveness\naesthetic\nattractiveness\nbeauty\nchic\ncrowning glory idiom\ngood looks\ngorgeousness\ngrace\ngracefulness\ngrandeur\nlustrously\nmagnificence\nmajestically\nmajesty\nnobility\nsplendour\nstateliness\nsublimity\nsultriness\nswoony\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing pleasure"}