{"id":216851,"name":"luxury","type":"noun","us_sound":"ˈlʌk.ʃɚ.i","us_link":"../audio/l/luxury.mp3","uk_sound":"ˈlʌk.ʃər.i","uk_link":"../audio/l/uklusci029.mp3","content":"Add to word list\nAdd to word list\nB1 [ U ] great comfort, especially as provided by expensive and beautiful things: to live in luxury a luxury cruise a luxury hotel\nC1 [ C ] something expensive that is pleasant to have but is not necessary: luxuries, such as champagne and chocolate I like to buy myself little luxuries from time to time.\nB2 [ S or U ] something that gives you a lot of pleasure but cannot be done often: A day off work is such a luxury.\nMore examplesFewer examplesThey have six holiday/luxury apartments for sale.He's living in luxury in the south of France.We certainly don't lead a life of luxury but we're not poor either.Lotus make luxury cars for a small but significant niche market.Once you've tasted luxury it's very hard to settle for anything else.\nSMART Vocabulary: related words and phrases\nExpensive & luxurious\nchampagne\ncostliness\nexpense\nexpensively\nextravagance\ngold plate\ngraciousness\nluxuriant\nluxurious\nluxury goods\nno expense is spared idiom\nposhly\nposhness\nprecious\npreciousness\npremium-rate\nprestige\npriceless\nritzy\nupmarket\nSee more results »\nAdd to word list\nAdd to word list\ngreat comfort, esp. as provided by expensive and beautiful possessions, surroundings, or food, or something enjoyable and often expensive but not necessary: [ U ] a life of luxury [ U ] a luxury hotel [ C ] Having an extra bathroom was at first a luxury, but after we had children it became a necessity.\nA luxury is also any unusual, enjoyable activity: [ C ] Sleeping late was a real luxury.\nAdd to word list\nAdd to word list\n[ U ] the pleasure and comfort you get from expensive and beautiful things: I made money on shares and for a while I lived in luxury.a luxury apartment/car/yacht The market for luxury cars was badly hit by the recession.a luxury cruise/hotel/resort They plan to build a luxury hotel in Nairobi.luxury brands/goods/items The store sells luxury brands such as Prada and Chanel.\n[ C ] something expensive which is pleasant to have but is not really necessary: He enjoys luxuries, such as champagne and caviar. Foreign travel is still an expensive luxury that many cannot afford.\n[ S ] something that gives you pleasure or an advantage which you do not usually have: A day off work is such a luxury. I enjoyed the luxury of travelling business class. We cannot afford the luxury of delaying this decision."}