{"id":203861,"name":"keen","type":"adjective","us_sound":"kiːn","us_link":"../audio/k/keen.mp3","uk_sound":"kiːn","uk_link":"../audio/k/ukkazak010.mp3","content":"keen adjective\n(EAGER)\nAdd to word list\nAdd to word list\nB1 very interested, eager, or wanting (to do) something very much: She's a keen tennis player. Joan wanted to go to a movie but I wasn't keen (= I didn't want to go).keen to They were very keen to start work as soon as possible.keen on She's keen on (playing) tennis.UK My son's mad keen on cycling. He's rather keen on a girl in his school (= he is very attracted to her).\nMore examplesFewer examplesPrince Charles is a keen polo player.They've been keen walkers ever since they read about the benefits of exercise.Doctors are short of time to listen and are therefore keen to dish out drugs whenever they can.\"What did he think of your suggestion?\" \"I don't think he was too keen.\"With an election approaching, the prime minister is keen to maintain his popularity.\nSMART Vocabulary: related words and phrases\nReady and willing\nagreeable\namenable\nat someone's beck and call idiom\nat your command idiom\nbe chafing at the bit idiom\nbeck\ncommand\ndisposed\neager\neagerly\nfain\nfind it in your heart to do something idiom\nfinger\npoised\nprepared\nraring\nreadily\nreadiness\nripe\nshape\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExcited, interested and enthusiastic\nkeen adjective\n(STRONG)\nextreme or very strong: keen interest Many people are taking a keen interest (= a very great interest) in the result of the vote.\nC1 very good or well developed: a keen sense of smell\nliterary A keen wind is strong and cold: a keen north wind\nSMART Vocabulary: related words and phrases\nHaving a powerful effect\nblazing\ncompelling\ncompellingly\ndevastating\ndevastatingly\nelementally\nfullness\nhigh-impact\nhyperintense\nimpactful\nlife-altering\nlife-changing\npungent\nscalding\nsuper-real\ntake (something) over\ntenaciously\nunconquerable\nunfailing\nvividly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExtremely good\nWind & winds\nkeen adjective\n(SHARP)\nliterary very sharp: a keen knife The tribe used obsidian to cut through whale skin, as the thick skin could dull even the keenest blade within a matter of minutes.\nSMART Vocabulary: related words and phrases\nSharp and blunt\nangularity\nblunt\ndull\nhone\njag\njaggy\npointed\nprickly\nrazor-sharp\nsharp\nsharpen\nsharpness\nspike\nspiked\nspikily\nspiky\nspiny\nstrop\nultra-sharp\nwhet\nSee more results »\nRelated word\nkeenlyIdiom\n(as) keen as mustard\nto make a loud, long, sad sound, especially because someone has died Synonym\nlament\nSMART Vocabulary: related words and phrases\nSounds made by humans with their mouths\ncatcall\ncaterwauling\ncrow\ncrunch\nembouchure\nglug\ngroan\ngrowl\nlaugh, shout, scream, etc. your head off idiom\nmewl\nraspberry\nsquall\nululation\nunsounded\nvocalization\nwail\nwhistle\nwhoop\nwolf whistle\nyelp\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRemembering people who have died\nRelated word\nkeenness\nkeen adjective [-er/-est only]\n(STRONGLY FELT)\nAdd to word list\nAdd to word list\n(esp. of emotions and beliefs) strongly felt: a keen interest in painting\nkeen adjective [-er/-est only]\n(DEVELOPED)\n(of an awareness or ability) very developed, or (of the mind) very quick to understand: a keen eye for detail a keen sense of smell\nkeen adjective [-er/-est only]\n(EAGER)\neager, interested, and enthusiastic: Theresa isn’t too keen on pets.\nAdd to word list\nAdd to word list\nif competition between people or businesses is keen, they are using a lot of effort to be more successful than the others: Some firms are diversifying their businesses in response to keen competition.\nUK if prices are keen, they are lower and offer more value than others: Superstores may offer keen prices that small-town shops cannot match.\nUK very interested in something or eager to do something: A keen member of two local investment clubs, he runs portfolios of shares for both himself and his wife.a keen interest in sth Among the foundation's donors are corporations with a keen interest in issues before the legislature.keen on sth Like every banker these days, he is keen on managing other people's wealth.keen to do sth The company is keen to expand beyond the UK."}