{"id":203868,"name":"keenly","type":"adverb","us_sound":"ˈkiːn.li","us_link":"../audio/k/uskabuk029.mp3","uk_sound":"ˈkiːn.li","uk_link":"../audio/k/ukkazak011.mp3","content":"keenly adverb\n(EXTREMELY)\nAdd to word list\nAdd to word list\nextremely or very strongly: They are keenly aware that this will be their last chance to succeed.\nMore examplesFewer examplesBoth are keenly interested, but have not provided plans. She still keenly feels the loss of her first child. His death affected me keenly, for we had been good friends. NASA scientists were keenly disappointed when the Voyager 1 spacecraft flew by Titan in 1980.The match promises to be a keenly contested affair. His keenly intelligent mind and passion for building systems helped him create an entirely new company.\nSMART Vocabulary: related words and phrases\nPhysically strong and powerful\n(as) tough as old boots idiom\nbeefy\nbilly-o\nbrute\nbulletproof\nburly\nimpregnably\nindestructible\nindestructibly\nindustrial-strength\nintensely\nshatterproof\nshockproof\nsinewy\nsouped-up\nstalwart\nstoutly\nviolent\nwashboard stomach\nwith a vengeance idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: very & extreme\nkeenly adverb\n(CAREFULLY)\nIf you look at someone or something keenly, you watch them very closely, and notice every detail. : He grunted a reply, and eyed me keenly from head to foot.\nMore examplesFewer examplesThe child advanced timidly towards her brother and glanced keenly at all present.While the women talked, he was keenly watching.If we observe nature keenly, we see how divine wisdom is working. His dark eyes were keenly following every move that they were making.\nSMART Vocabulary: related words and phrases\nCautious and vigilant\nabundance\nan abundance of caution idiom\naskance\nattentive\nattentively\ndiligence\ndiligent\ndiscreet\ndue diligence\ngingerly\nmindful\nminutely\nnarrowly\nonce\nonce bitten, twice shy idiom\nsemi-conservative\nslowly\nsnuffly\nsuper-cautious\nsuper-conservative\nSee more results »\nkeenly adverb\n(EAGERLY)\nin an eager way: \"I'll get the photo blown up to put on my wall,\" he says, keenly.\nMore examplesFewer examples Meanwhile, voters under 30 say they are keenly following the campaign.And as soon as I squeezed some onto my husband's hand as well he wiped it over his face and said keenly, \"I'd like some of that!\"They keenly partake in refreshments provided by their hosts. \"Second thoughts?\" Janeway asked keenly.The event is keenly awaited by readers.\nSMART Vocabulary: related words and phrases\nReady and willing\nagreeable\namenable\nat someone's beck and call idiom\nat your command idiom\nbe chafing at the bit idiom\nbeck\ncommand\ndisposed\neager\neagerly\nfain\nfind it in your heart to do something idiom\nfinger\nkeen\nprepared\nraring\nreadily\nreadiness\nready\nshape\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExcited, interested and enthusiastic\nkeenly adverb\n(CHEAP)\nIf something is keenly priced, it is cheap compared to other things of the same kind: There's a wide range of rugs, all keenly priced. See\nkeen\nMore examplesFewer examplesFares are clearly going to be keenly priced, particularly when there is oversupply in the market.This keenly priced cupboard is made from wood and finished in white which is so neutral it should fit with any decor.Flights to Berlin are keenly priced this month.The keenly priced lunchtime buffet gives few pointers as to the varied richness of this cuisine.\nSMART Vocabulary: related words and phrases\nCosting little or no money\naffordable housing\nbudget\ncatchpenny\nchargeless\ncheap\ncomp\ncompliment\ncostless\ndownmarket\neconomical\neconomically\nex gratia\nfor a song idiom\nmiserable\noff-peak\nrock bottom\nsmall change\nsupersaver\nworthlessly\nworthlessness\nSee more results »"}