{"id":203872,"name":"keep","type":"verb","us_sound":"kiːp","us_link":"../audio/k/keep.mp3","uk_sound":"kiːp","uk_link":"../audio/k/ukkazak013.mp3","content":"keep verb\n(CONTINUE TO HAVE)\nAdd to word list\nAdd to word list\nA2 [ T ] to have or continue to have in your possession: Do you want this photograph back or can I keep it? Keep medicines in a locked cupboard (= store them there). See also\nwell kept (HIDDEN)\nThesaurus: synonyms, antonyms, and examples\nto keep somethingkeepI've kept all my grandmother's jewellery.storeI've stored all Helen's books in the attic.stashHis money was stashed in a cupboard.saveI have some really good chocolates that I've been saving for a special occasion.hang ontoYou should hang onto that picture - it might be worth something.\nSee more results »\n[ T ] to own and manage a small shop: My uncle kept a little tobacconist's in Gloucester.\nB2 [ T ] If you keep animals, you own and take care of them, but not in your home as pets: to keep pigs/goats/chickens\n[ T ] US to watch and care for someone's children while their parents are away: Jody will keep the children while I shop. keep your promise/word\nB2 to do what you have told someone that you would do: I made a promise to you and I intend to keep it.\nSee more keep an appointment\nto go to a meeting or event that has been arranged: She phoned to say she couldn't keep her appointment.\nSee more keep a diary, an account, a record, etc.\nB2 to make a regular record of events or other information so that you can refer to it later: I've kept a diary for twelve years now.\nSee more keep a secret\nB1 to not tell anyone a secret that you know: It's hard to keep a secret in a school.\nSee more keep time\n(of a watch or clock) to show the correct time: Does your watch keep good time?\nto measure time as it passes: They had to keep time by the stars.\nto make a sound, movement, etc. with the rhythm of a piece of music: The teacher keeps time by clapping her hands.\nto measure time in order to make sure that an event happens within the time allowed: The match referee will no longer be responsible for keeping time.\nSee more keep goal UK\nto be the player who defends your team's goal by trying to prevent players from the other team scoring goals: He has kept goal extremely well this season.\nSee more\nMore examplesFewer examplesI always keep a copy of any official or important letters that I send off.If you keep valuables in your house, lock them away somewhere safe.I'm going to sort these old books into those to be kept and those to be thrown away.He shaved off his beard but kept his moustache.As part of their divorce settlement, Geoff agreed to let Polly keep the house.\nSMART Vocabulary: related words and phrases\nKeeping and storing things\nappropriate\naside\nbank\nbogart\nbuffer\ncapacitance\ncling\ndump\nkeep (something/someone) back\nkept\nlay something aside\nlay something down\nlay something in\nlodge\nstandby\nstash\nstockpile\nstockpiling\nstorage\ntrap\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBuying & selling - general words\nManaging and organizing\nAnimal farming - general words\nParenting & caring for children\nkeep verb\n(STAY)\nA2 [ L only + adj, T ] to (cause to) stay in a particular place or condition: I wish you'd keep quiet. I like to keep busy. Keep left (= stay on the road to the left) at the traffic lights. Can you keep the dog outside, please? [ + obj + adj ] Close the door to keep the room warm. The noise from their party kept me awake half the night. He ran towards the children, shouting at them to keep away. The protesters were kept far away, out of sight and out of earshot. keep something quiet\nto not tell people about something: They managed to keep the school's problems quiet for a while.\nSee more\nMore examplesFewer examplesBiscuits will stay crisp if you keep them in an airtight container.I keep my socks in the bottom drawer.Plants keep cool during the summer by evaporating water from their leaves.The poor things were kept in small cages without room to move.Could you keep quiet while I'm on the phone, please?\nSMART Vocabulary: related words and phrases\nKeeping and staying the same\nanti-progressive\ncalcification\ncalcify\nconsistency\nconsistent\ncontinuum\ninvariant\ninveteracy\nkept\nleave well alone idiom\nleft\nstability\nstabilization\nstabilize\nstably\nstay\nunreformed\nwallow\nwallow in something\nwouldn't have it any other way idiom\nSee more results »\nkeep verb\n(CONTINUE DOING)\nB1 [ I + -ing verb ] (also keep on) to continue doing something without stopping, or to do it repeatedly: He keeps trying to distract me. I keep on thinking I've seen her before somewhere. I kept hoping that he'd phone me. keep going\nto continue in the same way as before: If things keep going like this, we'll have to close the business.\nto continue to do something or to live normally in a difficult situation: Sometimes it was hard to keep going, but we did it for the children's sake.\nSee more keep someone going\nto help someone to continue doing something or living normally, especially in a difficult situation: It was my friends that kept me going through all this.\nmainly UK informal to prevent someone from getting too hungry when they have to wait to eat a meal: Have a piece of fruit to keep you going.\nSee more keep something going\nto make something continue to happen or operate in the same way as before: We just don't have enough funds to keep the business going. I kept the engine going while I waited. He managed to keep the fire going all night. She started playing beautifully and she kept it going all evening.\nMore examplesFewer examplesShe's got a secret admirer who keeps sending her gifts.She kept telling herself that nothing was wrong.They were laughing at him because he kept falling off his bike.I've called him several times but I keep getting the engaged tone.I don't like those watches that keep beeping every hour.\nSMART Vocabulary: related words and phrases\nContinue & last\n(it's) business as usual idiom\nbash on\ncarry (something) on\ncease\ncont.\ncontd\necho\nimmortally\nin the making idiom\ninsist on doing something\nisochronous\nleg\nprotract\nprotraction\npush ahead\npush on\nrun on\nsoldier\nspan\nspin\nSee more results »\nkeep verb\n(DELAY)\nB1 [ T ] to delay someone or prevent them from doing something: He's very late - what's keeping him? [ + -ing verb ] I'm so sorry to keep you waiting. She kept me talking on the phone for half an hour. I hope I'm not keeping you up (= preventing you from going to bed).\n[ I ] If you say that news or information for someone can keep, you mean that you can tell it to them later: \"I must tell you something.\" \"Can't it keep? I'm in a hurry!\" Whatever your news is, it will keep.\nMore examplesFewer examplesShe kept me waiting for hours.What's keeping her from just asking him?She kept me sitting in the kitchen while she talked to him.Try not to keep mother waiting.He kept me working all evening.\nSMART Vocabulary: related words and phrases\nDelaying and wasting time\nado\nbusywork\nbuy time idiom\ncarry something over\ndally\ngridlock\ninefficiency\ninefficiently\nkept\nkick\nkick something into the long grass idiom\npigeonhole\npush\nraincheck\nretard\nretardation\nset someone back (something)\nshelve\nspin\nstall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPreventing and impeding\nkeep verb\n(STAY FRESH)\nB2 [ I ] (of food) to stay fresh and in good condition: Milk keeps much longer in a fridge.\nSMART Vocabulary: related words and phrases\nDecaying and staying fresh\nbest-before date\nbiodegradable\nbiodegrade\ncompost\ndecay\ndecompose\nmoulder\nmouldy\nnonperishable\nnutrient cycling\nout of date\nperish\nputrid\nrack\nrotten\nsell-by date\nshrivel\nshrivelled\nsoft rot\nwithered\nSee more results »\nkeep verb\n(PROVIDE)\nC1 [ T ] to provide yourself or another person with food, clothing, a home, and other things necessary for basic living: He wanted a job that would allow him to keep his family in comfort.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\nafford\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDefending and protecting\nIdiom\nhow are you keeping?Phrasal verbs\nkeep at something\nkeep (someone/something) away\nkeep (something/someone) back\nkeep something back\nkeep something down\nkeep someone down\nkeep from doing something\nkeep someone/something from something\nkeep something from someone\nkeep someone in\nMore phrasal verbs\nkeep in with someone\nkeep (someone/something) off something\nkeep something off (someone/something)\nkeep (someone) off something\nkeep off something\nkeep on doing something\nkeep on\nkeep (someone/something) out\nkeep (someone/something) out of something\nkeep to somewhere\nkeep something to something\nkeep something to yourself\nkeep (yourself) to yourself\nkeep to something\nkeep someone up\nkeep something up\nkeep (something) up\nkeep up\nkeep up (with someone/something)\nkeep noun\n(LIVING EXPENSES)\n[ U ] the cost of providing food, heating, and other necessary things for someone: He's old enough now to earn his keep and stop living off his parents.\nSMART Vocabulary: related words and phrases\nCosts & expenses\nairfare\naliment\nall in\nblue book value\nbook value\ncarriage\ncarrying charge\nexpenditure\nfee\ngate money\npurchasing power\nSP\nspecial offer\nspend\nstarting price\nsticker price\nsunk cost\nsurcharge\ntime is money idiom\ntransfer fee\nSee more results »\nkeep noun\n(TOWER)\n[ C ]\n&#160; architecture\n&#160; specialized the strong main tower of a castle\nStuart Forster/robertharding/GettyImages\nSMART Vocabulary: related words and phrases\nFortifications\nacropolis\nbarricade\nbastion\nbattlements\ncastle\ndrawbridge\nearthwork\nenceinte\nentanglement\nfort\nmachicolation\nMartello tower\nmoat\nmoated\nmotte\npillbox\nstockade\nstorm cellar\nstronghold\nturret\nSee more results »\nkeep verb\n(POSSESS)\nAdd to word list\nAdd to word list\n[ T ] to be in or continue to be in someone’s possession: Can I keep this photo? \"Keep the change,\" she told the driver. We keep aspirin in the kitchen (= have it there for future use).\n[ T ] If you keep a diary or record, you write about events or record information.\nkeep verb\n(DO)\n[ T ] to do something you promised or had scheduled: I kept my promise. Did she keep her appointment? Can you keep a secret (= not tell other people)?\nkeep verb\n(STAY)\nto stay or cause to stay or continue in a particular place, direction, or condition: [ L ] keep left [ L ] keep quiet [ L ] It’s hard to keep cool in this weather. [ T ] Sorry to keep you waiting.\nkeep verb\n(CONTINUE DOING)\n[ T ] to continue doing something without stopping, or to do it repeatedly: I keep thinking I’ve seen her somewhere before.\nkeep verb\n(STAY FRESH)\n[ I ] (of food) to stay fresh and in good condition: Milk keeps longer in the refrigerator. Idioms\nkeep an eye on someone/something\nkeep an eye out for something\nkeep a tight rein on someone/something\nkeep someone company\nkeep count (of something)\nkeep your fingers crossed\nkeep someone guessing\nkeep your head above water\nkeep it down\nkeep your mouth shut\nMore idioms\nkeep your nose out of\nkeep your nose to the grindstone\nkeep someone posted\nkeep something quiet\nkeep your temper\nkeep to yourself\nkeep something to yourself\nkeep track (of someone/something)\nPhrasal verbs\nkeep at something\nkeep down something\nkeep down something\nkeep (yourself) from something\nkeep something from someone\nkeep (something) off (something)\nkeep (something/someone) out (of somewhere)\nkeep (someone/something) out of something\nkeep to something\nkeep something to yourself\nMore phrasal verbs\nkeep up\nkeep someone up\nkeep up something\nkeep up with something\nAdd to word list\nAdd to word list\n[ T ] to have or continue to have something, and not lose it or have to give it back to somebody: There is going to be a reorganization, but all the staff in the department will keep their jobs. On arrival, you will be given an information pack, which is yours to keep. Please keep all invoices relating to the sale.\n[ T ] to have available or for sale: We always keep a good supply of the most popular magazines.\n[ T ] to store something in a particular place: Where do we keep the items that are not on display? They kept his details on file for future use.\n[ I or T ] to stay, or make something stay, in a particular place or condition: When there's a crisis at work, it's important for managers to keep calm and be supportive.keep sth moving/working/operating You must keep the assembly line moving at a steady rate. keep sth organized/clean/available The bank's policy is to keep interest rates low.\n[ T ] (also keep on) to continue to do something, or to do something again and again: He kept missing deadlines.keep (on) doing sth We kept on working long after everyone else had gone home.\n[ T ] to own and manage a small store: His father kept a candy store in this neighborhood.\n[ I ] if food keeps, it stays fresh and in good condition: This variety of apple keeps well.\nkeep an account/a record/a note\nto make a record of events or other information so that you can refer to it later: We keep a record of every sale in this database. Always keep an account of how much you're spending.\nkeep an appointment\nto go to a meeting or event that has been arranged: She phoned to say she couldn't keep her appointment.\nkeep sth to yourself\nto not tell other people about something: My boss asked me to keep the information to myself until she could announce it formally.\nkeep sth under control\nto check something, and make sure that it stays within a certain limit: You must ensure that production costs are kept under control. Phrasal verbs\nkeep sb on\nkeep sth back\nkeep sth down\nkeep sth from sb\nkeep sb/sth from sth\nkeep to sth\nkeep up (with sb/sth)\nkeep up with sth\nkeep sth up"}