{"id":203929,"name":"key","type":"noun","us_sound":"kiː","us_link":"../audio/k/key.mp3","uk_sound":"kiː","uk_link":"../audio/k/ukkero_008.mp3","content":"key noun [C]\n(LOCK)\nAdd to word list\nAdd to word list\nA1 a piece of metal that has been cut into a special shape and is used for opening or closing a lock, starting a car engine, etc.: car/door keys\nRagnar Schmuck/GettyImages\nMore examplesFewer examplesShe fumbled around in her handbag, looking for her key.I heard someone turn a key in the lock.Give me the car keys - you're in no fit state to drive.She suddenly remembered (that) her keys were in her other bag.Please hand in your keys at reception on your departure from the hotel.\nSMART Vocabulary: related words and phrases\nBuilding: locks & locksmithing\nbolt\ncatch\ncombination\ncombination lock\ndeadbolt\ndeadlock\nfastener\nfob\nkey chain\nkey fob\nkey ring\nkeycard\nkeyhole\nlockbox\nlocksmith\nmaster key\nmortise lock\npadlock\nskeleton key\nYale lock\nSee more results »\nkey noun [C]\n(PART)\nB2 any of the set of moving parts that you press with your fingers on a computer keyboard, or musical instrument to produce letters, numbers, symbols, or musical notes\nShurik76/iStock/Getty Images Plus/GettyImages\nExamples\nIf you press this key, the computer screen will clear .Press and hold down the control key while you press '9'.Press the return key twice to leave a blank line.Use this key to toggle between the two typefaces.He ran his fingers over the piano keys.\nSMART Vocabulary: related words and phrases\nMachines - parts\nair compressor\nair filter\naxle\ncogwheel\ncompressor\nconsole\ncontrol panel\ncontroller\ncowl\nguard\ninstrumentation\njet\nmechanism\npivot\nslide\nspline\nsplit pin\nstepney\nuniversal joint\nvee belt\nSee more results »\nkey noun [C]\n(MUSICAL NOTES)\na set of musical notes based on one particular note: The song changes key halfway through. the key of C minor\nSMART Vocabulary: related words and phrases\nTechnical music terms\naccidental\nadagio\naleatory\nandante\nantiphonal\narpeggio\narr.\ncadence\ngiusto\ngroove\nharmonic\nharmonic progression\nharmony\nlegato\nsyncopated\nsyncopation\ntempered\ntempo\ntimbre\ntime signature\nSee more results »\nkey noun [C]\n(SYMBOLS)\na list of the symbols used in a map or book with explanations of what they mean\nSMART Vocabulary: related words and phrases\nMaps & map-making\natlas\ncartographer\ncartographic\ncartographically\ncompass rose\ncontour\ncontoured\ncontouring\ncoordinate\nelevation\nisobar\nisotherm\nmeridian\nos\nplot\npt\nreplot\nresurvey\nroad map\ntriangulation\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSigns, signals and symbols\nReasons and explanations\nkey noun [C]\n(ANSWERS)\nA2 a list of the answers to the questions in an exercise or test: See the key to test 3 on page 176.\nSMART Vocabulary: related words and phrases\nSolving and solutions\nband-aid solution\nbe at the bottom of something idiom\nbottom\nclear (something) up\nclue\nconquer\nfix\nholding operation\ninsolvable\niron\niron something out\nirresolvable\nit will (all) come out in the wash idiom\nkill\nresolution\nsolvable\nsolve\nsurmountable\ntalk something out\nunsolvable\nSee more results »\nkey noun [C]\n(ISLAND)\na small, low island in tropical regions, made of rock, sand, or coral (= a hard substance formed in the sea by groups of particular types of small animal) : There are a number of different islands, or keys, here. The resort is located at the tip of the Florida Keys. Synonym\ncay\nMore examplesFewer examplesA tropical storm battered the keys with high winds and tornadoes.You can observe the galaxy at this dark-sky site on West Summerland Key, Florida.\nSMART Vocabulary: related words and phrases\nGeography: small & large land masses\narchipelago\natoll\ncay\ncontinent\ncontinental\ncontinentally\ncoral reef\ndesert island\nfloating island\ninterisland\nisland\nisle\nlandform\nlandlocked\nlandmass\nmainland\nPangaea\nsubcontinent\nYou can also find related words, phrases, and synonyms in the topics:\nCoasts & beaches\nkey noun [C]\n(BASKETBALL)\ninformal another word for\nfree-throw lane : The key extends from the foul line to the baseline. Synonym\nkeyhole\nSMART Vocabulary: related words and phrases\nBasketball, netball & volleyball\nairball\nbackboard\nballer\nbasketball\nbeach volleyball\nbrick\ncatch and face idiom\ncharge\ncoast\ndunk\nelbow\nfoul\nfree throw\ninbounds pass\nkorfball\nlay someone up\nlay something in\nnetball\noutrebound\nsquare\nSee more results »\nIdiom\nthe key to something\nB2 very important and having a lot of influence on other people or things: She was a key figure in the international art world. a key factor in tackling the problem Synonyms\ncardinal\ncentral\nfundamental (BASIC)\nprimal\nMore examplesFewer examplesI think there is one key fact that you have overlooked.The key witness for the prosecution was offered police protection after she received death threats.The control of inflation is a key component of the government's economic policy.Delegation of responsibility is a key part of a manager's job.The economy is regarded as the key factor which will determine the outcome of the general election.\nSMART Vocabulary: related words and phrases\nVery important or urgent\nall-important\nat all costs idiom\nbe a matter of life and/or death idiom\ncardinally\nchief\nleading\nlife-altering\nlife-and-death\nlife-changing\nmainly\noverriding\nprimary\nprime\nprincipally\nprior\nprized\nseminal\ntectonic\nweightily\nweighty\nSee more results »\nto intentionally damage a car by scratching its paint using a key: Someone keyed his Porsche.\nSMART Vocabulary: related words and phrases\nScratching and rubbing\nabrade\nabrasion\nbuff\nchafe\nchaff\nerode\nerosive\ngrind\nregrind\nrub\nrub something down\nrubdown\nscour\nscrape\nscratch\nscratching\nscuff\ntickle\ntowel\nwear (something) away\nSee more results »\nPhrasal verbs\nkey something in\nkey something to someone/something\nkey noun\n(METAL SHAPE)\nAdd to word list\nAdd to word list\n[ C ] a piece of metal cut into a special shape to fit into a lock where it can be turned to open something, such as a door, or to start something, such as a car engine: I put the key into the ignition.\nkey noun\n(MOVABLE PART)\n[ C ] any of the set of movable parts that you press with your fingers on a computer or other machine to produce letters, numbers, or symbols, or on a musical instrument to produce sound: piano keys Press the shift key to write in capital letters.\nkey noun\n(IMPORTANT PART)\n[ U ] the most important part of achieving something or explaining a situation: Revision is the key to good writing.\nkey noun\n(MUSICAL NOTES)\n[ C ]\n&#160; music a set of musical notes based on one particular note: the key of C\nkey noun\n(LIST OF SYMBOLS)\n[ C ] a list of the symbols used in a map or book with explanations of what they mean: The key is printed at the bottom of the page. key adjective us\nYour browser doesn't support HTML5 audio\n/ki/\nDeception is a key element of military strategy.\nAdd to word list\nAdd to word list\nIT any of the set of moving parts that you press with your fingers on a computer, etc. to produce letters, numbers, or symbols: Press any key to continue.\nGRAPHS &amp; CHARTS a list of the symbols used in a map, chart, or book with explanations of what they mean: For an explanation of these symbols, see key below.\nthe key (to sth)\nthe best or only way to achieve something: The key is to prioritize your work, and to keep to your schedule. Hard work is the key to success. A focus on training is often the key to unlocking potential.\nSee also\nAlt key\narrow key\ncontrol key\nescape\nhot key\nscroll key\nshift key\nvery important and having a lot of influence on people or things: The control of inflation is a key component of the government's economic policy. a key factor key to sth Education is key to the country's success. Getting the budget right is absolutely key.\nIT to put information into a computer or a machine using a keyboard, or to spend time doing this work: All the data will then need to be keyed. She spends most of her time keying. Compare\nkeyboard verb Phrasal verbs\nkey sth in\nkey sth to sth"}