{"id":203932,"name":"keyboard","type":"noun","us_sound":"ˈkiː.bɔːrd","us_link":"../audio/k/uskeepn014.mp3","uk_sound":"ˈkiː.bɔːd","uk_link":"../audio/k/ukkero_009.mp3","content":"Add to word list\nAdd to word list\nA2 the set of keys on a computer or typewriter that you press in order to make it work : Switch off the computer and unplug the keyboard. The computer comes with a wireless mouse and keyboard.\nImage Source/Image Source/GettyImages\nthe row of keys on a musical instrument such as a piano: The width of piano keyboards became standard in the mid-1800s. Despite her expert fingering on the keyboard, she is simply too detached emotionally to be a great pianist.\nA2 an electronic musical instrument similar to a piano: In front of him is an electronic keyboard. He briefly played keyboards with rock-and-roller John Mellencamp.\nCimmerian/E+/GettyImages\nMore examplesFewer examplesYou can move the cursor either by using the mouse or by using the arrow keys on the keyboard.She told us how easy it was to use the computer, then by way of demonstration simply pressed a few keys on the keyboard.an electronic keyboardThe keyboard was fitted with a non-standard plug.The keyboard plugs in at the back of the computer.\nSMART Vocabulary: related words and phrases\nPublishing: paper & stationery\nA3\nA5\nacid-free\nassembler\nbackspace\nballpoint pen\nchalk\nfoolscap\nfountain pen\ngift wrap\ngrammage\nhanging chad\nnotepad\npropelling pencil\npulp\nquill\nquire\nqwerty\nream\nvellum\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMusical instruments\nto put information into a computer using a keyboard\nSMART Vocabulary: related words and phrases\nWriting & typing\nannotate\nasemic\nbang\nbang something out\nbash something out\nborrow\nborrow something from something\nchart\ndot\nfair\ninscribe\nre-registration\nreadability\nrecompose\nreformulate\nrekey\nsemiotics\nspeller\ntab\ntranscribe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOperating computers\nkeyboard noun [C]\n(COMPUTER)\nAdd to word list\nAdd to word list\nthe set of keys arranged in rows that you use to operate a computer\nkeyboard noun [C]\n(MUSICAL INSTRUMENT)\na musical instrument having keys like a piano, or the set of keys on this type of instrument: Steve plays keyboards, drums, and saxophone.\nAdd to word list\nAdd to word list\nIT the board with a set of keys on a computer, etc. to type information or that you use in order to make it work: I prefer to use the keyboard rather than a mouse. This is a wireless keyboard with all the latest features.\nIT to put information into a computer using a keyboard: Who is going to keyboard all the data? Compare\nkey verb keyboarding noun [ U ]\nIT The costs of keyboarding must be added to the first costs."}