{"id":204743,"name":"kid","type":"noun","us_sound":"kɪd","us_link":"../audio/k/kid.mp3","uk_sound":"kɪd","uk_link":"../audio/k/ukkicko002.mp3","content":"kid noun\n(CHILD)\nAdd to word list\nAdd to word list\nB1 [ C ] informal a child: He took the kids to the park while I was working.\nThesaurus: synonyms, antonyms, and examples\na childchildWhen I was a child the summers seemed to go on for ever.boyThere's a new boy in my class. girlThe girl's name is Sally.kidI'm off to pick up the kids from school.kiddieI saw her with a little kiddie in a pushchair.little oneThe little ones must be hungry by now.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nyour childchildWe have three children, two girls and a boy.sonMy son is getting married in the spring. daughterHer daughter works for a multinational in the Netherlands. kidMy two kids are both grown up now.offspringI'm sure you'll be relieved once your offspring grow up and leave home.broodMy sister descended on me with her brood of five.\nSee more results »\n[ C ] informal a young person: He was only 16, just a kid really. [ as form of address ] What's up, kid? someone's kid sister/brother mainly US informal\nsomeone's younger sister or brother: I went to Florida to visit my kid brother and his family.\nSee more be like a kid in a candy store US and Australian English\nto be very happy and excited about the things around you, and often react to them in a way that is silly and not controlled: You should have seen him when they arrived. He was like a kid in a candy store.\nSee more\nMore examplesFewer examplesShe knows the name of every kid in the school.He was the eldest of four kids.The kids always clutter up the hall with school bags and coats and stuff.She had to get the kids ready for school.My daughter used to play with the kids next door.\nSMART Vocabulary: related words and phrases\nChildren & babies\nankle-biter\narrival\nbabe\nbabe in arms\nbaby\ncomfort blanket\ncrawler\ndesigner baby\ndevil\ndiddums\nonly child\noops-a-daisy\npacifier\npapoose\nperisher\ntoddler\ntoilet-trained\ntomboy\ntot\ntyke\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nYoung people\nkid noun\n(ANIMAL)\n[ C ] a young goat\nGlobalP/iStock/Getty Images Plus/GettyImages\n[ U ] very soft leather made from the skin of a young goat: kid gloves\nSMART Vocabulary: related words and phrases\nAnimal young\nbaby\ncalf\ncalves\nchick\ncolt\ncygnet\nfawn\nfoal\nfry\ngosling\nhatchling\nheifer\njoey\nlitter\nowlet\npeachick\npiglet\npoult\npuggle\nspawn\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSheep & goats\nTanning & leather\nIdiom\nhandle/treat someone with kid gloves\nto say something as a joke, often making someone believe something that is not true: Oh no, I forgot your birthday! Hey, just/only kidding! You won first prize? You're kidding! (= I'm really surprised.) I'm just kidding you!\nThesaurus: synonyms, antonyms, and examples\nto tease someoneteaseThe boys teased her mercilessly on the playground.jokeI've lost your passport. Only joking!kidI'm sorry, I forgot to get you a birthday present. Just kidding!pull someone's legIs that really your car or are you pulling my leg?ribHis brothers were ribbing him about his new girlfriend.make fun ofThe other children made fun of him because he wore glasses.\nSee more results »\nkid yourself\nto believe something that is not true, usually because you want it to be true: He says there's a good chance she'll come back to him but I think he's kidding himself. If you think he's going to buy that excuse, you're kidding yourself. Don't kid yourself: no matter how hard you work, they aren't going to promote you.\nSMART Vocabulary: related words and phrases\nTeasing\nchaff\njoke\njosh\nkiddingly\nleg\nonly joking! idiom\npull someone's leg idiom\nrag\nrag on someone\nraillery\nrib\nribbing\nroast\nspoof\nstanding joke\ntease\nteaser\nteasingly\nwind\nwind something up\nYou can also find related words, phrases, and synonyms in the topics:\nBelieving\nIdioms\nno kidding\nyou have (got) to be kiddingPhrasal verb\nkid around\nkid noun\n(CHILD)\nAdd to word list\nAdd to word list\n[ C ] a child, or a young adult: I took the kids to the park. He’s only 19, just a kid.\n[ C ] A kid brother or kid sister is a younger brother or sister.\nkid noun\n(ANIMAL)\n[ C/U ] a young goat, or very soft leather made from the skin of a young goat Idiom\nyou have got to be kidding\nkid verb [I/T]\n(JOKE)\nto say something as a joke, often making someone believe something that is not true: [ I ] You’re kidding around, aren’t you? [ T ] Casey’s just kidding you. kid yourself\nIf you kid yourself, you believe that something you want to be true is true although it probably is not: He thinks she’ll come back, but I think he’s kidding himself."}