{"id":204752,"name":"kiddie","type":"noun","us_sound":"ˈkɪd.i","us_link":"../audio/k/kiddie.mp3","uk_sound":"ˈkɪd.i","uk_link":"../audio/k/ukkicko003.mp3","content":"Add to word list\nAdd to word list\na young child: Are you looking for something to do with the kiddies during the holidays? It's an interesting show, but I wouldn't bring the kiddies. I had to take my son to a kiddies' party.\nThesaurus: synonyms, antonyms, and examples\na childchildWhen I was a child the summers seemed to go on for ever.boyThere's a new boy in my class. girlThe girl's name is Sally.kidI'm off to pick up the kids from school.kiddieI saw her with a little kiddie in a pushchair.little oneThe little ones must be hungry by now.\nSee more results »\nMore examplesFewer examplesWho's taking care of the kiddies?I hope you all had a great weekend and lots of Halloween fun with your kiddies.Potato printing is an old-fashioned, fun activity for the kiddies.There's a kiddy here who's cut his knee.\nSMART Vocabulary: related words and phrases\nChildren & babies\nankle-biter\narrival\nbabe\nbabe in arms\nbaby\ncomfort blanket\ncrawler\ndesigner baby\ndevil\ndiddums\nonly child\noops-a-daisy\npacifier\npapoose\nperisher\ntoddler\ntoilet-trained\ntomboy\ntot\ntyke\nSee more results »\nintended for young children: He wanted to order off the kiddie menu. They were trying to cut up boxes with red kiddie scissors. See also\nkiddie pool\nMore examplesFewer examplesThis is food for adults, not kiddie food.On the day there will be live music and free kiddie rides.It's too much of a kiddie game for me.Even on a kiddie roller coaster he was terrified.\nSMART Vocabulary: related words and phrases\nChildren & babies\nankle-biter\narrival\nbabe\nbabe in arms\nbaby\ncomfort blanket\ncrawler\ndesigner baby\ndevil\ndiddums\nonly child\noops-a-daisy\npacifier\npapoose\nperisher\ntoddler\ntoilet-trained\ntomboy\ntot\ntyke\nSee more results »\nAdd to word list\nAdd to word list\na young child: We have soda for the kiddies."}