{"id":205045,"name":"kind","type":"adjective","us_sound":"kaɪnd","us_link":"../audio/k/kind.mp3","uk_sound":"kaɪnd","uk_link":"../audio/k/ukkicko027.mp3","content":"Add to word list\nAdd to word list\nA2 generous, helpful, and thinking about other people's feelings: She's a very kind and thoughtful person. It's very kind of you to help us. Please be kind to your sister!formal Would you be kind enough to/so kind as to close the door? (= please would you do this)\nThesaurus: synonyms, antonyms, and examples\na kind personkindYou'll never meet a kinder person.niceHe's such a nice guy.sweetShe's the sweetest little girl in the whole class.good toJay's mother has been very good to us.good-heartedHe's a good-hearted kid who loves to help out.\nSee more results »\nnot causing harm or damage: kind to the environment This soap is kinder to the skin.\nMore examplesFewer examplesIt's very kind of you to come all the way to meet me.I gave her some extra money - I know I didn't need to but I thought it would be kind.\"If you like I can do some shopping for you.\" \"That's a very kind offer.\"He showed me round the town, which was very kind of him.You sent her a card? That was a kind thought.\nSMART Vocabulary: related words and phrases\nKind & thoughtful\naccommodating\naccommodatingly\nattentive\nattentively\nattentiveness\ncooperative\ncooperatively\ndiplomacy\ndiplomatic\ndiplomatically\nmotherly\nneighbourliness\nneighbourly\nnice\nthe milk of human kindness idiom\nthoughtful\nthoughtfully\nthoughtfulness\nunmalicious\nunmaliciously\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSafe and secure\nA1 a group with similar characteristics, or a particular type: Today's vehicles use two kinds of fuel - petrol and diesel. What kind of (a) job are you looking for? I just don't have that kind of money (= I don't have so much money). The cupboard contained all kinds of strange things. Her travel company was the first of its kind (= of others that are similar).\nThesaurus: synonyms, antonyms, and examples\na group of people or things that share similar qualitiessortWhat sort of clothes do you like to wear?kindWhat kind of job are you looking for?typeHe's the type of man who never listens to what you're saying.formSwimming is the best form of exercise.varietyThe article was about the different varieties of Spanish spoken in South America.categoryThere are three categories of hotel room - standard, executive, and deluxe.\nSee more results »\nMore examplesFewer examplesRacism of any kind is abhorrent to me.I detest any kind of cruelty.She's got some kind of job in radio.\"I will not allow that kind of behaviour in my class, \" the teacher said severely.Wood, coal, oil, petrol, and gas are all different kinds of fuel.\nSMART Vocabulary: related words and phrases\nCategories and varieties\nbad/big boy idiom\nbreed\ncategoric\ncategorical\ncategory\nclassification\nderivative\nform\ngenre\nmark\nmodel\npolymorphism\nrun\nshade\nsort\nstratification\nsubcategory\nsubclassification\nsubstance\nupdate\nSee more results »\nGrammar\nSort, type and kindSort, type and kind all generally mean the same thing. They are words we use to refer to a group of people or things which share the same characteristics. We use these words very often when we describe things and we often find them in dictionary definitions: …\nKind of and sort ofKind of and sort of are very common expressions in speaking. They soften other words and phrases so that they do not appear too direct or exact. Kind of is more common in American English. Sort of is more common in British English: …\nIdioms\nin kind\nkind of\nof a kind\nof the kind\nkind adjective [-er/-est only]\n(GOOD)\nAdd to word list\nAdd to word list\ngenerous, helpful, and caring about other people: She’s a kind, thoughtful person. It was kind of you to give me your seat. Idiom\nkind of\nkind noun [C]\n(TYPE)\na group with similar characteristics, or a particular type: What kind of thing is it? They talked about all kinds of stuff. It’s the largest organization of its kind in history. Where books are concerned, Tyler and Chlo are two of a kind (= similar).\nin kind\nAdd to word list\nAdd to word list\nused to describe a payment that is given in the form of goods or services and not in the form of money: Payment in kind involves investors receiving more bonds in place of cash interest. At least part of their salary is paid in kind."}