{"id":205163,"name":"king","type":"noun","us_sound":"kɪŋ","us_link":"../audio/k/king.mp3","uk_sound":"kɪŋ","uk_link":"../audio/k/ukkindl009.mp3","content":"king noun [C]\n(MALE RULER)\nAdd to word list\nAdd to word list\nA2 (the title of) a male ruler of a country, who holds this position because of his royal birth: King Richard II the kings and queens of England\nMore examplesFewer examplesPrince Juan Carlos of Spain became king in 1975.The coronation of a new king is, of course, a historic occasion.Most modern kings and queens rule only in a formal way, without real power.The Spanish Armada was sent by the king of Spain to invade England in 1588.He bowed down before the king and begged for mercy.\nSMART Vocabulary: related words and phrases\nRoyalty, aristocracy & titles\naccede to something\naccession\nanointed\nanti-monarchical\nanti-monarchist\nduke\ndukedom\nearl\nearldom\nemir\nmiss\nmister\nmonarch\nmonarchist\nmorganatic\nroyalist\nroyally\nRt. Hon.\nShah\nsheikh\nSee more results »\nking noun [C]\n(MOST IMPORTANT)\nC1 the most important, best, or most respected member of a group of animals, things, or people: The lion is often called the king of the jungle. He's the new king of pop music.\nThesaurus: synonyms, antonyms, and examples\nsomeone famouscelebrityThe magazine is all about the lives of celebrities.celebWhich celeb recently spent $60,000 on an engagement ring?slebUK She was last spotted interviewing a minor sleb on the red carpet.starHer ambition was always to become a movie star.superstarRock superstar Elton John grew up working class in England.legendHe became a legend in his own lifetime.\nSee more results »\nSMART Vocabulary: related words and phrases\nGood and excellent things\nbadass\nbe the best thing since sliced bread idiom\nbeatification\nbeaut\nbeauty\nbunch\ngem\nhumdinger\njewel\njim-dandy\nkiller\nlulu\nmarvel\npeach\nscreamer\nsleeping beauty\nstandout\nsublime\nthe jewel in the crown idiom\nthe Rolls-Royce of something idiom\nSee more results »\nking noun [C]\n(GAMES)\nIn the game of chess, the king is the most important piece on the board. It can move one square in any direction.\nreal444/iStock/Getty Images Plus/GettyImages\na card with a picture of a king on it, used in games: the king of hearts\ntomograf/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nBoard games\nbackgammon\nbishop\nblitz\nboard game\ncastle\nChinese chequers\nChutes and Ladders\ncounterplay\ndefence\nendgame\nforfeit\ngambit\nmove\npin\nqueen\nqueenside\nre-roll\nresign\nrook\nsquare\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCard games\nIdiom\na king's ransom\nused as part of the name of something that is larger than the ordinary type: king prawns a king penguin\nSMART Vocabulary: related words and phrases\nEnormous\nastronomical\nastronomically\nbehemoth\nbigly\nby far and away idiom\nimmeasurable\nimmeasurably\nimmense\nimmensity\ninordinate\nprecipitous\nstratospheric\nstratospherically\nsuper-colossal\nsupersized\nterrific\nthumping\nwalloping\nyawning\nyawningly\nSee more results »\nAdd to word list\nAdd to word list\na man who rules a country because he has been born into a family which by tradition or law has the right to rule, or the title given to such a man: King Philip IV of Spain\nA king is a playing piece in the game of chess and each player’s most important piece.\nA king is also a playing card with a picture of a king on it: the king of hearts\nIf someone or something is called the king of an activity, that person is the best or the most important in that activity: He was baseball’s home run king.\nAdd to word list\nAdd to word list\na person, company, or organization that is thought to be the best or most successful: It is widely considered to be king of the supermarket chains.\nsb/sth is king\nused to say that someone or something is the most important part of something or has the most influence: In mergers and acquisitions, cash is king. They all followed the principle that the customer is king. Media executives are fond of saying that content is king."}