{"id":205230,"name":"kink","type":"noun","us_sound":"kɪŋk","us_link":"../audio/k/kink.mp3","uk_sound":"kɪŋk","uk_link":"../audio/k/ukkindl016.mp3","content":"kink noun [C]\n(TWIST/CURVE)\nAdd to word list\nAdd to word list\nan unwanted twist or bend in a wire, rope, pipe, etc. that is usually straight: There was a kink in the pipe. Track inspectors were watching for kinks or bending of the steel rails, which can be caused by excessive heat.\na curved shape in hair that means that it does not hang straight down: African American women, tired of trying to fit a white vision of beauty, have learned to love their kinks and curls. For years I have straightened my hair, ever since I saw the first kink in it. Synonym\ncurl\nUS a sore place in a muscle, especially in the neck or back: Massage is a marvelous way to work out the kinks in tense muscles. Thirty minutes later he was on the awards podium, working the kinks from his muscles and thinking about the next race.\nSMART Vocabulary: related words and phrases\nGeometry: bends, loops & curves\nanfractuous\narc\ncoil\nconic\ncurl\ncurve\nfishhook\nhelically\nhelix\nhyperbola\nhyperbolic\nloop\nparabola\npeaked\ntight\ntrajectory\nturn\nwhirl\nwhorl\nwraparound\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHair\nDisorders of muscles & the nervous system\nkink noun [C]\n(PROBLEM)\nsomething that is wrong: Pete still needs to iron out a few kinks in his game. The service is still relatively new, and the kinks - payments that are posted late, sites that are slow and hard to use - haven't been worked out yet.\nSMART Vocabulary: related words and phrases\nFaults and mistakes\naberration\nAchilles heel\nadrift\nblack mark\nblemish\nerror\nfailing\nfalse move\nfaux pas\nflaw\nmiscue\nmisfunction\nmisperception\nmisprint\nmisspelling\nthat's/it's your funeral! idiom\ntypo\nwardrobe malfunction\nweakness\nwhat price...? idiom\nSee more results »\nkink noun [C]\n(HABIT)\na strange habit, usually of a sexual nature: The movie contains many familiar themes, and a sexual kink or two.\nSMART Vocabulary: related words and phrases\nHabitual behaviour\nADL\natavism\natavistic\ncounter-tendency\ncreature\ncreature of habit idiom\ndiet\nhabit\nidiosyncrasy\nidiosyncratic\nidiosyncratically\nleaning\npenchant\nprogramme\nritualism\nritualistic\nritualistically\nritualized\nritually\nroutine\nSee more results »\nAdd to word list\nAdd to word list\na sharp twist or bend in something such as a wire or rope: There was a kink in the hose and the water wouldn’t come through.\nA kink is also a small problem: The system will work fine once we work out a few kinks."}