{"id":205450,"name":"kit","type":"noun","us_sound":"kɪt","us_link":"../audio/k/kit.mp3","uk_sound":"kɪt","uk_link":"../audio/k/ukkit__001.mp3","content":"Add to word list\nAdd to word list\nB1 [ C ] a set of things, such as tools or clothes, used for a particular purpose or activity: a first-aid/tool kit a pregnancy-testing kit\n[ C ] a set of parts sold ready to be put together: He's making a model car from a kit.\nA2 [ U ] mainly UK the particular clothing worn by a sports team, or the particular clothing and small pieces of equipment worn and used by people such as soldiers and sailors: They were wearing football kit.\nFuse/Corbis/GettyImages\n[ S or U ] mainlyUK the equipment needed for a particular purpose or activity: Don't go and buy all the kit until you know what sort of sailing you enjoy. A torch is an important piece of kit on backpacking trips.\nMore examplesFewer examplesI bought a new cycle repair kit.We didn't have our sports kit with us.Where is the first-aid kit?My Mum washes my rugby kit for me.Luckily, she had her doctor's kit with her.\nSMART Vocabulary: related words and phrases\nThings needed for a task\naccoutrements\napparatus\narmoury\ncould use something idiom\nequipment\ngadgetry\ngear\nmaterial\nmatériel\nnecessaries\nparaphernalia\nstock-in-trade\ntackle\nthing\ntool\ntool (something/someone) up\nuse\nYou can also find related words, phrases, and synonyms in the topics:\nGroups and collections of things\nSportswear & swimwear\nIdiom\nget your kit off\nAdd to word list\nAdd to word list\na set of things, such as tools or equipment, used for a particular purpose or activity: We keep a first-aid kit in the office for emergencies.\nA kit is also a set of parts sold ready to be put together: a model airplane kit\nAdd to word list\nAdd to word list\na set of things that is used for a particular purpose or activity: We have a first-aid kit available in every office. information kit a digital photography starter kit\na set of parts sold ready to be put together and made into something: Steel-framed buildings can be supplied in kit form. See also\npress kit\ntool kit"}