{"id":205922,"name":"knock","type":"verb","us_sound":"nɑːk","us_link":"../audio/k/knock.mp3","uk_sound":"nɒk","uk_link":"../audio/k/ukkneel025.mp3","content":"knock verb\n(MAKE NOISE)\nAdd to word list\nAdd to word list\nB1 [ I ] to repeatedly hit something, producing a noise: She knocked on the window to attract his attention. There's someone knocking on/at the door. Please knock before entering.\n[ I ]\n&#160; engineering\n&#160; specialized If an engine is knocking, it is producing a repeated high sound either because the fuel is not burning correctly or because a small part is damaged and is therefore allowing another part to move in ways that it should not.\n[ I ] If something such as a pipe knocks, it makes a repeated high sound.\nThesaurus: synonyms, antonyms, and examples\nto make a sudden loud soundbangThe door banged shut.knockI know when the heating is on because the old radiator begins to knock and hiss.crackThunder cracked right before it began pouring and we ran for cover.clankI could tell he was upset by the way the pots clanked in the sink while he was washing up.clangChurch bells clanged in the distance.clashThe children covered their ears whenever the cymbals clashed.\nSee more results »\nMore examplesFewer examplesI wish he'd knock instead of just barging in.He knocked quietly before entering the room.She knocked on the table to get our attention.She never knocks before she comes in.Knock three times, then I'll know it's you.\nSMART Vocabulary: related words and phrases\nHitting against objects accidentally and colliding\nanti-collision\nanti-shock\nbang\nbang around\nbowl someone over\nbump\ncannon\ncatch\ncollision\ncrash\nhead-on\njog\nplough into something/someone\npost-crash\nrun (something) into something/someone\nrun someone/something down\nscuff\nslam\nsmash something up\nstack up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSounds made by objects, movement or impact\nknock verb\n(HIT)\nB1 [ I + adv/prep, T ] to hit, especially forcefully, and cause to move or fall: He accidentally knocked the vase off the table. She knocked her head against the wall as she fell. Who knocked over that mug of coffee? [ + obj + adj ] Some thug knocked him unconscious/senseless. She took a hammer and knocked a hole in the wall. knock through something (also knock (something) into something)\nIf you knock one room into another room, or knock through a room, you remove the wall between one room and the next so that they form one room: We're planning to knock the kitchen into the dining room to make one large eating space.\nSee more\nMore examplesFewer examplesThe force of the wind knocked my hat off.I knocked over a cup of tea.The chair knocked against the lamp.She knocked her head on the cupboard door.Mind you don't knock the glass over.\nSMART Vocabulary: related words and phrases\nHitting against objects accidentally and colliding\nanti-collision\nanti-shock\nbang\nbang around\nbowl someone over\nbump\ncannon\ncatch\ncollision\ncrash\nhead-on\njog\nplough into something/someone\npost-crash\nrun (something) into something/someone\nrun someone/something down\nscuff\nslam\nsmash something up\nstack up\nSee more results »\nknock verb\n(CRITICIZE)\n[ T ] UK informal to criticize, especially unfairly: Don't knock him - he's doing his best.\nThesaurus: synonyms, antonyms, and examples\nto show disapproval of someone or somethingcriticizeHe criticized the government's handling of the crisis.attackShe wrote an article attacking the judge and the way the trial had been conducted.condemnShe was condemned for her comments about the candidate.denounceThe government's economic policy has been denounced on all sides.come under fireThe government programme has come under fire for mismanaging funds.\nSee more results »\nSMART Vocabulary: related words and phrases\nDisapproving & criticizing\nanathematize\nanimadversion\naspersion\naw\nbackbite\nboo\ncriticism\ndeprecate\ndim\nniggle\nobloquy\nopprobrious\nopprobriously\nopprobrium\npeanut gallery\npeople who live in glass houses shouldn't throw stones idiom\npersonalize\nsarky\nsatirize\ntear\nSee more results »\nIdioms\nbe knocking (on) 60, 70, etc.\nknock someone's block off\nknock something on the head\nknock (some) sense into someone\nknock someone sideways/for six\nknock on wood\nknock 'em dead!\nknock it off\nknock spots off something\nknock the bottom out of something\nMore idioms\nknock, knock!\nyou could have knocked me down/over with a feather\nPhrasal verbs\nknock around\nknock around (something)\nknock someone around\nknock someone back (something)\nknock back (something)\nknock someone down\nknock someone/something down\nknock something down\nknock off (something)\nknock something off (something)\nMore phrasal verbs\nknock something off\nknock someone off\nknock (something) on\nknock someone out\nknock yourself out\nknock something out\nknock something out of someone\nknock someone over\nknock something over\nknock something together/up\nknock up\nknock someone up\nknock noun [C]\n(NOISE)\na sudden short noise made when someone or something hits a surface: There was a knock at/on the door.\nSMART Vocabulary: related words and phrases\nSounds made by objects, movement or impact\nbang around\nbong\nburble\nchoo-choo\nchuff\nclick away\nclicker\nclinking\ncrunch\nplop\nresonance\nsplat\nsplutter\nsputter\nsqueak\ntintinnabulation\ntoot\nunsounded\nwhirr\nwhite noise\nSee more results »\nknock noun [C]\n(HIT)\nthe act of something hard hitting a person or thing: He received a nasty knock on the head from a falling slate.\nSMART Vocabulary: related words and phrases\nHitting against objects accidentally and colliding\nanti-collision\nanti-shock\nbang\nbang around\nbowl someone over\nbump\ncannon\ncatch\ncollision\ncrash\nhead-on\njog\nplough into something/someone\npost-crash\nrun (something) into something/someone\nrun someone/something down\nscuff\nslam\nsmash something up\nstack up\nSee more results »\nIdioms\nthe knock at/on the door\ntake/have a knock\nknock verb\n(MAKE NOISE)\nAdd to word list\nAdd to word list\n[ I ] to repeatedly hit something, producing a noise: Someone is knocking at the door. Jane knocked on the window to attract his attention.\n[ I ] If an engine is knocking, it makes a repeated noise because of a mechanical problem.\nknock verb\n(MOVE)\n[ T ] to push into something or someone, often forcefully, causing the thing or person to move: Alice accidentally knocked the pot off the table. The blast knocked him off his feet.\nknock verb\n(CRITICIZE)\n[ T ] infml to criticize, esp. unfairly: She knocks every suggestion I make.\nIdioms\nknock it off\nknock on woodPhrasal verbs\nknock something off (something)\nknock down something/someone\nknock down something\nknock off (something)\nknock out someone\nknock out something/someone\nknock over something/someone\nAdd to word list\nAdd to word list\nto cause a sudden and unexpected change in something such as prices: His downbeat assessment knocked the company's share price enough to ensure that it failed to rejoin the FTSE 100. Analysts have warned that price cuts and slowing sales would knock profits.\nto affect someone or something badly: The hotel and conference sector has been knocked sideways by a catalogue of problems in recent years. Manufacturing redundancies in the area are knocking buyers' confidence.be knocked by sth The financial markets were badly knocked by the week's political turmoil.\ninformal to criticize something or someone: Critics may knock the company, but it's still a good investment. You can knock him for some things, but you have to give him credit for his record.\ncome knocking informal\nto visit or talk to someone in order to ask for something: We assist small companies that want to expand their capabilities - if they come knocking, we don't turn them down.\nknock on/at sb's door informal\nto talk to a person or an organization because you want them to help you, or you want to join them: In the two years since it launched its first plan, nearly 218,000 investors have knocked on its door. In 1911, 39 per cent of Britain's working women were domestic servants, now they are knocking at the boardroom door.\nknock sth on the head UK informal\nto prevent something from happening, or to finally finish something: The company knocked housing market concerns on the head with a 32% rise in full-year profits.\nknock spots off sth/sb UK informal\nto be much better than something or someone else: This ingenious colour viewfinder knocks spots off current LCD displays.\nknock sth/sb into shape informal\nto take action to get something or someone into good condition: His arrival on the board has finally knocked the company into shape.\nknock the bottom out of sth\nto damage something severely, especially by destroying its support: The rise in mortgage rates really knocked the bottom out of the housing market.\nPhrasal verbs\nknock sb/sth back\nknock sb down\nknock sth down\nknock sth from sth\nknock off (sth)\nknock off sth\nknock sth off (sth)\nknock sth out\na situation in which something is badly affected: Sales of champagne were up over the key Christmas period despite earlier fears of a knock in consumer confidence.\ninformal a bad experience: take/suffer/have a knock In him, we see a man, toughened by his share of hard knocks, who's had to struggle for every success.\na criticism of someone or something: a knock on sb/sth The biggest knock on internet phones is that they're only as reliable as your broadband connection."}