{"id":206014,"name":"knowledge","type":"noun","us_sound":"ˈnɑː.lɪdʒ","us_link":"../audio/k/knowledge.mp3","uk_sound":"ˈnɒl.ɪdʒ","uk_link":"../audio/k/ukknock012.mp3","content":"Add to word list\nAdd to word list\nB1 [ S or U ] understanding of or information about a subject that you get by experience or study, either known by one person or by people generally: Her knowledge of English grammar is very extensive. He has a limited knowledge of French. The details of the scandal are now common knowledge (= familiar to most people). She started to photograph the documents, safe in the knowledge that (= knowing that) she wouldn't be disturbed for at least an hour. In this town there are only a couple of restaurants that to my knowledge (= judging from my personal experience and information) serve good food.\n[ U ] the state of knowing about or being familiar with something: They both deny all knowledge of the affair. It has come/been brought to our knowledge (= we have discovered) that several computers have gone missing.\nMore examplesFewer examplesHer knowledge of computers is quite awe-inspiring.She has an intimate knowledge of Tuscany, where she has lived for 20 years.He tried to impress me with his extensive knowledge of wine.I only have a limited knowledge of Spanish.He went to visit her without my knowledge.\nSMART Vocabulary: related words and phrases\nKnowledge and awareness\nacquaintance\nalertness\nas every schoolboy/schoolchild knows idiom\nastuteness\nat/in the back of your mind idiom\nfamiliarity\nfirsthand\ngeneral knowledge\ngnostic\ngrounding\nmetacognition\nnescience\nnescient\noff someone's radar idiom\nomniscience\nsensibility\nstreet smarts\ntheory of mind\nvisual literacy\nwitting\nSee more results »\nAdd to word list\nAdd to word list\nawareness, understanding, or information that has been obtained by experience or study, and that is either in a person’s mind or possessed by people generally: How will we use our increasing scientific knowledge? A lack of knowledge on the part of teachers is a real problem. He has a limited knowledge of French. The owner claims the boat was being used without her knowledge. It was common knowledge that Lucy was superstitious about the number 13.\nAdd to word list\nAdd to word list\nskill in, understanding of, or information about something, which a person gets by experience or study: acquire/gain/have knowledge possess/lack knowledge People working in stores need better product knowledge. business/scientific/technical knowledgedeny all/any knowledge of sth The chairman denies all knowledge of any foreign accounts. Applicants should have a working knowledge of computer-aided design systems. detailed/extensive/basic knowledge business/scientific/technical knowledge\nto my knowledge (also to the best of my knowledge)\njudging from my personal experience and information: To my knowledge, not one call was made to verify anything in my application for the job. See also\nexplicit knowledge\nimplicit knowledge\ntacit knowledge"}