{"id":205995,"name":"know","type":"verb","us_sound":"noʊ","us_link":"../audio/k/eus73226.mp3","uk_sound":"nəʊ","uk_link":"../audio/k/ukknock008.mp3","content":"know verb\n(HAVE INFORMATION)\nAdd to word list\nAdd to word list\nA1 [ I or T, not continuous ] to have information in your mind: \"Where did he go?\" \"I don't know.\" \"What does it cost?\" \"Ask Kate. She'll know.\" She knows the name of every kid in the school. I don't know anything about this. [ + question word ] We don't know when he's arriving. I don't know (= understand) what all the fuss is about. [ + (that) ] I just knew (that) it was going to be a disaster. She knew (= was aware) (that) something was wrong. [ + obj + to infinitive ] Even small amounts of these substances are known to cause skin problems.formal The authorities know him to be (= know that he is) a cocaine dealer.\nThesaurus: synonyms, antonyms, and examples\naware of somethingawareWe are aware that some people are getting frustrated.consciousI am conscious of the need for greater scrutiny of these matters.cognizantMost people are cognizant of the fact that some pollsters ask leading questions.knowWe know that people who are stressed out look haggard.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto know factsknowI know you've been hiding something from me.be familiar withI'm very familiar with various accountancy software packages.informedit's important to keep the public informed about the steps they're taking.be apprised ofThe suspect will be apprised of their rights.realizeI realized that it was too late to stop them from finding out. have heard ofMost Americans have never heard of the California Air Resources Board.\nSee more results »\nA1 [ T not continuous ] used to ask someone to tell you a piece of information: Do you know the time? [ + question word ] Do you know where the Post Office is?\nA2 [ I or T, not continuous ] to be certain: [ + (that) ] I know (that) she'll be really pleased to hear the news. [ + question word ] I don't know whether I should tell her or not. The party is at Sarah's house as/so far as I know (= I think but I am not certain).\nMore examplesFewer examples\"Will the table fit in here?\" \"I don't know - let's measure it.\"I still don't know whether she's coming or not.It's a bit suspicious that no one knows where he was at the time of the murder.No one knew how many troops had died in combat.\"He's been married three times.\" \"Oh, really? I didn't know that!\"\nSMART Vocabulary: related words and phrases\nLearning & knowing\nabsorptive capacity\nacquirable\nacquire\nacquisition\nassimilate\nbone\nfamiliar\nhit the books idiom\nminor\nmislearn\nmug (something) up\nnon-academic\nnon-library\nrecognition\nshadow\nsubspecialty\nswot up (something)\nteachable\nthose\nuncultivated\nSee more results »\nknow verb\n(BE FAMILIAR WITH)\nB1 [ T not continuous ] to be familiar with or have experience and understanding of: I've known Daniel since we were at school together. She grew up in Paris so she knows it well. I've seen the film \"Casablanca\" so many times that I know a lot of it by heart (= I know it in my memory). Knowing Karen (= from my experience of her in the past), she'll have done a good job.formal I have known (= experienced) great happiness in my life.\nB1 [ I or T, not continuous ] (also know about) If you know a subject, you are familiar with it and understand it: Do you know about computers? She knows her subject inside out (= very well).\nA2 [ T not continuous ] If you know a language, you can speak and understand it: Do you know any French?\n[ T not continuous ] to recognize someone or something: That's Peter alright - I'd know him anywhere! I know a bargain when I see one. know how to do something\nA2 to be able to do something because you have the necessary knowledge: Do you know how to print on this computer?\nSee more get to know someone/something\nB1 to spend time with someone or something so that you gradually learn more about them or it: The first couple of meetings are for the doctor and patient to get to know each other.\nSee more know someone by name\nto have heard the name of a person but not seen or talked to them: I know him by name, but I don't think I've ever met him.\nto know a person whom you do not see or talk with very often well enough that you know their name: She stayed at the hotel so often that she knew all the staff by name.\nSee more know someone by sight\nIf you know someone by sight, that person looks familiar to you, but is not a friend of yours: Mike spends a lot of time in this area, so you'd probably know him by sight.\nSee more\nMore examplesFewer examplesI know the first verse of the song, but I don't know what comes next.If you don't know what the word means, look it up in a dictionary.It's always awkward when you meet someone you know, but you can't remember their name.He knows a lot of people, but only one or two that he'd call close friends.I hope she knows where to get off the bus.\nSMART Vocabulary: related words and phrases\nLearning & knowing\nabsorptive capacity\nacquirable\nacquire\nacquisition\nassimilate\nbone\nfamiliar\nhit the books idiom\nminor\nmislearn\nmug (something) up\nnon-academic\nnon-library\nrecognition\nshadow\nsubspecialty\nswot up (something)\nteachable\nthose\nuncultivated\nSee more results »\nGrammar\nKnowWe commonly use the verb know with a noun phrase, with a that-clause or with a wh-clause (e.g. who, where, why): …\nKnow how + infinitiveWe do not commonly use know + to-infinitive. We use know how + to-infinitive: …\nKnow + object + infinitiveIn very formal English, we use know + object + to-infinitive: …\nKnow without an objectTo refer to general knowledge, we use know without an object: …\nYou knowWe use you know very often in speaking as a discourse marker. We use it to check that the people we are speaking to share the same knowledge as us and understand what we are saying: …\nYou knowWe use you know very commonly in speaking. It is used to check with our listeners that we share the same knowledge. When we use you know, we assume that the listener or listeners do have the knowledge that we want them to have: …\nIdioms\nbefore you know it\nbe known to be/do something\nGoodness/God/Heaven/Christ knows\nhow was I to know?\nI don't know\nI don't know about you but...\nI don't know how, what, why, etc.\nI know\nI know, right?\nI'll, he'll, etc. have you know\nMore idioms\nknow something back to front\nknow something like the back of your hand\nknow your own mind\nknow your place\nknow your stuff\nknow your way around something\nknow all the answers\nknow all there is to know about something\nknow best\nknow better (than to do something)\nknow better (than someone)\nknow the score\nknow what you are doing\nknow what you are talking about\n(you) know what I mean\nknow what it is (like) to\nknow what's what\nknow which side your bread is buttered (on)\nsomething knows no bounds\nnot know someone from Adam\nnot know the first thing about something\nnot know the meaning of the word\nnot know what has hit you\nnot know where to put yourself\nnot know where/which way to turn\nnot know whether to laugh or cry\nnot that I know of\nthere's no knowing\n(well) what do you know!\nwouldn't know something if you fell over one/it\nyou know\nyou know something?\nyou never know\nPhrasal verbs\nknow something from something\nknow of someone/something\nbe in the know\nto have knowledge about something that most people do not have: This resort is considered by those who are in the know to have the best downhill skiing in Europe.\nSee more\nknow verb\n(HAVE INFORMATION)\nAdd to word list\nAdd to word list\n[ I/T ] to have information in your mind; to be aware of something: [ I ] “Where did he go?” “I don’t know.” [ T ] Do you know the answer? [ T ] She knows the name of every kid in school. [ + question word ] Do you know how to tap dance? [ + question word ] We don’t know when he’s arriving. [ + (that) clause ] I knew (that) something was wrong from the start. [ + question word ] I want to know how much this will cost. know of\nIf you know of someone or something, you have experience of or information about the person or thing: Do you know of a good doctor?\nknow verb\n(HAVE UNDERSTANDING)\n[ I/T ] to agree with or understand the reasons for an action or opinion: [ + question word ] I don’t know what all the fuss is about. [ + question word ] “What a stupid movie!” “I know what you mean.” know what it is (like) to\nTo know what it is (like) to be or do something is to understand because you have personally experienced it: She knows what it’s like to go bankrupt – it happened to her 20 years ago.\nknow verb\n(BE FAMILIAR WITH)\n[ I/T ] to be familiar with a person or place: [ T ] I’ve known Vince since we were in elementary school. [ T ] She grew up in Hawaii so she knows it well. [ T ] Knowing Debbie (= from my experience of her in the past), she’ll do a good job.\nknow verb\n(FEEL CERTAIN)\n[ T ] to feel certain about something: I know I’d enjoy myself if I went. [ + (that) clause ] I know (that) I took those library books back. [ + wh- word ] I don’t know whether or not I should go to college.\n[ T ] to feel certain about something: I know I’d enjoy myself if I went. [ + (that) clause ] I know (that) I took those library books back. [ + question word ] I don’t know whether or not I should go to college.\nknow verb\n(RECOGNIZE)\n[ T ] to recognize someone or something, or to recognize the difference between two people or things: That’s Pete – I’d know him anywhere. I know a bargain when I see one! Idioms\nknow best\nknow better (than to do something)\nknow something like the back of your hand\nknow your way around something\nknow what you are doing\nknow what you are talking about\nknow where you stand\nnot know the first thing about\nnot know what hit you\nknow noun\n(HAVE INFORMATION)\nin the know\nSomeone who is in the know has information about something: Ask Keith – he’s always in the know about upcoming projects."}