{"id":206427,"name":"kosher","type":"adjective","us_sound":"ˈkoʊ.ʃɚ","us_link":"../audio/k/kosher.mp3","uk_sound":"ˈkəʊ.ʃər","uk_link":"../audio/k/ukkos__003.mp3","content":"Add to word list\nAdd to word list\n(of food or places where food is sold, etc.) prepared or kept in conditions that follow the rules of Jewish law: kosher food/meat a kosher restaurant/butcher/shop\ninformal humorous legal, able to be trusted and therefore good: Their business activities aren't quite kosher.\nSMART Vocabulary: related words and phrases\nJudaism\nAshkenazi\nbar mitzvah\nbat mitzvah\ncantor\nHalakha\nHanukkah\nJew\nJewish\nJewishness\nOrthodox Judaism\npaschal\nPassover\nPentecost\nPharisee\nsynagogue\ntallit\nTalmudic\nTalmudist\nthe ark\nthe Talmud\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nVarious qualities of food\nSuitable and acceptable\nkeep kosher\nto follow the rules of Jewish law about which types of food can be eaten, and about how to prepare and store food: Only about 15 percent of the nation's roughly 5.2 million Jews keep kosher.\nSee more Compare\nkashrut\nhalal\nto make food or food preparation equipment kosher (= to make it follow the rules of Jewish law), for example by removing blood from meat by washing it and using salt: Kosher salt is the salt used for koshering meat. If you want your kitchen koshered, he can do it.\nMore examplesFewer examplesWe spend hours koshering all the chicken.The local Jewish population produced a koshered cured beef product similar to corned beef. The picture shows butchers preparing the beef as part of the koshering process.The oven should be koshered by turning it to maximum heat for 40 minutes.\nSMART Vocabulary: related words and phrases\nJudaism\nAshkenazi\nbar mitzvah\nbat mitzvah\ncantor\nHalakha\nHanukkah\nJew\nJewish\nJewishness\nOrthodox Judaism\npaschal\nPassover\nPentecost\nPharisee\nsynagogue\ntallit\nTalmudic\nTalmudist\nthe ark\nthe Talmud\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nVarious qualities of food\nAdd to word list\nAdd to word list\n(of food or places where food is kept) prepared or kept in conditions that follow the rules of Jewish law: kosher food a kosher restaurant\nKosher can also mean acceptable or correct: It’s kosher for a politician to make a fortune when he leaves office, but not when he’s in office."}