{"id":116603,"name":"daily","type":"adverb","us_sound":"ˈdeɪ.li","us_link":"../audio/d/daily.mp3","uk_sound":"ˈdeɪ.li","uk_link":"../audio/d/ukdagoe006.mp3","content":"Add to word list\nAdd to word list\nA2 happening on or relating to every day: Take the tablets twice daily. Exercise has become part of my daily routine. We back up our computer files at work on a daily basis. She's looking forward to retiring and ending the daily grind (= hard, boring work or duty) of working in an office.\nThesaurus: synonyms, antonyms, and examples\nbeing part of normal life and not specialordinaryHe took ordinary household objects and transformed them into pieces of art. everydayComputers are now just a part of everyday life.quotidianWe longed for the quotidian rituals, like shopping and tea, that the end of the war would bring.day-to-dayDay-to-day operations of the team would be handled by the assistant coach.dailyI'm looking for a good daily shampoo that won't damage my hair.\nSee more results »\nMore examplesFewer examplesThe museum is open daily except Mondays.The restaurant flies its fish in daily from Scotland.Britain is one of the few countries where milk is delivered daily to the doorstep by milkmen.He commutes daily between Leeds and Manchester.The post comes twice daily.\nSMART Vocabulary: related words and phrases\nRelating to regular periods of time\nafternoons\nannual\nannum\nbi-yearly\nbiannual\ncircadian rhythm\ndailiness\nevenings\nfortnightly\nhalf-hourly\nhourly\np.c.m.\np.w.\nper annum\nper calendar month\nquadrennial\nquadrennially\nquarterly\ntriennially\nweekly\nSee more results »\na person who is employed to clean someone else's home\nSMART Vocabulary: related words and phrases\nPeople who clean & tidy places & things\nchambermaid\nchar\ncharlady\ncharwoman\nchimney sweep\nclean freak\ndishwasher\ndomestic\nhome help\nhousekeeper\nkitchen porter\nlitter picker\nscullion\nsqueegee man\nsweep\nsweeper\ntrash picker\nwaste picker\nSee more results »\nAdd to word list\nAdd to word list\nhappening on or relating to every day, or every working day: Take the pills twice daily. Exercise is part of my daily routine.\na newspaper published every day of the week or every day except the weekend\nAdd to word list\nAdd to word list\nhappening or done every day: a daily meeting Will I be involved in the management of the business on a daily basis?\nexisting or true for a single day: There has been an agreement to increase the daily rate of pay for temporary staff.\nevery day: The new website will allow subscribers to check daily for new job listings."}