{"id":116661,"name":"dairy","type":"adjective","us_sound":"ˈder.i","us_link":"../audio/d/dairy.mp3","uk_sound":"ˈdeə.ri","uk_link":"../audio/d/ukdagoe011.mp3","content":"Add to word list\nAdd to word list\nB2 used to refer to cows that are used for producing milk, rather than meat, or to foods that are made from milk, such as cream, butter, and cheese: dairy cattle dairy farmers dairy products\nMore examplesFewer examplesI'm trying to cut down on dairy products, which is difficult because I adore cheese.You'll find all the yogurts in the dairy section, madam. Shall I show you?I hope you've checked the ingredients, as Amy's allergic to anything dairy.The shop doesn't stock much dairy produce - only fresh milk, actually.My uncle recently sold his dairy herd and is now concentrating on arable farming.\nSMART Vocabulary: related words and phrases\nCattle & similar animals\nbison\nbossy\nbovine\nbuffalo\nbull\nbullock\ncalf\ncattle\nGalloway\nheifer\nhighland\nHolstein\njersey\nNormande\nox\nox-drawn\nshorthorn\nsteer\nstock\ntaurine\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDairy products & eggs\n[ C ] a place on a farm where milk and cream are kept and cheese and butter are made, or a company that supplies milk and products made from milk\n[ U ] foods that are made from milk, such as cream, butter, and cheese: I was advised not to eat too much dairy.\nMore examplesFewer examplesWe get our milk and cheese from the local dairy.One of regions biggest dairies has won a contract to supply milk to a major supermarket chain.This dairy is famous for its delicious ice-cream.There used to be a dairy on the farm until they decided to only raise cattle for meat.The cheese is still made in village dairies in Switzerland by local cheese-makers.\nSMART Vocabulary: related words and phrases\nAnimal farming - general words\nanimal husbandry\naquaculture\naquaponics\nbedding\nbeekeeping\ndip\ndraft\ndrove\nheeler\nherd\nhoneycomb\nkept\nlambing season\nsheepdog\nshepherd\nslaughter\nstable\nsubtherapeutic\nteaser\nunweaned\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDairy products & eggs\nAdd to word list\nAdd to word list\na place on a farm where milk and cream are kept and cheese and butter are made, a company that supplies milk and products made from milk, or milk and products made from milk: [ U ] She eats no meat and very little dairy. [ U ] I’ll only buy nonfat dairy products."}