{"id":116791,"name":"damage","type":"verb","us_sound":"ˈdæm.ɪdʒ","us_link":"../audio/d/damage.mp3","uk_sound":"ˈdæm.ɪdʒ","uk_link":"../audio/d/ukdagoe022.mp3","content":"Add to word list\nAdd to word list\nB1 to harm or spoil something: Many buildings were badly damaged during the war. It was a scandal that damaged a lot of reputations.\nMore examplesFewer examplesSmoking is likely to damage your health permanently.The library was badly damaged in the fire.The explosion damaged the bridge, but the substructure remained intact.Certain chemicals have been banned because they are damaging the environment.The caretaker ran out and tried to catch the boys who had been damaging the fence.\nSMART Vocabulary: related words and phrases\nDamaging and spoiling\nadulterate\nadulterated\nadulteration\napplecart\nat-risk\nbutcher\neat away at something\nerode\nflaw\nfoul\nfoul (something) up\ngild the lily idiom\ngloss\nrain on someone's parade idiom\nrampage\nravage\nravages\nruin\nsour\nwreck\nSee more results »\nB1 [ U ] harm or injury: Strong winds had caused serious damage to the roof. Recent discoveries about corruption have done serious damage to the company's reputation. The doctors were worried that he might have suffered brain damage. damages [ plural ]\nmoney that is paid to someone by a person or organization who has been responsible for causing them some injury or loss: The politician was awarded £50,000 in damages over false allegations made by the newspaper.\nSee more\nMore examplesFewer examplesThe state of Florida was hit by a hurricane that did serious damage.After the crash both drivers got out and inspected their cars for damage.Smoking has caused irreversible damage to his lungs.The bomb was designed to cause the maximum amount of damage.The disease can cause permanent damage to the brain.\nSMART Vocabulary: related words and phrases\nDamaging and spoiling\nadulterate\nadulterated\nadulteration\napplecart\nat-risk\nbutcher\neat away at something\nerode\nflaw\nfoul\nfoul (something) up\ngild the lily idiom\ngloss\nrain on someone's parade idiom\nrampage\nravage\nravages\nruin\nsour\nwreck\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInjuring and injuries\nIdioms\nthe damage is done\nwhat's the damage?\nAdd to word list\nAdd to word list\nto harm or spoil something: Many buildings were badly damaged by the earthquake. News reports damaged the senator’s reputation.\nharm or injury: The fire did serious damage to the buildings. He suffered brain damage in the accident.\nAdd to word list\nAdd to word list\nharm that is done to someone or something that makes them less successful: damage to sth/sb The firm was lucky to get away with little damage to its reputation.do/cause damage (to sth/sb) The pensions scandal did a lot of damage to the Government's credibility.inflict damage on sth/sb Public relations disasters could inflict damage on the brand. The solicitors say their clients will hold the bank liable for any loss and damage suffered as a result of the arrangements. severe/irreparable/serious damage economic/financial damage\nphysical harm that is done to something: They asked their insurers to assess the damage so that they could make a claim.do/cause damage (to sth) The government estimates the damage done by the fires at millions of pounds. Roofs are most likely to suffer damage during a hurricane. storm/wind/water damage severe/irreparable/serious damage environmental/structural damage\ndamages [ plural ]\nLAW money that a person or organization is ordered by a court of law to pay to another person or organization because they are responsible for harming them in some way: They want the rival company to withdraw the product and pay damages.£140,000/$12 million, etc. in damages Juries have been handing out millions of dollars in damages for minor injuries. A party failing to fulfil their part of the contract will presumably be liable for damages.award damages (to sb) In addition to the damages awarded to Robertson, his wife was awarded $500,000.claim/seek/sue for damages (for sth) He was seeking damages for breach of contract,.be awarded/receive/recover damages (for sth) If the odds of survival fell because of a missed diagnosis, victims would be able to try to recover damages.\nthe damage is done\nharm has been caused and it is too late to change the situation: Even though he was acquitted, the damage was done. See also\nactual damages\nadditional damages\napparent damage\ncivil damages\ncompensatory damages\nconsequential damages\ncriminal damage\nexemplary damages\nincidental damages\nliquidated damages\nView all\nmoney damages\nnominal damages\nnon-economic damages\nproperty damage\npunitive damages\ntreble damages\nunspecified damages\nto harm someone or something in a way that makes them less successful: The Chancellor is being urged not to take steps that could damage Britain's competitiveness. They feared that public knowledge of the deal might damage them.seriously/severely/irreparably damage sb/sth He is suing his colleague on the grounds that her accusations severely damaged his reputation.\nto physically harm something: People who are under-insured won't be able to rebuild if their homes are damaged by a hurricane.seriously/severely/irreparably damage sth The fire completely destroyed five buildings and severely damaged several more."}