{"id":116921,"name":"damper","type":"noun","us_sound":"ˈdæm.pɚ","us_link":"../audio/d/usdamna003.mp3","uk_sound":"ˈdæm.pər","uk_link":"../audio/d/ukdamne007.mp3","content":"damper noun\n(CONTROL)\nAdd to word list\nAdd to word list\n[ C ] a device that reduces vibration (= fast shaking), for example in an engine: The system includes a motor with appropriate gear transmission and a damper. The new model has new springs and dampers and a sports exhaust. Synonym\ndampener\n[ C ] a device that stops a piano string from making a sound, that can be stopped from working by pressing a key or pedal: A damper, made of soft felt, presses against each string and prevents it from vibrating until it is wanted. The melody resounds as if the damper pedal were being pressed on a piano.\n[ C ] a metal plate in a chimney that can be moved to control the flow of air and make the fire burn faster or more slowly: Vent-free fireplaces have no need for a damper. The worker in the boiler room said he was just about to close the damper when the explosion took place. put a damper on something informal (also put a dampener on something)\nto make something less active or less enjoyable: Both the kids were sick while we were in Boston, so that put a damper on things.\nSee more\nSMART Vocabulary: related words and phrases\nThe engine & engine parts\nair filter\nalternator\nanti-roll\nantifreeze\nbiting point\nbrake\ncam\ncarburation\ncarburettor\nchoke\ncombustion chamber\ndisc brake\ndistributor\ndrive shaft\ninternal combustion engine\nmuffler\nneutral\nplug\nsuspension\ntailpipe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMusical instruments\nParts of buildings: the fireplace & parts of the fireplace\ndamper noun\n(BREAD)\n[ C or U ] mainly Australian English a simple type of bread made with flour and water and without yeast, traditionally cooked on a fire: I wanted to try making damper, a bread that you cook in coals on the ground.\nMore examplesFewer examplesTea was a picnic of damper (yeast-free bread) straight from the fire and traditional billy tea, brewed over the coals. Eva enjoyed \"dampers\", a kind of bread without yeast made by the swagmen on their wanderings.\nSMART Vocabulary: related words and phrases\nBread\nAnadama bread\narepa\nbagel\nbaguette\nbannock\ncorn pone\ncottage loaf\ncrouton\ncrumb\ncrumpet\nkaiser roll\nlardy cake\nloaf\nloaves\nmalt loaf\nrye bread\nsippet\nsoda bread\nspoon bread\nstaff\nSee more results »"}