{"id":116911,"name":"damp","type":"adjective","us_sound":"dæmp","us_link":"../audio/d/damp.mp3","uk_sound":"dæmp","uk_link":"","content":"Add to word list\nAdd to word list\nB2 slightly wet, especially in a way that is not pleasant or comfortable: The grass is still damp. This shirt still feels a bit damp. It was a damp, misty morning.\nThesaurus: synonyms, antonyms, and examples\nfull of or covered with liquidwetThe washing is still wet.moistYou must try this carrot cake - it's so moist and delicious.dampThe towels are still damp.soakedYour clothes are soaked!soakingIt rained in the middle of the night, and when we woke up our sleeping bags were soaking wet.\nSee more results »\nMore examplesFewer examplesThe room was damp and smelly so we opened all the windows and gave it a good airing.Put those damp clothes in the tumble dryer.The hotel walls were covered in damp patches.The house was dusty, damp and unwelcoming.Left in the garage where it was damp, the wooden frame had warped.\nSMART Vocabulary: related words and phrases\nWet weather & wetness\nclammily\nclamminess\ndamply\ndampness\ndankly\ndouse\nflooded\nmoist\nmoisten\nmonsoon\nrehydration\nsaturation\nsemi-dry\nsleety\nslobbery\nsoak\nsoaked\nsodden\nsoggily\nwaterlogged\nSee more results »\nCompare\nhumid\nmoistRelated words\ndampness\ndamply\nwater in the air, in the walls of a house, etc., usually with harmful or unpleasant effects: Repointing mortar is vital to prevent damp in walls. The damp is bad for his asthma. See also\nrising damp\nMore examplesFewer examplesThe shed was really dark and smelled of damp.In the basement was some old machinery, rusting in the damp.The wallpaper is brown with age, and darkened with patches of damp.The damp was making my hair curl.Watering the plants more actually encourages the infection—any fungus loves the damp. There was a lot of damp in the air.\nSMART Vocabulary: related words and phrases\nWet weather & wetness\nclammily\nclamminess\ndamply\ndampness\ndankly\ndouse\nflooded\nmoist\nmoisten\nmonsoon\nrehydration\nsaturation\nsemi-dry\nsleety\nslobbery\nsoak\nsoaked\nsodden\nsoggily\nwaterlogged\nSee more results »\nAdd to word list\nAdd to word list\nslightly wet, esp. in a way that is not pleasant or comfortable: damp socks a cold, damp day dampness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈdæmp·nəs/\nThe dampness bothers my arthritis."}