{"id":116967,"name":"dance","type":"verb","us_sound":"dæns","us_link":"../audio/d/dance.mp3","uk_sound":"dɑːns","uk_link":"../audio/d/ukdamne011.mp3","content":"Add to word list\nAdd to word list\nA1 [ I or T ] to move the body and feet to music: We danced all night. We went dancing at a club. What kind of music do you like dancing to? Who was she dancing with at the party last night? Can you dance the tango? We played our music and danced the night away.\n[ I ] literary to move quickly and lightly: The daffodils were dancing in the breeze. She watched the sunlight dancing on the water.\nMore examplesFewer examplesHe was too shy to ask her to dance with him.The lights and loud music in the club made her want to dance.He dances well for a man of his years.They danced to the beat of the drums.Come on, why aren't you dancing? Enjoy yourselves!\nSMART Vocabulary: related words and phrases\nDance & choreography\narabesque\nbacking dancer\nbackspin\nbackup dancer\nballerina\ncountry dancing\ncut a rug idiom\ndabbing\ndance studio\ndancer\nmoonwalk\nmoonwalking\nmorris dance\nmorris dancer\nmorris dancing\ntarantella\nTerpsichore\nterpsichorean\nthrow shapes idiom\ntights\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking short, sudden movements\nIdioms\nbe dancing in the streets\ndance attendance on someone\ndance to someone's tune\nB1 [ C ] a particular series of movements that you perform to music or the type of music that is connected with it: The band played a slow dance.\nA2 [ C ] a social occasion where people dance, especially a formal occasion in a large room: They're having an end-of-term dinner-dance.\nRubberBall Productions/Brand X Pictures/GettyImages\nA1 [ C or U ] the act of moving your feet and body to music: UK We had a dance. The bride's father gets the first dance at the wedding. a dance class\nA2 [ U ] the art of performing dances, especially as a form of entertainment: The performers tell the story through song and dance.\nMore examplesFewer examplesFollowing the dinner, there will be a dance.There are classes in movement, dance, acting and improvisation.Before a rugby match, the New Zealand team perform a Maori war dance.Everyone should pair up for the next dance.She's teaching me some basic dance steps.\nSMART Vocabulary: related words and phrases\nDance & choreography\narabesque\nbacking dancer\nbackspin\nbackup dancer\nballerina\ncountry dancing\ncut a rug idiom\ndabbing\ndance studio\ndancer\nmoonwalk\nmoonwalking\nmorris dance\nmorris dancer\nmorris dancing\ntarantella\nTerpsichore\nterpsichorean\nthrow shapes idiom\ntights\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCelebrations, parties & special occasions\nAdd to word list\nAdd to word list\nto move the body and feet in rhythm to music: [ I ] Who was she dancing with at the party? [ T ] They danced a waltz.\nIf something dances, it moves quickly and easily: [ I ] Sunlight danced on the water.\nan act of dancing, or a particular set of movements: [ C ] “May I have this dance?” he asked. [ C ] The next dance will be a waltz. [ U ] Do you take dance lessons?\nA dance is also a social occasion at which people dance: [ C ] the eighth-grade dance"}