{"id":117165,"name":"dapple","type":"verb","us_sound":"ˈdæp.əl","us_link":"../audio/d/cdo0319usdapp0437.mp3","uk_sound":"ˈdæp.əl","uk_link":"../audio/d/cdo0319ukdapp0386.mp3","content":"Add to word list\nAdd to word list\nto cover something with spots of colour that are lighter or darker than the main colour, or to cover something with areas of light and darkness: At 7,000 feet, thin patches of snow dapple the sandstone.\nMore examplesFewer examplesFor centuries, scientists have measured the sun's activity by counting how many sunspots dapple its surface.Britten's opera \"A Midsummer Night's Dream\" opens with shimmering curtains of blue-green fabric and swirling pools of light dappling the stage.The cat was at the kitchen door, alert, a shaft of sunlight dappling the stripes of his back.As he walks deeper into the woods, branches of oak, hickory and sugar maple trees dapple the sunlight.\nSMART Vocabulary: related words and phrases\nPatterns and shapes\namorphous\narabesque\nargyle\nasymmetrically\nasymmetry\nfishbone\nfishhook\nflecked\nformless\nformlessly\npalmate\nreticulation\nrhomboid\nsemilunaris\nshapeable\nshaped\nshapeless\nshapelessly\nsilhouetted\nzigzag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGiving out light\na small area of colour or light: They walked through a dapple of sunlight that shifted as the breeze shifted the leaves.\nMore examplesFewer examples The illustrations by Jane Ray are all exquisitely patterned with circles, stars, dapples, dots and curlicues and are delicately and ravishingly coloured.The little horse had dapples in his coat.There is really an extraordinary range of different barks. I think my favourite has to be the dapples of spotted gum bark (Eucalyptus maculata).\nSMART Vocabulary: related words and phrases\nPatterns and shapes\namorphous\narabesque\nargyle\nasymmetrically\nasymmetry\nfishbone\nfishhook\nflecked\nformless\nformlessly\npalmate\nreticulation\nrhomboid\nsemilunaris\nshapeable\nshaped\nshapeless\nshapelessly\nsilhouetted\nzigzag\nSee more results »"}