{"id":117197,"name":"dare","type":"verb","us_sound":"der","us_link":"../audio/d/dare.mp3","uk_sound":"deər","uk_link":"../audio/d/ukdappl002.mp3","content":"dare verb\n(BE BRAVE/RUDE)\nAdd to word list\nAdd to word list\nB2 [ I not continuous ] to be brave enough to do something difficult or dangerous, or to be rude or silly enough to do something that you have no right to do: I was going to ask if his dog was better, but I didn't dare in case she had died. [ + (to) infinitive ] Everyone in the office complains that he smells awful, but nobody dares (to) mention it to him. [ + infinitive without to ] I wouldn't dare have a party in my flat in case the neighbours complained. Dare you tell him the news? I don't dare think how much it's going to cost.UK I daren't think how much it's going to cost.UK Do you dare (to) tell him the news? I'd never dare (to) talk to my mother the way Brandon talks to his. [ + to infinitive ] He was under attack for daring to criticize the mayor. See also\ndaresay mainly UK\nMore examplesFewer examplesShe fixed the child with a stare of such disapproval he did not dare move.I didn't dare say anything for fear of offending him.I wouldn't dare say anything against him to his mother!I dare not let the children out of my sight in this park.He's a bit possessive about his CDs - I wouldn't dare ask to borrow them.\nSMART Vocabulary: related words and phrases\nTaking risks\nadventurer\nall in\nbe skating on thin ice idiom\nbet the farm/ranch idiom\nbroke\ncompromise\nexpose\nhave/put your head on the block idiom\nhazard\nhigh wire\nhigh-stakes\nimperil\nlay\nput your neck on the line idiom\nre-expose\nrisk\nrun the risk of doing something idiom\nsail\nsail close to the wind idiom\nskate\nSee more results »\ndare verb\n(ASK)\nC1 [ T ] to ask someone to do something that involves risk: Wear the low-cut blouse with your pink shorts - go on, I dare you! [ + to infinitive ] I dare you to ask him to dance.\nSMART Vocabulary: related words and phrases\nMaking appeals & requests\nadjuration\nappellate\napply for something\napply to\nappreciate\nask a lot\nbesiege\ncar wash\ncry\nentreat\nentreaty\nimportunately\nimportunity\ninvite\ninvocation\nleech\nout with it! idiom\npush\nscrounge\nticket\nSee more results »\nGrammar\nDareDare is both a main verb and a semi-modal verb. …\nDare, need, ought to and used to (semi-modal verbs)Dare, need, ought to and used to are often called semi-modal because in some ways they are formed like modal verbs and in some ways they are like other main verbs. …\nIdioms\ndon't you dare\nhow dare she, you, etc.!\nsomething you do because someone dares you to: He jumped in the river at twelve o'clock last night as (also US on/UK for) a dare.\nSMART Vocabulary: related words and phrases\nCompeting and contending (non-sporting)\nbe one up on someone idiom\nbid\ncat\ncatchup\nchancer\nclose-run\ncompetition\ngo in for something\ngo toe to toe idiom\nhyper-competitive\nin the game idiom\nintercollegiate\npit\nrunners and riders idiom\nshowing\nslugfest\nsnap at someone's heels idiom\nsuper-competitive\nthrow\ntoe\nSee more results »\ndare verb\n(BE BRAVE)\nAdd to word list\nAdd to word list\npresent tense dares or dare to be brave enough to do something difficult or dangerous or that you should not do: [ T ] She wouldn’t dare go out alone there at night. [ I ] He wanted to touch it, but he didn’t dare. [ +to infinitive ] I can’t believe you dare to talk to me this way!\ndare verb\n(ASK)\n[ T ] to ask someone to do something that involves risk: I dare you to ask him to dance.\ndare noun [C]\n(BRAVE ACT)\nsomething difficult or dangerous that you do because someone asks you to do it: He jumped into the river on a dare."}