{"id":117239,"name":"darken","type":"verb","us_sound":"ˈdɑːr.kən","us_link":"../audio/d/darken.mp3","uk_sound":"ˈdɑː.kən","uk_link":"../audio/d/ukdappl010.mp3","content":"darken verb\n(GET DARKER)\nAdd to word list\nAdd to word list\n[ I ] (of a place or the sky) to become dark: The sky darkened as thick smoke billowed from the blazing oil well.\n[ I ] to become dark or darker in colour: The stains on the wall have darkened and expanded.\n[ T ] to make a place dark, for example by turning off lights: Close the blinds to darken the room, and leave her alone.\n[ T ] to make something become darker in colour: The sun had darkened his skin.\nMore examplesFewer examplesIn the distance I can see the mountains against the darkening sky.The audience's attention was drawn to the spotlit stage as the hall darkened.Following the storm, there were many communities almost totally darkened by power outages.Red onions are sweeter, but they darken the color of the risotto.\nSMART Vocabulary: related words and phrases\nDarkness & becoming dark\nblackness\ndarkened\ndarkly\ndarkness\ndim\ndimly\ndimness\ndingily\ndingy\ndraw\ninky\nmatt\npitchy\nsemi-darkness\nshaded\nshadily\nshadow\nshadowily\nshadowy\ntwilight\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe qualities of colour\ndarken verb\n(GET WORSE OR MORE SERIOUS)\n[ I ] to become worse or more serious: The economic picture is darkening rapidly.\n[ T ] to make something become worse or more serious: This bad news darkened the mood.\nMore examplesFewer examplesIt was getting late, and maybe because he had to get up early for work in the morning, Mr. Lee's mood darkened. Soon the phrases used to describe him began to darken.Some economists have warned that falling house prices could darken the jobs picture.Municipal bonds, considered safe investments, sank last week, darkening the already grim mood in the markets.\nSMART Vocabulary: related words and phrases\nSerious and unpleasant\nabominable\nabominably\nabysmal\nabysmally\napocalyptic\nfraught\nfrightful\nfrom hell idiom\nfun\nghastliness\nnoisome\nnot be all fun and games idiom\nnoxiously\nobjectionable\nobjectionably\nunpleasantness\nunpretty\nunspeakable\nunspeakably\nunsupportable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWorse and worst\nMaking people sad, shocked and upset\nRelated word\ndarkenedIdiom\nnot darken someone's door\nAdd to word list\nAdd to word list\nto become or make something dark: [ I ] The sky darkened as thick smoke billowed from the refinery. [ T ] She pulled down the shades to darken the room."}