{"id":117276,"name":"darling","type":"noun","us_sound":"ˈdɑːr.lɪŋ","us_link":"../audio/d/darling.mp3","uk_sound":"ˈdɑː.lɪŋ","uk_link":"../audio/d/ukdappl015.mp3","content":"Add to word list\nAdd to word list\nB2 a person who is very much loved or liked: Oh darling, I love you. Here's your change, darling. In spite of his unpopularity in the USSR, Gorbachev remained a/the darling of (= very popular with) the West right to the end. Synonyms\ndear\ndearie old-fashioned\nlove (LIKING SOMEONE) UK informal\npet (PERSON) UK informalNote: This is used as a name between people who love each other and people who are being friendly. As a friendly way of talking to someone it is not usually used between men.\nMore examplesFewer examplesSorry darling, something unexpected has come up at the office, and I'll be home late.\"How wonderful to see you again, darling, \" she cooed.Darling, Mummy's told you before, there's no such thing as ghosts!\"Mummy, I hurt my knee.\" \"Come here, darling, and let me kiss it better.\"My darling!\nSMART Vocabulary: related words and phrases\nAffectionate terms of address\nangel\nbabe\nbaby\nbae\nbean\nboo\nboy\ndearest\nhon\nhoney\nhun\nhunny\nmunchkin\nmy\nold bean idiom\nsport\nsweet\nsweetie\nsweetie pie\nterm\nSee more results »\nold-fashioned used when talking to someone you love, for example in a letter, to say that you love them very much: Darling Martha, It was great to see you at the weekend.\nvery attractive: They've just bought a darling little apartment.\nSMART Vocabulary: related words and phrases\nWritten greetings\n(yours) sincerely phrase\nbest\nconcern\ncordially\ndear\ndearest\never\nfaithfully\ngreeting\nlove\nmadam\nrespectfully\nseason's greetings\nsincerely\nsir\ntruly\nwish\nwith\nyours\nyours ever phrase\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAttractive\nAdd to word list\nAdd to word list\nused to show affection when speaking to someone: Hello, darling.\nmuch loved: Here’s a picture of my darling child."}