{"id":117431,"name":"data","type":"noun","us_sound":"ˈdeɪ.t̬ə","us_link":"../audio/d/data.mp3","uk_sound":"ˈdeɪ.tə","uk_link":"../audio/d/ukdappl029.mp3","content":"Add to word list\nAdd to word list\nB2 information, especially facts or numbers, collected to be examined and considered and used to help decision-making, or information in an electronic form that can be stored and used by a computer: The data was/were collected by various researchers. Now the data is/are being transferred from magnetic tape to hard disk.\nThesaurus: synonyms, antonyms, and examples\ninformationinformationCan I get some information on uni courses?detailsPlease send me details of your training courses.directionsJust follow the directions on the label.instructionsHave you read the instructions all the way through?directionsWe had to stop and ask for directions.guidelinesThe government has issued new guidelines on health and safety at work.\nSee more results »\nMore examplesFewer examplesThe data is stored on a hard disk and backed up on a floppy disk.The report was written after analysing data from the case histories of thousands of patients.Scientists hope that data from the space probe will pave the way for a more detailed exploration of Mars.The system will handle phone calls and data messages as well as other signals that need high bandwidth.The data, normally transmitted electronically, can be changed into pulses of light.\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nhandout\ninfo\ninfodemic\ninfodump\ninfographic\npostscript\nPSA\npush notification\nradiogram\nreadout\ntelemetry\nthe real deal\nSee more results »\nAdd to word list\nAdd to word list\nmathematics, science information collected for use: They had data on health, education, and economic development. Note: Although originally a plural (the rarely used singular is datum) and used with a plural verb, data is now often used as an uncount noun with a singular verb.\nAdd to word list\nAdd to word list\ninformation, especially facts or numbers, collected to be examined and considered and used to help with making decisions: The data shows that more than 80% of the agricultural workforce is Hispanic. financial/personal/sales data The database for each health authority should be able to provide data on the number of staff residing in each location. She earns about $13.50 an hour collecting data for the US Department of Labor.\nIT information in an electronic form that can be stored and processed by a computer: The students' task was to prepare all the posters and electronic data for the publicity campaign. See also\nprimary data\nsecondary data"}