{"id":117465,"name":"dateless","type":"adjective","us_sound":"ˈdeɪt.ləs","us_link":"../audio/d/cdo1121usdate1316.mp3","uk_sound":"ˈdeɪt.ləs","uk_link":"../audio/d/cdo1121ukdate1291.mp3","content":"dateless adjective\n(NO PARTNER)\nAdd to word list\nAdd to word list\nwith no romantic partner or no one to go out with romantically: The dateless guys say they feel stunned into terrified silence when they meet women. She was dateless on St Valentine's Day - she had not even received a card.\nMore examplesFewer examplesI was overweight, out of place, dateless for the prom.He sets out to woo her with the help of his equally unemployed and dateless friends.The matchmaker says many of her clients have all the right qualities but are still dateless.He's the loner, the bespectacled, dateless geek. In the show a dateless girl is given a makeover and then sent on a dream date with one of three men.\nSMART Vocabulary: related words and phrases\nRelationships: finding a partner\na heavy date idiom\nbe on the pull idiom\nchase\ncomputer dating\ncourt\ncourtship\ncruising\nhook up\ninternet dating\nlonely\nlonely hearts idiom\nlucky\nmatch\nonline dating\npin\npull\npursue\nsingles bar\nspeed dating\ntogether\nSee more results »\ndateless adjective\n(NO DAY)\nwith no date on it: The date features on most other pages so I'm not sure why this page is dateless.\nnot appearing to belong to any particular date or period of time: They wear classic suits and dateless dresses. Synonym\ntimeless\nMore examplesFewer examplesThey opted to leave the stories dateless to avoid pinning them down to any particular era.This is no period piece; it is a dateless classic that, like a good wine, improves with age.The image shows four men and a woman, dressed in dateless clothing.\nSMART Vocabulary: related words and phrases\nRelating to time\nanachronism\nanachronistic\nanachronistically\nchronological\nchronologically\ncontemporaneously\ncontemporarily\ncontemporary\ncut into something\ndendrochronology\nretroaction\nretroactive\nretroactively\nretrospective\nretrospectively\nsynchronically\ntime loop\ntimeline\ntiming\ntwin\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDays & times of day\nLasting for a long time"}