{"id":117458,"name":"date","type":"noun","us_sound":"deɪt","us_link":"../audio/d/date.mp3","uk_sound":"deɪt","uk_link":"../audio/d/ukdatag002.mp3","content":"date noun [C]\n(DAY)\nAdd to word list\nAdd to word list\nA1 a numbered day in a month, often given with a combination of the name of the day, the month, and the year: What's the date (today)?/What date is it?/What's today's date?UK Today's date is 11 June (the eleventh of June).US Today's date is June 11 (June the eleventh). What is your date of birth? The closing date for applications is the end of this month. We agreed to meet again at a later date. I'd like to fix a date for our next meeting. I made a date (= agreed a date and time) to see her about the house. See also\nout of date (FASHION)\nup to date\na particular year: The date on the coin is 1789. Albert Einstein's dates are 1879 to 1955 (= he was born in 1879 and died in 1955).\na month and a year: The expiry (US expiration) date of this certificate is August 2017.\nMore examplesFewer examplesWe've written to him asking him if he's free on that date but we haven't had an answer yet.As the date of his operation drew near, he became more and more anxious.If necessary, we can always change the dates of our trip.Do you know the date of Caroline and Matthew's wedding?Applications received after the closing date will not be accepted.\nSMART Vocabulary: related words and phrases\nDays & times of day\nafternoon\nafternoons\nall day\nam\narvo\nhappy hour\nhigh noon\nhour\nin broad daylight idiom\nin the dead of night/winter idiom\nnocturnally\nnoon\nnoontime\no'clock\noffice hours\nthe witching hour\nwee small hours\nwhite night\nwine o'clock\nworkday\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nYears & yearly\nSpecific periods of time\ndate noun [C]\n(MEETING)\nB1 a social meeting planned before it happens, especially one between two people who have or might have a romantic relationship: He asked her out on a date. She has a hot date (= an exciting meeting) tonight.\nmainly US a person you have a romantic meeting with: Who's your date for the prom?\nMore examplesFewer examplesWe went out on a date.I've got a date with someone from work tonight.I know she's going to the cinema with him tonight but I don't know if it's a date as such.I went there on a date with a boy I used to know.So who's your date tonight?\nSMART Vocabulary: related words and phrases\nMeeting people\nacquaintance\nayup\nbump into someone\ncounter-rally\ncross someone's path/cross paths with someone idiom\nfarewell\nfish\nmass\nmeeting\nmuster point\nopen house\npaths cross idiom\npay your respects idiom\npower lunch\nre-encounter\nre-meet\nreconvene\nrecross\nrendezvous\nrespect\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRelationships: finding a partner\ndate noun [C]\n(PERFORMANCE)\na performance: They've just finished an exhausting 75-date European tour.\nSMART Vocabulary: related words and phrases\nSpectacles & performances\naerobatic\namateur theater\nbalancing act\nbravura performance\nbullfight\ndouble-header\nminstrel show\nmusic hall\nnon-musical\none-night stand\none-person\nroutine\nspectacular\nstrip\nstripping\nstriptease\nsuper-spectacle\nsupershow\nswansong\ntattoo\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMusical performances\ndate noun [C]\n(FRUIT)\nC1 the sweet fruit of various types of palm tree\nJuanmonino/E+/GettyImages\nSMART Vocabulary: related words and phrases\nTypes of fruit\nackee\nalligator pear\nalpine strawberry\namla\naçaí\ncooker\ncooking apple\ncopra\ncrab apple\ncranberry\nlongan\nloquat\nlychee\nmajhool date\nmandarin\nrose hip\nsalmonberry\nsaskatoon\nsatsuma\nsatsuma plum\nSee more results »\nGrammar\nDatesWe write the date in English in different ways. The most common way in British English is to write the day of the month first, then the month (starting with a capital letter) and then the year: …\nWriting the dateWe write the date in English in different ways. The most common way in British English is to write the day of the month first, then the month (starting with a capital letter) and then the year: …\nSpeaking the dateWe ask the date or about dates in several ways. We can add the and of when we reply: …\nIdioms\nit's a date\nto date\ndate verb\n(TIME)\nB1 [ T ] to write the day's date on something you have written or made: [ + obj + noun ] Thank you for your letter dated 30 August.\n[ T ] to say how long something has existed or when it was made: Archaeologists have been unable to date these fossils. An antique dealer had dated the vase at (= said that it was made in) 1734.\nMore examplesFewer examplesThe TV programme shows archaeologists using the latest technology to date things they have found.Your cheque should be dated before or on the day the bill is due.When they lifted the carpet, they found a newspaper dated 5 August 1952.The portrait is signed and dated 1893.The painting, dated 1928, is expected to fetch up to £250,000.\nSMART Vocabulary: related words and phrases\nWriting & typing\nannotate\nasemic\nbang\nbang something out\nbash something out\nborrow\nborrow something from something\nchart\ndot\ninscribe\nkeyboard\nre-registration\nreadability\nrecompose\nreformulate\nrekey\nsemiotics\nspeller\ntab\ntranscribe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOrigins and sources\ndate verb\n(MEET)\nB1 [ I or T ] mainly US to regularly spend time with someone you have a romantic relationship with: They dated for five years before they got married. How long have you been dating Nicky?\nMore examplesFewer examplesShe dated a string of actors before she met her first husband.She became famous when she started dating one of the country's top football stars.Would you date a man ten years younger than yourself?Their parents didn't approve of their relationship so they had to date in secret.The two of them dated for a while, but it didn't work out.\nSMART Vocabulary: related words and phrases\nRelationships: finding a partner\na heavy date idiom\nbe on the pull idiom\nchase\ncomputer dating\ncourt\ncourtship\ncruising\ngo back to someone\nheavy\nhook up\ninternet dating\nlonely\nlonely hearts idiom\nmatch\npersonal ad\npin\npull\npursue\nsingles bar\nspeed dating\nSee more results »\ndate verb\n(SHOW AGE)\n[ I ] to stop being fashionable or become old-fashioned: Some James Bond films have dated more than others.\n[ T ] to show the age of a person or thing: I can remember watching live TV coverage of the first lunar landing, so that dates me (= shows how old I am).\nSMART Vocabulary: related words and phrases\nOld or old-fashioned\nage-old\nageing\nancient\nantediluvian\nanti-progressive\nfossilization\nfossilize\nfossilized\nfrumpy\nfustily\nout of date\noutdate\noutdated\noutdatedly\noutmoded\nunprogressive\nunreconstructed\nunsmart\nunstylish\nused\nSee more results »\nPhrasal verbs\ndate back\ndate from something\ndate noun [C]\n(DAY)\nAdd to word list\nAdd to word list\na numbered day in a month, often given with the name of the month or with the month and the year: Today’s date is June 24, 1998. We agreed to meet again at a later date. Please fill in your date of birth on the application form. I’ve made a date (= agreed to a date and time) to see her about the house.\ndate noun [C]\n(MEETING)\na social meeting planned in advance: We made a date to meet Evelyn and Josie at noon tomorrow for lunch.\nA date is a person you are planning to meet socially and in whom you might have a romantic interest: Who is your date for the prom?\ndate noun [C]\n(FRUIT)\nthe sweet, brown fruit of various types of palm tree\nIdiom\nto date\ndate verb [I/T]\n(WRITE DATE)\nto write the day's date on something you have written or made: [ T ] The last letter I received from the insurance company was dated August 30, 1999. [ I ] This signature dates from (= originated at the time of) the 1800s.\ndate verb [I/T]\n(MEET SOCIALLY)\nto regularly spend time with someone you have a romantic relationship with: [ I ] They dated for five years before they got married.\nAdd to word list\nAdd to word list\na particular day of a particular month, shown in numbers, or words and numbers: \"What date is the next meeting?\" \"It's Thursday, October 1st.\" The Danish government has set a date for a referendum on the matter. The decision on the merger will be taken at a later date .\nto date\nup to the present time: Some 3,800 pieces of the new software have been sold to date. See also\nafter date\naverage date\nbest-before date\nclosing date\ncompletion date\ndelivery date\ndrop-dead date\ndue date\neffective date\nexpiration date\nView all\nexpiry date\nmaturity date\nprompt date\npull date\nrecord date\nredemption date\nsell-by date\nsettlement date\nuse-by date\nyear to date\nto put a particular day's date on something: The demand must be dated and signed by the creditor. I write with reference to your letter dated 30 March."}