{"id":117641,"name":"dawning","type":"adjective","us_sound":"ˈdɑː.nɪŋ","us_link":"../audio/d/cdo0318usdawn1272.mp3","uk_sound":"ˈdɔː.nɪŋ","uk_link":"../audio/d/cdo0317dawnuk1044.mp3","content":"Add to word list\nAdd to word list\nstarting to happen or become known or obvious: There is a dawning realization that we cannot continue to deplete the planet. The dawning promise of replacement therapy has shifted his outlook on life.\nMore examplesFewer examples In the late 19th century, there was the dawning knowledge that the area around the Persian Gulf was rich with oil.She had the dawning recognition that a lot of people in the company weren't happy.You can see the dawning awareness of responsibility on Hank's face.\nSMART Vocabulary: related words and phrases\nAbout to happen\n(just) around the corner idiom\nabout\nat hand idiom\nbe on the point of (doing) something idiom\nbe ready to roll idiom\nbeckon\ncome up\ncorner\nhorizon\nimpending\nin the air idiom\nin the pipeline idiom\nin-store\nloom\nready\nstare\nstare someone in the face idiom\nstore\nteeter\nteeter on the brink/edge of something idiom\nSee more results »\nthe beginning of a period of time: the dawning of the digital age The steamboat was the dawning of a new day in travel in America.\nThesaurus: synonyms, antonyms, and examples\nthe start of somethingbeginningLet's go back to the beginning. Can you tell me when you arrived at the crime scene?startI didn't like him from the very start.endThis is it – the end of the tour. openingThe opening of the ceremony was marred by protest.commencementWhat is the commencement date of their contract?kick-offWhat time is the kick-off for the banquet and show?\nSee more results »\nMore examplesFewer examplesWith the dawning of the space age came an exciting but short-lived opportunity for women.In retrospect, this was the dawning of the fast-food industry in the country.Levels of atmospheric nitrogen have been more than doubled by humans since the dawning of the industrial age.\nSMART Vocabulary: related words and phrases\nBeginnings and starts\na baptism of/by fire idiom\nadvent\nbaptism\nbeginning\nbirth\ncommencement\ninitiation\nintroduction\njumping-off point\nkick off\nonset\nopening\noutbreak\nsquare\nstarter\nstarting time\nthe thin end of the wedge idiom\nthin\ntrigger\nzero hour\nSee more results »"}