{"id":116550,"name":"day","type":"noun","us_sound":"deɪ","us_link":"../audio/d/day.mp3","uk_sound":"deɪ","uk_link":"../audio/d/ukdatag015.mp3","content":"Add to word list\nAdd to word list\nA1 a period of 24 hours, especially from twelve o'clock one night to twelve o'clock the next night: January has 31 days. the days of the weekevery day He runs five miles every day. It took us almost a day to get here.the day before yesterday I saw him the day before yesterday.the day after tomorrow We leave the day after tomorrow.three/four/five/etc. days ago He was last seen alive five days ago.for days They haven't been seen for days (= for several days).in a few days/in a few days' time I'll be seeing Pat in a few days/in a few days' time. How's your day been? (= Have you enjoyed today?) Have a nice day!a big day I must get some sleep - I've got a big day (= an important day) tomorrow.\nA2 used to refer to the period in 24 hours when it is naturally light: a bright sunny dayall day It rained all day. These animals sleep during the day and hunt at night.\nA2 the time that you usually spend at work or at school: a normal working day I work a seven-hour day. We're having to work a six-day week to cope with demand. day off\na day when you do not have to work or do something that you normally do: I won't be in on Thursday - it's my day off.\nSee more the other day\nB1 a few days ago: Didn't I see you in the post office the other day?\nSee more these days\nA2 used to talk about the present time, in comparison with the past: Vegetarianism is very popular these days.\nSee more in those days\nB2 in the past: In those days people used to write a lot more letters.\nSee more any day now\nB2 very soon, especially within the next few days: The baby's due any day now.\nSee more by day\nwhen it is naturally light: I prefer travelling by day.\nSee more day after day\nB1 repeatedly, every day: The same problems keep coming up day after day.\nSee more day and night\nall the time: You can hear the traffic from your room day and night.\nSee more day by day\nB2 every day, or more and more as each day passes: Day by day he became weaker.\nSee more (from) day to day\nIf something changes (from) day to day, it changes often: The symptoms of the disease change from day to day.\nSee more from one day to the next\nbefore each day happens: I never know what I’ll be doing from one day to the next.\nSee more the days\nC1 a period in history: How did people communicate in the days before email?\nSee more to this day\nup to and including the present moment: To this day nobody knows what happened to him.\nSee more\nMore examplesFewer examplesI always like to leave my desk clear at the end of the day.We went to Edinburgh and back again all in one day.We're open every day except Sunday.She had five days off work due to illness.The soldiers marched 90 miles in three days.\nSMART Vocabulary: related words and phrases\nDays & times of day\nafternoon\nafternoons\nall day\nam\narvo\nhigh noon\nhour\nin broad daylight idiom\nin the dead of night/winter idiom\nlast orders\nnoon\nnoontime\no'clock\noffice hours\nopening time\nthe witching hour\nwhite night\nwine o'clock\nworkday\nworking day\nSee more results »\nGrammar\nNowadays, these days or today?We can use nowadays, these days or today as adverbs meaning ‘at the present time, in comparison with the past’: …\nIdioms\nall in a day's work\nthe best/happiest days of your life\nday in day out\nsomeone's/something's days are numbered\nhave had its/your day\nhave your day in court\nin all my (born) days\nin my day\nin this day and age\nit's not every day (that)...\nMore idioms\nmake someone's day\nnot be someone's day\noh my days!\nthe old days\none of these days\none of those days\none/some day\ntake it one day at a time/take each day as it comes\nthat'll be the day\nthose were the days\nto the day\nAdd to word list\nAdd to word list\na period of 24 hours, esp. from 12 o’clock one night to 12 o’clock the next night, or the part of this period after the sun rises but before it goes down, when there is light: My husband picks up our son every day after school. In summer the days are longer and we have cookouts in the backyard. We leave on vacation the day after tomorrow.\nA day is also the part of a period of 24 hours that you spend at work: He’s been working 12-hour days this week.\nDays can mean a long period of time: In those days (= that period in history), people had large families. Idioms\nday after day\nday and night\nday by day\nday in, day out"}