{"id":117777,"name":"deadlock","type":"noun","us_sound":"ˈded.lɑːk","us_link":"../audio/d/deadlock.mp3","uk_sound":"ˈded.lɒk","uk_link":"../audio/d/ukddt__012.mp3","content":"deadlock noun\n(SITUATION)\nAdd to word list\nAdd to word list\n[ S or U ] a situation in which agreement in an argument cannot be reached because neither side will change its demands or accept any of the demands of the other side: Somebody will have to compromise if we are to break (= end) the deadlock between the two warring factions. Once again the talks have ended in deadlock. Deadlock over wage levels has prevented an agreement being reached. Synonym\nstalemate\nSMART Vocabulary: related words and phrases\nDifficult situations and unpleasant experiences\na (heavy) cross to bear idiom\na rough ride idiom\nadversity\nat your worst idiom\nAugean\nbad hair day\ncrunch\nemergence\ngenie\ngrief\nhave a bumpy ride idiom\nhave someone over a barrel idiom\nhell\nhell on earth idiom\nreversal\nrigour\nrollercoaster\nrub\nthe Augean Stables idiom\nvortex\nSee more results »\ndeadlock noun\n(LOCK)\n[ C ] a lock that is inside the edge of a door, so that it cannot be seen or removed when the door is closed See also\nmortise lock\nSMART Vocabulary: related words and phrases\nBuilding: locks & locksmithing\nbolt\ncatch\ncombination\ncombination lock\ndeadbolt\nfastener\nfastening\nfob\nkey fob\nkey ring\nkeycard\nkeyhole\nkeysafe\nlock\nlocksmith\nmaster key\nmortise lock\npadlock\npasskey\nYale lock\nSee more results »\nAdd to word list\nAdd to word list\na state or situation in which agreement in an argument cannot be reached because neither side will change its demands or accept the demands of the other side: [ U ] The long deadlock over clean air legislation has been broken.\nAdd to word list\nAdd to word list\na situation in which people cannot agree and no progress can be made: a deadlock between sb (and sb) There was deadlock between the directors and the negotiating committee.a deadlock in sth The deadlock in the talks meant that the dispute was taken to arbitration.a deadlock on/over sth There was a legislative deadlock over how to reduce property taxes.end in/reach deadlock Nurses went on strike after pay talks ended in deadlock.break/end a deadlock Bosses have been in intense negotiations with employees to break a deadlock over the proposed pay cuts."}