{"id":117774,"name":"deadline","type":"noun","us_sound":"ˈded.laɪn","us_link":"../audio/d/deadline.mp3","uk_sound":"ˈded.laɪn","uk_link":"../audio/d/ukddt__010.mp3","content":"Add to word list\nAdd to word list\nB2 a time or day by which something must be done: There's no way I can meet that deadline. We're working to a tight deadline (= we do not have much time to finish the work). I'm afraid you've missed the deadline - the deadline for applications was 30 May.\nMore examplesFewer examplesThe end of the year was their self-imposed deadline for finishing the building work.The final deadline for submissions is 21 February.Now that the deadline is approaching we all feel under pressure.Do you think we will be able to meet our deadline?We haven't got a hope in hell of meeting such a tight deadline.\nSMART Vocabulary: related words and phrases\nSchedules & agendas\nagenda\nAOB\nbusiness plan\ncalendar\ndatebook\nHegira\nHejira\nitinerary\njournal\nmake time idiom\npack\nprogramme\nschedule\nset the agenda idiom\nslot\nslot someone/something in\nspread\nspread something over something\nsqueeze\nsqueeze someone/something in\nSee more results »\nAdd to word list\nAdd to word list\na time or day by which something must be done: The deadline for filing income taxes is April 15th.\nAdd to word list\nAdd to word list\nthe time or date by which something must be done: The application deadline is February 16.a deadline of March 21/5 o'clock/next Thursday, etc. We have already agreed a deadline of July 1 2011.a July/Monday/midnight deadline 900,000 applications were handed in by yesterday's noon deadline. The deadline for bids was yesterday lunchtime.a deadline to do sth They have been given a 12-month deadline to create a plan for the region.a strict/tight deadline We had a very tight deadline to keep to on the project and things were getting tense.set/give a deadline They have set us a deadline of 30 July to pay the money.meet/make a deadline She was worried that they would not meet the deadline and that penalties would be imposed. We hit delays and asked to extend the deadline. If you miss the deadline your application cannot be considered.a deadline approaches/looms The deadline was looming and things were getting tense in the office."}