{"id":117827,"name":"deal","type":"noun","us_sound":"diːl","us_link":"../audio/d/deal.mp3","uk_sound":"diːl","uk_link":"../audio/d/ukddt__020.mp3","content":"deal noun\n(AGREEMENT)\nAdd to word list\nAdd to word list\nB2 [ C ] an agreement or an arrangement, especially in business: a business deal The unions and management have made a two-year pay and productivity deal. I'll make/do a deal with you - you wash the car and I'll let you use it tonight. She got a good deal (= paid a low price) on her new house. Is industry getting a raw/rough deal from (= being unfairly/badly treated by) the EU?\nThesaurus: synonyms, antonyms, and examples\na decision or arrangement between groups or peopleagreementDo we have an agreement?understandingWe had an understanding that the businesses would merge, but never got that in writing.gentleman's agreementHe and his builder have a gentleman's agreement that if there are spare materials left after working on the flat, the builder can take them home.dealDo we have a deal?contractThe basketball player was signed to a multimillion-dollar contract with a new team this week.accordThe leaders of the four countries signed a peace accord.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nsomething that is cheapbargainAnyone prepared to play a waiting game could bag a real bargain.giftAt one hundred pounds, this phone is a gift.snipUK Afternoon tea is a snip at £10 per head.good buyWoven cotton and linen are also a good buy.good dealYou may be able to get a better deal from your own bank.\nSee more results »\nMore examplesFewer examplesThey backed out of the deal the day before they were due to sign the contract.Do you think the government should try to strike a deal with the terrorists?We won't be able to make a profit on the deal unless we raise the sale price.After some tough bargaining, we finally agreed on a deal.Our firm could lose a lot of money if the deal is unsuccessful.\nSMART Vocabulary: related words and phrases\nBusiness - general words\naddressable\naddressable market\nAge of Exploration\namortizable\nanti-commercial\ncontract something out\ncontractual\ncontractually\ncoopetition\ncop\nIPO\nlean\nleanly\nlock something in\nm-commerce\ntransact\nuberization\nultra-commercial\nunbranded\nuncommercialized\nSee more results »\ndeal noun\n(AMOUNT)\na good/great deal\nB2 a large amount: She spends a good deal of her time in China.\nSee more\ndeal noun\n(SHARING OUT)\n[ C ] the act of dealing (= sharing out) something, especially playing cards: It's your deal (= turn to deal).\nSMART Vocabulary: related words and phrases\nCard games\nall in\nbidding\nbridge\nbusted flush\ncanasta\ncard sharp\ndealer\ndiamond\nflush\nhonour\njack\npool\nre-raise\nrebid\nrecut\nrookie card\nroyal flush\nsolitaire\nspade\nstraight\nSee more results »\ndeal noun\n(WOOD)\n[ U ] the pale, soft wood of a pine or fir tree (= types of tree that do not lose their leaves), used for making furniture, etc.: The book cases were made of deal. a deal table\nMore examplesFewer examplesThey were made of deal but stained to look darker.Deal was used for the seats, with oak for the seat rails. cheap deal furniture with a mahogany finisha simple deal bench\nSMART Vocabulary: related words and phrases\nTypes of wood\nAmerican elm\nAtlantic white cedar\nbalk\nbalsa wood\nbark\nbasswood\nblack locust\nboxwood\ncork\nelm\nknotty\nMDF\nmulga\npaulownia\npiny\npitch pine\nponderosa pine\npost oak\nsoftwood\nthree-ply\nSee more results »\nGrammar\nMuch, a lot, lots, a good deal: adverbsWe use much, a lot, lots and a good deal as adverbs to refer to frequency, quantity and degree. …\nMuchWe use much in questions and negative clauses to talk about degrees of something. We put it in end position: …\nA lot, a good deal and a great dealWe can use a lot, a good deal and a great deal as adverbs of frequency, quantity or degree: …\ndeal verb [I or T]\n(DO BUSINESS)\nto do business: We only deal with companies which have a good credit record.slang How long had she been dealing (= selling drugs) before she was arrested?slang He was suspected of dealing (= selling) cocaine.\nMore examplesFewer examplesHe was picked up by the police for drug dealing.He proposed dealing directly with the suppliers.Make sure you are dealing with a bona fide company.They have always dealt honestly and fairly with their customers.Drug dealing is punishable by death in some countries.\nSMART Vocabulary: related words and phrases\nBusiness - general words\naddressable\naddressable market\nAge of Exploration\namortizable\nanti-commercial\ncontract something out\ncontractual\ncontractually\ncoopetition\ncop\nIPO\nlean\nleanly\nlock something in\nm-commerce\ntransact\nuberization\nultra-commercial\nunbranded\nuncommercialized\nSee more results »\ndeal verb [I or T]\n(SHARE OUT)\nto give or share out something, especially playing cards: Whose turn is it to deal? Would you like to deal (out) the cards? [ + two objects ] Deal them five cards each./Deal five cards to each of them. We have only a small amount of food and clothing to deal out to each refugee. deal a blow to someone/something (also deal someone/something a blow)\nto cause someone or something, usually a plan or hope, to fail or to be affected very badly: The latest trade figures have dealt a severe blow to hopes of an early economic recovery.\nSee more\nMore examplesFewer examplesHe had psychotherapy to help him deal with his childhood traumas.\nSMART Vocabulary: related words and phrases\nCard games\nall in\nbidding\nbridge\nbusted flush\ncanasta\ncard sharp\ndealer\ndiamond\nflush\nhonour\njack\npool\nre-raise\nrebid\nrecut\nrookie card\nroyal flush\nsolitaire\nspade\nstraight\nSee more results »\nPhrasal verbs\ndeal in something\ndeal with someone\ndeal with something\ndeal noun\n(AGREEMENT)\nAdd to word list\nAdd to word list\n[ C ] an agreement or arrangement, esp. in business: They bargained with each other but finally agreed to a deal. She got a really good deal (= paid a low price) on her new car.\ndeal noun\n(AMOUNT)\n[ U ] a large amount or very much: She used to talk a great deal about her childhood in Indiana.\ndeal noun\n(GIVING OUT)\n[ C ] a turn to give out playing cards: It’s your deal.\ndeal verb [I/T]\n(HAVE AGREEMENT)\nto do business with or be involved with someone or something: [ I ] We only deal with companies that have a good credit record. [ I ] They mainly deal in (= buy and sell) mutual funds.\ndeal verb [I/T]\n(GIVE OUT)\nto give or give out something, esp. playing cards: [ I/T ] Whose turn is it to deal (the cards)? [ T ] fig. Tonight’s defeat dealt a blow to (= damaged) her hopes of making it to the finals. Phrasal verbs\ndeal with someone/something\ndeal with something\nAdd to word list\nAdd to word list\nan agreement or arrangement made between two people or companies: do/make a deal A spokeswoman for the agency said they would not give any further information until they are close to making a deal.cut/strike a deal After several weeks of talks no deal has been struck.close/seal a deal They anticipate closing the deal in 60 to 90 days, pending environmental and financial reviews.back out of/pull out of a deal He suspected them of trying to back out of the deal. Green only goes into business deals if he can see a way of turning a problem into a profit. The President's team has been very active in pushing trade deals. We did a great deal with our suppliers. The proposed deal between the two companies had fallen through.a £20 million/$14bn, etc. deal Stannard bought the company in a £20 million deal.a deal to do sth This week the company concluded a deal to sell 313 of its stores.\na good, or lower than usual, price: a good/excellent, etc. deal I got a good deal on my new phone contract.a deal on sth The hotel also offers deals on the hire of bicycles.\na done deal\nan agreement or arrangement that has been made and is now certain to happen: The takeover is far from a done deal. See also\nbought deal\ncash deal\npackage deal"}