{"id":117846,"name":"dealing","type":"noun","us_sound":"ˈdiː.lɪŋ","us_link":"../audio/d/cdo0318usdeal1281.mp3","uk_sound":"ˈdiː.lɪŋ","uk_link":"../audio/d/cdo0318ukdeal0397.mp3","content":"Add to word list\nAdd to word list\n[ U ] the activity of selling illegal drugs: There's dealing going on in our streets, right outside our houses. The two men were convicted of dealing. cocaine/heroin dealing\n[ C or U ] the activity of buying and selling shares, or a sale of shares: The London Stock Exchange embraced computer-based dealing. Dealings should have been disclosed by 12 noon on the business day following the relevant dealing.\n[ U ] activities involving buying and selling or business in general: The course promised to teach the art of property dealing. dealings\n[ plural ] activities involving other people, especially in business: Have you had any dealings with their Paris office?\nSee more\nMore examplesFewer examplesHe told his sister he had been involved in dealing and he wanted to get out.possession of drugs for the purposes of dealingTruancy can lead to worse problems, such as abusing drugs or dealing.an economically depressed area steeped in meth dealingShort selling is where market makers do not have access to loan stocks at the time of dealing. Consumers have a right to expect fair dealing.\nSMART Vocabulary: related words and phrases\nDrugs - general words\nabstinence\nabstinence-only\nbindle\nbiosimilar\nchase\nnon-intoxicant\nnon-intoxicating\nnondrug\npeddler\nperformance-enhancing\npharmacopoeia\npill-popping\nshoot\nspike\nspliff\nspliff up\nsubstance\nsubstance abuse\nwhacked\nwiped out\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStock markets\nBusiness - general words\nAdd to word list\nAdd to word list\nFINANCE, STOCK MARKET the activity of buying and selling shares, currencies, etc.: share/currency dealing Online share dealing has grown dramatically over the past few years. Towards the end of the day there was another round of heavy dealing in the company's shares.\na way of doing business: fair/honest dealing Our company maintains a reputation for fair dealing in all its transactions.dodgy/shady dealing Many institutions have been badly damaged by dodgy corporate dealing.\ndealings\n[ plural ] business activities involving other people: They suspended all dealings with the company when the falsification scandal was revealed.business/financial dealings She protested that her business dealings with the company had been completely legitimate. His agent told us that he had never met or had any dealings with her.in his/her/your dealings with sb/sth The code says officials must be \"courteous, objective, and impartial\" in their dealings with the public. See also\ndouble dealing\ninsider dealing\nwheeling and dealing"}