{"id":117896,"name":"dear","type":"adjective","us_sound":"dɪr","us_link":"../audio/d/dear.mp3","uk_sound":"dɪər","uk_link":"../audio/d/ukddt__026.mp3","content":"dear adjective\n(LOVED)\nAdd to word list\nAdd to word list\nB2 loved or liked very much: She was a very dear friend. He was very dear to me. This place is very dear to me - we came here on our honeymoon. What a dear (= very attractive) little kitten! My dear Gina - how nice to see you!\nA1 used at the beginning of a letter to greet the person you are writing to: Dear Kerry/Mum and Dad/Ms Smith/Sir\nMore examplesFewer examplesWe will always remember our dear departed friends.In loving memory of my dear husband, who departed this life on 5 May, 1978.My dear daughter arranged this whole holiday for me.Emily is such a dear, kind person - she would never hurt anyone.Look what those dear boys have bought me for my birthday!\nSMART Vocabulary: related words and phrases\nLoving and in love\nabsence\nabsence makes the heart grow fonder idiom\nadore\nadoring\nadoringly\nadorkable\ndotty\nendearment\never-loving\nfall for someone\nfall in love idiom\nlurve\nmadly\nmoon\nmoon over someone/something\npash\nshine\nsteal\ntreasure\nworship\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWritten greetings\ndear adjective\n(EXPENSIVE)\nmainly UK comparative dearer | superlative dearest costing too much: The food was good but very dear. Synonym\nexpensive\nThesaurus: synonyms, antonyms, and examples\ncosting a lot of moneyexpensiveHe thinks he's special with his expensive suits and fancy shoes.dearUK I find the veg too dear in that supermarket.costlyThey made several costly mistakes, including spending $60 million on shoddy machinery. priceyThe restaurants in town are a bit pricey.exclusiveThey have an apartment in an exclusive part of town.\nSee more results »\nSMART Vocabulary: related words and phrases\nCosting too much\na bottomless pit idiom\nbottomless\ncapital intensive\ncheap at half the price idiom\nclobber\ncost an arm and a leg/a small fortune idiom\ncost someone a pretty penny idiom\ncost someone dear idiom\ndaylight robbery\ngouge\nnon-competitive\nout of sight idiom\noutprice\novercharge\npretty\nprice fixing\nprice someone out\nprice yourself out of the market idiom\nsight\nsky-high\nSee more results »\nIdiom\nfor dear life\nA2 used in expressions of anger, disappointment, sadness, or surprise: Oh dear! I've lost my keys again. Dear me, it's already 4.30 and I said I'd be home by 5.00! Dearie me, what a mess!\nSMART Vocabulary: related words and phrases\nLinguistics: interjections\naiyo\nattaboy\nattagirl\nauf Wiedersehen\naw shucks\ndoctor\neat your heart out idiom\nfigure\nmazel tov\nmore\nmore power to your elbow! idiom\nneed\nneed I say more? idiom\nperiod\nsmall wonder idiom\nthe rest is history idiom\nyou should have seen/heard something/someone idiom\nyou the man! idiom\nyuk\nyum yum\nSee more results »\n[ C usually singular ] informal a kind person: Annie's such a dear - she's brought me breakfast in bed every morning this week.\n[ as form of address ] used to address someone you love or are being friendly to, not used between men: Here's your receipt, dear. Would you like a drink, dear? Lovely to see you, my dear.\nSMART Vocabulary: related words and phrases\nPeople having good qualities\nadvertisement\naltruist\nangel\nbeatify\nbrick\nbunch\nenchantress\ngem\njewel\nmensch\nnot be as black as you are painted idiom\nparagon\npoppet\nrough diamond\nsaint\nsalt\nsalt of the earth idiom\nsoftie\nsweetheart\ntreasure\nSee more results »\ndear adjective [-er/-est only]\n(LOVED)\nAdd to word list\nAdd to word list\nloved or greatly liked: She’s a dear friend.\nDear is used at the beginning of a letter to greet the person you are writing to: Dear Kerrie/Mom and Dad/Ms. Smith/Sir\nDearest can be used in a letter to greet someone you love: Dearest Ben, I think of you every day.\ndear exclamation\n(EXPRESSION)\nused to express annoyance, disappointment, unhappiness, or surprise: Oh dear! I’ve lost my keys again.\ndear noun [C]\n(LOVED PERSON)\na person who is loved or greatly liked: Annie’s such a dear.\nDear is used to address someone in a friendly way, esp. someone you love or a child: Have something to eat, dear.\nAdd to word list\nAdd to word list\nexpensive: Tourist restaurants are too dear for the locals.\ncost sb dear\nto cause someone to have a lot problems or to lose a lot of money: The Government's lack of knowledge about IT systems has undoubtedly cost it dear."}