{"id":118013,"name":"debate","type":"noun","us_sound":"dɪˈbeɪt","us_link":"../audio/d/eus75520.mp3","uk_sound":"dɪˈbeɪt","uk_link":"../audio/d/ukdeath012.mp3","content":"Add to word list\nAdd to word list\nB2 [ C or U ] (a) serious discussion of a subject in which many people take part: Education is the current focus of public debate. How we proceed from here is a matter for debate. Over the year we have had several debates about future policy.\n[ C ] a competition in which teams of people, often students, discuss a subject and the team that is judged to make the best arguments wins: The team won their Round 3 debate against Mitcham Girls High School. The students were taking part in a debate contest.\nMore examplesFewer examplesThe debate completely changed course after Liz made her speech.The debate about food safety has engaged the whole nation.She issued a challenge to her rival candidates to take part in a public debate.The prison riots have sharpened the debate about how prisons should be run.This proposal will almost certainly spark another countrywide debate about how to organize the school system.His team won the national high school debate championship.\nSMART Vocabulary: related words and phrases\nDebate & discussion\nagent provocateur\nargue\nargue against something\nargue for something\nbargain\nbargainer\nbat around\ncontroversial\ncontroversialist\nfloat\nhash\nout-debate\noutbargain\npalaver\npanel discussion\npolarized\nsophism\ntendentious\nwash (something) up\nwell argued\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCompetitions, & parts of competitions\nC2 [ I or T ] to discuss a subject in a formal way: In Parliament today, MPs debated the Finance Bill. They had been debating for several hours without reaching a conclusion. [ + question word ] The authorities debated whether to build a new car park.\nThesaurus: synonyms, antonyms, and examples\nto talk about somethingtalk aboutI don't like talking about my feelings.speak aboutHe is often asked to speak about the decline of global energy supplies.discussWe need to discuss arrangements for next week.talk overI need to talk it over with my wife before I accept the job.talk throughWe're used to talking things through, so we don't have many arguments.debateThe bill will be debated in parliament next week.\nSee more results »\n[ T ] to try to make a decision about something: [ + question word ] We debated whether to take the earlier train. I'm still debating what colour to paint the walls.\nMore examplesFewer examplesThe matter was hotly debated in all the towns of the realm.There was no seconder for the motion so it could not be debated.The ethics of journalism are much debated.They were debating the proposition that 'All people are created equal'.I'm still debating whether to take the job or not.\nSMART Vocabulary: related words and phrases\nDebate & discussion\nagent provocateur\nargue\nargue against something\nargue for something\nbargain\nbargainer\nbat around\ncontroversial\ncontroversialist\nfloat\nhash\nout-debate\noutbargain\npalaver\npanel discussion\npolarized\nsophism\ntendentious\nwash (something) up\nwell argued\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThinking and contemplating\nRelated word\ndebater\nAdd to word list\nAdd to word list\nEnglish a discussion, esp. one in which several people with different opinions about something discuss them seriously, or the process of discussing something: [ U ] Education is always a topic of interest and public debate. debate verb [ I/T ] us\nYour browser doesn't support HTML5 audio\n/dɪˈbeɪt/\n[ I ] Congress debated for several hours without reaching a vote."}