{"id":117987,"name":"debark","type":"verb","us_sound":"ˌdiˈbɑːrk","us_link":"../audio/d/cdo0318usdeba1284.mp3","uk_sound":"ˌdiˈbɑːk","uk_link":"../audio/d/cdo0318ukdeba0399.mp3","content":"debark verb\n(GET OFF)\nAdd to word list\nAdd to word list\n[ I ] to leave a ship, aircraft, etc. after a journey: We boarded a train, and an hour later we debarked on the outskirts of the city. Synonym\ndisembark\nMore examplesFewer examplesHer immigrant grandfather debarked in Boston at 16 a century ago without money and speaking no English.They debark from employee shuttle buses and step smartly through the terminal.Black-and-white snapshots showed Gary Cooper and Errol Flynn debarking onto the tarmac, waving into flashbulbs. The ship arrived in Havana at night, but the passengers were told that they would not be allowed to debark.\nSMART Vocabulary: related words and phrases\nBoarding and alighting from modes of transport\naboard\nbestride\nboard\nclimb\ndeplane\ndisembark\ndisembarkation\ndismount\neject\nembarkation\nentrain\nget\nget off\nget on\nget out\nhop\nin\nmount\nsettle\nstraddle\nSee more results »\ndebark verb\n(REMOVE BARK)\n[ T ] to remove bark (= the hard outer covering) from a tree: Cork trees are debarked every nine years to make wine bottle corks.\nMore examplesFewer examplesThe company was not following quarantine requirements, because it was making firewood products from ash trees in the quarantine areas without debarking them as required.Tusks are used to dig for water, salt, and roots and to debark trees to eat the bark. Tree guards are used to deter voles from debarking the base of a tree.\nSMART Vocabulary: related words and phrases\nRemoving and getting rid of things\nabandonment\nbanish\nbe scattered to the four winds idiom\nbin\ncast someone/something aside/away/off\nelimination\nerase\nevacuation\nexorcism\nexpunge\nexpurgate\nexpurgated\nshrug something off\nshuck\nshuck something off\nshuffle something off\nsling\nsling someone out\ntoss\nturf\nSee more results »"}