{"id":118072,"name":"debit","type":"noun","us_sound":"ˈdeb.ɪt","us_link":"../audio/d/debit.mp3","uk_sound":"ˈdeb.ɪt","uk_link":"../audio/d/ukdeath019.mp3","content":"Add to word list\nAdd to word list\nB2 (a record of) money taken out of a bank account: The account was in debit at the end of the month (= more money had been spent than was in the account at that time). Debits are shown in the left-hand column. Opposite\ncredit (MONEY)\nSMART Vocabulary: related words and phrases\nWithdrawing money\natm\nautomated teller machine\nautomatic teller machine\ncash machine\ncashback\ncashpoint\nclear\nclearance\ndip into something\ndraw\ndraw something down\ndrawdown\ndrawn\nhole in the wall\nlay\noverdraw\noverdrawn\ntake something out\nwithdraw\nwithdrawal\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBanks\nB2 to take money out of an account or keep a record of this: The bank debited my account. The bank debited the money from my account. The unauthorized borrowing fee will be debited to your account. Opposite\ncredit\nSMART Vocabulary: related words and phrases\nWithdrawing money\natm\nautomated teller machine\nautomatic teller machine\ncash machine\ncashback\ncashpoint\nclear\nclearance\ndip into something\ndraw\ndraw something down\ndrawdown\ndrawn\nhole in the wall\nlay\noverdraw\noverdrawn\ntake something out\nwithdraw\nwithdrawal\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBanks\nAdd to word list\nAdd to word list\nmoney taken out of a financial account, or a record of money taken debit verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈdeb·ət/\nWe have debited your account $30.\nAdd to word list\nAdd to word list\n[ C ]\n&#160; BANKING an amount of money that is taken out of a bank account, etc.: Once your contract with them ends, the company should no longer take monthly debits from your account. The statement showed a debit of £350 on January 22. Compare\ncredit\n[ U ]\n&#160; BANKING the system of taking money from a bank account, etc., for example, by using a debit card: When you swipe your card at the checkout line, you'll be asked if you want to pay by debit or credit. debit payment/transaction/purchase I had lost the original invoice but I still had the debit receipt. See also\ndirect debit\n[ C ]\n&#160; ACCOUNTING\n&#160; (abbreviation Deb); (deb) an amount recorded that is recorded in a company's financial accounts which represents money that has been used to pay an expense or buy an asset. In double-entry bookkeeping debits are recorded on the left-hand side (= the debit side) of the accounts: One of the principles of accounting is that the debits recorded in a ledger should equal or balance the credits in it. Compare\ncredit\nin debit\nBANKING if a bank account, etc. is in debit, more money has been taken out of it than was originally put into it or paid: These transactions had put his account in debit.\nBANKING to take or pay money out of a bank account, etc.: Your account will be debited as soon as your order has been shipped.debit an account/card with sth By agreeing to these conditions, you give permission for us to debit your credit card with the amount stated above.debit sth from sb’s account She later discovered that the bank had accidentally debited $517.23 from her account twice.\nACCOUNTING to record an amount in a company's financial accounts which represents money that has been used to pay an expense or buy an asset. In double-entry bookkeeping this is done on the left-hand side (= the debit side) of the accounts.\nCompare\ncredit"}