{"id":118143,"name":"debt","type":"noun","us_sound":"det","us_link":"../audio/d/debt.mp3","uk_sound":"det","uk_link":"../audio/d/ukdeath023.mp3","content":"Add to word list\nAdd to word list\nB2 something, especially money, that is owed to someone else, or the state of owing something: He managed to pay off his debts in two years. The company ran up huge debts. They are in debt to (= owe money to) the bank. He got into debt (= borrowed money) after he lost his job. The company is deep in debt (= owes a lot of money). See also\nindebted (OWING)\nMore examplesFewer examplesThe national debt stands at 55 billion dollars.He had to borrow money to pay off his gambling debts.She keeps running up huge debts and asking friends to bail her out.They piled up such a huge debt that they soon went bankrupt.His economic policies have won widespread praise for reducing government debt.\nSMART Vocabulary: related words and phrases\nBorrowing & lending\namortizable\namortization\nbad debt\nbonded\nborrow\nborrow something from something\nbridging loan\ncredit limit\nforeclose\nhole\nliquidator\nloan\nnon-prime\nnonaccrual\non the slate idiom\nover-borrowed\noverpay\noverpayment\npay someone/something back\nreceivership\nSee more results »\nIdiom\nowe a debt of gratitude/thanks\nAdd to word list\nAdd to word list\nsomething owed, esp. money: He managed to pay off his debts in two years.\nIf you are in debt, you owe money: We seem to be perpetually in debt.\nIf you go into debt, you borrow money. Idiom\nin someone’s debt\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; FINANCE the amount of money that is owed by a person, company, country, etc. and that they usually have to pay interest on: Financing will consist of $200 million of debt in the form of a five-year term loan. Companies become insolvent because they cannot pay their debts.amass/incur/run up a debt of Investors fear the insurance company will have amassed debts of more than €22.5 million by the end of the year.repay/pay off/clear a debt When applying for a loan, customers may be required to prove their ability to repay the debt.settle/resolve/retire a debt The country's foreign exchange reserves were adequate to settle the entire debt this year.cut/pay down/reduce a debt Our credit counselors will work with you to help you to reduce your debt.refinance/reschedule/restructure a debt The plan also includes restructuring of long-term debts at lower interest rates.write off/cancel a debt State law allows cities to write off uncollectable debts with the approval of the city council. If the market does not improve, these businesses may not be able to service their debts, and we may see more bankruptcies. This arrangement is useful for those who need to consolidate their debts .be burdened/saddled with debt(s) Young college graduates are saddled with crippling debts.\n[ U ] the situation of owing money, or of not having enough money to pay what you owe: consumer/corporate/federal debt Consumer debt is high, with record-level defaults on credit cards and mortgage loans. Now solvent, the conglomerate was $14 billion in debt when Jones took over as the new CEO.fall/get/go into debt With college tuition and housing prices rising, more and more families are falling into debt.get/keep/stay out of debt By setting up a debt repayment plan he was able to pay off his creditors and stay out of debt for good. See also\nbad debt\nbank debt\nbook debt\nconsumer debt\ncorporate debt\ndoubtful debt\nexternal debt\nfloating debt\nforeign debt\njudgment debt\njunior debt\nlong-term debt\nmedium-term debt\nnational debt\npublic debt\nsecured debt\nsenior debt\nshort-term debt\nsovereign debt\nThird World debt\ntrade debt\nunsecured debt"}