{"id":118176,"name":"debut","type":"noun","us_sound":"deɪˈbju","us_link":"../audio/d/debut.mp3","uk_sound":"ˈdeɪ.bju","uk_link":"../audio/d/ukdeath027.mp3","content":"Add to word list\nAdd to word list\nC1 the occasion when someone performs or presents something to the public for the first time: make your debut She made her professional stage debut in Swan Lake.make your debut as something He started as an actor, making his debut as a director in 1990. her debut (= first) album\nMore examplesFewer examplesTiger Woods is determined to erase the memory of a disappointing Cup debut two years ago.Her new detective series will be her debut on the small screen.Five years after her debut, the diminutive star of the Royal Ballet has the world at her feet.It was a dream start for the young player who scored twice on his debut for the club.Maazel studied in Pittsburgh, making his debut as a violinist in 1945 and as a conductor in 1953.\nSMART Vocabulary: related words and phrases\nFirst and firstly\nat first blush idiom\nat first idiom\nbegin\nblush\nfirst come, first served idiom\nfrom the word go idiom\nfront end\nin the first/second place idiom\ninaugural\ninitial\ninitially\nplace\nprefatory\nprimary\nproto-\nprototypical\nstart\nstarter\nto begin with idiom\nword\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema & theatre: acting, rehearsing & performing\nto perform or appear in public, or to be shown or introduced to the public, for the first time: The Broadway show debuted last year to great acclaim. The museum recently debuted a brand-new, never-before-seen exhibit, \"Living in Space.\"\nSMART Vocabulary: related words and phrases\nCinema & theatre: acting, rehearsing & performing\nact out\namateur theater\nappear\nappearance\nblocking\ncamp\nchew\nchew the scenery idiom\nimprovisation\ninterpreter\nre-enact\nre-enactment\nrecreation\nrep\nstage business\nstage fright\nunderstudy\nvoice acting\nwalk\nwalk through something\nSee more results »\nAdd to word list\nAdd to word list\na first public appearance or activity: Cassavetes made his film debut in “Taxi” in 1953. debut verb [ I/T ] us\nYour browser doesn't support HTML5 audio\n/ˈdeɪ·bju, deɪˈbju/\n[ T ] I’ll be debuting this song next Saturday night.\nAdd to word list\nAdd to word list\nthe first time that something appears in public, or that a product, service, or shares become available to buy: Shares in the company rose 12% on their stock market debut.\nif a company debuts a product, service , or share, or if it debuts, it becomes available to the public for the first time: The company has recently debuted its new website. Drug discount cards, approved by Medicare, debuted last year."}