{"id":118235,"name":"decay","type":"verb","us_sound":"dɪˈkeɪ","us_link":"../audio/d/decay.mp3","uk_sound":"dɪˈkeɪ","uk_link":"../audio/d/ukdecad014.mp3","content":"Add to word list\nAdd to word list\nB2 [ I or T ] to become gradually damaged, worse, or less; to cause something to do this: Sugar makes your teeth decay. The role of the extended family has been decaying for some time. Pollution has decayed the surface of the stonework on the front of the cathedral. the smell of decaying meat\n[ I ]\n&#160; physics\n&#160; specialized If a radioactive substance decays, it changes to a different form, producing radiation: Radioactive uranium decays into stable lead at a known rate. As the actinium-225 decays, it gives off short-lived, highly energized alpha particles.\nMore examplesFewer examplesFloating in the dirty river were dead fish, already starting to decay.The bacteria live on food particles and produce acid that decays the enamel on your teeth.The flesh on a dead body decays very rapidly.It's sad to watch a beautiful rose wither and decay in such a short time.Plants and animals decay into the soil, replenishing the minerals and nutrients.\nSMART Vocabulary: related words and phrases\nDecaying and staying fresh\nbest-before date\nbiodegradable\nbiodegrade\ncompost\ndecompose\ndecomposition\nmouldy\nnonperishable\nnutrient cycling\nout of date\nperish\nperishable\nrack\nseed\nsell-by date\nshrivel\nshrivelled\nsoft rot\nspoil\nwithered\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDeteriorating and making worse\nPhysical & chemical processes\nPhysics: radiation & radioactivity\nC2 the process of decaying: environmental/industrial/moral/urban decay dental/tooth decay The buildings had started to fall into decay. This industry has been in decay for some time.\nphysics\n&#160; specialized the process by which a radioactive substance changes to a different form, producing radiation: Radon is emitted in the natural decay of radioactive materials in rock and soil. the decay rate of beryllium-7\nMore examplesFewer examplesMany children come to us with severe dental decay.Unemployment and inner city decay are inseparable issues which must be tackled together.Sugar is a major cause of tooth decay.The mansion had an atmosphere of genteel elegance and decay.Areas of the most serious urban decay are to receive funds for new building and redevelopment schemes.\nSMART Vocabulary: related words and phrases\nDecaying and staying fresh\nbest-before date\nbiodegradable\nbiodegrade\ncompost\ndecompose\ndecomposition\nmouldy\nnonperishable\nnutrient cycling\nout of date\nperish\nperishable\nrack\nseed\nsell-by date\nshrivel\nshrivelled\nsoft rot\nspoil\nwithered\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysical & chemical processes\nPhysics: radiation & radioactivity\nAdd to word list\nAdd to word list\ndamage, or a state that becomes gradually worse: The dentist says I have a lot of tooth decay. There’s still too much crime, poverty, and decay in the neighborhood. Your attitude just contributes to the growing social decay.\ndecay noun [U]\n(PROCESS)\nphysics us/dɪˈkeɪ/ the process by which a radioactive substance breaks down and sends out harmful radiation decay verb [ I/T ] us\nYour browser doesn't support HTML5 audio\n/dɪˈkeɪ/\n[ I ] City services are rapidly decaying. decaying adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/dɪˈkeɪ·ɪŋ/\nEmpty lots stand next to abandoned, decaying buildings."}