{"id":118513,"name":"decent","type":"adjective","us_sound":"ˈdiː.sənt","us_link":"../audio/d/decent.mp3","uk_sound":"ˈdiː.sənt","uk_link":"../audio/d/ukdecad027.mp3","content":"Add to word list\nAdd to word list\nB2 socially acceptable or good: Everyone should be entitled to a decent wage/standard of living. I thought he was a decent person. It was very decent (= kind) of you to help. It made quite a decent-sized (= large) hole. After the recent scandal, the priest is expected to do the decent thing and resign from his position.\nThesaurus: synonyms, antonyms, and examples\nmorally rightgoodShe is a good woman who goes out of her way to help others.virtuousI believe that humans are, despite their flaws, capable of virtuous conduct.righteousHe refused to stray from the righteous path.honestHe was a hardworking, honest family man who was only trying to do his duty.upstandingI’m sure most of them are honest, upstanding members of society.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\ngood enough but not excellentacceptableYour essay was acceptable, but I think you could have done better.reasonableThey have a reasonable chance of winning.adequateThe law provides adequate compensation for robbery victims.passableI speak passable Spanish. will doIt's not perfect, but it'll do.\nSee more results »\ninformal dressed or wearing clothes: Are you decent yet? You can come in now, I'm decent.\nMore examplesFewer examplesAll I need is a roof over my head and a decent meal.He seemed like a decent sort of a fellow.The law obliges companies to pay decent wages to their employees.I haven't had a decent night's sleep in years.The makers of the film will want to see a decent return on their investment.\nSMART Vocabulary: related words and phrases\nSuitable and acceptable\nable\nacceptability\nacceptable\nacceptably\naccepted\nconvenience\nconveniently\ncorrectly\ncorrectness\ndecently\neligibility\nfelicity\nlegitimate\npractical\nre-eligible\nrelevance\nrelevant\nrelevantly\nrespectability\nticket\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWearing clothes\nRelated word\ndecently\nAdd to word list\nAdd to word list\nacceptable, satisfactory, or reasonable: We get good benefits, and the pay is decent. It costs $100 to buy a decent sleeping bag.\nDecent also means good or kind: They’re just decent, ordinary people.\ninfml Decent also means wearing socially acceptable clothing: When the players were showered and decent, the reporters were allowed in. decently adverb us\nYour browser doesn't support HTML5 audio\n/ˈdi·sənt·li/\nTheir employer treats them decently."}