{"id":118447,"name":"deceive","type":"verb","us_sound":"dɪˈsiːv","us_link":"../audio/d/deceive.mp3","uk_sound":"dɪˈsiːv","uk_link":"../audio/d/ukdecad021.mp3","content":"Add to word list\nAdd to word list\nB2 to persuade someone that something false is the truth, or to keep the truth hidden from someone for your own advantage: The company deceived customers by selling old computers as new ones. The sound of the door closing deceived me into thinking they had gone out. Synonym\ntrick\nThesaurus: synonyms, antonyms, and examples\nto deceive someonedeceiveThe cigarette companies deceived the public about the health risks of cigarettes.deceive yourselfYou'd be deceiving yourself if you believed that.trickShe felt they had tricked her into saying more than she intended.foolYou don't fool me with your innocent act.take inThey claimed to be destitute, but we weren't taken in.pull the wool over someone's eyesI'm not stupid. You can't pull the wool over my eyes like that.\nSee more results »\ndeceive yourself\nto refuse to accept the truth: She thinks he'll come back, but she's deceiving herself. Her main character flaw is her readiness to deceive herself. He insists that she loves him, but really, he's deceiving himself. Unless I'm deceiving myself, I think we have a very good friendship. I don't think they can face the truth so they deceive themselves. People deceive themselves with their own version of events.\nThesaurus: synonyms, antonyms, and examples\nto deceive someonedeceiveThe cigarette companies deceived the public about the health risks of cigarettes.deceive yourselfYou'd be deceiving yourself if you believed that.trickShe felt they had tricked her into saying more than she intended.foolYou don't fool me with your innocent act.take inThey claimed to be destitute, but we weren't taken in.pull the wool over someone's eyesI'm not stupid. You can't pull the wool over my eyes like that.\nSee more results »\nMore examplesFewer examplesAnyway, I can't deceive him - it's against all my principles.He repudiated the allegation that he had tried to deceive them.I suspect these statistics flatter to deceive.What really angered her was the dirty underhand way they had deceived her.They deceived us into thinking they would come back later with our money.\nSMART Vocabulary: related words and phrases\nCheating & tricking\nanti-fraud\nbad faith\nbamboozle\nbilk\nblackmail\ndiddle\nfeint\nfiddle\nflannel\ngrifter\ngull\nhave an eye to/for the main chance idiom\nhave someone on\nhoax\npretextual\npull\npull a fast one idiom\npull the wool over someone's eyes idiom\npunk\nracket\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRefusing & rejecting\nRelated words\ndeceiver\ndeceivable\ndeceivinglyIdiom\nare my eyes deceiving me?\nAdd to word list\nAdd to word list\nto persuade someone that something false is the truth; trick or fool: Some parents try to deceive school officials and enroll their children in other districts.\nIf you deceive yourself, you pretend something is true: We should not deceive ourselves into thinking this will be the end of it.\nAdd to word list\nAdd to word list\nto use dishonest or illegal methods to get something or to make people believe that something is true when it is not: These were fraudulent transactions aimed at deceiving creditors and investors.intention/intent to deceive A spokesman for the bank maintained that there had been no intent to deceive.\nflatter to deceive\nto seem better than it actually is: The FTSE-100 flattered to deceive, as it broke through the 5000 barrier only to fall back again."}