{"id":118603,"name":"decide","type":"verb","us_sound":"dɪˈsaɪd","us_link":"../audio/d/eus75521.mp3","uk_sound":"dɪˈsaɪd","uk_link":"../audio/d/ukdecep005.mp3","content":"Add to word list\nAdd to word list\nA2 [ I or T ] to choose something, especially after thinking carefully about several possibilities: They have to decide by next Friday. It doesn't matter to me which one we have - you decide. [ + to infinitive ] In the end, we decided to go to the theatre. [ + (that) ] She decided (that) she would travel to India. [ + question word ] I can't decide what to do. He can't decide whether to buy it. The committee decided in favour of (= made a formal judgment to choose) the cheapest option.\nThesaurus: synonyms, antonyms, and examples\nto choose or choose to do somethingchooseThere are thirty-one flavours of ice cream to choose from.pickHe's been picked for the school football team.selectWe've selected three candidates.opt (for)Mike's opted for early retirement.decide (on)I've decided on blue walls for the bathroom.go forUK I think I'll go for the chocolate cake.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto decidedecideI've decided to move to Sweden.fixUK The price has been fixed at £10.setHave you set a date for the wedding?finalizeWe've chosen a venue for the wedding, but we haven't finalized the details yet.settleOK then, we're going to Spain. That's settled.settle on/uponHave you settled on a place to live yet?\nSee more results »\nC2 [ T ] to be the reason or situation that makes a particular result happen: The weather decided the outcome of the tennis match. Tim's mistake decided the game (= caused him to lose).\nMore examplesFewer examplesThe jury has to decide whether a person is guilty or innocent of a crime.Stand the paintings against the wall while we decide where to hang them.They decided to move abroad and make a fresh start.After a gap of five years, Jennifer decided to go back to work full-time.Have you decided where you're going for your holiday this year?\nSMART Vocabulary: related words and phrases\nDecisions and deciding\nascription\nbalance\nbe make or break for someone/something idiom\nbe on the horns of a dilemma idiom\nchoose\nclinch\nconclusion\nfix\nget it together idiom\nhammer something out\nhave a, some, etc. say in something idiom\nif/when it comes to the crunch idiom\nin the balance idiom\nresolution\nsleep\ntightrope\ntilt\ntilt the balance/scales idiom\ntop-down\ntoss up\nSee more results »\nPhrasal verb\ndecide on something/someone\nAdd to word list\nAdd to word list\nto choose between one possibility or another: [ T ] I decided I would try it. [ + to infinitive ] In the end, we decided to go to the theater. [ + question word ] We’re trying to decide how to proceed. [ + (that) clause ] He decided (that) it was his business.\nIf something decides a result in a competition, it causes that result: [ T ] A mistake by our team decided the game against us.\nA deciding factor is something so important that it forces a particular decision: The deciding factor in choosing this school was that it was far from home."}