{"id":118795,"name":"declining","type":"verb","us_sound":"dɪˈklaɪn","us_link":"../audio/d/eus75524.mp3","uk_sound":"dɪˈklaɪn","uk_link":"../audio/d/ukdecep030.mp3","content":"Add to word list\nAdd to word list\npresent participle of\ndecline\ndecline verb\n(GO DOWN)\nB2 [ I ] to gradually become less, worse, or lower: His interest in the project declined after his wife died. The party's popularity has declined in the opinion polls.formal The land declines sharply away from the house.\nThesaurus: synonyms, antonyms, and examples\nto decreasedecreaseThe tests show that the tumour has decreased in size since we started treatment. lessenA healthy diet lessens your risk for cardiovascular disease.lowerThey've just lowered the age at which you can join.reduceThey've just reduced the price.bring downThey are bringing down their prices.dropStock prices dropped today after the company's announcement.\nSee more results »\nMore examplesFewer examplesThe latest opinion poll shows that the president's popularity has declined.Profits have declined as a result of the recent drop in sales.The levels of trade union and political activism in this country have greatly declined in the past 15 years.Her popularity has declined since her triumphal return from exile two years ago.Their economy has expanded enormously, while ours, by/in contrast, has declined.\nSMART Vocabulary: related words and phrases\nDeteriorating and making worse\nadd\nadmin\naggravate\nbackslide\nbe (all) downhill idiom\ndebase\ndeterioration\ndevaluation\ndevalue\ndisintegrate\ndog\ndowngrade\none step forward, two steps back idiom\nregress\nregression\nregressive\nregressively\nwear thin idiom\nworse\nworsen\nSee more results »\ndecline verb\n(REFUSE)\nB2 [ I or T ] formal to refuse: I invited him to the meeting but he declined. He declined my offer. [ + to infinitive ] They declined to tell me how they had obtained my address.\nMore examplesFewer examplesWhen she was asked if she had any ambition to become prime minister, she respectfully declined to answer the question.A spokesperson declined to speculate on the cause of the train crash.The official declined to comment on the matter.Our application for a loan was declined by the bank.His request for early retirement was declined by his employers.\nSMART Vocabulary: related words and phrases\nRefusing & rejecting\nabjuration\nabnegate\nabnegation\nbar\nbat something/someone away\ndecline\ndemur\njettison\nmiss a chance/opportunity idiom\nopt out\npass something up\npunt on something\nquit\nquit on someone\nreact\nrebuff\nresistant\nspurn\nturn your nose up idiom\nwild horses wouldn't drag me idiom\nSee more results »\ndecline verb\n(GRAMMAR)\n[ I or T ]\n&#160; language\n&#160; specialized If a noun, pronoun, or adjective declines, it has different forms to show if it is the subject or object, etc. of a verb or if it is singular or plural, etc. If you decline such a word, you list its various forms: In Latin we learned how to decline nouns.\nSMART Vocabulary: related words and phrases\nLinguistics: grammatical terms\nablative\napposition\nappositive\nappositively\nattributively\ncollocate\nconcord\ndative\nfeminine\ngenitive\ninflected\nnominal\npost-modifier\npostposition\npostpositional\npostpositive\npostpositively\nquantifier\nsingular\nsyntax\nSee more results »\nIdiom\nsomeone's declining years"}