{"id":118760,"name":"declaring","type":"verb","us_sound":"dɪˈkler","us_link":"../audio/d/eus75523.mp3","uk_sound":"dɪˈkleər","uk_link":"../audio/d/ukdecep026.mp3","content":"Add to word list\nAdd to word list\npresent participle of\ndeclare\ndeclare verb\n(EXPRESS)\nB2 [ T ] to announce something clearly, firmly, publicly, or officially: They declared their support for the proposal [ + (that) ] She declared (that) it was the best chocolate cake she had ever tasted. [ + obj + (to be) + noun/adj ] They declared themselves (to be) bankrupt. [ + speech ] \"I won't do it!\" he declared. America declared war on Japan in 1941 (= announced officially that it was at war).figurative The government has declared war on (= announced that they intended to stop) the drug dealers. The country declared independence in 1952 (= announced that it was no longer under the control of another country).\nThesaurus: synonyms, antonyms, and examples\nto say somethingsayWhen I say your name, raise your hand.utterShe barely uttered a word all morning.they sayThey say the house is haunted.it is saidIt is said that a chain is only as strong as its weakest link.stateUnion members stated that they were unhappy with the proposal.remarkHe remarked that she was looking thin.\nSee more results »\nB1 [ T ] to officially tell someone the value of goods you have bought, or the amount of money you have earned because you might have to pay tax: Nothing to declare. Goods to declare. You have to declare any earnings over a certain amount.\nMore examplesFewer examplesAn elderly man from Hull has confounded doctors by recovering after he was officially declared dead.The inspector declared the meat fit for human consumption.The doctor declared her medically fit.The election was declared null and void.The club closed after the fire brigade declared its wiring to be unsafe.\nSMART Vocabulary: related words and phrases\nAnnouncing, informing & stating\nacquaint someone/yourself with something\nannunciation\napprise someone of something\navowedly\nawaken someone to something\nbreak\nbreathe/say a word idiom\ndisseminate\nimpart\non the record idiom\npass\nproclaim\npropagate\nput something before someone\nput something out\nput something out of its misery idiom\nrapporteur\nreportable\nreported\nstatement\nSee more results »\ndeclare verb\n(CRICKET)\n[ I ] If a cricket team declares, they stop batting (= hitting the ball) because they think they already have enough runs (= points) to win: Pakistan declared at 350 for 7.\nSMART Vocabulary: related words and phrases\nCricket\n12th man\nbails phrase\nball-tampering\nbatswoman\nbatting average\nbowl someone out\nbreak\ncut\ndeclare\ndeep\nforward\nglance\nlength\nmaiden\npavilion\ntest match\nuppish\nuppishly\nwalk\nwicketkeeper\nSee more results »\nIdiom\nI declarePhrasal verb\ndeclare for/against something"}