{"id":118789,"name":"decline","type":"verb","us_sound":"dɪˈklaɪn","us_link":"../audio/d/eus75524.mp3","uk_sound":"dɪˈklaɪn","uk_link":"../audio/d/ukdecep030.mp3","content":"decline verb\n(GO DOWN)\nAdd to word list\nAdd to word list\nB2 [ I ] to gradually become less, worse, or lower: His interest in the project declined after his wife died. The party's popularity has declined in the opinion polls.formal The land declines sharply away from the house.\nThesaurus: synonyms, antonyms, and examples\nto become smaller or lessdecreaseThe tests show that the tumour has decreased in size since we started treatment. lessenA healthy diet lessens your risk for cardiovascular disease.lowerThey've just lowered the age at which you can join.reduceThey've just reduced the price.bring downThey are bringing down their prices.dropStock prices dropped today after the company's announcement.\nSee more results »\nMore examplesFewer examplesThe latest opinion poll shows that the president's popularity has declined.Profits have declined as a result of the recent drop in sales.The levels of trade union and political activism in this country have greatly declined in the past 15 years.Her popularity has declined since her triumphal return from exile two years ago.Their economy has expanded enormously, while ours, by/in contrast, has declined.\nSMART Vocabulary: related words and phrases\nDeteriorating and making worse\nadd\nadmin\naggravate\nbackslide\nbe (all) downhill idiom\ndebase\ndeterioration\ndevaluation\ndevalue\ndisintegrate\ndog\ndowngrade\none step forward, two steps back idiom\nregress\nregression\nregressive\nregressively\nwear thin idiom\nworse\nworsen\nSee more results »\ndecline verb\n(REFUSE)\nB2 [ I or T ] formal to refuse: I invited him to the meeting but he declined. He declined my offer. [ + to infinitive ] They declined to tell me how they had obtained my address.\nMore examplesFewer examplesWhen she was asked if she had any ambition to become prime minister, she respectfully declined to answer the question.A spokesperson declined to speculate on the cause of the train crash.The official declined to comment on the matter.Our application for a loan was declined by the bank.His request for early retirement was declined by his employers.\nSMART Vocabulary: related words and phrases\nRefusing & rejecting\nabjuration\nabnegate\nabnegation\nbar\nbat something/someone away\nbrush\ndemur\njettison\nmiss a chance/opportunity idiom\nopt out\npass something up\npunt on something\nquit\nquit on someone\nreact\nrebuff\nresistant\nspurn\nturn your nose up idiom\nwild horses wouldn't drag me idiom\nSee more results »\ndecline verb\n(GRAMMAR)\n[ I or T ]\n&#160; language\n&#160; specialized If a noun, pronoun, or adjective declines, it has different forms to show if it is the subject or object, etc. of a verb or if it is singular or plural, etc. If you decline such a word, you list its various forms: In Latin we learned how to decline nouns.\nSMART Vocabulary: related words and phrases\nLinguistics: grammatical terms\nablative\napposition\nappositive\nappositively\nattributively\ncollocate\nconcord\ndative\nfeminine\ngenitive\ninflected\nnominal\npost-modifier\npostposition\npostpositional\npostpositive\npostpositively\nquantifier\nsingular\nsyntax\nSee more results »\nIdiom\nsomeone's declining years\nB2 when something becomes less in amount, importance, quality, or strength: industrial decline Home cooking seems to be on the/in decline (= not so many people are doing it). a decline in the number of unemployed She seemed to be recovering and then she went into a decline.\nThesaurus: synonyms, antonyms, and examples\nthe fact of getting smaller or becoming lessdecreaseThere has been a steady decrease in the number of visitors.fallA fall in the price of petrol is unlikely.fall-offThere's been a sharp fall-off in demand for the product since the company's scandal broke.falling-offThere has been a slight falling-off in public sector employment growth.riseThere has been a sharp rise in home sales this month.\nSee more results »\nMore examplesFewer examplesThe country has been in a very poor economic state ever since the decline of its two major industries.My grandmother, as usual, lamented the decline in moral standards in today's society.The TV series will be axed owing to a decline in popularity.Orders for new ships are rising, after several years of steady decline.The new manager hoped to reverse the decline in the company's fortunes.\nSMART Vocabulary: related words and phrases\nBecoming and making less strong\nabate\nabatement\nadulterate\nadulterated\nadulteration\nenervate\nenervating\nenervatingly\nenfeeble\nenfeebled\nfade\nhedge\nmelt\nrelieve\nsink\nturn to jelly idiom\nundimmed\nunsubdued\nwane\nwaste away\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming and making smaller or less\ndecline verb\n(GO DOWN)\nAdd to word list\nAdd to word list\n[ I ] to go down in amount or quality; lessen or weaken: His interest in the project declined after his wife died. Her health declined quickly.\ndecline verb\n(REFUSE)\n[ I/T ] to refuse something: [ T ] She declined their job offer.\ndecline noun [C/U]\n(GOING DOWN)\na change to a lower amount; the process of becoming less in quality or strength: [ C usually sing ] Unemployment increased this month after a modest decline. [ U ] Civilization is in decline.\nAdd to word list\nAdd to word list\nto become less, worse, or lower in value: Milk production could decline by 15% or more in the late summer months. declining prices/profits/sales/interest rates Even though interest rates could decline further, they are now near their lowest point. decline sharply/rapidly/dramatically decline gradually/steadily/slowly Among economists, the widespread view is that the dollar will keep declining.\nto make less profit, or produce less: a declining economy/industry/market The plan will reduce profits for the declining commercial fishing industry.\na reduction in the value or amount of something, for example a currency or sales: If sustained, the yen's 12.5% decline against the dollar this month may damp inflation across the region. A quarter of manufacturers reported a decline in production. The housing industry experienced a decline in sales. a rapid/sharp/steep/marked decline a slight/slow/gradual decline\na situation in which a company, country, or financial market gradually becomes less valuable, makes less profit, or produces less: Further economic decline might provoke spontaneous popular protest. Little was being done to reverse the decline in the town's tourist economy. The industry has been in decline for decades."}