{"id":118753,"name":"declare","type":"verb","us_sound":"dɪˈkler","us_link":"../audio/d/eus75523.mp3","uk_sound":"dɪˈkleər","uk_link":"../audio/d/ukdecep026.mp3","content":"declare verb\n(EXPRESS)\nAdd to word list\nAdd to word list\nB2 [ T ] to announce something clearly, firmly, publicly, or officially: They declared their support for the proposal [ + (that) ] She declared (that) it was the best chocolate cake she had ever tasted. [ + obj + (to be) + noun/adj ] They declared themselves (to be) bankrupt. [ + speech ] \"I won't do it!\" he declared. America declared war on Japan in 1941 (= announced officially that it was at war).figurative The government has declared war on (= announced that they intended to stop) the drug dealers. The country declared independence in 1952 (= announced that it was no longer under the control of another country).\nThesaurus: synonyms, antonyms, and examples\nto say somethingsayWhen I say your name, raise your hand.utterShe barely uttered a word all morning.they sayThey say the house is haunted.it is saidIt is said that a chain is only as strong as its weakest link.stateUnion members stated that they were unhappy with the proposal.remarkHe remarked that she was looking thin.\nSee more results »\nB1 [ T ] to officially tell someone the value of goods you have bought, or the amount of money you have earned because you might have to pay tax: Nothing to declare. Goods to declare. You have to declare any earnings over a certain amount.\nMore examplesFewer examplesAn elderly man from Hull has confounded doctors by recovering after he was officially declared dead.The inspector declared the meat fit for human consumption.The doctor declared her medically fit.The election was declared null and void.The club closed after the fire brigade declared its wiring to be unsafe.\nSMART Vocabulary: related words and phrases\nAnnouncing, informing & stating\nacquaint someone/yourself with something\nannunciation\napprise someone of something\navowedly\nawaken someone to something\nbreak\nbreathe/say a word idiom\ndisseminate\nimpart\nknown\non the record idiom\npass\nproclaim\npropagate\nput something before someone\nput something out\nput something out of its misery idiom\nrapporteur\nreportable\nstatement\nSee more results »\ndeclare verb\n(CRICKET)\n[ I ] If a cricket team declares, they stop batting (= hitting the ball) because they think they already have enough runs (= points) to win: Pakistan declared at 350 for 7.\nSMART Vocabulary: related words and phrases\nCricket\n12th man\nbails phrase\nball-tampering\nbatswoman\nbatting average\nbowl someone out\nbowling\nbreak\ncut\ndeep\nglance\nlength\nmaiden\npavilion\nsix\ntest match\nuppish\nuppishly\nwalk\nwicketkeeper\nSee more results »\nIdiom\nI declarePhrasal verb\ndeclare for/against something\nAdd to word list\nAdd to word list\nto announce or express something clearly and publicly, esp. officially: The courts declared the policy unconstitutional. A state of emergency has been declared because of severe flooding. People use their license plates to declare their team loyalty. [ + that clause ] I declare that is the best chocolate cake I’ve ever eaten!\nAdd to word list\nAdd to word list\nto make a public or official statement about something: All pre-existing health conditions should be declared to your insurer. After the acquittal, CEO, Bill Peters, declared: \"We feel vindicated.\"declare (that) The Serious Fraud Office is expected to declare that it will be conducting further investigations.declare sb/sth (to be) sth The WTO issued an interim ruling declaring the subsidies illegal.declare yourself to be sth Silverjet, the transatlantic business airline, has declared itself carbon-neutral.declare a ban/moratorium on sth In times of crisis the industry must declare a moratorium on aggressive marketing and sales tactics.declare bankruptcy If restrictions on air travel are enforced, several of the large airlines may be forced to declare bankruptcy.declare sb bankrupt Figures released by the bank showed almost 12,000 companies had been declared bankrupt in the third quarter of the year.\nTAX to make a written statement to the tax authorities containing information about money you have earned, shares you have bought, etc.: Winterway Investments have declared a 14.6% stake in the new corporation. Companies who fail to declare their accounts on time are breaking the law.declare earnings/profits/losses Many eBay traders are unaware that they have to declare their earnings.\nTAX, TRANSPORT to tell customs that you are bringing goods into a country on which you have to pay tax: The green channel is for those passengers with nothing to declare.\ndeclare an interest/a conflict of interest(s)\nto say publicly that you could gain a personal advantage from a situation and so might not be able to make decisions that are fair and honest: The Mayor was advised to declare a potential conflict of interest over a road project that could boost his wife's business.\ndeclare a dividend\nFINANCE, STOCK MARKET to tell shareholders that they will receive a dividend (= a share of a company's profits) and how much it will be: The Fund declares and pays dividends on net investment income on a quarterly basis."}