{"id":118983,"name":"decoration","type":"noun","us_sound":"ˌdek.ərˈeɪ.ʃən","us_link":"../audio/d/decoration.mp3","uk_sound":"ˌdek.əˈreɪ.ʃən","uk_link":"../audio/d/ukdecod015.mp3","content":"decoration noun\n(MAKE ATTRACTIVE)\nAdd to word list\nAdd to word list\nB2 [ C or U ] the activity of making something look more attractive by putting things on it or around it, or something that you use to do this: He's good at cake decoration. Christmas/party/table/cake decorations\nThesaurus: synonyms, antonyms, and examples\ndecorations or a decorationdecorationIt's time to put away the Christmas decorations.ornamentationThe artifacts included a gold bracelet with beaded ornamentation.adornmentShe wore no adornments except for a small watch.embellishmentThe building is plain, avoiding all unnecessary embellishments.trimmingI want a plain black cardigan with no trimmings.trimI like that tan sofa with the bright blue trim.\nSee more results »\nB2 [ U ] mainly UK (US usually redecoration) the activity of covering the walls or other surfaces of rooms or buildings with paint or paper: This place is badly in need of decoration.\nMore examplesFewer examplesI like the decoration around the collar - it's got quite a Spanish feel to it.His office is very utilitarian in style, with no decoration.It looks very Christmassy in here with the tree and all the decorations.I could use some help putting these decorations up if you're not too busy.During the 17th century, the Puritans destroyed many decorations in English churches.\nSMART Vocabulary: related words and phrases\nDecorating or making something attractive\naccessorize\nadorn\nadornment\nbeautification\nbeautify\nembellish\nfoliated\ngarland\ngewgaw\nglam\nglam (yourself) up\nornate\nover-glamorize\noverdecorate\noverdecoration\npimp\nundecorated\nwindow dressing\nyarn bombing\nzhuzh\nSee more results »\ndecoration noun\n(HONOUR)\n[ C ] a medal given to someone and worn as an honour: The Victoria Cross and George Cross are British decorations for bravery.\nSMART Vocabulary: related words and phrases\nPrizes, rewards and medals\n(the/a pot of gold at) the end of the rainbow idiom\nAcademy Award\naward\nbemedalled\nblue ribbon\nbooby prize\nbronze\ngong\ngrab bag\nGrammy\nhand something out\nhonour\nhonourable mention\nplatinum disc\nprize\nPulitzer Prize\nPurple Heart\nrainbow\nstake\nthe wooden spoon\nSee more results »\ndecoration noun\n(ATTRACTIVE THING)\nAdd to word list\nAdd to word list\n[ C/U ] something added to an object or place to make it look more attractive; the act of doing this: [ C ] The molding has a floral decoration carved into it. [ U ] Some women wear barrettes as decoration.\ndecoration noun\n(HONOR)\n[ C ] a medal, badge, etc. that is given to a person to reward them; an official honor: He received the country’s highest decoration for bravery."}