{"id":118859,"name":"decolonize","type":"verb","us_sound":"ˌdiːˈkɑː.lə.naɪz","us_link":"../audio/d/cdo0318usdeco1296.mp3","uk_sound":"ˌdiːˈkɒl.ə.naɪz","uk_link":"../audio/d/cdo0318ukdeco0400.mp3","content":"Add to word list\nAdd to word list\n[ I or T ] to make a country that was previously a colony (= a country controlled by another country) politically independent; to get rid of colonies: France is decolonising the Ivory Coast, where some 450 French scientists, technicians, and their families are working. He said that had it not been for Western colonialism and the unwillingness of the Great Powers to decolonize wisely, the oppressed of Asia would never have turned to communism.\n[ I ] (of a colony) to become politically independent: Many decolonizing territories in Africa, the Americas, and Southeast Asia had two or more ethnoterritorial groups competing for control.\n[ T ]\n&#160; social science\n&#160; specialized to change something such as a curriculum (= a list of books, ideas, etc. to be studied) in a way that considers the cultural beliefs behind it, for example the belief that European writers, artists, or ideas are better and more important than ones from countries that were colonized (= controlled) by Europe, and that gives more importance to these non-European writers, artists, etc.: Decolonizing the curriculum asks us to look at our shared assumptions about how the world is, particularly assumptions regarding racial and civilizational hierarchy.\nMore examplesFewer examplesNot a square foot of territory was decolonised in Churchill's second term (1951-55) - India had already gone in 1947.By the time the world prevailed upon Spain to decolonise, Equatorial Guinea had the best medical services, the lowest death rate and the second highest per capita income of any sub-Saharan African country.In the 1950s a decolonising Britain was losing its empire.How can art decolonize its Western-centric norms and practices?\nSMART Vocabulary: related words and phrases\nColonization & self-government\nacknowledgement of country\nannex\nannexation\nanti-colonial\nanti-colonialism\ncolony\ncommonwealth\ncondominium\ncrown colony\ndecolonization\nIndependence Day\nintercolonial\nland acknowledgment\nNat\nnationalism\nsecession\nself-determination\nself-governing\nself-government\nself-rule\nSee more results »"}