{"id":118858,"name":"decolonization","type":"noun","us_sound":"diːˌkɑː.lə.nəˈzeɪ.ʃən","us_link":"../audio/d/eus71173.mp3","uk_sound":"diːˌkɒl.ə.naɪˈzeɪ.ʃən","uk_link":"../audio/d/ukdecod003.mp3","content":"Add to word list\nAdd to word list\nthe process in which a country that was previously a colony (= controlled by another country) becomes politically independent; the process of getting rid of colonies: He was an ambassador in western Africa during a period of decolonization. In some of France's former colonies, French remained the official language of state after decolonisation.\nsocial science\n&#160; specialized the process of changing something such as a curriculum (= a list of books, ideas, etc. to be studied) in a way that considers the cultural beliefs behind it, for example the belief that European writers, artists, or ideas are better and more important than ones from countries that were colonized (= controlled) by Europe, and that gives more importance to non-European writers, artists, etc.: Decolonisation hit the headlines when a student wrote an open letter to her college saying that their English literature course did not reflect world literatures and was put together from a strictly white perspective. The decolonization of history as a subject is long overdue.\nMore examplesFewer examplesThe pace of decolonisation accelerated rapidly during the time that he held office. They were an extreme right-wing organization that opposed the decolonization of Belgium's only colony, the Congo.The essay examines the roots and consequences of decolonisation in Africa over the past 100 years.These Aboriginal paintings make me think of our people's constant struggle for decolonization. Decolonisation includes the collective reclaiming of culture and language.\nSMART Vocabulary: related words and phrases\nColonization & self-government\nacknowledgement of country\nannex\nannexation\nanti-colonial\nanti-colonialism\ncolony\ncommonwealth\ncondominium\ncrown colony\ndecolonize\nIndependence Day\nintercolonial\nland acknowledgment\nNat\nnationalism\nsecession\nself-determination\nself-governing\nself-government\nself-rule\nSee more results »\nRelated word\ndecolonize\nAdd to word list\nAdd to word list\npolitics &amp; government the release of one country or territory from political control by another country\nworld history Decolonization was also the political independence received by European colonies (= a country or area controlled politically by a more powerful country) in Africa and Asia after World War II."}