{"id":118835,"name":"decoy","type":"noun","us_sound":"ˈdiː.kɔɪ","us_link":"../audio/d/decoy.mp3","uk_sound":"ˈdiː.kɔɪ","uk_link":"../audio/d/ukdecod022.mp3","content":"Add to word list\nAdd to word list\nsomething or someone used to trick or confuse people, especially something or someone that is not what they appear to be: Air Force One flew ahead as a decoy, with the President in another plane behind. These attacks could be a decoy, a manoeuvre to throw everyone off guard.\na bird or animal, or something that looks like one, used when hunting to attract other birds or animals: They use electrically powered duck decoys known as \"robo ducks\".\nMore examplesFewer examplesWhen a driver sees a patrol car, they don't know if it's a real police officer or if it's a decoy.They used a girl hitch-hiker as the decoy to get him to stop.The officer arrested a bike thief after planting \"decoy\" bikes around the city.The spinning decoys try to mimic the flashing of a bird's wings, luring waterfowl toward the decoy.\nSMART Vocabulary: related words and phrases\nFaking & pretending\naffect\nair guitar\nassume\nbelieve\nbluff someone into something/doing something\nchangeling\ncry\nfalse\nfalse modesty\nfalsifiable\nfalsify\nfeign\nout-bluff\npass something off as something\nphoney\nphony-baloney\nplay-act\nprofessed\npurport\nquack\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHunting & fishing\nto trick or confuse people into doing something or going somewhere, especially by showing them something that is not what it appears to be: Flying French colours, the ship tacked back and forth, trying to decoy the French ship into the harbour.\nto trick an animal or bird that you are hunting, especially by using something to attract it that is not what it appears to be: They were always looking for a way to decoy geese that invaded the rice fields.\nMore examplesFewer examplesFlares are canisters of magnesium that burst into very bright, very hot flame to decoy infrared receivers away from the plane.They would try to decoy the enemy towards some of the hidden groups, where they would be outnumbered.The plan is that Marie decoys the victim into a position that will give Bobbie plenty of time to take aim.Cats often pretend to sleep to decoy their prey, then suddenly spring on it.He decoyed the pheasants by leaving peas.\nSMART Vocabulary: related words and phrases\nChanging direction\nabout-face\nabout-turn\nbear\nbranch\nbranch off\nbreak\ndeflect\ndo an about-turn\nexcursive\nexcursively\nflippy\nglance off (something)\nregear\nreverse\nslew\nsomeone's back is turned idiom\nswerve\nturn around\nturn off (something)\nwheel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHunting & fishing\nAdd to word list\nAdd to word list\nsomething used to trick or confuse a person or animal: He carves duck decoys for hunters.\nAdd to word list\nAdd to word list\na name that is placed on a company's mailing list (= list of names and addresses of people to whom advertising is sent) in order to check if the list is being used without the owner's permission"}