{"id":119021,"name":"decrease","type":"verb","us_sound":"dɪˈkriːs","us_link":"../audio/d/eus71175.mp3","uk_sound":"dɪˈkriːs","uk_link":"../audio/d/ukdecod025.mp3","content":"Add to word list\nAdd to word list\nB1 to become less, or to make something become less: Our share of the market has decreased sharply this year. We have decreased our involvement in children's books. Opposite\nincrease\nThesaurus: synonyms, antonyms, and examples\nto become smaller or lessdecreaseThe tests show that the tumour has decreased in size since we started treatment. lessenA healthy diet lessens your risk for cardiovascular disease.lowerThey've just lowered the age at which you can join.reduceThey've just reduced the price.bring downThey are bringing down their prices.dropStock prices dropped today after the company's announcement.\nSee more results »\nMore examplesFewer examplesDuring the 1980s, the amount of ozone in the stratosphere above Europe decreased by about 8%.Total unemployment has decreased in the past year.The pop star's popularity decreased as he got older, which is only to be expected.The government proposed decreasing the annual expenditure on arms.To make the sleeve get narrower toward the cuff, you gradually decrease the number of stitches on your needle.\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nabridgment\nattenuate\nattenuated\nattenuating\nattenuation\nboil\ndamp\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nforeshortened\nroll back something\nrollback\nrun someone/something down\nrundown\nsag\nshave\ntelescope\ntumble\nSee more results »\nB1 a reduction: There has been a steady decrease in the number of visitors. I haven't noticed much decrease in interest.\nThesaurus: synonyms, antonyms, and examples\nthe fact of getting smaller or becoming lessdecreaseThere has been a steady decrease in the number of visitors.fallA fall in the price of petrol is unlikely.fall-offThere's been a sharp fall-off in demand for the product since the company's scandal broke.falling-offThere has been a slight falling-off in public sector employment growth.riseThere has been a sharp rise in home sales this month.\nSee more results »\nMore examplesFewer examplesThere was a slight decrease in his weight after a week of dieting.Any decrease in tourism could have a serious effect on the local economy.The report's finding on the decrease in violent crime supports the police chief's claims.We have seen a marked decrease in the number of accidents since these safety measures were introduced.We've noticed a steady decrease in jobs available for new graduates in the industry.\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nabridgment\nattenuate\nattenuated\nattenuating\nattenuation\nboil\ndamp\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nforeshortened\nroll back something\nrollback\nrun someone/something down\nrundown\nsag\nshave\ntelescope\ntumble\nSee more results »\nAdd to word list\nAdd to word list\nto become smaller or make something less: [ I ] Car sales decreased sharply this year. decrease noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈdi·kris, dɪˈkris/\nI haven’t noticed any decrease in ticket sales.\nAdd to word list\nAdd to word list\nto become less, or to make something become less: decrease in value/price/amount When an investment increases or decreases in value but we do not sell it, we record an unrealized gain or loss.decrease by 10%/10 points, etc. The country's total exports decreased by 6% in 2009. The company has introduced various strategies to decrease production costs. decrease significantly/dramatically/rapidly decrease gradually/slightly/slowly\nthe process of something becoming less, or the amount by which something becomes less: Florida is not the only state to experience decreases in revenues.a decrease of 10%/10 points, etc. Sales were $640 million for the quarter, a decrease of 11%. a marked/significant/dramatic decrease a slight/gradual/steady decrease"}