{"id":119029,"name":"decree","type":"noun","us_sound":"dɪˈkriː","us_link":"../audio/d/decree.mp3","uk_sound":"dɪˈkriː","uk_link":"../audio/d/ukdecod026.mp3","content":"Add to word list\nAdd to word list\nan official statement that something must happen: The decree stopped short of a full declaration of independence. More than 200 people were freed by military decree. Synonyms\nedict formal\nfiat formal\norder\nSMART Vocabulary: related words and phrases\nRules & laws\nadministrative\nadmiralty\nanti-bribery\nanti-regulatory\nanti-sodomy\nbinding\nblue law\ncivil law\nhumanitarian law\ninvocation\njuridical\njuridically\njuristic\nland tenure\nlegislation\nprovision\nRafferty's rules\nself-regulation\nuncanonical\nunenforceable\nSee more results »\nto officially decide or order that something must happen: They decreed an end to discrimination on grounds of age. [ + that ] After the earthquake, the government decreed that all new buildings must be built according to the new standards.\nSMART Vocabulary: related words and phrases\nGiving orders & commands\nall-points bulletin\nboss someone around\nbossily\nbossiness\nbossyboots\ncommanding\ndemand\ndictate\nexpect\nharry\ninstruct\nlay down the law idiom\nprescribe\npush someone around\nput something on\nshove\nshove someone around\nstick\nstick out for something\ntask\nSee more results »\nAdd to word list\nAdd to word list\nan order or statement of an official decision: He refused to carry out the board’s decree. decree verb [ T ] us\nYour browser doesn't support HTML5 audio\n/dɪˈkri/\n[ + that clause ] The Olympic charter decrees that the Games be opened by a head of state.\nAdd to word list\nAdd to word list\nLAW a judgment that is made in a court of law: In December a court decree ended the strike.\nan official statement that something must happen, made by a leader, government, etc.: The Dutch government issued a decree laying down strict rules on the age of veal calves and how they should be housed. rule/legislate by decree See also\nconsent decree\nLAW to make a judgment in a court of law: The U.S. Supreme Court ruling decreed that apparel manufacturers - not the retailers themselves - could control the minimum sale price of products.\nto officially state that something will happen: Several countries have lured back untaxed assets held abroad by decreeing an amnesty for tax evasion."}