{"id":119178,"name":"dedicated","type":"adjective","us_sound":"ˈded.ə.keɪ.t̬ɪd","us_link":"../audio/d/dedicated.mp3","uk_sound":"ˈded.ɪ.keɪ.tɪd","uk_link":"../audio/d/ukdecry003.mp3","content":"Add to word list\nAdd to word list\nC1 believing that something is very important and giving a lot of time and energy to it: a dedicated father/teacher She's completely dedicated to her work. The Green Party is dedicated to protecting the environment. Synonyms\ncommitted\ndevoted\nfaithful (LOYAL)\nfirm (CERTAIN)\nloyal\nstalwart (LOYAL)\nstaunch\nsteadfast approving\nsteady\ntrue (SINCERE)\nunfaltering\nunshakeable mainlyUK\nunswerving\nunwavering\nC2 designed to be used for one particular purpose: a dedicated computer a dedicated sports channel\nMore examplesFewer examplesOnly a truly dedicated scientist would want to read such a detailed report.A dedicated football-fan herself, she started the magazine for women like herself.Maggie's life was dedicated to the needs of her family.We have one TV channel completely dedicated to news, and another dedicated to sport.From that point onwards his work was dedicated to research into childhood leukaemia.\nSMART Vocabulary: related words and phrases\nLoyal, faithful & dependable\na safe pair of hands idiom\nallegiance\naudaciously\nbe as good as your word idiom\nbe here for someone idiom\nbe there for someone idiom\nfaithfully\nfaithfulness\nfealty\nfidelity\nfiduciary\nhere\nreliable\nreliably\nself\nstalwart\nstalwartly\nultra-reliable\nundependable\nunto thine own self be true idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGoals and purposes\nAdd to word list\nAdd to word list\nbelieving that an activity or idea is important and giving a lot of energy and time to it: The Boy Scouts organization is dedicated to helping boys become moral and productive adults.\nAdd to word list\nAdd to word list\nused only for one particular purpose or job: The company designs its own clothes and sources them directly from dedicated factories in China. They decided to spend £2,000 setting up each of the at-home operators, equipping them with PCs and dedicated phone lines. dedicated funding On dedicated server networks, clients access resources by requesting them from a PC that functions only as a server."}