{"id":119177,"name":"dedicate","type":"verb","us_sound":"ˈded.ə.keɪt","us_link":"../audio/d/dedicate.mp3","uk_sound":"ˈded.ɪ.keɪt","uk_link":"../audio/d/ukdecry002.mp3","content":"dedicate verb [T]\n(GIVE TIME/ENERGY)\nAdd to word list\nAdd to word list\nC1 to give all of your energy, time, etc.: He has dedicated his life to scientific research. The new president said she would dedicate herself to protecting the rights of the sick and the homeless.\nMore examplesFewer examplesHe dedicated his poetry to the glory of God.The record is dedicated to her mother, who died recently.He dedicated his life to freeing the world from famine and disease.The war memorial was dedicated to both Jews and Gentiles.If you are in the area, you should dedicate at least a day to seeing the city.\nSMART Vocabulary: related words and phrases\nGiving oneself\ndevote something to something/someone\ngive your life to something idiom\nlife\nrededicate\nrededication\ndedicate verb [T]\n(BOOK, ETC.)\nC2 If you dedicate a book, play, performance, etc. to someone, you publicly say that it is in that person's honour: The book is dedicated to the author's husband.\nSMART Vocabulary: related words and phrases\nPraising and applauding\nacclaim\nacclamation\naccolade\nadulate\nadulation\ncomplimentary\ndispatch\neulogistic\neulogistically\neulogize\neulogy\nexalt\nhonour\npaean\npanegyric\npanegyrical\npanegyrist\npat someone on the back idiom\nrave\nslap\nSee more results »\ndedicate verb [T]\n(BUILDING)\nformal When a building, especially a religious building, is dedicated, there is a ceremony at which it is formally opened for use and its particular purpose is stated: The church was dedicated on 1 March 1805 to the local Saint Jude.\nSMART Vocabulary: related words and phrases\nCeremonies\nanti-ritualism\ncavalcade\nceremonial\nceremonially\nceremony\nguard of honour\nhara-kiri\ninitiation ceremony\ninstallation\ninvestiture\nknight\nmaster of ceremonies\nmemorial service\npageant\nrequiem\nribbon cutting\nrite of passage\nritual\nritualistic\ntroop\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReligious ceremonies & prayers\nAdd to word list\nAdd to word list\nto give completely your energy, time, etc. to something: He dedicated his life to helping the poor.\nIf you dedicate a book, play, performance, etc., to someone or something, you say publicly that it is in honor of that person or thing: This book is dedicated to my children, Claire and Tom."}