{"id":119228,"name":"deductible","type":"adjective","us_sound":"dɪˈdʌk.tə.bəl","us_link":"../audio/d/deductible.mp3","uk_sound":"dɪˈdʌk.tə.bəl","uk_link":"../audio/d/ukdecry008.mp3","content":"Add to word list\nAdd to word list\nA deductible amount can be taken away from a total: Expenses like office phone bills are tax-deductible (= you do not have to pay tax on them).\nSMART Vocabulary: related words and phrases\nPrice decreases\nbargain\nbearish\nbearishly\ncloseout\nconcessional\ncouponer\ncouponing\ndeflate\ndeflation\ndepreciate\ndepress\ndiscount\ndrop off\nfreeze\nmark something down\noverdiscount\npost-devaluation\nprojected value\npromo code\nspiral\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAddition, subtraction, multiplication & division\nUK an amount of money that is taken away from an employee's pay before they receive it\nUS (UK excess) a part of the cost of an accident, injury, etc., that you agree to pay when you buy insurance: Customers can lower insurance premiums by taking higher deductibles.\nSMART Vocabulary: related words and phrases\nEarning money\nassessable\nbank\nbase pay\nbasic\nbasic income\ndisposable income\nhand over fist idiom\nin arrears idiom\nline your pocket(s) idiom\nlivelihood\nmake an honest living idiom\npro rata\nprorate\npull\npull something down\nraise\nrake something in\nremonetize\nrevenue\nsick pay\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCosts & expenses\nInsurance\nAdd to word list\nAdd to word list\nan amount of money that you are responsible for paying before your insurance (= protection against loss) will pay you for an expense: Judy’s car insurance policy had a $500 deductible.\nA deductible expense is a cost that you can subtract from the earnings on which you have to pay income tax: Mortgage interest is deductible.\nAdd to word list\nAdd to word list\nrelating to an amount or part that can be taken away from a total: However, the supplementary benefit that he was receiving was deductible from the figure awarded as damages.\nTAX relating to particular costs that can be taken away from the amount of money that you have earned, before you have to pay tax on it: Expenditure by private persons on education and training is rarely deductible for income-tax purposes. deductible expenses See also\ntax-deductible deductibility noun [ U ]\nThe first provision in the bill calls for immediate and full deductibility of health-insurance premiums for the self-employed.\nan amount of money that is taken away from the money paid to an employee before it is given to them: The increase in the deductible could eat away a worker's entire pay increase for the year.\nINSURANCE\n&#160; ( UK excess) a part of the cost of an accident, loss, injury, etc. that you agree to pay yourself when you buy insurance: The company's insurance covers the cost of accidents, minus a $500 deductible, for members of all ages."}