{"id":119233,"name":"deduction","type":"noun","us_sound":"dɪˈdʌk.ʃən","us_link":"../audio/d/deduction.mp3","uk_sound":"dɪˈdʌk.ʃən","uk_link":"../audio/d/ukdecry009.mp3","content":"deduction noun\n(THINKING)\nAdd to word list\nAdd to word list\nC2 [ C or U ] the process of reaching a decision or answer by thinking about the known facts, or the decision that is reached: Through a process of deduction, the detectives discovered the identity of the killer. All we can do is make deductions from the available facts.\nSMART Vocabulary: related words and phrases\nConcluding and deducing\nanalysis\ndeduce\ndeducible\ndeductive\ndeductively\ndiagnosis\ndraw\ngather\nhypothetico-deductive\nimply\nimpute something to someone\nin the last/final analysis idiom\ninconclusively\ninduction\ninferential\nmaths\nnon-deductive\nperceive\nput something down to something\nput two and two together idiom\nSee more results »\ndeduction noun\n(TAKING AWAY)\nC1 [ C or U ] the calculation of taking an amount or a part of something away from a total or the amount that is taken away: The interest I receive on my savings account is paid after the deduction of tax.\n[ C ] US and Australian English (UK stoppage) an amount that is taken away from the money you are paid before you officially receive it: After deductions, his taxable income is $30,000.\nSMART Vocabulary: related words and phrases\nPrice decreases\nbargain\nbearish\nbearishly\ncloseout\nconcessional\ncouponer\ncouponing\ndeflate\ndeflation\ndepreciate\ndevalue\ndiscount\ndrop off\nfreeze\nknock off (something)\nmark something down\noverdiscount\npost-devaluation\nprojected value\nspiral\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAddition, subtraction, multiplication & division\nAdd to word list\nAdd to word list\nthe process of learning something by considering a general set of facts and thinking about how something specific relates to them: [ C ] Sherlock Holmes was famous for making clever deductions.\nan amount or part taken away from a total, esp. an expense that you do not have to pay taxes on, or the process of taking away an amount or part: [ C ] New tax regulations would cut the deduction for business lunches.\nAdd to word list\nAdd to word list\nthe process of taking away an amount or a part of something from a total, or the amount that is taken: The interest you receive will be paid after deduction of tax. The tax and social security authorities normally insist upon deduction of payments and contributions at source. Household insurance policies tend to replace lost or stolen items on a \"new for old\" basis, while travel policies tend to make deductions for wear and tear.\nTAX the process of taking away particular costs from the amount of money that you have earned before you pay tax on it, or the costs that are taken away: The married couple's allowance was in the form of a tax deduction. See also\nincome tax deduction\nstandard deduction"}