{"id":119243,"name":"deed","type":"noun","us_sound":"diːd","us_link":"../audio/d/deed.mp3","uk_sound":"diːd","uk_link":"../audio/d/ukdecry011.mp3","content":"deed noun [C]\n(ACTION)\nAdd to word list\nAdd to word list\nan intentional act, especially a very bad or very good one: It seems to me that a lot of evil deeds are done in the name of religion. She's always helping people and doing good deeds.\nThesaurus: synonyms, antonyms, and examples\nyour actionsactionYou should take responsibility for your own actions.actThis was considered to be an act of war.thingThat’s the last thing you should be doing if you’re pregnant.activityNot all of her business activities were scrupulously clean. moveApplying for that job was a good move.deedTheir evil deeds must not go unpunished.\nSee more results »\nSMART Vocabulary: related words and phrases\nActing and acts\n(your) every move idiom\nact\nact for someone\nact/do something on your own responsibility idiom\nactivity\nADL\nagency\nant\ner\nexecution\nexploit\nfait accompli\nmove\nresponsibility\nrole-play\nrot\nstep\nstep up\nstuff\ntalk\nSee more results »\ndeed noun [C]\n(DOCUMENT)\nlaw\n&#160; specialized a legal document that is an official record of an agreement or official proof that someone owns land or a building\nSMART Vocabulary: related words and phrases\nOfficial documents\naccounts\naffidavit\naleatory\nannal\napostille\ndriving licence\nfiling\nfree pass\nget-out clause\nGreen Paper\nHansard\nproceedings\npt\nPTO\nrecertification\nrecertify\nrecharter\nrenewable\nwarrant\nwrit\nSee more results »\ndeed noun\n(ACTION)\nAdd to word list\nAdd to word list\n[ C/U ] an intentional act, esp. a very bad or very good one: [ C ] Whatever his motives, the deed did save a hundred thousand lives.\ndeed noun\n(DOCUMENT)\n[ C ] law a legal document that is an official record and proof of ownership of property: According to the deed, she owns the land from here to the river.\nAdd to word list\nAdd to word list\nLAW, PROPERTY a legal document that is an official record of an agreement or official proof that someone owns land or a building: Solicitors should ensure that borrowers understand the mortgage on offer before signing the mortgage deed. See also\ntitle deed"}