{"id":119278,"name":"deep","type":"adjective","us_sound":"diːp","us_link":"../audio/d/deep.mp3","uk_sound":"diːp","uk_link":"../audio/d/ukdecry014.mp3","content":"deep adjective\n(LONG WAY DOWN)\nAdd to word list\nAdd to word list\nA2 going or being a long way down from the top or surface, or being of a particular distance from the top to the bottom: a deep well/mine a deep river/sea a deep cut The hole is so deep you can't see the bottom. The water's not deep here - look, I can touch the bottom. Drill 20 holes, each 2 inches deep. The water's only ankle/knee/waist-deep, so we'll be able to get across the river easily. Take a few deep breaths (= breaths that fill the lungs with air) and calm down.\nMore examplesFewer examplesThe snow lay in deep drifts.The water's deep here, so don't fall in!The thorn went deep into the flesh of my hand.Over many years, flowing water wore deep grooves into the rock.Sow the seeds about 3 cm deep.\nSMART Vocabulary: related words and phrases\nHigh, tall and deep\nabysmal\naltitude\nbottomless\ndwarf\nectomorph\nelevated\neye level\nheight\nhigher\nlofty\novershadow\nrangy\nrear\nrear above/over something/someone\nstand\ntall\ntallish\ntallness\ntower\ntower above/over someone/something\nSee more results »\ndeep adjective\n(STRONGLY FELT)\nB2 very strongly felt or experienced and usually lasting a long time: Their son has been a deep disappointment to them. We're in deep trouble. She fell into a deep sleep.\nThesaurus: synonyms, antonyms, and examples\nfelt or experienced with a lot of forcestrongI felt a strong urge to hug him.powerfulAnger is one of the most powerful human emotions.intenseShe learned that even intense emotional pain passes.fierceThe people have a fierce pride in their country.deepHe suffered from a deep feeling of inadequacy.deep-seatedHe has a deep-seated loathing of snobbery.\nSee more results »\nMore examplesFewer examplesShe went into a deep coma after taking an overdose of sleeping pills.She has developed a deep dependence on him.She alternated between cheerfulness and deep despair.Her eyes expressed deep sadness.She had developed an outgoing personality to mask her deep insecurities.\nSMART Vocabulary: related words and phrases\nStrong feelings\nafire\nall-consuming\nanguish\nanguished\nardent\nfierily\nfit to burst idiom\nflamingly\nfulminating\ngrip\npenetratingly\npungently\nquiveringly\nrabidly\nreinforced\nsearing\ntempestuous\ntingle\ntorrid\nvirulent\nSee more results »\ndeep adjective\n(LOW)\nB2 (of a sound) low: a wonderfully deep voice\nMore examplesFewer examplesHe has a deep, masterful voice.a deep mellifluous voicea deep, resonant voiceShe produced a rich, deep tone from her clarinet.\nSMART Vocabulary: related words and phrases\nDescribing qualities of sound\naudibly\nboomy\nchocolatey\nchuff\nclomp\ncrackling\near-splitting\nlistenable\nmellifluously\nmelodically\nmelodious\nmelodiously\nmetallically\nraucous\nstaccato\nsymphonically\ntextured\nthready\ntinnily\ntunefully\nSee more results »\ndeep adjective\n(COMPLICATED)\nC2 showing or needing serious thought, or not easy to understand: His films are generally too deep for me.\nMore examplesFewer examplesHis poetry is imbued with deep, religious feeling.Her first novel was too deep to have wide appeal.I enjoy his company but his conversation can get a bit deep at times.\"What do you want to go and see at the cinema?\" \"Oh, nothing too deep, perhaps a comedy or something\"The programme claims to discuss very deep and profound philosophical issues.\nSMART Vocabulary: related words and phrases\nComplexity\nadvanced\nall-singing\nbaroque\nbaroquely\nbe more to something than meets the eye idiom\nfancily\nfinicky\nhigh-tech\nindirectly\ninsolubility\nmultilayer\nonerousness\nornate\nornately\nover-elaborate\ntortuous\ntortuously\ntortuousness\nultra-sophisticated\nwheels within wheels idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDifficult to understand\ndeep adjective\n(FRONT TO BACK)\nB2 If something is deep, it has a large distance between its edges, especially between its front and back edges: Is the alcove deep enough for bookshelves? The wardrobe is 2 m high, 1 m wide and 60 cm deep. By midnight, there were customers standing six deep (= in six rows) at the bar. deep in/inside/within something\nB1 near the middle of something, and a long distance from its edges: Little Red Riding Hood's grandmother lived in a house deep in the forest.\nSee more\nSMART Vocabulary: related words and phrases\nMeasurements in general\naltitude\nbathymetric\nbathymetrically\nbathymetry\nbe running at something idiom\ncalibrate\ndrop\nelevation\nfactor\nknee-length\nmetric\nmetrication\nmicro\nmilli-\nscale\nsetting\ntera-\nuncalibrated\nunmeasurable\nunsized\nSee more results »\ndeep adjective\n(CRICKET)\nsports\n&#160; specialized In cricket, deep positions are far from the wicket (= the area where the batters stand and run): The ball sailed towards the boundary in the direction of deep square leg. The South African captain positioned deep fielders on each side of the ground.\nMore examplesFewer examplesCowlie's throw from deep mid wicket was spot on.\nSMART Vocabulary: related words and phrases\nCricket\n12th man\nbails phrase\nball-tampering\nbatswoman\nbatting average\nbowl someone out\nbreak\ncut\ndeclare\nforward\nglance\nlength\nmaiden\npavilion\nsix\ntest match\nuppish\nuppishly\nwalk\nwicketkeeper\nSee more results »\ndeep adjective\n(DARK)\nB1 (of a colour) strong and dark: The sky was deep blue.\nSMART Vocabulary: related words and phrases\nThe qualities of colour\nanalogous\nbrightly\nbrightness\ncolourful\ncolourfully\ndarkness\nfluorescent\nharsh\nneutrally\nnon-complementary\nnon-fluorescent\nnon-yellowing\nover-bright\npsychedelic\nvibrancy\nvibrantly\nviolent\nvivid\nvividly\nvividness\nSee more results »\nGrammar\nMeasurementsWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nArea: length, width, depth and heightWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nWeight and volumeWe use the verb weigh to measure weight: …\nFrequency, speed, timeWe use many different expressions to describe frequency, speed and time. Here are some of them: …\nIdioms\ndeep in thought\nbe in deep water\ndeep pockets\ngo off the deep end\njump in at the deep end\ndeep adverb\n(LONG WAY DOWN/IN)\nA2 a long way from the top or surface : The submarine sailed deep under the ice cap. He thrust his hands deep in(to) his pockets.\nSMART Vocabulary: related words and phrases\nHigh, tall and deep\nabysmal\naltitude\nbottomless\ndwarf\nectomorph\nelevated\neye level\nheight\nhigher\nlofty\novershadow\nrangy\nrear\nrear above/over something/someone\nstand\ntall\ntallish\ntallness\ntower\ntower above/over someone/something\nSee more results »\ndeep adverb\n(SPORTS)\nIn sports such as football, rugby, orice hockey , if a player or team plays or defends deep, they stay a long way inside their own half of the field: Some midfielders play deep, having a more defensive role, while others go forward. The manager was yelling at the team that they were defending too deep. Capper played deep, relishing the competition in midfield areas. She gave the ball away deep inside her own half. At 2-0 up, Cambridge played deep, inviting the opposition to attack.\nSMART Vocabulary: related words and phrases\nFootball/soccer\n18-yard box\n2 3 5\n4 3 2 1\n4 4 2\n4 5 1\nfootball pools\nfooty\nformation\nfoul throw\nfour five one\nfour four two\nfour three two one\nreducer\nrelegation zone\nreserve team\nroute one football\nrow Z\nsweeper\ntreble\nwoodwork\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral terms used in ball sports\nGrammar\nMeasurementsWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nArea: length, width, depth and heightWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nWeight and volumeWe use the verb weigh to measure weight: …\nFrequency, speed, timeWe use many different expressions to describe frequency, speed and time. Here are some of them: …\nIdioms\ndeep down\nrun/go deep\nthe deep literary\nthe sea or the ocean: The sailors were lost to the deep.\nSMART Vocabulary: related words and phrases\nSeas & oceans\nAegean\nbathypelagic\nbriny\nCaribbean\nEnglish Channel\nguyot\ninterocean\ninteroceanic\nMediterranean\noceanic\nsubmarine\nsubsea\ntablemount\nthe Adriatic Sea\nthe Arabian Sea\nthe Baltic Sea\nthe doldrums\nthe high seas\nthe Irish Sea\nunderwater\nSee more results »\nGrammar\nMeasurementsWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nArea: length, width, depth and heightWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nWeight and volumeWe use the verb weigh to measure weight: …\nFrequency, speed, timeWe use many different expressions to describe frequency, speed and time. Here are some of them: …\ndeep adjective, adverb [-er/-est only]\n(DOWN)\nAdd to word list\nAdd to word list\ngoing or being a long way down from the top or surface, or being at a particular distance down from the top: She had a deep cut on her left arm. During the flood, the water in the basement was knee-deep (= it would reach the knees of an average adult). Idioms\ndeep down\nhave deep pockets\nin deep (trouble)\ndeep adjective\n(FRONT TO BACK)\nhaving a (sometimes stated) distance from front to back: I want the bookcase shelves to be 12 inches deep. The crowd along the parade route was six deep (= in six rows).\ndeep adjective\n(STRONGLY FELT)\nstrongly felt or experienced, or having a strong and lasting effect: Our deep love for each other will last forever. He awoke from a deep sleep. Joseph, deep in thought (= thinking so much that he is not aware of others), didn’t hear Erin enter the room.\ndeep adjective\n(COMPLICATED)\n[ -er/-est only ] difficult to understand; complicated: His book on how the brain works is too deep for me.\ndeep adjective\n(LOW SOUND)\n[ -er/-est only ] (of a sound) low: He was a large man with a deep voice.\ndeep adjective\n(DARK)\n[ -er/-est only ] (of a color) strong and dark: The sky is a deep blue.\nAdd to word list\nAdd to word list\nvery large or serious: Employees were forced to accept deep cuts in pay and benefits. a deep recession. These deep discounts will be a major factor in stimulating local telephone competition in Pennsylvania.\nin deep trouble\nexperiencing very serious problems: But the question is whether any business strategy can save a company in such deep trouble.\nbe in/get into deep water\nto be in or get into serious trouble: The main problem's going to be cash flow. It's the same in any business that gets into deep water.\ndeep in debt\nowing a very large amount of money: Why are the banks willing to allow people like this to get even deeper into debt?\ndeep pockets\nif you say that an organization or a person has deep pockets, you mean that they have a lot of money to spend: The sleek new car promises to do well, but it takes deep pockets to market premium cars across Europe.\njump in/throw sb in at the deep end\nto start, or make someone start, doing something new and difficult without help or preparation: When new people start in our call centre, we give them basic training in all our systems and then throw them in at the deep end on day one."}