{"id":119404,"name":"default","type":"verb","us_sound":"dɪˈfɑːlt","us_link":"../audio/d/default.mp3","uk_sound":"dɪˈfɒlt","uk_link":"../audio/d/ukdecry024.mp3","content":"Add to word list\nAdd to word list\nto fail to do something, such as pay a debt, that you legally have to do: People who default on their mortgage repayments may have their home repossessed.\nSMART Vocabulary: related words and phrases\nFailing and doing badly\nabjectly\nat-risk\nbackbencher\nballs (something) up\nbe on your beam ends idiom\nblow (someone/something) up\nbomb\negg\nflog\nflog a dead horse idiom\nflop\nflub\nflunk out\nfounder\nmess\nrot\nrunning on empty idiom\nsclerotic\nscrew\nthe rot sets in idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBorrowing & lending\nPhrasal verb\ndefault to something\ndefault noun\n(RESULT)\n[ U ] the thing that exists or happens if you do not change it intentionally by performing an action: Unless something else is agreed, the default is to meet at the hotel at 7.00 p.m. The computer will take 0 as the default value, unless you type in something different.formal In default of (= because there is not) any better alternative, we will have to proceed with the original plan.\nSMART Vocabulary: related words and phrases\nStandard and routine\naverage\naverage Joe\nbog-standard\nconformance\nconformity\nconventionalized\ngiven\ninstitutionalize\nmainline\northodox\nquotidian\nregular\nregularity\nregularization\nregularize\nround\nstock\nthe/your average bear idiom\nunchallenging\nunspectacular\nSee more results »\ndefault noun\n(FAIL)\n[ C or U ] a failure to do something, such as pay a debt, that you legally have to do: Defaults on loan repayments have reached 52,000 a month. Any default on your mortgage payments may mean you will lose your house. Since they refuse to reply, I think we've won the argument by default (= because of their failure to act). The national student loan default rate (= the number of people failing to pay) is estimated at one in ten.\nThesaurus: synonyms, antonyms, and examples\nthe fact of not doing something you shouldfailureFailure to follow the employee guidelines can lead to your immediate termination.defaultThe bank seized his house because his mortgage was in default.malpracticeThe surgeon was sued for malpractice.derelictionHe was dishonourably discharged for dereliction of duty.neglectCorruption and neglect resulted in a government that was weakened enough to be overthrown. negligenceEducational standards deteriorated thanks to the negligence of the administration.\nSee more results »\nSMART Vocabulary: related words and phrases\nBorrowing & lending\namortizable\namortization\nbonded\nborrow\nborrow something from something\nbridging loan\ncredit limit\nforeclose\nhole\nliquidator\nloan\nnon-prime\nnonaccrual\non the slate idiom\noutstanding\nover-borrowed\noverpay\noverpayment\npay someone/something back\nreceivership\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFailures\nAdd to word list\nAdd to word list\nto fail to do something, such as pay a debt, that you legally have to do: The company defaulted on a $133 million loan.\ndefault noun\n(FAILURE TO DO)\n[ C/U ] us\nYour browser doesn't support HTML5 audio\n/dɪˈfɔlt, ˈdi·fɔlt/ a failure to do something that you legally have to do, such as pay a debt: [ C ] Defaults rose to 4 percent of all the bank’s loans.\n[ C/U ] us\nYour browser doesn't support HTML5 audio\n/dɪˈfɔlt, ˈdi·fɔlt/ In sports, to win or lose by default is to win or lose because one side did not compete: [ U ] Humphrey never showed up, so Wilson won by default.\ndefault noun\n(STANDARD SETTING)\n[ U ] us\nYour browser doesn't support HTML5 audio\n/ˈdi·fɔlt, dɪˈfɔlt/ a standard setting esp. of computer software, such as of type size or style: The default color of text on the screen is black.\nAdd to word list\nAdd to word list\nFINANCE the fact of not paying interest or other money that is owed on time: Many experts say a default would raise interest rates in the future because the government would be seen as a higher-risk borrower. Any default on the interest payments will have serious consequences. Creditors are frequently obliged to terminate the consumer credit agreement because the debtor is in default.\nLAW the fact of not keeping to an agreement or contract: There will be a joint government review of the agreement if there is any default.\nIT the way that something will happen or appear automatically, especially on a computer, if you do not make any different choices: Checking this box means that your computer will now use this printer as the default. The default is to provide a statement monthly. This is the default setting, but you can change it by going to the Options menu. We recommend using the defaults that are already set.\nby default\nhappening or done because no formal choice or decision has been made: The fear was that unless IAS was adopted, US accounting principles would become the world standard by default.\nFINANCE to fail to pay interest or other money that is owed: default on a payment/a mortgage/your rent If a company defaults on its rent, another tenant can be found. I have never defaulted or been late with previous payments.\nLAW to fail to keep to an agreement or contract: default on an agreement/a contract They claimed that education providers had defaulted on their agreement with students to provide a course.\nIT to happen or appear automatically in a particular way, if a user does not make a different choice: If you do not enter a value it will default to a delay of 20 seconds."}