{"id":119511,"name":"defensive","type":"adjective","us_sound":"dɪˈfen.sɪv","us_link":"../audio/d/eus75537.mp3","uk_sound":"dɪˈfen.sɪv","uk_link":"../audio/d/ukdefec013.mp3","content":"defensive adjective\n(PROTECTING)\nAdd to word list\nAdd to word list\nused to protect someone or something against attack: These are purely defensive weapons, not designed for attack. Opposite\noffensive (ATTACKING)\nMore examplesFewer examplesResearch involving the use of biological warfare agents will be used for defensive purposes.The merest hint of criticism makes him defensive.The tone of the feminist speakers suggested they were adopting a rather defensive posture.Some of the tunnels in the cliff are natural, some were carved out by soldiers for defensive purposes.The anti-personnel mines were laid around the town as a defensive measure.\nSMART Vocabulary: related words and phrases\nDefending and protecting\nanti-bug\nanti-mosquito\nbaby\nbandobast\nbastion\nbuffer\ncocoon\ndefend\nfight back\nfoot patrol\nharbour\nharm\nhave (got) someone's back idiom\nhold off\npoisonous\nshelter\nsheltered\nshield\nsplashproof\nstand/keep guard phrase\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nResponding to an attack\nArms & munitions in general\ndefensive adjective\n(SENSITIVE)\nC2 too quick to protect yourself from being criticized: When asked about his decision, he got very defensive. There's no need to get so defensive!\nSMART Vocabulary: related words and phrases\nAnswering & responding\nacknowledgment\naffirmative\naffirmatively\nanswer\nclap back\nclapback\ncounter\ncounterattack\ncrickets idiom\ndefensively\nfield\nnon-responder\nnon-response\nnon-responsive\nrejoin\nrespondent\nresponse\nRSVP\nthank you\nwhataboutism\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDenying & contradicting\ndefensive adjective\n(IN SPORT)\nin a sports event, trying to prevent the opposing player or players from scoring points, goals, etc.: He's currently the best defensive player on the team.\nSMART Vocabulary: related words and phrases\nSports & games generally\nbattleship\nboard sport\nbuildering\nchoose\nchoose up sb/sth\nclassic\ncross-country\ndefensively\nhigh jinks\nland\nline\nmulti-sport\nparasport\nparkour\npickup\npre-game\nsnooker\nsport\nthe first person\nTTRPG\nSee more results »\non the defensive\nready to protect yourself because you are expecting to be criticized or attacked: The government has been put on the defensive, accused by critics of doing too little too late.\nSee more Related words\ndefensively\ndefensiveness\ndefensive adjective\n(PROTECTING)\nAdd to word list\nAdd to word list\nintended to protect against attack or harm: a defensive strategy It’s too late to sign up for the defensive driving class.\nIf someone is defensive, the person feels criticized and quickly tries to explain: Don’t be defensive – I’m just asking why you didn’t vote.\ndefensive adjective\n(SPORTS)\ntrying to prevent the opposing player or players from scoring points: The team’s defensive strategy was effective.\nAdd to word list\nAdd to word list\nFINANCE, STOCK MARKET an investment that is defensive is very safe, with little or no risk, and its value does not change very much over a period of time: a defensive share/stock\ntrying to protect someone or something from harm or attack: a defensive measure/move\nFINANCE, STOCK MARKET an investment that is very safe, with little or no risk, and whose value does not change very much over a period of time: Analysts said investors were moving to defensives that had enough cash to cover a high dividend."}