{"id":119425,"name":"defeating","type":"verb","us_sound":"dɪˈfiːt","us_link":"../audio/d/eus75529.mp3","uk_sound":"dɪˈfiːt","uk_link":"../audio/d/ukdecry025.mp3","content":"Add to word list\nAdd to word list\npresent participle of\ndefeat\nB1 to win against someone in a fight, war, or competition: Napoleon was defeated by the Duke of Wellington at the battle of Waterloo. They defeated the Italian team and reached the final. Synonyms\nannihilate informal\nbeat (DEFEAT)\nconquer\ncrush (BEAT)\nhammer (DEFEAT) informal\nthrash (DEFEAT) informal\ntrounce informalSee also\nself-defeating\nThesaurus: synonyms, antonyms, and examples\nto beat someone in a race, competition, etc.beatUnited beat City 3 - 2.defeatCan Ireland defeat New Zealand in this high-stakes match?conquerThe Greeks had fought and conquered the army of Mardonius.vanquishThe superhero always vanquishes his foes and saves the world.annihilateModern superpowers succeed not by annihilating their enemies but by buying them off.hammerThe Colts got hammered by the Patriots.\nSee more results »\nB2 to cause someone or something to fail: The proposal to change the rules was narrowly defeated (= by a very small number) by 201 votes to 196. Our ambitions for this tournament have been defeated by the weather. I'm afraid anything that involves language learning has always defeated me (= I have been unable to do it).\nMore examplesFewer examplesThe French were defeated at Waterloo in 1815.The team were overwhelmingly defeated in yesterday's game.The North defeated the South in the American Civil War.The bill was defeated in the Commons by 249 votes to 131.The four-times champion was unexpectedly defeated in the second round of the competition.\nSMART Vocabulary: related words and phrases\nWinning and defeating\nannihilate\nannihilation\nbank\nbe gunning for someone idiom\nbe one in the eye for someone idiom\nconvincing\nmoral victory\nmove/go in for the kill idiom\nnear thing\noutclass\noutcompete\nscrape\nsew\nslaughter\nstomp on someone/something\nsweep the board idiom\ntake someone down\ntake someone to the cleaner's idiom\ntake something apart\nthrash\nSee more results »"}