{"id":119512,"name":"defensively","type":"adverb","us_sound":"dɪˈfen.sɪv.li","us_link":"../audio/d/defensively.mp3","uk_sound":"dɪˈfen.sɪv.li","uk_link":"../audio/d/ukdefec014.mp3","content":"defensively adverb\n(PROTECTING)\nAdd to word list\nAdd to word list\nin a way that protects someone or something against attack or injury: His fists were raised defensively when he spun and spotted the young man opposite. People have long believed that plants respond to insect attacks defensively.\nMore examplesFewer examplesIt is the responsibility of sport bikers to drive defensively at all times and wear adequate safety equipment. They intend to dig in defensively and fight to the death.\nSMART Vocabulary: related words and phrases\nDefending and protecting\nanti-bug\nanti-mosquito\nbaby\nbandobast\nbastion\nbuffer\ncocoon\ndefend\ndefensive\nfoot patrol\nharbour\nharm\nhave (got) someone's back idiom\nhold off\ninoculation\nsheltered\nshield\nsplashproof\nstand/keep guard phrase\ntake someone under your wing idiom\nSee more results »\ndefensively adverb\n(SENSITIVELY)\nin a way that shows you feel you are being criticized and do not like it: \"It's not something I could have prevented,\" he said, a bit defensively.\nMore examplesFewer examplesHe became defensively touchy towards old friends.Sam corrected her rather defensively. The department finds itself reacting defensively.\nSMART Vocabulary: related words and phrases\nAnswering & responding\nacknowledgment\naffirmative\naffirmatively\nanswer\nanswer (someone) back\nclap\nclap back\nclapback\ncounter\ncounterattack\ncrickets idiom\ndefensiveness\nfield\nnon-response\nnon-responsive\nrespondent\nresponse\nRSVP\nthank you\nwhataboutism\nSee more results »\ndefensively adverb\n(IN SPORT )\nin a way that is intended to prevent the opposing player or players from scoring points, goals, etc.: He was always returning the ball defensively. You're not going to beat Australia by batting defensively.\nin a way that relates to the part of the team that tries to prevent the other team from scoring: Although we're quite dangerous in attack we are bad defensively. France illustrated how vulnerable Ireland can be defensively. See\ndefensive\nMore examplesFewer examplesIf we only play defensively, we won't be able to win.Defensively, they are solid and they have got some fantastic players. I thought they'd be better defensively but they lack discipline.\nSMART Vocabulary: related words and phrases\nAnswering & responding\nacknowledgment\naffirmative\naffirmatively\nanswer\nanswer (someone) back\nclap\nclap back\nclapback\ncounter\ncounterattack\ncrickets idiom\ndefensiveness\nfield\nnon-response\nnon-responsive\nrespondent\nresponse\nRSVP\nthank you\nwhataboutism\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSports & games generally\nAdd to word list\nAdd to word list\nacting in a way that shows feelings of being criticized and the need to quickly explain : When asked where she went, she answered defensively."}