{"id":119439,"name":"defect","type":"noun","us_sound":"ˈdiː.fekt","us_link":"../audio/d/defect_01_00.mp3","uk_sound":"ˈdiː.fekt","uk_link":"../audio/d/ukdefec001.mp3","content":"Add to word list\nAdd to word list\nC1 a fault or problem in something or someone that spoils that thing or person or causes it, him, or her not to work correctly: All the company's aircraft have been grounded, after a defect in the engine cooling system was discovered. There are so many defects in our education system. It's a character defect in her that she can't ever admit she's wrong.\na physical condition in which something is wrong with a part of someone's body: She suffers from a heart/sight/speech defect. The drug has been shown to cause birth defects. Cystic fibrosis is caused by a genetic defect.\nSMART Vocabulary: related words and phrases\nFaults and mistakes\naberration\nAchilles heel\nadrift\nblack mark\nblemish\nerror\nfailing\nfalse move\nfaux pas\nflaw\nmiscue\nmisfunction\nmisperception\nmisprint\nmisspelling\nthat's/it's your funeral! idiom\ntypo\nwardrobe malfunction\nweakness\nwhat price...? idiom\nSee more results »\nto leave a country, political party, etc., especially in order to join an opposing one: When the national hockey team visited the US, half the players defected. The British spy, Kim Philby, defected to the Soviet Union/defected from Britain in 1963. Compare\ndesert verb\nSMART Vocabulary: related words and phrases\nRunning away and escaping\nabscond\nabscond from somewhere\nabscond with someone/something\nback away\nback off\nelopement\nelude\nescapology\nextrication\nflee\nheel\nleg\nloose\nrun away\nrunaway\nscarce\nscarper\nscram\nthrow\nunderground\nSee more results »\nRelated word\ndefector\ndefect noun [C]\n(SOMETHING WRONG)\nAdd to word list\nAdd to word list\nsomething that is lacking or that is not exactly right in someone or something: The cars have a defect in the electrical system that may cause them to stall. defective adjective us\nYour browser doesn't support HTML5 audio\n/dɪˈfek·tɪv/\nI replaced the defective light switch.\ndefect verb [I]\n(LEAVE)\nto leave a country or a group you belong to, esp. in order to join an opposing one: Some of the mayor’s long-time supporters have defected to other candidates. defection noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/dɪˈfek·ʃən/\n[ C ] There have been defections to the US by several Cuban baseball players.\nAdd to word list\nAdd to word list\nCOMMERCE, PRODUCTION a fault that spoils something or causes it not to work correctly: product defects The report cited structural defects as the reason for the demolition of the building. correct/remedy/rectify a defect a major/serious/minor defect a design/manufacturing defect\nWORKPLACE to leave one company or organization and form or join another: defect from/to sth Many of our sales team have defected to the competition.\nCOMMERCE, MARKETING to stop buying a particular product or service and buy a different one instead: defect from/to sth Millions of customers defected to rival telecommunications companies.\nPOLITICS to leave your country or group and join another because you disagree with the ideas of those in control: He's a pilot who defected to the United States. defection noun [ C or U ]\nSince the introduction of the new tariff, there have been fewer customer defections."}