{"id":119484,"name":"defended","type":"verb","us_sound":"dɪˈfend","us_link":"../audio/d/eus75533.mp3","uk_sound":"dɪˈfend","uk_link":"../audio/d/ukdefec008.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\ndefend\ndefend verb\n(PROTECT)\nB1 [ T ] to protect someone or something against attack or criticism: How can we defend our homeland if we don't have an army? White blood cells help defend the body against infection. They are fighting to defend their beliefs/interests/rights. I'm going to karate lessons to learn how to defend myself. The Bank of England intervened this morning to defend the pound (= stop it from losing value). Compare\nattack verb (HURT)\n[ T ] to speak or write in support of someone or something: He vigorously defended his point of view. The president was asked how he could defend a policy that increased unemployment.\nMore examplesFewer examplesThe general rallied his forces to defend the town.Police officers used riot shields to defend themselves.A female lion defends her young ferociously.In the past, the party would have closed ranks around its leader and defended him loyally.Should the church always defend traditional values, or be open to changing them?\nSMART Vocabulary: related words and phrases\nDefending and protecting\nanti-bug\nanti-mosquito\nbaby\nbandobast\nbastion\nbuffer\ndefence\ndefend\nfoot patrol\nharbour\nharm\nhave (got) someone's back idiom\nhold off\ninoculation\nshield\nsplashproof\nstand/keep guard phrase\ntake someone under your wing idiom\nundefended\nwing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBacking, supporting & defending\ndefend verb\n(IN LAW)\n[ T ] to act as a lawyer for someone who has been accused of something in a court of law and try to prove that they are not guilty: The lawyer defending the students asked the judge to dismiss the charges. He has defended many famous clients. Unusually, the accused opted to defend himself in court. The company has spent a lot of money defending the case.\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\nextrajudicial\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\npleading\npower of attorney\nprecedent\npretrial\nprobate\nthe Webster ruling\nwardship\nwitness to something\nwobbler\nSee more results »\ndefend verb\n(IN SPORT)\n[ T ] to compete in a sports competition that you won before and try to win it again: He will defend his 1,500 metre title this weekend. The defending champion will play her first match of the tournament tomorrow.\n[ I ] to try to prevent the opposing player or players from scoring points, goals, etc. in a sport: In the last ten minutes of the game, we needed to defend.\nSMART Vocabulary: related words and phrases\nCompeting in sport\nbring\nbring someone on\nbye\nbye week\ncatchup\nclash\nduel\nexplosive\nfield\nflying start\ngo the distance idiom\nmatch\noutduel\npark the bus idiom\npartner\npartner up\nplay big idiom\nplay sb on idiom\nsquare\nweigh\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral terms used in ball sports"}