{"id":119473,"name":"defence","type":"noun","us_sound":"dɪˈfens","us_link":"../audio/d/defense.mp3","uk_sound":"dɪˈfens","uk_link":"../audio/d/ukdefec005.mp3","content":"defence noun\n(PROTECTION)\nAdd to word list\nAdd to word list\nA2 [ U ] the act of protecting someone or something against attack or criticism : He published an essay in defence of the freedom of the press. These people have died in the defence of liberty. She angrily came to her friend's defence. to leap/rush/jump/spring to sb's defence (= defend them quickly) See also\nself-defence UK\n[ C or U ] something that provides protection against attack from enemies, or against something dangerous such as weather or an infection: The rebels' only form of defence against the soldiers' guns was sticks and stones. The towers were once an important part of the city's defences. She called for new flood defences to be built. A good diet helps build the body's natural defences.\n[ U ] the systems, organizations, parts of a country's government, etc. that are involved in a country protecting itself against attack: The war has ended but government spending on defence is still increasing. the Ministry of Defence a defence secretary/minister/spokesperson the defence budget\n[ C ] a piece of writing or speech that supports something or someone that has been criticized: The book is a closely argued defence of the economic theory of Keynes.\nMore examplesFewer examplesWhenever anyone criticizes her husband, she immediately jumps to his defence.\"Shut up,\" she said, leaping to her friend's defence.Huge sums of money are spent on national defence.They have been strengthening their border defences in preparation for war.Why is our defence budget so high?They put up a sturdy defence of their proposal.\nSMART Vocabulary: related words and phrases\nDefending and protecting\nanti-bug\nanti-mosquito\nbaby\nbandobast\nbastion\nbuffer\ncocoon\ndefensive\nfight back\nfoot patrol\nharbour\nharm\nhave (got) someone's back idiom\nhold off\npoisonous\nshelter\nsheltered\nshield\nsplashproof\nstand/keep guard phrase\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBacking, supporting & defending\nThe armed forces generally\nUK politics: government departments & organizations\ndefence noun\n(IN LAW)\n[ S or U ] an argument or explanation that you use to prove that you are not guilty of something: The judge remarked that ignorance was not a valid defence. All I can say, in defence of my actions, is that I had little choice.\n[ S ] the things said in court to prove that a person did not commit a crime: She said that she didn't want a lawyer and was going to conduct her own defence. the defence C2\nthe person or people in a law case who have been accused of doing something illegal, and their lawyer(s): a witness for the defence a defence lawyer\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\nextrajudicial\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\npleading\npower of attorney\nprecedent\npretrial\nprobate\nthe Webster ruling\nwardship\nwitness to something\nwobbler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLawyers & legal officials\nPeople appearing in court\ndefence noun\n(SPORT)\nB1 [ S or U ] in some sports, the part of a team that tries to prevent the other team from scoring goals or points: a strong defence I play in defence.\nMore examplesFewer examplesThe team has a strong attack, but its defence is weak.\nSMART Vocabulary: related words and phrases\nCompetitors & participants in sports & games\nback four\nballer\nballplayer\nbase jumper\nbenchwarmer\nchallenger\njumper\nkeeper\nlogroller\nlong-jumper\nlongboarder\nmajor league\nmid-table\nracer\nretire\ntrampolinist\ntrialist\ntriathlete\ntriple jumper\ntriple threat\nSee more results »\ndefence noun\n(CHESS)\n[ C or U ]\n&#160; games\n&#160; specialized in the game of chess, a particular set of moves used by the person playing with the black pieces: What defence did you use in that last game?\nSMART Vocabulary: related words and phrases\nBoard games\nbackgammon\nbishop\nblitz\nboard game\ncastle\nChinese chequers\nChutes and Ladders\ncounterplay\ndraught\nendgame\nforfeit\ngambit\nmove\npawn\npin\nqueen\nqueenside\nre-roll\nresign\nsquare\nSee more results »\nAdd to word list\nAdd to word list\n[ S or U ]\n&#160; LAW an argument or explanation which you use to prove that you are not guilty of something: Now he says he's done nothing wrong, and I assume that will be his defence in court. a defense attorney/lawyer\nthe defence [ S ]\nLAW the person or people in a law case who have been accused of doing something illegal, and the lawyer or lawyers who are representing them: He claims that official documents of vital importance to the defence were not available. Compare\nprosecution\n[ C ] a method used by a company to avoid having another company take control of it: The chief executive led a vigorous takeover defence. One possible defence strategy is to mount a higher counter-bid for the parent company.\nSee also\ncrown jewels defence\nPacman defence"}