{"id":119420,"name":"defeat","type":"verb","us_sound":"dɪˈfiːt","us_link":"../audio/d/eus75529.mp3","uk_sound":"dɪˈfiːt","uk_link":"../audio/d/ukdecry025.mp3","content":"Add to word list\nAdd to word list\nB1 to win against someone in a fight, war, or competition: Napoleon was defeated by the Duke of Wellington at the battle of Waterloo. They defeated the Italian team and reached the final. Synonyms\nannihilate informal\nbeat (DEFEAT)\nconquer\ncrush (BEAT)\nhammer (DEFEAT) informal\nthrash (DEFEAT) informal\ntrounce informalSee also\nself-defeating\nThesaurus: synonyms, antonyms, and examples\nto beat someone in a race, competition, etc.beatUnited beat City 3 - 2.defeatCan Ireland defeat New Zealand in this high-stakes match?conquerThe Greeks had fought and conquered the army of Mardonius.vanquishThe superhero always vanquishes his foes and saves the world.annihilateModern superpowers succeed not by annihilating their enemies but by buying them off.hammerThe Colts got hammered by the Patriots.\nSee more results »\nB2 to cause someone or something to fail: The proposal to change the rules was narrowly defeated (= by a very small number) by 201 votes to 196. Our ambitions for this tournament have been defeated by the weather. I'm afraid anything that involves language learning has always defeated me (= I have been unable to do it).\nMore examplesFewer examplesThe French were defeated at Waterloo in 1815.The team were overwhelmingly defeated in yesterday's game.The North defeated the South in the American Civil War.The bill was defeated in the Commons by 249 votes to 131.The four-times champion was unexpectedly defeated in the second round of the competition.\nSMART Vocabulary: related words and phrases\nWinning and defeating\nannihilate\nannihilation\nbank\nbe gunning for someone idiom\nbe one in the eye for someone idiom\nconvincing\nmove/go in for the kill idiom\nnear thing\noutclass\noutcompete\noutfox\nsew\nslaughter\nsweep\nsweep the board idiom\ntake someone down\ntake someone to the cleaner's idiom\ntake something apart\ntakedown\nthrash\nSee more results »\nB1 the fact of losing against someone in a fight or competition, or when someone or something is made to fail: In the last election, they suffered a crushing/humiliating defeat. After their defeat in battle, the soldiers surrendered. She admitted/conceded defeat well before all the votes had been counted. Compare\nvictory admit defeat\nto accept that you cannot do something: I thought I could fix the radio myself, but I had to admit defeat.\nSee more\nMore examplesFewer examplesThe Democrats suffered a crushing defeat in the last election.Her silence was taken as an admission of defeat.He was famed for his stubborn resistance and his refusal to accept defeat.Saturday's 2-0 defeat dashed their hopes of reaching the final.His defeat in the world championship led to a long period of gloomy introspection.\nSMART Vocabulary: related words and phrases\nWinning and defeating\nannihilate\nannihilation\nbank\nbe gunning for someone idiom\nbe one in the eye for someone idiom\nconvincing\nmove/go in for the kill idiom\nnear thing\noutclass\noutcompete\noutfox\nsew\nslaughter\nsweep\nsweep the board idiom\ntake someone down\ntake someone to the cleaner's idiom\ntake something apart\ntakedown\nthrash\nSee more results »\nAdd to word list\nAdd to word list\nto oppose and cause someone to lose in a competition or war so that you can win: Bill Clinton defeated George Bush for the presidency in 1992.\nsuccess in competition with an opponent, causing the opponent to lose so that you can win: [ U ] In the American Civil War, the North’s defeat of the South involved tremendous loss of life on both sides.\nA defeat is also the action or fact of losing a competition or war: [ C ] This was the team’s fifth straight defeat."}