{"id":119604,"name":"define","type":"verb","us_sound":"dɪˈfaɪn","us_link":"../audio/d/eus75543.mp3","uk_sound":"dɪˈfaɪn","uk_link":"../audio/d/ukdefil003.mp3","content":"define verb [T]\n(EXPLAIN)\nAdd to word list\nAdd to word list\nB2 to say what the meaning of something, especially a word, is: In the dictionary, \"reality\" is defined as \"the state of things as they are, rather than as they are imagined to be\". Before I answer your question, could you define your terms a little more (= explain what you mean by the words you have used)? See also\nwell defined\nB2 to explain and describe the meaning and exact limits of something: Your rights and responsibilities are defined in the citizens' charter. Your role in the project will be strictly defined (= limited to particular areas). I'd hate to feel that I was defined by (= that my life got its meaning and importance only from) my job.\nThesaurus: synonyms, antonyms, and examples\nto explain somethingexplainCan you explain that again?clarifyLet me just clarify what I mean here.defineYour responsibilities are clearly defined in the contract.set outYour contract will set out the terms of your employment.set forthThe terms of the statute are set forth in Section I, Article 3.spell outThey sent me a letter spelling out the details of the agreement.\nSee more results »\nMore examplesFewer examplesIt is very difficult to define the concept of beauty.The borderline between friendship and intimacy is often hard to define.Security defined in the broadest sense of the term means getting at the root causes of trouble and helping to reduce regional conflicts.It's a very hierarchical organization in which everyone's status is clearly defined.Responsibility, I suppose, is what defines adulthood.\nSMART Vocabulary: related words and phrases\nDefining & explaining\naccount (to someone) for something\naccountability\nadumbrate\nadumbration\nannotation\nannotator\nbelabour\ndemythologize\ndisabuse\nexcuse\nextenuate\ninexpressibly\njustificatory\nlay something out\nlimn\nmansplaining\noutline\nsketch\nspell\nundefinable\nSee more results »\ndefine verb [T]\n(CLEARLY SHOW)\nto show clearly the edge of something: The outline of the castle on the hill was clearly defined against the evening sky.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndemonstrative\nindicate\nostensive\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nreflect\nreveal\nspeak\nunwrap\nvent\nvirtue signalling\nvisualization\nSee more results »\nRelated word\ndefinable\ndefine verb [T]\n(EXPLAIN)\nAdd to word list\nAdd to word list\nEnglish to describe the meaning of something, esp. a word, or to explain something more clearly so that it can be understood: How would you define “jaded”?\ndefine verb [T]\n(SHOW)\nto show clearly the edge or shape of something: The dark figures are sharply defined on the white background. definable adjective us/dɪˈfɑɪ·nə·bəl/\nAdd to word list\nAdd to word list\nto say what the meaning of something, especially a word, is: Economists normally define a recession as two successive quarters of negative growth.\nto explain and state the meaning and exact limits of something: a defined goal/objective If you want employees to be more productive, then you must define and measure productivity precisely."}