{"id":119575,"name":"deficit","type":"noun","us_sound":"ˈdef.ə.sɪt","us_link":"../audio/d/deficit.mp3","uk_sound":"ˈdef.ɪ.sɪt","uk_link":"../audio/d/ukdefec029.mp3","content":"Add to word list\nAdd to word list\nC1 the total amount by which money spent is more than money received: The country is running a balance-of-payments/budget/trade deficit of $250 million. The UK's deficit in manufactured goods fell slightly in the last three months. Synonym\nshortfallOpposite\nsurplus\nMore examplesFewer examplesThere are many priorities, but reducing the budget deficit is paramount/is of paramount importance.By late in the first half United were staring at a seven-goal deficit and almost certain defeat.The UK trade deficit widened/narrowed last month.The government claimed they were doing a good job of reducing the country's trade deficit and balancing the budget.The deficit has been rising in recent years because of a drop in earnings from oil, the country's main export.\nSMART Vocabulary: related words and phrases\nProfits & losses\nanti-profiteering\nanti-speculative\nbe a licence to print money idiom\nbuoyancy\nbuoyant\ncash cow\ngold mine\nlose\nlose your shirt idiom\nmargin\nmuck\npi\npocket\nprofit from something\nprofit warning\nprofitability\nprofitable\nrake-off\ntrade surplus\nwinnings\nSee more results »\nAdd to word list\nAdd to word list\nthe amount by which money spent is more than money received: The theater has been operating at a deficit of over $150,000 a year.\nAdd to word list\nAdd to word list\nECONOMICS, FINANCE the total amount by which money spent by a business or government is more than the money it receives: a deficit of £10 million/$1 billion, etc. The two companies between them have reported a deficit of nearly $14bn.have/run/show a deficit About a third of the nation's non-profit arts presenters run a large deficit each year, according to Charity Navigator. reduce/cut a deficit federal/government/public deficit The US balance of payments deficit was running at over 4% of gross domestic product.\nthe amount by which something, especially an amount of money, is smaller than it should be: a pension/pension fund deficita deficit in sth The company reported that an estimated $31.5 million deficit in this year's operating budget would end up at about $20 million as a result of savings. There is a deficit of trust between the customer and the banks, which yesterday's headline figure will do little to dispel. Compare\nsurplus\nin deficit\nused to describe a situation when a business or country has spent more money than it has received, or an amount of money is smaller than it should be: At the time, the Federal Budget was expected to remain in deficit until at least Fiscal 2011. At their last valuation, almost all council pension funds were in deficit.\nSee also\nbudget deficit\ncurrent account deficit\nexternal deficit\ntrade deficit"}