{"id":119571,"name":"deficiency","type":"noun","us_sound":"dɪˈfɪʃ.ən.si","us_link":"../audio/d/deficiency.mp3","uk_sound":"dɪˈfɪʃ.ən.si","uk_link":"../audio/d/ukdefec026.mp3","content":"Add to word list\nAdd to word list\nC1 a state of not having, or not having enough, of something that is needed: Pregnant women often suffer from iron deficiency. Deficiencies in the education system have been much in the news. Synonym\nlack of something\nMore examplesFewer examplesSevere iron deficiency can cause developmental delay and growth retardation.The teacher even implied that he was suffering from some kind of mental deficiency.The blood tests revealed a deficiency in certain key minerals and vitamins.There were clear deficiencies in the standard of service provided.Despite his deficiencies as a husband, he was a good father to his children.\nSMART Vocabulary: related words and phrases\nScarce, inadequate and not enough\nbe at a premium idiom\nbe thin on the ground idiom\ndearth\ndeficient\ndeficiently\ngold dust\nlousy\nmeagre\nmeagrely\nmeasly\nmingy\nnearly\nshortage\nshortfall\nshortness\nshy\nskimpily\nskinny\nsparse\nthin\nSee more results »\nAdd to word list\nAdd to word list\nthe lack of something that is needed in order to meet a particular standard or level of quality, or the thing that is lacking: [ U ] Many women suffer from iron deficiency.\nAdd to word list\nAdd to word list\n[ C ] a situation in which something is not as good as it should be: a deficiency in sth The audit revealed deficiences in the accounting system. an operations/performance/service deficiencyidentify/highlight a deficiency We need to identify any deficiencies in the system and address them immediately. address/correct/remedy a deficiency\nACCOUNTING the amount by which something such as income or profit is less than it should be: a deficiency in sth They are not permitted to borrow additional funds as long as any deficiency exists in the capital reserve fund. The accounts show a balance sheet deficiency - the amount by which liabilities exceed assets - of £13.19m at December 31. The company has suffered recurring losses from operations and has a net capital deficiency that raises substantial doubt about its ability to continue as a going concern.\nTAX, ACCOUNTING\n&#160; US the amount by which the tax recorded in someone's financial records is less than the tax they actually owe, or a situation in which this happens: The IRS notified him that he was subject to a $10000 tax deficiency for the 2009 tax year."}