{"id":119615,"name":"defining","type":"adjective","us_sound":"dɪˈfaɪ.nɪŋ","us_link":"../audio/d/cdo0123usdefi0708.mp3","uk_sound":"dɪˈfaɪ.nɪŋ","uk_link":"../audio/d/cdo0123ukdefi0871.mp3","content":"defining adjective\n(IMPORTANT)\nAdd to word list\nAdd to word list\nA defining moment, feature, etc. is so important that it is or becomes part of the basic meaning or description of something. : Winning this contest was the defining moment of her life. The attacks were the defining event of his presidency. Electronic dance music is characterized by several defining features. Synonym\nkey\nMore examplesFewer examplesThough he sometimes felt trapped by his past success and fame, he also knew that it was the completely defining thing in his life.She was a defining force in the American theatre as well as in so many people's lives.The invention of celluloid was a defining advance in early polymer science.Many Americans saw communism as the defining moral challenge of the age.For all the differences between the candidates, none is more defining than this issue.\nSMART Vocabulary: related words and phrases\nVery important or urgent\nall-important\nat all costs idiom\nbe a matter of life and/or death idiom\ncardinally\nchief\nimperative\nlife-altering\nlife-and-death\nlife-changing\nmainly\nmajor league\noverriding\nprime\nprincipally\nprior\nprized\nradical\nseminal\ntectonic\nweighty\nSee more results »\ndefining adjective\n(LANGUAGE)\nlanguage\n&#160; specialized (of a clause) giving information about someone or something that is necessary in order to understand who or what is being referred to, or (of a pronoun) used in a clause like this: No commas are used before defining clauses. In \"They interviewed the woman whose dog had been rescued\", \"whose dog had been rescued\" is a defining relative clause because it makes clear which woman is being talked about. We can use \"who\" or \"that\" as a defining relative pronoun to talk about people. Compare\nnon-defining\nMore examplesFewer examplesDefining clauses give essential information to identify the person or thing we are talking about.If we remove the defining relative clause from the sentence \"Cats that have blue eyes are very unusual\", the meaning of the sentence changes completely.If we say \"the Sam who we used to know\", there is more than one Sam and \"who we used to know\" serves as a defining relative clause.Is this clause defining or non-defining?\nSMART Vocabulary: related words and phrases\nLinguistics: sentences & expressions\nadage\nasyndetic\nasyndetically\nasyndeton\nbackchannel\nclause\ncoin\ncomplex sentence\ncompound sentence\nconcessive clause\ndictum\nepigram\nmotto\noperative\nphrase\nproverbial\nsentence\nslogan\nto coin a phrase idiom\nTrumpism\nSee more results »"}