{"id":119652,"name":"deflation","type":"noun","us_sound":"dɪˈfleɪ.ʃən","us_link":"../audio/d/usdecol030.mp3","uk_sound":"dɪˈfleɪ.ʃən","uk_link":"../audio/d/ukdefil010.mp3","content":"deflation noun [U]\n(MAKING SMALLER/WEAKER)\nAdd to word list\nAdd to word list\nthe action of making something smaller by removing the air from inside it; the fact of becoming smaller in this way : The rate of deflation of the balloon depends on the kind of material from which it is made.\nthe situation in which something becomes weaker, or something or someone becomes less confident than before: a feeling of deflation after the party\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nabridgment\nattenuate\nattenuated\nattenuating\nattenuation\nboil\ndamp\nfall off\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nrightsizing\nroll back something\nrollback\nrun someone/something down\nrundown\nshave\ntelescope\ntumble\nSee more results »\ndeflation noun [U]\n(MONEY)\na reduction of the supply of money in an economy, and therefore a reduction of economic activity, that is often part of an intentional government plan to reduce prices Compare\ninflation (INCREASE)\nreflation\na reduction in value: There has been a deflation in/of property values.\nSMART Vocabulary: related words and phrases\nEconomics\naccommodative\nanti-economic\nanti-inflation\nanti-inflationary\nanti-recession\ndeindustrialization\ndouble-dip\nGDP\nhuman development index\nindustrialism\ninflation\nKeynesian\nliberal\nmarket economy\nmarketeering\nmonetary\npeace dividend\nretrench\nstagflation\nthe public purse\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrice decreases\nRelated word\ndeflationary\nAdd to word list\nAdd to word list\nECONOMICS an economic situation in which prices fall and there is a reduction in wages and government spending, and low levels of growth: Global deflation is squeezing profits and extinguishing jobs. He warned that Euroland could sink into deflation unless the central bankers tailored their policies to promote economic growth. In monetary deflation, a contracting money supply causes prices and demand to decline.\na situation in which the value or price of something is reduced: The current deflation of home prices is having a profound effect on American society. The price of cars, computers, and dishwashers have all been falling as global deflation in traded goods gathers pace. asset deflation. Compare\ndisinflation\ninflation\nreflation"}