{"id":119666,"name":"deflection","type":"noun","us_sound":"dɪˈflek.ʃən","us_link":"../audio/d/usdefla002.mp3","uk_sound":"dɪˈflek.ʃən","uk_link":"../audio/d/ukdefil013.mp3","content":"Add to word list\nAdd to word list\n[ C or U ] a change of direction after hitting something: The second goal was from a deflection off the Liverpool defender. His shot took a deflection and sailed into the net. Measure the angle of deflection of the laser beam when it hits the surface.\n[ C or U ] something you do or say in order to avoid something such as criticism, blame, or a question being directed at you: Reporters were frustrated by her constant deflection of their questions. I noticed his skilful deflection of blame onto other team members. There are jokes and deflections but no answers.\n[ U ]\n&#160; psychology\n&#160; specialized the act of attacking or blaming another person rather than accepting criticism or blame for your own actions: Deflection is a psychological defence in which you deflect blame to others. Related word\ndeflect\nMore examplesFewer examplesThe deflections steer the electrons into patterns known to mathematicians and physicists as caustics.For decades he has been on the public stage and yet he remains inscrutable, a cagey master of deflection. That was a nice attempt at deflection but I'm going to ask you the question again!The decision to campaign on taxation provides a neat deflection from discussion about health and crime, two areas where the government is weak.Deflection is a deliberate tactic in which any attempt to talk about feelings or behaviour is met with a barrage of argument and blame of others.\nSMART Vocabulary: related words and phrases\nChanging direction\nabout-face\nabout-turn\nbear\nbranch\nbranch off\nbreak\ndecoy\ndo an about-turn\nexcursive\nexcursively\nflippy\nglance off (something)\nregear\nreverse\nslew\nsomeone's back is turned idiom\nswerve\nturn around\nturn off (something)\nwheel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAvoiding action\nBlaming & accusing"}