{"id":119665,"name":"deflecting","type":"verb","us_sound":"dɪˈflekt","us_link":"../audio/d/eus75545.mp3","uk_sound":"dɪˈflekt","uk_link":"../audio/d/ukdefil012.mp3","content":"Add to word list\nAdd to word list\npresent participle of\ndeflect\n[ I or T ] to change direction after hitting something, or to cause something to do this : The ball deflected off my shoulder, straight into the goal. The crowd cheered as the goalkeeper deflected the shot. If a huge meteor was heading towards us, our best hope could be to deflect it away from the Earth using a nuclear explosion.\n[ T ] to cause someone to change from or stop what they were intending to do: His initial defeats did not deflect him from his ambitions. She listens to him, but doesn't allow herself to be deflected from her purpose. We will continue with our plans and not be deflected by the attacks.\n[ T ] to avoid something such as criticism, blame, or a question being directed at you: The president deflected criticism of his economic record by focusing on crime. He successfully deflected blame for his mismanagement of the crisis. I just tried to deflect questions the best way I could.\n[ I or T ]\n&#160; psychology\n&#160; specialized to attack or blame another person rather than accepting criticism or blame for your own actions: When someone deflects, they are trying to feel less guilty, avoid negative consequences, and put the blame on others. The guilty person deflects their guilt onto the person who is accusing them or onto another person. Related word\ndeflection\nMore examplesFewer examplesShe uses her long arms to distract shooters and deflect passes.Screens deflect fish away from the dams' turbines.Most of the stream of high-energy radiation coming from the Sun is deflected by Earth's magnetic field.Let your boss realize that nothing is going to deflect you from reaching your objectives. The administration tried to deflect criticism of its environmental record by focusing on troubles in Congress. They painted him as the victim of a malicious smear campaign, thus deflecting the spotlight from his lack of experience.The abuser immediately responds to any discussion or confrontation of his actions by deflecting the focus onto the survivor's behaviour.Being friends with someone who deflects onto you can damage your mental health and self-esteem.Here are some signs your partner may be deflecting responsibility for what goes wrong in your relationship.\nSMART Vocabulary: related words and phrases\nChanging direction\nabout-face\nabout-turn\nbear\nbranch off\nbreak\ncut\ndecoy\ndo an about-turn\nexcursive\nexcursively\nflippy\nglance off (something)\nreverse\nslew\nsomeone's back is turned idiom\nswerve\nturn\nturn around\nturn off (something)\nU-ie\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGoals and purposes\nAvoiding action\nBlaming & accusing"}