{"id":119784,"name":"defraud","type":"verb","us_sound":"dɪˈfrɑːd","us_link":"../audio/d/eus71187.mp3","uk_sound":"dɪˈfrɔːd","uk_link":"../audio/d/ukdefil025.mp3","content":"Add to word list\nAdd to word list\nto take something illegally from a person, company, etc., or to prevent someone from having something that is legally theirs by deceiving them: He was found guilty of defrauding the Internal Revenue Service. They are both charged with conspiracy to defraud an insurance company of $20,000. Synonyms\ncon informal\ndiddle (TRICK) informal\ngyp US informal old-fashioned\nrook old-fashioned informal\nswindle\nThesaurus: synonyms, antonyms, and examples\nto deceive someonedeceiveThe cigarette companies deceived the public about the health risks of cigarettes.deceive yourselfYou'd be deceiving yourself if you believed that.trickShe felt they had tricked her into saying more than she intended.foolYou don't fool me with your innocent act.take inThey claimed to be destitute, but we weren't taken in.pull the wool over someone's eyesI'm not stupid. You can't pull the wool over my eyes like that.\nSee more results »\nSMART Vocabulary: related words and phrases\nFraud & corruption\nanti-bribery\nanti-corruption\nanti-counterfeiting\nanti-fraud\nAugean\nbribe\ndark money\ndefalcation\ndolus\nembezzle\nembezzlement\nimposture\ninsider dealing\nlaunder\nmalfeasance\nmalpractice\nmatch-fixing\nnobble\npyramid scheme\nsiphon\nSee more results »\nAdd to word list\nAdd to word list\nto take or keep something illegally from someone by deceiving the person: She is charged with defrauding the Internal Revenue Service.\nAdd to word list\nAdd to word list\nto take money or goods illegally from someone by deceiving them: defraud sb of sth An architect and two surveyors defrauded a charity trust of £3.5m by invoicing it for work they did not do and by inflating fees in building contracts. The police made a number of arrests at the company's head office in connection with a conspiracy to defraud investors."}