{"id":119550,"name":"defy","type":"verb","us_sound":"dɪˈfaɪ","us_link":"../audio/d/defy.mp3","uk_sound":"dɪˈfaɪ","uk_link":"../audio/d/ukdeftl005.mp3","content":"Add to word list\nAdd to word list\nC2 to refuse to obey a person, decision, law, situation, etc.: It is rare to see children openly defying their teachers. A few workers have defied the majority decision and gone into work despite the strike. The fact that aircraft don't fall out of the sky always seems to me to defy (= act against) the law of gravity. A forest fire raging in southern California is defying (= is not changed by) all attempts to control it.\nThesaurus: synonyms, antonyms, and examples\nto disagree with something by speaking or fighting against itopposeVillagers opposed plans to widen the carriageway.objectNo one objected to the decision.defyA few workers defied the decision to strike and went in to work.speak out againstMore and more people are speaking out against this unpopular law.stand out againstMore people are standing out against the corruption of the local government. declare againstUK She declared against the new airport.\nSee more results »\ndefy belief/description/explanation\nC2 to be extreme or very strange and therefore impossible to believe, describe, or explain: The chaos at the airport defies description.\nSee more defy someone to do something\nto tell someone to do something that you think will be impossible: I defy you to prove your accusations.\nSee more\nMore examplesFewer examplesThe mess in Bart's room defies description!His remarkable recovery defied all medical augury.In 1970 he defied the three-line whip against EC membership.They defied convention by giving up their jobs and becoming self-sufficient.Tom Cruise has performed his own stunts for Mission Impossible 2, defying warnings from professionals.\nSMART Vocabulary: related words and phrases\nRefusing & rejecting\nabjuration\nabnegate\nabnegation\nbar\nbat something/someone away\nbrush\ndemur\njettison\nmiss a chance/opportunity idiom\nopt out\npass something up\npunt on something\nquit\nquit on someone\nreact\nrebuff\nresistant\nspurn\nturn your nose up idiom\nwild horses wouldn't drag me idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOpposing & against\nAdd to word list\nAdd to word list\nto refuse to obey or to do something in the usual or expected way: They defied an evacuation order and stayed in town during the hurricane. He defied the odds (= did what no one expected) and won the race for mayor. defiant adjective us\nYour browser doesn't support HTML5 audio\n/dɪˈfɑɪ·ənt/\nShe is defiant, angry, and tough. defiantly adverb us\nYour browser doesn't support HTML5 audio\n/dɪˈfɑɪ·ənt·li/\nWhen I said she might fail, she replied defiantly, “No, I won’t!”"}