{"id":120214,"name":"delay","type":"verb","us_sound":"dɪˈleɪ","us_link":"../audio/d/eus75550.mp3","uk_sound":"dɪˈleɪ","uk_link":"../audio/d/ukdejur004.mp3","content":"Add to word list\nAdd to word list\nA2 [ I or T ] to make something happen at a later time than originally planned or expected: My plane was delayed by an hour. Heavy snow delayed the start of the game. [ + -ing verb ] I think we should delay deciding about this until next year.\nB1 [ T ] to cause someone or something to be slow or late: I was delayed by traffic.\n[ I ] to not act quickly or immediately: If you delay now, the opportunity might be lost.\nMore examplesFewer examplesThe new treatment can delay the onset of the disease by several years.This decision may delay the process of European unification.The legal to-ings and fro-ings could delay the start of the trial for up to six months.The project has been delayed by innumerable problems.They've just announced on the PA that our flight's been delayed.\nSMART Vocabulary: related words and phrases\nDelaying and wasting time\nado\nbusywork\nbuy time idiom\ncarry something over\ndally\ngridlock\ninefficiently\nkept\nkick\nkick something into the long grass idiom\nkick the can down the road idiom\npush\nretard\nretardation\nset someone back (something)\nshelve\nsit\nsit on something\nspin\nstall\nSee more results »\nA2 the situation in which you have to wait longer than expected for something to happen, or the time that you have to wait: This situation needs to be tackled without delay. Long delays are predicted on the motorway because of the accident. There has been a delay in the book's publication. Synonym\ntime lag\nMore examplesFewer examplesWe had to endure a nine-hour delay at the airport.Trains may be subject to delay on the northern line - we apologize for any inconvenience caused.Please settle your account without further delay.There are delays on the M4 because of roadworks.We should arrive at ten o'clock, as long as there are no unexpected delays.\nSMART Vocabulary: related words and phrases\nDelaying and wasting time\nado\nbusywork\nbuy time idiom\ncarry something over\ndally\ngridlock\ninefficiently\nkept\nkick\nkick something into the long grass idiom\nkick the can down the road idiom\npush\nretard\nretardation\nset someone back (something)\nshelve\nsit\nsit on something\nspin\nstall\nSee more results »\nAdd to word list\nAdd to word list\nto cause to be late or to cause to happen at a later time, or to wait before acting: [ T ] He wants to delay the meeting until Wednesday. [ T ] The space launch was delayed because of bad weather. [ I ] Don’t delay in ordering tickets to the show.\na period when something that might happen does not happen or does not happen quickly enough, or the failure to act quickly: [ U ] You need to call back without delay. [ C ] The holiday traffic is likely to cause long delays. [ C ] Any further delay would threaten the entire project."}