{"id":120300,"name":"delete","type":"verb","us_sound":"dɪˈliːt","us_link":"../audio/d/eus75552.mp3","uk_sound":"dɪˈliːt","uk_link":"../audio/d/ukdejur013.mp3","content":"Add to word list\nAdd to word list\nB1 to remove or draw a line through something, especially a written word or words: They insisted that all expletives be deleted from the article. Here is a list of possible answers. Please delete (= draw a line through them) as appropriate.\nMore examplesFewer examplesAll names have been deleted from the report.I deleted the file by accident.All swear words were deleted from the text.I deleted the entire paragraph.They have deleted a clause in the contract which says the company can make people redundant for economic reasons.\nSMART Vocabulary: related words and phrases\nDeleting writing\nblank\nblank something out\ncross\ncross someone/something off (something)\ncross something out\ndeletion\nedit\nedit something out\nefface\nerasable\nerase\nrub\nrub something out\nscore something out/through\nsensitivity read\nsensitivity reader\nstrike\nX, x\nSee more results »\nAdd to word list\nAdd to word list\nto remove (part or all of) a written or electronic text: [ T ] She accidentally deleted one of her computer files. [ T ] The editor deleted the last three paragraphs.\nAdd to word list\nAdd to word list\nto remove something that is written or printed in a document, etc.: The new law had inadvertently deleted a section of existing labor law that dealt with overtime for employees who work more than 40 hours a week.delete sth from sth Lawyers deleted all names and other identifying details from the documents.\nIT to remove data, documents, programs, etc. from a computer: How many times have you deleted an email, file, or document and then regretted it?the delete button/key Highlighting a page and hitting the delete button is very easy.\nCOMMERCE to stop making or selling a particular product: There is a lot of pressure on publishers to delete stock. Many of these wonderful recordings had been deleted because they were unlikely to sell any more copies.\nIT a key on a computer keyboard that you press to remove data: If you receive any suspicious emails, just hit delete."}