{"id":120287,"name":"delegation","type":"noun","us_sound":"ˌdel.əˈɡeɪ.ʃən","us_link":"../audio/d/delegation.mp3","uk_sound":"ˌdel.ɪˈɡeɪ.ʃən","uk_link":"../audio/d/ukdejur012.mp3","content":"delegation noun\n(CHOSEN PEOPLE)\nAdd to word list\nAdd to word list\nC2 [ C, + sing/pl verb ] a group of delegates: The delegation from Spain has/have arrived for a month.\nMore examplesFewer examplesAfter exchanging pleasantries, the delegation revealed the purpose of their visit.The talks ended abruptly when one of the delegations walked out in protest.She was nominated as the delegation's official interpreter.A delegation from the White House attended the funeral.He was part of a delegation that went to the Department of Education to complain about proposed cuts.\nSMART Vocabulary: related words and phrases\nGroups of people\nalliance\nan\nanti-gang\nassemblage\nbaby boomer\nflashmob\nflock\nfocus group\nfoursome\nfraternity\nline (someone) up\nmafia\nmob\npublic\nquaternity\nrabble\nretinue\nsandwich generation\nsquad\nsyndicate\nSee more results »\ndelegation noun\n(GIVING)\n[ U ] the act of delegating a particular job, duty, right, etc. to someone: Delegation of responsibility is a key part of a manager's job.\nSMART Vocabulary: related words and phrases\nApplying for a job\nacqui-hire\nadvertisement\nanoint\nanointed\napplicant\nassign\nelect\nemployable\nemployment\nemployment agency\nequality, diversity and inclusion\nget in\nnomination\nprospect\nreinstatement\nrelocation expenses\nresume\nretain\nrope\ntestimonial\nSee more results »\nAdd to word list\nAdd to word list\na set of people chosen or elected to represent a larger group\nAdd to word list\nAdd to word list\n[ C ] a group of delegates: The Trade and Industry Secretary is taking a delegation of business and union leaders to Shanghai tomorrow to meet Chinese ministers. Indiana's trade delegation hopes to secure investments and jobs by visiting European companies whose offices are already in the state.\n[ U ] the act of giving a particular job, duty, etc. to someone else: the delegation of authority/power/responsibility The main principle involved is the delegation of responsibility for budgets to accountable units, each of which has defined objectives."}