{"id":120280,"name":"delegate","type":"noun","us_sound":"ˈdel.ə.ɡət","us_link":"../audio/d/delegate_01_00.mp3","uk_sound":"ˈdel.ɪ.ɡət","uk_link":"../audio/d/ukdejur011.mp3","content":"Add to word list\nAdd to word list\nC1 a person chosen or elected by a group to speak, vote, etc. for them, especially at a meeting: Delegates have voted in favour of the motion. Each union elects several delegates to the annual conference.\nMore examplesFewer examplesOur delegates have been mandated to vote against the proposal at the conference.The delegates trailed back into the conference room for the afternoon session.They've chartered a plane to take delegates to the conference.With one accord, the delegates walked out of the conference.The conference delegates were transfixed by her speech.\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\nname\nnovate\npart exchange\npinch-hit\npre-empt\nrefresh\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitution\nsubstitutive\nsucceed\nsuccession\nsupersede\nSee more results »\ndelegate verb\n(GIVE)\nC2 [ I or T ] to give a particular job, duty, right, etc. to someone else so that they do it for you: As a boss you have to delegate (responsibilities to your staff). Authority to make financial decisions has been delegated to a special committee.\nSMART Vocabulary: related words and phrases\nApplying for a job\nacqui-hire\nadvertisement\nanoint\nanointed\napplicant\nassign\nelect\nemployable\nemployment\nemployment agency\nequality, diversity and inclusion\nget in\nnomination\nprospect\nreinstatement\nrelocation expenses\nresume\nretain\nrope\ntestimonial\nSee more results »\ndelegate verb\n(CHOOSE PERSON)\n[ T + obj + to infinitive ] to choose or elect someone to speak, vote, etc. for a group, especially at a meeting: A group of four teachers were delegated to represent their colleagues at the union conference.\nSMART Vocabulary: related words and phrases\nApplying for a job\nacqui-hire\nadvertisement\nanoint\nanointed\napplicant\nassign\nelect\nemployable\nemployment\nemployment agency\nequality, diversity and inclusion\nget in\nnomination\nprospect\nreinstatement\nrelocation expenses\nresume\nretain\nrope\ntestimonial\nSee more results »\nAdd to word list\nAdd to word list\na person chosen or elected by a group to represent the group, esp. at a meeting: Each state chooses delegates to the national convention.\ndelegate verb\n(GIVE)\n[ I/T ] to give a job or responsibility to someone in a lower position instead of doing it yourself: [ T ] Personnel matters made him uncomfortable, and he increasingly delegated them to others.\ndelegate verb\n(CHOOSE)\n[ T ] to choose someone to represent a group: Four teachers were delegated to represent the school at the conference.\nAdd to word list\nAdd to word list\na person who is chosen or elected by a group to speak or vote for it, especially at a meeting: More than 1,000 delegates attended the three-day conference. a delegate to a meeting/conference\n[ I or T ]\n&#160; MANAGEMENT to give a particular job, duty, etc. to someone else so that they do it for you: He was always overburdened with too many trivial tasks because he found it impossible to delegate.delegate authority/powers/responsibility The Board may delegate its authority to any duly appointed committee.delegate sth to sb A manufacturer can delegate some or all of its overseas operations to an export house.\n[ T ]\n&#160; MEETINGS to choose or elect someone to speak or vote for a group, especially at a meeting: delegate sb to do sth The company director, who prepared their submission, cannot be here and has delegated her deputy to present it for her."}