{"id":120329,"name":"deliberate","type":"adjective","us_sound":"dɪˈlɪb.ɚ.ət","us_link":"../audio/d/eus71198.mp3","uk_sound":"dɪˈlɪb.ər.ət","uk_link":"../audio/d/ukdejur018.mp3","content":"Add to word list\nAdd to word list\nB2 (often of something bad) intentional or planned: a deliberate attack/insult/lie We made a deliberate decision to live apart for a while.\nA deliberate movement, action, or thought is done carefully without hurrying: From her slow, deliberate speech I guessed she must be drunk.\nMore examplesFewer examplesSome women make a deliberate choice to rear a child alone.Can you pick out the three deliberate mistakes in this paragraph?I don't think his name was left off the list by accident - I think it was deliberate.This was a deliberate attempt to wreck the peace talks.I didn't take a deliberate decision to lose weight. It just happened.\nSMART Vocabulary: related words and phrases\nPlanning, expecting and arranging\naccidentally\naccidentally on purpose idiom\nadvertent\nadvisedly\naim at something\nbargain\nhorizon scanning\nhow are you fixed for something? idiom\nI might have known idiom\nI'll/we'll cross that bridge when I/we come/get to it idiom\nin someone's crosshairs idiom\nplanner\nprovision\npurpose\npurposefully\npurposely\nput the cart before the horse idiom\nput their heads together idiom\nsettle\nsleeve\nSee more results »\nto think or talk seriously and carefully about something: The jury took five days to deliberate on the case. The committee has deliberated the question at great length. [ + question word ] He's deliberating whether or not to accept the new job that he's been offered.\nSMART Vocabulary: related words and phrases\nThinking and contemplating\na brown study idiom\nagonize\nagonize over/about something\nbeard-stroking\nbethink\nharbour\nintrospect\nintrospection\njoined-up thinking\nlateral thinking\nlet me see/let's see idiom\nnavel\nreckon\nreflection\nrumination\nrun through someone's mind/head idiom\nscratch your head idiom\nself-contemplation\nself-exploration\nweigh\nSee more results »\nAdd to word list\nAdd to word list\n(of an action or a decision) intentional or planned, often with the result of being harmful to someone: a deliberate insult He accused her of writing deliberate untruths.\nSomeone who moves, acts, or thinks in a deliberate way moves, acts, or thinks slowly and usually carefully.\nto think or talk seriously and carefully about something: [ I ] The jury deliberated for two days before reaching a verdict."}