{"id":120467,"name":"delist","type":"verb","us_sound":"ˌdiːˈlɪst","us_link":"../audio/d/cdo0123usdeli0716.mp3","uk_sound":"ˌdiːˈlɪst","uk_link":"../audio/d/cdo0123ukdeli0879.mp3","content":"delist verb\n(REMOVE FROM LIST)\nAdd to word list\nAdd to word list\n[ T ] to remove something from a list: Six wolves have been shot since they were taken off the endangered species list, four of them on the same day they were delisted. Architects opposed calls to delist the historic building, saying it should be protected.\nMore examplesFewer examples15 patients (31%) died on the waiting list and 6 patients were delisted because they recovered.Powerful supermarket chains could \"delist\" a manufacturer's whole range if it refused to provide own-brand goods.The commission complained that some states had \"delisted\" toxic sites to keep them out of the data.The bald eagle was listed as endangered in 1963, but it may be delisted soon in response to a strong recovery.\nSMART Vocabulary: related words and phrases\nLists and catalogues\nagenda\narchivist\nbibliographical\nbibliographically\nbirthday honours\nhit list\nhonor roll\nhonours list\nindices\ninventory\nrecital\nregistrable\nroll of honour\nroster\nrota\nthe White Pages\nwait list\nwaiting list\nwedding list\nwhitelist\nSee more results »\ndelist verb\n(REMOVE FROM MARKET)\n[ I or T ] to remove a company's shares from a particular financial market, or to be removed in this way: Nasdaq recently delisted the stock. These companies are now all struggling: one is bankrupt, one is delisted and another cut its workforce in half. It would be in shareholders' interests for the company to delist. Compare\nlist\nMore examplesFewer examplesThe New York Stock Exchange said it planned to delist the stock on 5 August because it does not meet the Big Board minimum of $30 million. So far this year, 325 companies have been delisted for not meeting the requirements.The Financial Services Commission said the measures were aimed at making it easier for companies to list while making it harder for troubled companies to delist.\nSMART Vocabulary: related words and phrases\nStock markets\nalgo\nanti-city\nanti-dilution\nanti-speculation\nanti-speculative\nbond\nbroker\nbull\nbull market\ndead cat bounce\nequity\nfootsie\ninconvertible\ninitial coin offering\nintangible asset\nnon-controlling\nnon-convertible\nrogue trader\nstockbroker\nthe Nikkei index\nSee more results »"}