{"id":120485,"name":"delivery","type":"noun","us_sound":"dɪˈlɪv.ɚ.i","us_link":"../audio/d/eus75561.mp3","uk_sound":"dɪˈlɪv.ər.i","uk_link":"../audio/d/ukdelig016.mp3","content":"delivery noun\n(OF PACKAGE ETC.)\nAdd to word list\nAdd to word list\nB1 [ C or U ] the act of taking goods, letters, parcels, etc. to people's houses or places of work: We get two deliveries of mail (= it is delivered twice) a day. You can pay for the carpet on delivery (= when it is delivered). We expect to take delivery of (= receive) our new car next week. Your order is out for delivery (= it has been given to the person who will deliver it) and will be with you soon. Delivery is free on orders over £30. The price includes next-day delivery anywhere in the UK. a delivery van Synonyms\nboatload\ncargo\nconsignment\nfreight\nload\npayload\nshipment\ntruckload\nMore examplesFewer examplesYou have to allow for a time lag between order and delivery.Our head office will liaise with the suppliers to ensure delivery.Please send this letter by express delivery.$200 is payable immediately with a further $100 payable on delivery.They've decided to hold all future deliveries until the invoice has been paid.\nSMART Vocabulary: related words and phrases\nTransferring and transporting objects\nbear\nbearer\nbike\nborne\nbring\nbudge\ncall for someone\ncarry\nchauffeur\nconvey\nhump\nimport\npayload\npickup\nportable\nportage\npost-delivery\nput something/someone down\ntransplant\ntruck\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunications - the postal system\ndelivery noun\n(GIVING)\n[ S or U ] the supply of something, for example power to an engine, or the way that it is supplied: The power delivery is extremely smooth, but the car is let down by the steering. The drug increases the delivery of oxygen to muscles in the body. The procedure promises great benefits in accurate delivery of radiation to treat tumours. New media includes new methods of content delivery such as internet streaming.\n[ S ] the way in which someone speaks in public: She did a perfect imitation of his breathless delivery. Her delivery is deadpan, but hilarious.\n[ C or U ] in some sports, such as cricket or baseball, the act of throwing the ball towards the person with the bat, in order for that person to try to hit the ball: That was a good delivery from Thompson. The pitcher is famous for the speed of his delivery.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\nafford\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWays of speaking\nCricket\ndelivery noun\n(KEEPING PROMISE)\n[ U ] the fact of achieving or producing something that has been promised: Delivery of the hoped-for improvements hit a snag when they failed to recruit enough staff for the expansion. There were plenty of promises, but no delivery.\nMore examplesFewer examplesDuring his official visit the president will push for the delivery of promised reconstruction aid.Many people are growing increasingly troubled by lack of delivery in key services such as health and education.\nSMART Vocabulary: related words and phrases\nGolf\nbogie\ncaddy\nclip\ncrazy golf\ncut\ndriver\nfade\nfore\nfringe\ngolf ball\noutdrive\nouthit\nputting green\nround\nslice\nstiff\ntap in\ntee (something) up\ntee someone off\nwood\nSee more results »\ndelivery noun\n(BIRTH)\n[ C or U ] a birth: Her husband was with her for the delivery. We want as many mothers as possible to have safe and normal deliveries. Women who have the infection are at risk of pre-term delivery of their baby.\nSMART Vocabulary: related words and phrases\nObstetrics: birth\nafterbirth\nantenatally\nApgar score\nB, b\nbirth centre\nbirth partner\nbirth rate\nbore\nchildbearing\nchildbirth\nhypnobirth\nhypnobirthing\ninduce\nmaternity suite\nmaternity unit\nmatrescence\nposh\npreemie\nstillbirth\nstillborn\nSee more results »\ndelivery noun\n(TAKING GOODS)\nAdd to word list\nAdd to word list\n[ C/U ] the act of taking goods, letters, or packages to people's houses or places of work: [ C ] The company gets two deliveries a day. [ U ] You can pay for the rug on delivery (= when it is received).\ndelivery noun\n(WAY OF SPEAKING)\n[ U ] the manner in which someone speaks, esp. in public: His dialogue was offbeat, his delivery fast.\ndelivery noun\n(BIRTH)\n[ C ] the act or process of birth: She had a difficult delivery.\nAdd to word list\nAdd to word list\n[ C or U ] the act of taking goods, letters, parcels, etc. to a place: Please allow 14 days for delivery. mail/parcel/postal delivery a delivery driver/truck/vanon delivery There's a 10% deposit to be paid, and then the balance has to be paid on delivery of the car.next-day/same-day/overnight delivery The company has established links with florists across the UK for a same-day delivery service. express/free delivery The supermarket rose to the challenge with cost cuts and successful expansion into internet sales and home delivery. delivery address/charges/terms They make two deliveries a day.\n[ C ] an amount of goods received: There were several faulty items in the last delivery.\n[ U ] the act of providing a service or supplying something to a customer: The new proposals will allow the delivery of high-speed internet access without a phone line. Providing targeted medical advice over the internet is the highest level yet of what the government calls the electronic delivery of public services.\n[ U ]\n&#160; LAW a situation in which a buyer is given control of something they have bought: For a deed to convey ownership, there must be delivery and acceptance.\n[ U ]\n&#160; FINANCE used in the trading of futures to talk about the date when the shares or commodities (= goods) will be available to the buyer: The price of gold for December delivery fell 20 cents an ounce.\ntake delivery of sth\nto receive goods that you have bought: Once the fashion show finishes, department store buyers will choose, order, and take delivery of clothes from all over the world.\nSee also\ncash before delivery\ncash on delivery\ngeneral delivery\nnearby delivery\nnon-delivery\npart delivery\nrecorded delivery\nspecial delivery\nspot delivery"}