{"id":120476,"name":"deliver","type":"verb","us_sound":"dɪˈlɪv.ɚ","us_link":"../audio/d/eus75560.mp3","uk_sound":"dɪˈlɪv.ər","uk_link":"../audio/d/ukdelig012.mp3","content":"deliver verb\n(TAKE)\nAdd to word list\nAdd to word list\nB1 [ T ] to take goods, letters, parcels, etc. to people's houses or places of work: Mail is delivered to our office twice a day. The furniture store is delivering our new bed on Thursday.\nMore examplesFewer examplesShops which will deliver goods are thin on the ground these days.\"What would be the best time of day for us to deliver the table?\" \"Oh, any time will be OK.\"For a nominal fee, they will deliver orders to customers' homes.We get our milk delivered.The documents were delivered by special messenger.\nSMART Vocabulary: related words and phrases\nTransferring and transporting objects\nbear\nbearer\nbike\nborne\nbring\nbudge\ncall for someone\nchauffeur\nconvey\nhump\nimport\npayload\npickup\nportable\nportage\npost-delivery\nput something/someone down\ntransplant\ntransportation\ntruck\nSee more results »\ndeliver verb\n(GIVE)\nB2 [ T ] to give, direct, or aim something: The priest delivered a passionate sermon/speech against war. The jury delivered a verdict of not guilty. The police said that it was the blow delivered (= given) to her head that killed her. The pitcher tripped as he delivered the ball (= threw it towards the person with the bat).\nMore examplesFewer examplesThe actor delivered his speech in a silken voice.The Governor of New York delivered a rousing speech to the national convention.She delivered her speech with tremendous wit and verve.She delivered a rousing speech full of anger and passion.He rose to his feet to deliver his speech.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\nafford\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nSee more results »\ndeliver verb\n(PRODUCE)\nC1 [ I or T ] to achieve or produce something that has been promised: The government has failed to deliver (what it promised).mainly US The Republicans are relying on their agricultural policies to deliver the farmers' vote (= to persuade farmers to vote for them).\nMore examplesFewer examplesHe promises a lot but can he deliver?Critics claim that the government has failed to deliver on all its pre-election promises.As far as housing is concerned, the council has failed to deliver.What they promise sounds impressive enough - let's see if they can deliver.The company has not delivered on its promise to invest in training.\nSMART Vocabulary: related words and phrases\nSucceeding, achieving and fulfilling\nA game\naccomplish\nachieve\nacquit\nactualize\nbear\nget to/reach first base idiom\ngo (like/down) a bomb idiom\ngo far idiom\ngo from strength to strength idiom\ngo into orbit idiom\ngrade\nkill\nrise\nscale the heights idiom\nscrape through (something)\nsew something up\nslam dunk\nsmash it idiom\nstand out\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking & breaking promises & commitments\ndeliver verb\n(GIVE BIRTH)\n[ T ] to (help) give birth to a baby: She delivered her third child at home. The baby was delivered by a midwife.formal The princess has been delivered of (= has given birth to) a healthy baby boy.\nSMART Vocabulary: related words and phrases\nObstetrics: birth\nafterbirth\nantenatally\nApgar score\nB, b\nbirth centre\nbirth partner\nbirth rate\nbore\nchildbearing\nchildbirth\nhypnobirth\nhypnobirthing\ninduce\nmaternity suite\nmaternity unit\nmatrescence\nposh\npreemie\nstillbirth\nstillborn\nSee more results »\ndeliver verb\n(SAVE)\n[ T ] formal to save someone from a painful or bad experience: Is there nothing that can be done to deliver these starving people from their suffering?\nSMART Vocabulary: related words and phrases\nPreserving and saving\naspic\nco-processing\nconserve\ndeliverer\ndocumentalist\ndocumentarily\nlifeguard\nreclaim\nrecycled\nrenewal\nreprieve\nrescue\nrescuer\nreusable\nsustain\nunadopted\nunappropriated\nunassigned\nundesignated\nupcycle\nSee more results »\nRelated words\ndeliverance\ndeliverer\ndeliver verb\n(TAKE TO)\nAdd to word list\nAdd to word list\n[ I/T ] to take goods, letters, or packages to people’s houses or places of work: [ T ] We had the pizza delivered. [ T ] We call our pharmacy with the doctor’s prescription and ask them to deliver it. [ I ] We deliver anywhere in the city.\ndeliver verb\n(GIVE)\n[ T ] to give or produce a speech or result: The president is scheduled to deliver a speech on foreign policy. The jury delivered a verdict of not guilty.\ndeliver verb\n(GIVE BIRTH)\n[ T ] to give birth to a baby, or to help someone do this: Dr. Adams delivered all three of my children.\ndeliver verb\n(PRODUCE)\n[ I/T ] to achieve or produce something promised or expected: [ I ] You pay your dues, and you expect the union to deliver.\nAdd to word list\nAdd to word list\n[ I or T ] to take goods, letters, parcels, etc. to a place: deliver goods/mail/products Manufacturers can deliver goods directly from factories. Most stores will deliver between 8 a.m. and 8 p.m.deliver sth to sb/sth Together, the three groups deliver 340,000 meals a year to homebound people.\n[ T ] to provide a service: We want world-class wages and conditions for our people to match the world class services that they deliver. The company is working tirelessly to deliver improved services for passengers.\n[ I or T ] to achieve, provide, or produce something: The price wars we see among retailers are a direct result of their need to maximise market share and deliver profits to shareholders.deliver a rise/increase in sth We have been able to deliver a 40% rise in revenues and profits for the seventh successive year. deliver growth/returns/savings deliver benefits/results/improvements\n[ I ] to do something that has been promised: The main complaint from analysts is that the company says all the right things but fails to deliver. In particular, critics cite his failure to deliver on a promise to attract half-a-million customers for the new service by last summer.\n[ I or T ] to manufacture and supply something to a customer: Boeing predicts that manufacturers will deliver 28,600 airplanes worth $2.8 trillion by 2026. Our key aim is to deliver a quality product to the consumer. Officials say the merger should be invisible, as the new company will continue to deliver electricity and gas to customers and be regulated by the same body.\n[ T ] to make a speech or an official statement: deliver a briefing/report/speech She is due to deliver a keynote speech to finance ministers this afternoon. The water industry regulator is due to deliver his verdict on the proposed takeover today.\ndeliver content\nto provide information, text, and pictures for a book, website, etc.: The digital entertainment company is working with hardware companies, trying to come up with technologies to deliver content the way they think consumers want to see it.\ndeliver a blow to sb/sth\nto have a damaging effect on someone or something: This move is going to continue to deliver a blow to the company and its position in the industry.\ndeliver the goods informal\nto do what you have promised to do, or to produce what is wanted: The company expects employees to perform and to deliver the goods."}