{"id":120374,"name":"delight","type":"noun","us_sound":"dɪˈlaɪt","us_link":"../audio/d/delight.mp3","uk_sound":"dɪˈlaɪt","uk_link":"../audio/d/ukdejur029.mp3","content":"Add to word list\nAdd to word list\nB2 (something or someone that gives) great pleasure, satisfaction, or happiness: My sister's little boy is a real delight. I read your letter with great delight. The children squealed in delight when they saw all the presents under the Christmas tree. He seems to take great delight in (= enjoys) teasing his sister. the delights of something\nthe pleasures of something: We're just discovering the delights of being retired.\nSee more\nMore examplesFewer examplesHe guffawed with delight when he heard the news.My initial surprise was soon replaced by delight.The little dog's tail wagged in delight.Her eyes shone with delight.When his wife bore him a child he could not hide his delight.\nSMART Vocabulary: related words and phrases\nPleasure and happiness\nabandon\nafterglow\nbeatitude\nbed\nbed of roses idiom\ndelirium\nexaltation\nfeast\nfelicity\nfor fun phrase\nfulfilment\nfun\ngaiety\ngoody\njoyfulness\njoyousness\njubilation\nlike a dog with two tails idiom\nmirth\nsavour\nSee more results »\nto give someone great pleasure or satisfaction: Peter's academic success delighted his family. Opposite\ndisplease formal\nSMART Vocabulary: related words and phrases\nCausing pleasure\nagreeable\nagreeableness\nagreeably\nall things to all people idiom\nattractive\ndelightfully\ndistraction\ndiverting\ndivertingly\ndo someone the world of good idiom\nhomey\nindulgent\nindulgently\njovial\njovially\nsensuous\nsensuously\nserendipitous\nsweeten\nswooning\nSee more results »\nPhrasal verb\ndelight in something\nAdd to word list\nAdd to word list\ngreat pleasure, satisfaction, or happiness, or something or someone that gives this: [ C ] My sister’s little boy is a real delight. [ U ] His music teacher expressed delight with his performance.\nto give someone great pleasure or satisfaction: The songs of countrypeople and of sailors delight me. Peter’s success at college delighted his family. Phrasal verb\ndelight in something"}