{"id":120346,"name":"delicate","type":"adjective","us_sound":"ˈdel.ə.kət","us_link":"../audio/d/delicate.mp3","uk_sound":"ˈdel.ɪ.kət","uk_link":"../audio/d/ukdejur023.mp3","content":"delicate adjective\n(EASILY DAMAGED)\nAdd to word list\nAdd to word list\nB2 needing careful treatment, especially because easily damaged: Peaches have delicate skins which are easily bruised. Delicate plants need to be kept in a greenhouse during the winter. delicate china Molly's health has always been delicate (= she gets sick easily). Synonyms\nbreakable\nbrittle (EASILY DAMAGED)\nfragile\nfrail\nThesaurus: synonyms, antonyms, and examples\neasily brokenbreakablePut breakable ornaments on a high shelf when young children come to visit.fragileSmall mammal bones are extremely fragile.delicateThe plant has delicate white flowers.brittleThe ground was a carpet of dried leaves and brittle twigs.weakThe floors were uneven and too weak to support the heavy equipment.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nbreaking easilyweakIf trees do not get enough water they become weak.strongSteel is a very strong material.flimsyThere was only a flimsy inflatable raft between him and the raging riverricketyWe climbed up the rickety wooden stairs.fragileSome objects are too fragile to be moved between the museums.delicateShe carefully wrapped up the delicate glass ornaments.\nSee more results »\nC1 needing to be done carefully: Repairing damaged nerves is a very delicate operation/process.\nMore examplesFewer examplesWith something as delicate as brain surgery, there is little margin for error.If used on delicate skin, this cream may produce a stinging sensation.She's got a very delicate stomach and doesn't eat spicy food.This news has ruptured the delicate peace between the rival groups.The introduction of the tube into the artery is a very delicate procedure.\nSMART Vocabulary: related words and phrases\nFragile and breakable\nbreakable\nbrittle\ncobwebby\ncrumbly\ndelicacy\ndodgy\nfissile\nflaky\nflimsily\nflimsiness\nflimsy\nfragile\nfragility\nfrail\nfriable\nramshackle\nrickety\ntenuous\ntenuously\ndelicate adjective\n(DIFFICULT)\na delicate situation, matter, point, etc.\nC1 a situation, matter, etc. that needs to be dealt with carefully in order to avoid trouble or offence: I need to speak to you about a delicate matter.\nSee more\ndelicate adjective\n(ACCURATE)\nable to measure very small changes: Weather-forecasters have extremely delicate equipment which helps them predict what the weather is going to be like.\nSMART Vocabulary: related words and phrases\nFragile and breakable\nbreakable\nbrittle\ncobwebby\ncrumbly\ndelicacy\ndodgy\nfissile\nflaky\nflimsily\nflimsiness\nflimsy\nfragile\nfragility\nfrail\nfriable\nramshackle\nrickety\ntenuous\ntenuously\ndelicate adjective\n(SOFT)\nB2 pleasantly soft or light: a rose with a delicate scent a delicate shade of pink We chose a delicate floral pattern for our bedroom curtains.\nThesaurus: synonyms, antonyms, and examples\nnot strong or forcefulgentleA gentle breeze stirred the leaves.mildThe children just have a mild cold.softHer voice was so soft, I could barely hear her.lightThe temperature in London is 24 degrees, with light winds out of the west.lowKeep your voices low while the baby's sleeping.\nSee more results »\nSMART Vocabulary: related words and phrases\nCausing pleasure\nagreeable\nagreeableness\nagreeably\nall things to all people idiom\nattractive\ndelightfully\ndistraction\ndiverting\ndivertingly\ndo someone the world of good idiom\nhomey\nindulgent\nindulgently\njovial\njovially\nsensuous\nsensuously\nserendipitous\nsweeten\nswooning\nSee more results »\ndelicate adjective\n(ATTRACTIVE)\nC2 having a thin, attractive shape: She folded her delicate hands on the table.\nSMART Vocabulary: related words and phrases\nThin and fine\nattenuate\nattenuated\nattenuation\nelongated\nfinely\nhairline\nnarrow\nnarrowness\npaper-thin\npapery\npencil-thin\nslender\nslimline\nsuper-thin\nsuperfine\ntenuity\nthinly\nultra-thin\nultrafine\nwispily\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAttractive\nRelated word\ndelicately\ndelicates\n[ plural ] clothing that needs to be washed very carefully because it is easily damaged, for example underwear made of thin material: I always wash my delicates by hand. Turn the dress inside out and put it in the washing machine on the delicates cycle.\nSMART Vocabulary: related words and phrases\nCleaning clothes\nairer\nboil\ncare label\ncleaner\nclothes brush\nclothes horse\ndelouse\nhandwash\niron box\nironing\nironing board\nlaunder\nspin-dry\nspin-dryer\nstarch\nsteam iron\ntrouser press\ntumble dryer\nwashing\nwashing machine\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFragile and breakable\ndelicate adjective\n(EASILY DAMAGED)\nAdd to word list\nAdd to word list\nneeding careful treatment, esp. because easily damaged: a delicate flower delicate jewelry\nDelicate also means needing to be dealt with carefully in order to avoid causing trouble or offense: The negotiations have reached a delicate stage. It’s a delicate operation, and you want an experienced surgeon to do it.\ndelicate adjective\n(PLEASANT)\npleasant but not easily noticed or strong: a delicate flavor We chose a delicate floral pattern for our bedroom curtains. delicately adverb us\nYour browser doesn't support HTML5 audio\n/ˈdel·ɪ·kət·li/\nPlease handle the china delicately."}