{"id":120642,"name":"demand","type":"verb","us_sound":"dɪˈmænd","us_link":"../audio/d/eus75565.mp3","uk_sound":"dɪˈmɑːnd","uk_link":"../audio/d/ukdemag004.mp3","content":"demand verb [T]\n(REQUEST)\nAdd to word list\nAdd to word list\nB1 to ask for something forcefully, in a way that shows that you do not expect to be refused: I demanded an explanation. The union is demanding a seven percent pay rise this year. He has always demanded the highest standards of behaviour from his children. [ + speech ] \"And where do you think you're going?\" demanded the police officer. [ + to infinitive ] I demand to see the manager. [ + that ] She demanded that he return the books he borrowed from her.\nThesaurus: synonyms, antonyms, and examples\nto ask for somethingask forI asked the waiter for another glass.requestThe department has requested permission to spend money on new equipment.apply forWe applied for planning permission to build an extension.demandPeople are demanding the right to return to their homes.appeal forThe prime minister appealed for calm.call forA group of religious leaders are calling for an end to racism and injustice in the city.\nSee more results »\nMore examplesFewer examplesWe demand freedom from injustice/persecution .It was grossly unfair to demand such a high interest rate on the loan.I think I'm quite within my rights to demand a full refund.Carrying a gun, he walked up to the cashier and demanded money.She strode purposefully up to the desk and demanded to speak to the manager.\nSMART Vocabulary: related words and phrases\nGiving orders & commands\nall-points bulletin\nboss someone around\nbossily\nbossiness\nbossyboots\ncommanding\ndecree\ndictate\nexact\nexpect\nharry\ninstruct\nprescribe\npush someone around\nput something on\nshove\nshove someone around\nstick\nstick out for something\ntask\nSee more results »\ndemand verb [T]\n(NEED)\nB2 to need something such as time, effort, or a particular quality: This is a very difficult piece of music to play - it demands a lot of concentration. He seems to lack many of the qualities demanded of (= needed by) a successful politician.\nSMART Vocabulary: related words and phrases\nLacking things\nbankrupt\nbankruptcy\nbe hard up (for something) idiom\nbereft\ncry out for something\ninappeasable\nlack\nlacking\nminus\nneed\nneed something like you need a hole in the head idiom\nscrape\nscream\nshortage\nshy\nskimpily\nstarve someone/something of something\nstarved\ntaken\nunaccompanied\nSee more results »\ndemand noun\n(REQUEST)\nB1 [ C ] a strong request: You can't give in to children's demands all the time. The government is unlikely to agree to the rebels' demands for independence.UK They received a final demand (= a last request) for payment.\nThesaurus: synonyms, antonyms, and examples\nthe act of asking for somethingrequestHer request for information was denied.applicationHis application for bail was granted.appealThe leader made an appeal for unity.callWith calls for action mounting, policymakers are beginning to pay attention.demandWe will never give in to terrorists’ demands.\nSee more results »\nMore examplesFewer examplesThere's increasing demand for cars which are more economical on fuel.Low consumer demand has forced us to mark down a wide range of goods, sometimes by as much as 30%.You can see why they refused her demand for a pay rise, but I suppose it was perfectly reasonable for her to ask.The party leader resisted demands for his resignation.The unions intend to call a strike if management will not agree to their demands.\nSMART Vocabulary: related words and phrases\nMaking appeals & requests\nadjuration\nappellate\napply for something\napply to\nappreciate\nask a lot\nbesiege\ncar wash\ncry\nentreat\nentreaty\nimportunately\nimportunity\ninvocation\nleech\nout with it! idiom\npush\nscrounge\nseek\nticket\nSee more results »\ndemand noun\n(NEED)\nB2 [ C or U ] a need for something to be sold or supplied: There was little demand for tickets. Good teachers are always in (great) demand (= are always needed). demands [ plural ]\nthe difficult things that you have to do: The demands of nursing are too great for a lot of people.\nSee more\nSMART Vocabulary: related words and phrases\nEssential or necessary\nbasically\nbasis\nbe a question of doing something idiom\nbox ticking\nbusiness-critical\ndependence\nelemental\nif need be idiom\nif/when push comes to shove idiom\nincumbent\nindispensable\nindispensably\nnecessary evil\nnecessitate\nnecessity\nneed\nneeded\nowe\nsymbiotic\nsymbiotically\nSee more results »\nIdiom\non demand\nAdd to word list\nAdd to word list\nto ask for forcefully, in a way that shows that refusal is not expected and will not be accepted: [ T ] The library demanded $5 for each book returned late. [ + to infinitive ] I demand to see the person in charge.\nTo demand is also to need something: [ T ] The twins demand a lot of attention.\nsomething asked for forcefully, or something that you accept as necessary: [ C ] The union’s major demand was for improved benefits. [ C ] The demands of nursing are too great for a lot of people.\nDemand is also need: [ C ] We can’t meet the demand for tickets to the game. [ U ] Good teachers are always in demand (= needed).\nDemand is also the desire to buy goods: There was weak demand for imported goods last month.\nAdd to word list\nAdd to word list\n[ S or U ]\n&#160; COMMERCE, ECONOMICS a need for goods or services that customers want to buy or use: increasing/rising/growing demand declining/falling/slowing demand high/strong/huge demand a decline/drop/shift in demand Colourful Ceramics hope to tap into the demand for products made out of recycled materials. a rise/increase/boom in demanddemand rises/grows/falls As populations age, demand rises for ever more complex and expensive health treatments. demand exceeds/outstrips supply to increase/decrease/satisfy demand Safecare says it has thrived by meeting a demand for affordable insurance. For the moment, strong customer demand is helping all four operators grow quickly. Rising prices for land and the need for security create demand for gated high-rise units.bolster/boost/fuel demand The dollar rose as buying of U.S. securities bolstered demand for the currency.\n[ U ]\n&#160; ECONOMICS the fact of customers buying goods and using services in an economy, and the amount that they buy: demand grows/recovers Pilkington said prices and demand were growing in Europe. There are signs of a slowdown in domestic demand. Grain prices are increasing, helped by both the strengthening U.S. economy and accelerating demand from China.\n[ C ] a strong request for something: a demand for sth/a demand that There was a demand that customers be compensated for the inconvenience they had suffered. accept/agree to/reject a demand\n[ C ] a letter requesting that someone pays money that they owe: Defaulting customers received a final demand for payment.\ndemands\n[ plural ] the things that a particular situation or person makes necessary: demands on sb/sth Most managers feel there are too many demands on their time.changing/competing/conflicting demands Staff are forced to face the conflicting demands of workplace and home.meet/respond to/satisfy the demands of sth Farmers need to modernize their tobacco production to meet the demands of a competitive market.\nin demand\nused for describing goods or services that customers would buy or use if they were available: Banking shares were also in demand, amid continued hopes of consolidation in the sector. The company must develop the right products - those that are in demand by their prospective clientele.\non demand\nas soon as a request is made: The bank stated that there was little point in adding to small firms' worries by making overdrafts payable on demand.\nwhenever you need or want it: Television, movies, music, and computer games are now available on demand in homes over high-speed data links. The network is available on various cable operators' on-demand services.\nthe law of demand\nECONOMICS an economic law that states that people buy less of a product when the price is high, and more when the price is low: This is the normal law of demand, in which the quantity of corn demanded increases as the price of corn declines. See also\naggregate demand\ncomposite demand\nconsumer demand\ncyclical demand\nderived demand\nelastic demand\nelasticity\nexcess demand\ninelastic demand\ninstitutional demand\nView all\nmarket demand\nprimary demand\nselective demand\nto make a strong request for something: Miller was expected to go back to the bidders last night to demand a further rise in price. If the Revenue thinks you have underpaid it will demand payment and can charge a penalty of interest. Shareholders in the company are demanding the resignation of the chief executive."}