{"id":120646,"name":"demanded","type":"verb","us_sound":"dɪˈmænd","us_link":"../audio/d/eus75565.mp3","uk_sound":"dɪˈmɑːnd","uk_link":"../audio/d/ukdemag004.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\ndemand\ndemand verb [T]\n(REQUEST)\nB1 to ask for something forcefully, in a way that shows that you do not expect to be refused: I demanded an explanation. The union is demanding a seven percent pay rise this year. He has always demanded the highest standards of behaviour from his children. [ + speech ] \"And where do you think you're going?\" demanded the police officer. [ + to infinitive ] I demand to see the manager. [ + that ] She demanded that he return the books he borrowed from her.\nThesaurus: synonyms, antonyms, and examples\nto ask for somethingask forI asked the waiter for another glass.requestThe department has requested permission to spend money on new equipment.apply forWe applied for planning permission to build an extension.demandPeople are demanding the right to return to their homes.appeal forThe prime minister appealed for calm.call forA group of religious leaders are calling for an end to racism and injustice in the city.\nSee more results »\nMore examplesFewer examplesWe demand freedom from injustice/persecution .It was grossly unfair to demand such a high interest rate on the loan.I think I'm quite within my rights to demand a full refund.Carrying a gun, he walked up to the cashier and demanded money.She strode purposefully up to the desk and demanded to speak to the manager.\nSMART Vocabulary: related words and phrases\nGiving orders & commands\nall-points bulletin\nboss\nboss someone around\nbossily\nbossiness\nbossyboots\ncharge\ndecree\ndefy\ndemand\ndictate\nexpect\nharry\nimportunate\nlay down the law idiom\nprescribe\nput something on\nshove\nshove someone around\nstick out for something\nSee more results »\ndemand verb [T]\n(NEED)\nB2 to need something such as time, effort, or a particular quality: This is a very difficult piece of music to play - it demands a lot of concentration. He seems to lack many of the qualities demanded of (= needed by) a successful politician.\nSMART Vocabulary: related words and phrases\nLacking things\nbankrupt\nbankruptcy\nbe hard up (for something) idiom\nbereft\ncatch\ncry out for something\ndemand\nhole\nlack\nlacking\nminus\nneed\nneed something like you need a hole in the head idiom\nneedful\nshy\nstarve someone/something of something\ntaken\nunaccompanied\nunappeased\nunassuaged\nSee more results »"}