{"id":121199,"name":"demotic","type":"adjective","us_sound":"dɪˈmɑː.t̬ɪk","us_link":"../audio/d/eus71211.mp3","uk_sound":"dɪˈmɒt.ɪk","uk_link":"../audio/d/ukdemot001.mp3","content":"Add to word list\nAdd to word list\nlanguage\n&#160; specialized in or relating to a form of language used by ordinary people, that includes informal expressions and slang: He has made poetry out of demotic speech. She addressed us in demotic French. We are writing for a very diverse population, so our language must be more demotic.\nrelating to or used, made, enjoyed, etc. by ordinary people: The demotic pieces of art enjoyed by the majority were dismissed as formally simplistic or sentimental. Travelling by train in India is still a genuinely demotic experience. His athletically hybrid style of dance was demotic but classy. Synonym\npopular\nlanguage, history\n&#160; specialized (also Demotic) describing or relating to a simple form of ancient Egyptian writing used from about 650 BCE to the 5th century CE, when it was replaced by Coptic, which uses a form of the Greek alphabet: Copies of the text of the decree have survived written in ancient Egyptian, in both hieroglyphic and demotic scripts. Fragments of papyrus were found containing Demotic Egyptian text. Compare\nhieratic\nhieroglyphic\nlanguage, history\n&#160; specialized (also Demotic) describing or relating to the modern form of Greek that is used in ordinary speech and writing: As Education Minister, he formally established demotic Greek as the language of the land. His work moves from the Hellenistic golden age through to today's Demotic Greek, the language of the people.\nMore examplesFewer examplesWhen writing for a general audience he would adopt a more straightforward, demotic style.The writer has an extraordinary ear for the demotic English of working-class women.The new edition of the dictionary had increased coverage of demotic slang.Even in this demotic age we want our leaders to be in some way extraordinary.\nSMART Vocabulary: related words and phrases\nForms of languages & specialist dialects\nacrolect\nargot\nbasilect\ncant\ncolloquialism\njargonistic\njournalese\nlegalese\nlingo\nlingua franca\nmetalanguage\npatois\npidgin\nplain English\nPolari\npsychobabble\nrhyming slang\nshibboleth\nslang\ntongue\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOrdinary people\nLettering & alphabets\nAncient history: before 500 AD\n[ S or U ] a form of a language used by ordinary people, that includes informal expressions and slang: Unlike many politicians, he is not afraid of the colloquial and the demotic. She is more qualified than most English directors to tackle the subtleties of the Scots demotic. The language is an odd mixture of Victorian English and early 21st-century demotic.\n[ U ]\n&#160; language, history\n&#160; specialized (also Demotic) a simple form of ancient Egyptian writing used from about 650 BCE to the 5th century CE, when it was replaced by Coptic, which uses the Greek alphabet: Some of these letter forms derive from Demotic and others from Coptic. Names written in demotic may be those of the workmen, and markings they left show us how they cut the obelisks. Compare\nhieratic\nhieroglyphics\n[ U ]\n&#160; language, history\n&#160; specialized (also Demotic) the modern form of Greek that is used in ordinary speech and writing: I wrote a blogpost on Demotic in the Soviet Union, about the two major groups of ethnic Greeks that lived in the USSR.\nMore examplesFewer examplesThe whole book is written in a perfectly acceptable, intelligent demotic.The poem's self-conscious demotic seems dated now.He believes that the novel has renewed itself by turning away from modernist elitism and rediscovering the pleasures of humour, storytelling, and the demotic.He ruminated over the Rosetta Stone, suspecting it displayed parallel texts in Greek characters, Egyptian hieroglyphics, and Demotic, a cursive version of Egyptian.\nSMART Vocabulary: related words and phrases\nForms of languages & specialist dialects\nacrolect\nargot\nbasilect\ncant\ncolloquialism\njargonistic\njournalese\nlegalese\nlingo\nlingua franca\nmetalanguage\npatois\npidgin\nplain English\nPolari\npsychobabble\nrhyming slang\nshibboleth\nslang\ntongue\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOrdinary people\nLettering & alphabets\nAncient history: before 500 AD"}