{"id":121063,"name":"demolition","type":"noun","us_sound":"ˌdem.əˈlɪʃ.ən","us_link":"../audio/d/demolition.mp3","uk_sound":"ˌdem.əˈlɪʃ.ən","uk_link":"../audio/d/ukdemoc009.mp3","content":"demolition noun [C or U]\n(DESTROYING)\nAdd to word list\nAdd to word list\nthe act of destroying something such as a building: the demolition of dangerous buildings The demolition of the stadium is already underway.\nthe act of proving that an argument or theory is wrong: He offers a robust demolition of the argument that there is a \"third way\" between capitalism and socialism. His demolition of conspiracy theories was angrily dismissed by some.\nMore examplesFewer examplesThere are still vacant homes awaiting demolition. The demolition work will continue for the next six weeks.The laconic demolition of the argument was rapturously applauded.\"In Her Master's Voice\" is a witty demolition of the female inferiority theory.\nSMART Vocabulary: related words and phrases\nDestroying and demolishing\nannihilate\nannihilation\napocalypse\nbash\nbash through (something)\nbe sacrificed on the altar of something idiom\nerosive\nextirpate\nextirpation\nfall in\ngully erosion\nsacking\nsacrifice\nscarred\nself-destruct\nself-devouring\nshred\nsink\ntear\nwipe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProving and disproving\ndemolition noun [C or U]\n(DEFEATING)\nthe act of easily defeating someone: This was a six-nil demolition of a classy team. The US players admired Brazil's demolition of the host team in group play.\nMore examplesFewer exampleshis team's outstanding demolition of Newcastle United in the FA Cup The All Blacks coach resisted the temptation to bask in the glory of his team's demolition of the Wallabies.Manduro lit up the Royal meeting with his demolition of the opposition in the Prince Of Wales's Stakes.\nSMART Vocabulary: related words and phrases\nWinning and defeating\nannihilate\nannihilation\nbank\nbe gunning for someone idiom\nbe one in the eye for someone idiom\nconvincing\nmove/go in for the kill idiom\nnear thing\noutclass\noutcompete\noutfox\nsew\nslaughter\nsweep\nsweep the board idiom\ntake someone down\ntake someone to the cleaner's idiom\ntake something apart\ntakedown\nthrash\nSee more results »\nSee\ndemolish\nAdd to word list\nAdd to word list\nthe act of destroying something, such as a building or other structure: [ C ] They tried unsuccessfully to stop the demolition of the old hotel."}