{"id":121007,"name":"democracy","type":"noun","us_sound":"dɪˈmɑː.krə.si","us_link":"../audio/d/democracy.mp3","uk_sound":"dɪˈmɒk.rə.si","uk_link":"../audio/d/ukdemag028.mp3","content":"Add to word list\nAdd to word list\nB2 [ U ] the belief in freedom and equality between people, or a system of government based on this belief, in which power is either held by elected representatives or directly by the people themselves: The government has promised to uphold the principles of democracy. The early 1990s saw the spread of democracy in Eastern Europe.\nB2 [ C ] a country in which power is held by elected representatives: Few of the Western democracies still have a royal family.\nMore examplesFewer examplesA strong opposition is vital to a healthy democracy.There cannot be true democracy without reform of the electoral system.Sweden is often held up as an example of a successful social democracy.The recent free elections mark the next step in the country's progress towards democracy.Western governments should be giving more aid to the emerging democracies of the Third World.\nSMART Vocabulary: related words and phrases\nSystems of government\nabsolutism\nancien régime\nanti-apartheid\nanti-communism\nanti-federalist\ndemocratization\ndemocratize\ndespotic\ndespotically\ndespotism\nmajority rule\nmartial law\nmatriarchal\nmatriarchy\nmeritocracy\npost-apartheid\npre-fascist\npure democracy\nregime\nreign\nSee more results »\nAdd to word list\nAdd to word list\npolitics &amp; government the belief in freedom and equality between people, or a system of government based on this belief, in which power is either held by elected representatives or directly by the people themselves\npolitics &amp; government A democracy is a country in which power is held by elected representatives.\nAdd to word list\nAdd to word list\n[ U ]\n&#160; WORKPLACE, MANAGEMENT a situation, system, or organization in which everyone has equal rights and opportunities, and can help make decisions: corporate democracy shareholder democracy\n[ U ]\n&#160; POLITICS the belief that everyone in a country has the right to express their opinions, and that power should be held by people who are elected, or a system of government based on this belief: The country was celebrating its return to democracy.\n[ C ]\n&#160; POLITICS a country in which power is held by people who are elected: It is now a stable, well-governed democracy.\nSee also\nindustrial democracy\nworkplace democracy"}