{"id":121148,"name":"demonstrate","type":"verb","us_sound":"ˈdem.ən.streɪt","us_link":"../audio/d/demonstrate.mp3","uk_sound":"ˈdem.ən.streɪt","uk_link":"../audio/d/ukdemoc021.mp3","content":"demonstrate verb\n(SHOW)\nAdd to word list\nAdd to word list\nB2 [ T ] to show or make something clear: These numbers clearly demonstrate the size of the economic problem facing the country. [ + that ] Research has demonstrated that babies can recognize their mother's voice very soon after birth. These problems demonstrate the importance of strategic planning.\nC1 [ T ] to show something and explain how it works: He got a job demonstrating kitchen equipment in a department store. [ + question word ] The teacher demonstrated how to use the equipment.\nMore examplesFewer examplesYou need to demonstrate to the examiners that you have more than a literal understanding of the text.It is impossible to demonstrate conclusively that the factory is responsible for the pollution.Management have demonstrated almost unbelievable incompetence in their handling of the dispute.The Australian team soon demonstrated their superiority over the opposition.I can show you studies which demonstrate that some forms of alternative medicine are extremely effective.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nprobatory\nreflect\nspeak\nvent\nvirtue signalling\nvisualization\nwhiff\nSee more results »\ndemonstrate verb\n(EXPRESS)\nC2 [ T ] to express or show that you have a particular feeling, quality, or ability: He has demonstrated a genuine interest in the project. His answer demonstrated a complete lack of understanding of the question.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nprobatory\nreflect\nspeak\nvent\nvirtue signalling\nvisualization\nwhiff\nSee more results »\ndemonstrate verb\n(PROTEST)\nB2 [ I ] to make a public expression that you are not satisfied about something, especially by marching or having a meeting: Thousands of people gathered to demonstrate against the new proposals.\nSMART Vocabulary: related words and phrases\nActivism & pressure groups\nactivism\nactivist\nagitation\nagitator\nagitprop\ncirculator\nclicktivism\nclicktivist\ncounter-demonstrate\ncounter-demonstration\nidentity politics\ninsurgency\ninsurrection\ninterest group\nlobbyist\nsocial enterprise\nsocial entrepreneur\nspecial interest group\nsuper-lobbyist\nsuper-militant\nSee more results »\ndemonstrate verb\n(SHOW HOW)\nAdd to word list\nAdd to word list\n[ T ] to show how to do something; explain: [ + question word ] He demonstrated how to use the new software. The surgeon demonstrated the use of lasers for certain operations.\ndemonstrate verb\n(PROVE)\n[ T ] to show that something is true; prove: [ + that clause ] Research demonstrates that babies can recognize their mother’s voice very soon after birth. She was eager to demonstrate her skill at chess.\ndemonstrate verb\n(EXPRESS)\n[ T ] to express or show that you have a feeling, quality, or ability: His answer demonstrated a complete lack of understanding of the question.\ndemonstrate verb\n(MARCH)\n[ I ] (of a group of people) to make a public expression of complaint about a problem or support for something, esp. by marching or meeting\nAdd to word list\nAdd to word list\nto show something, or show someone how to do something, or how a system or product works: They demonstrated how big savings could be made with the help of the new machinery.demonstrate sth to sb We asked them to come and demonstrate the new invoicing system to the staff. Compare\ndemo"}