{"id":121011,"name":"democratic","type":"adjective","us_sound":"ˌdem.əˈkræt̬.ɪk","us_link":"../audio/d/democratic.mp3","uk_sound":"ˌdem.əˈkræt.ɪk","uk_link":"../audio/d/ukdemag030.mp3","content":"Add to word list\nAdd to word list\nB2 based on the principles of democracy: We must accept the results of a democratic election (= an election in which all people can vote). Do you think Australia is a more democratic country than Britain?\nMore examplesFewer examplesThe 1990s have seen a shift to democratic government in Eastern Europe.The president has promised a new constitution and the creation of democratic power structures.These will be the first truly democratic elections in the country's history.How can there be democratic elections without a free press?We must do more to smooth the country's path to democratic reform.\nSMART Vocabulary: related words and phrases\nSystems of government\nabsolutism\nancien régime\nanti-apartheid\nanti-communism\nanti-federalist\ndemocratization\ndemocratize\ndespotic\ndespotically\ndespotism\nmajority rule\nmartial law\nmatriarchal\nmatriarchy\nmeritocracy\npost-apartheid\npre-fascist\npure democracy\nregime\nreign\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nJustice and fairness\nRelated word\ndemocratically\nAdd to word list\nAdd to word list\npolitics &amp; government using the principles of democracy in elections and government: That country has never had a democratic election (= an election in which all adults can vote). Australia is a democratic country.\nA person or a group that is democratic believes in, encourages, or supports freedom and equality between people and groups: a democratic society\nAdd to word list\nAdd to word list\nPOLITICS based on the principles of democracy: a democratic society democratic elections\nWORKPLACE, MANAGEMENT a democratic system or organization allows everyone to be treated equally and to be involved in making decisions: Employee ownership and open-book management are common practices in most democratic workplaces.\nDemocratic\nPOLITICS relating to or supporting the Democratic Party in the US: Democratic policies Democratic voters"}