{"id":121154,"name":"demonstration","type":"noun","us_sound":"ˌdem.ənˈstreɪ.ʃən","us_link":"../audio/d/demonstration.mp3","uk_sound":"ˌdem.ənˈstreɪ.ʃən","uk_link":"../audio/d/ukdemoc022.mp3","content":"demonstration noun\n(SHOW)\nAdd to word list\nAdd to word list\nC1 [ C or U ] the act of showing someone how to do something, or how something works: This disaster is a clear demonstration of the need for tighter controls. Let me give you a demonstration of how the camera works. She told us how easy it was to use the software, then by way of demonstration produced a beautiful graph with a few clicks of the mouse. We're going to a cookery demonstration tonight.\nMore examplesFewer examplesHe gave us a demonstration of the new software in use.The rise in unemployment is just another demonstration of the government's incompetence.The kids enjoyed the cookery demonstration in the supermarket yesterday as they got to taste the food.The pilots at the air show put on a very fine demonstration of aerobatic skill.The beauty consultant is expected to give demonstrations of how to use our new products.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nprobatory\nreflect\nspeak\nvent\nvirtue signalling\nvisualization\nwhiff\nSee more results »\ndemonstration noun\n(PROTEST)\nB2 [ C ] (informal demo) an occasion when a group of people march or stand together to show that they disagree with or support something or someone: The students are holding a demonstration against the proposed changes. Protesters staged an anti-war demonstration.\nPeopleImages/E+/GettyImages\nMore examplesFewer examplesPolice lined the route of the demonstration.As the demonstration began to turn violent, the police were called in to restore order.Her early release from prison led to a demonstration.Police used water cannon to break up the demonstration.The army seized power after five days of anti-government demonstrations.\nSMART Vocabulary: related words and phrases\nActivism & pressure groups\nactivism\nactivist\nagitation\nagitator\nagitprop\ncirculator\nclicktivism\nclicktivist\ncounter-demonstrate\ncounter-demonstration\nidentity politics\ninsurgency\ninsurrection\ninterest group\nlobbyist\nsocial enterprise\nsocial entrepreneur\nspecial interest group\nsuper-lobbyist\nsuper-militant\nSee more results »\ndemonstration noun\n(EXPRESSION)\n[ C or U ] a way of expressing a feeling or a quality: Huge crowds followed the funeral procession in a public demonstration of grief. There has been little demonstration of support for the proposal so far.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nprobatory\nreflect\nspeak\nvent\nvirtue signalling\nvisualization\nwhiff\nSee more results »\ndemonstration noun\n(ACT OF SHOWING)\nAdd to word list\nAdd to word list\n[ C/U ] us/ˌdem·ənˈstreɪ·ʃən/ (short form demo) the act of showing someone how to do something or how something works: [ C ] Let me give you a demonstration of how the camera works.\ndemonstration noun\n(EXPRESSION OF FEELING)\n[ C/U ] us/ˌdem·ənˈstreɪ·ʃən/ a way of expressing a feeling or quality: a demonstration of friendship\ndemonstration noun\n(GROUP EVENT)\n[ C ] us/ˌdem·ənˈstreɪ·ʃən/ an event in which a group of people march or stand together to show that they disagree with or support something or someone: Students staged a protest demonstration in the school gym.\nAdd to word list\nAdd to word list\nMARKETING the act of showing someone how to use a product or how a new system or product works: an online sales demonstration Trade shows and product demonstrations are excellent ways to build your business. I offered to give them a demonstration of the software updates. Compare\ndemo"}