{"id":121048,"name":"demographic","type":"adjective","us_sound":"ˌdem.əˈɡræf.ɪk","us_link":"../audio/d/usdemis009.mp3","uk_sound":"ˌdem.əˈɡræf.ɪk","uk_link":"../audio/d/epd31644.mp3","content":"Add to word list\nAdd to word list\nrelating to demography (= the study of populations and the different groups that make them up): There have been monumental social and demographic changes in the country. current demographic trends\nSMART Vocabulary: related words and phrases\nEnvironmental issues\nagroecology\nair pollution\nanoxia\nanoxic\nanti-conservation\ncarbon capture\ndumping ground\neco-footprint\nenvironmentally\nESG\nfeed-in tariff\nfood insecure\nfood insecurity\nparticulate\nreclamation\nsequestration\nsingle-use\nskip diving\nsmoggy\nsolar power\nSee more results »\na group of people, for example customers, who are similar in age, social class, etc.: This demographic (young teenagers) is the fastest-growing age group using the site.\nSMART Vocabulary: related words and phrases\nGroups of people\nalliance\nan\nanti-gang\nassemblage\nbaby boomer\nflashmob\nflock\nfocus group\nfoursome\nfraternity\nline (someone) up\nmafia\nmob\npublic\nquaternity\nrabble\nretinue\nsandwich generation\nsquad\nsyndicate\nSee more results »\nAdd to word list\nAdd to word list\nsocial studies relating to human populations and the information collected about them, such as their size, growth, ages, and education: More than any other demographic group, it is the educated young adult who has been the industry’s favorite customer. demographics plural noun us\nYour browser doesn't support HTML5 audio\n/ˌdem·əˈɡræf·ɪks, ˌdi·mə-/\nsocial studies Southern California’s demographics make it a particularly good used-car market.\nAdd to word list\nAdd to word list\nMARKETING a group of people, for example, customers, who are similar in age, social class, etc.: This demographic (young teenagers) is the fastest growing age group using the site. Marketing to baby boomers is not easy; but in order to be successful, you must reach this demographic. Our target demographic is college-educated urban females aged 25-30.\nrelating to demography (= the study of populations, their characteristics and changes): Demographic change means the market is shrinking. demographic data. demographically adverb\nYou will need to segment your market both geographically and demographically."}