{"id":121283,"name":"denaturalize","type":"verb","us_sound":"ˌdiːˈnætʃ.ɚ.rə.laɪz","us_link":"../audio/d/cdo0623usdena0904.mp3","uk_sound":"ˌdiːˈnætʃ.ər.əl.aɪz","uk_link":"../audio/d/cdo0623ukdena0898.mp3","content":"denaturalize verb [T]\n(NOT LEGAL)\nAdd to word list\nAdd to word list\nlaw\n&#160; specialized to remove someone's legal right to stay a naturalized citizen (= someone who has been made a legal citizen of a country that they were not born in): The government is seeking to denaturalise and deport him. Prosecutors have successfully used a similar strategy in the past to denaturalize Nazi war-crimes suspects. Compare\nnaturalize\nMore examplesFewer examplesHe became a US citizen in 1963 but was denaturalised in 2002 over his past.The government seeks to denaturalize the defendant through false allegations of wartime atrocities. Many post-1945 refugees had not been denaturalised, even if they were unable to return home.\nSMART Vocabulary: related words and phrases\nCountries, nationalities & continents: country & nation\nbirthright citizenship\nbody politic\nBRICS\ncitizen\ncompatriot\ncross-border\ndomestic\ndomestically\ndual\ndual citizen\nfatherland\nmotherland\nnative\nnon-country\nnon-domestic\nnon-indigenous\nnon-national\nnoncitizen\nstatehood\nstateless\nSee more results »\ndenaturalize verb [T]\n(NOT NATURAL)\nsocial sciences\n&#160; specialized to show or claim that something is not natural and impossible to change, but has been created by a particular society or culture: These thinkers denaturalized sexuality, rejecting approaches that view it as a fixed biological fact. By deconstructing or denaturalising old habits of thinking, perhaps this kind of fiction can create a greater receptiveness for new concepts.\nMore examplesFewer examplesThey sought to denaturalize the pervasive cultural hierarchy and disrupt its authority. They contest the “natural” order of Westernization by distinguishing Western and African cultural forms, and by denaturalizing Western practices.We should denaturalise the hegemonic position of English in global business and other spheres.\nSMART Vocabulary: related words and phrases\nNatural and artificial\nanti-natural\nartificial\nartificiality\nartificially\nbiodynamic\nfake\nfalse\nfreshness\nGod-given\nimitation\nnon-toxic\norganically\npure\nrawness\nrefined\nunbleached\nunnatural\nunnaturally\nunprocessed\nuntamed\nSee more results »"}