{"id":121403,"name":"denied","type":"verb","us_sound":"dɪˈnaɪ","us_link":"../audio/d/eus71221.mp3","uk_sound":"dɪˈnaɪ","uk_link":"../audio/d/ukdensi012.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\ndeny\ndeny verb [T]\n(NOT TRUE)\nB2 to say that something is not true: He will not confirm or deny the allegations. [ + that ] Neil denies that he broke the window, but I'm sure he did. [ + -ing verb ] Neil denies breaking the window. there's no denying\nit is true: There's no denying that this has been a difficult year for the company.\nMore examplesFewer examplesHe said the police assaulted him while he was in custody, a claim which the police deny.The president has consistently denied the rumours.A close associate of the author denied reports that she had cancer.She has always stridently denied the accusations against her.The ambassador denied that any missiles had been fired across the border.\nSMART Vocabulary: related words and phrases\nDenying & contradicting\nabnegate\nabnegation\napparently\nbreath\nbubble\nburst someone's bubble idiom\ncontradictorily\ncounter-argue\ndebunk\ndenier\ndispute\nI'm a Dutchman idiom\nnon-acceptance\nnon-recognition\nnonsense\noxymoron\noxymoronic\noxymoronically\nrebut\nspeak for yourself idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdmitting & confessing\ndeny verb [T]\n(REFUSE)\nB2 to not allow someone to have or do something: Her request for time off work was denied. No one should be denied a good education./A good education should be denied to no one. [ + two objects ] The goalkeeper denied him his third goal. I was denied the opportunity of learning French at school.\nMore examplesFewer examplesWhile priests were denied the right to marry and procreate, he said, their situation would remain impossible.Freedom of speech and freedom of thought were both denied under the dictatorship.All I'd cherished from early childhood had been denied me, so I simply gave up the ghost.Can the right to live ever be denied to any human?He complained that he had been denied his conjugal rights.\nSMART Vocabulary: related words and phrases\nForbidding and banning things\nabolish\nabolition\nabolitionist\nanti-censorship\nban\ndebar\ndecertification\ndecertify\ndisallow\ndisqualification\nnon-valid\noff-limits\nout of bounds idiom\noutlaw\nprohibit\ntravel ban\nunapproved\nunauthorized\nunkosher\nunsanctioned\nSee more results »\ndeny verb [T]\n(NOT ADMIT)\nto not admit that you have knowledge, responsibility, feelings, etc.: He denied all responsibility for the rumours which have been circulating. Even under torture, he refused to deny his beliefs/faith. deny yourself\nto not allow yourself to have or do things: Many parents deny themselves so that their children can have the best.\nformal to refuse to admit that you have any connection with something or someone: She has denied her family and refuses to have any contact with them.\nMore examplesFewer examplesShe knew that Dave wasn't the right man for her but she couldn't deny that there was an attraction between them.She denied any personal enmity towards him.The company consistently denied responsibility, but it agreed to the settlement to avoid a long and expensive legal case.Alois denied any knowledge of the matter.She has strenuously denied any criminal wrongdoing.\nSMART Vocabulary: related words and phrases\nDenying & contradicting\nabnegate\nabnegation\napparently\nbreath\nbubble\nburst someone's bubble idiom\ncontradictorily\ncounter-argue\ndebunk\ndenier\ndispute\nI'm a Dutchman idiom\nnon-acceptance\nnon-recognition\nnonsense\noxymoron\noxymoronic\noxymoronically\nrebut\nspeak for yourself idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRefusing & rejecting"}