{"id":121717,"name":"deodorizing","type":"adjective","us_sound":"diˈoʊ.də.raɪ.zɪŋ","us_link":"../audio/d/cdo1121usdeod1370.mp3","uk_sound":"diˈəʊ.dər.aɪ.zɪŋ","uk_link":"../audio/d/cdo1121ukdeod1338.mp3","content":"Add to word list\nAdd to word list\nable to remove smells, especially unpleasant ones, from something: Hydrogen peroxide solution has antiseptic and deodorizing properties, and is used mainly for cleaning wounds. deodorizing body spray\nMore examplesFewer examplesThe products had similar deodorizing uses, but they were presented very differently.Petitgrain has been used in the skin care industry for acne, oily skin, and as a deodorizing agent.Commercials for deodorizing body spray, cars and other products were shown on a video screen.For tenacious smells, use a fabric refresher or deodorizing spray.Use charcoal insoles for their deodorising effect.\nSMART Vocabulary: related words and phrases\nSmells & smelling\nacridly\nanosmic\naromatic\nbergamot\ndeodorize\nfetid\nfragranced\nfragrant\nmalodorous\nodourless\npungency\npungently\nrankly\nredolence\nredolent\nripeness\nscented\nsniff\nstink\nwaft\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPersonal care - general words\nthe process of removing smells, especially unpleasant ones, from something: The chemical process is used in oil deodorizing.\nMore examplesFewer examplesSodium bicarbonate has a wide range of applications, including cleaning, deodorizing, buffering, and fire extinguishing. Oil deodorizing is the removal of volatile odoriferous components.With the facilities for ventilation and deodorizing that are readily available, this passageway could be made inoffensive.Eucalyptus oil can be used for cleaning, deodorising deodorizing, and in very small quantities in food supplements.\nSMART Vocabulary: related words and phrases\nSmells & smelling\nacridly\nanosmic\naromatic\nbergamot\ndeodorize\nfetid\nfragranced\nfragrant\nmalodorous\nodourless\npungency\npungently\nrankly\nredolence\nredolent\nripeness\nscented\nsniff\nstink\nwaft\nSee more results »"}