{"id":121814,"name":"departure","type":"noun","us_sound":"dɪˈpɑːr.tʃɚ","us_link":"../audio/d/eus75582.mp3","uk_sound":"dɪˈpɑː.tʃər","uk_link":"../audio/d/ukdensi019.mp3","content":"departure noun [C]\n(LEAVING)\nAdd to word list\nAdd to word list\nB1 the fact of a person or vehicle, etc. leaving somewhere: There are several departures (= buses, trains, or aircraft leaving) for Paris every day. Our departure was delayed because of bad weather. departure time\nthe act of leaving a job: Everyone in the office was surprised by Graham's sudden departure.\nMore examplesFewer examplesFlights should be confirmed 48 hours before departure.I asked the guard the time of the train's departure.Please hand in your keys at reception on your departure from the hotel.The estimated time of departure of this flight is 11.15.If you time your departure carefully, you should be able to miss the worst of the traffic.\nSMART Vocabulary: related words and phrases\nArrivals and departures\nadmittance\nadvent\napproach\narr.\narrival\nbourne\ncheck\nconnection\ndescent\nentry\neta\ngain admittance\ngoing\ngold rush\ninvasion\nlandfall\nmisconnect\nmisconnection\noff\noutflow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRetiring & resigning\ndeparture noun [C]\n(CHANGE)\na change from what is expected, or from what has happened before: There can be no departure from the rules. Selling men's clothing is a new departure for the store.\nSMART Vocabulary: related words and phrases\nChange and changes\nadjustment\nalteration\nanti-evolutionism\nbe ahead of the curve idiom\nblip\nflatten\nflip-flop\nfluctuation\ngradation\ngyrate\ngyration\nretransformation\nreversal\nreversion\nrevolution\nrhythm\nuntick\nvariation\nvicissitudes\nyouthquake\nSee more results »\nAdd to word list\nAdd to word list\nthe act of leaving a place, job, etc., or an occasion when this happens: [ U ] Departure is scheduled for 2 p.m. [ C ] Our departure was delayed because of bad weather.\nA departure from usual behavior is a change in the way you do something: [ C ] His departure from his usual optimism startled his staff.\nAdd to word list\nAdd to word list\n[ C or U ] the act of leaving a company or a job: The current finance director will retire, but she has set no date for her departure.a sudden/surprise/unexpected departure The group made changes in accounting policies following the sudden departure of the executive chairman.\n[ C or U ] the act of leaving a place, or a flight, train, etc. that is leaving a place at a particular time: He had arranged a meeting for the morning before his departure for Singapore. Check our website for the flight times for departures from Bristol airport.departure desk/gate/terminal He had arranged to pick up the tickets at the airport departure desk.\n[ S ] a change in what is usually done or how something is usually done: The restaurant is a departure for Fabbio who has spent his career starting software companies. The rule did not represent any departure from current immigration laws"}