{"id":121797,"name":"department","type":"noun","us_sound":"dɪˈpɑːrt.mənt","us_link":"../audio/d/eus75581.mp3","uk_sound":"dɪˈpɑːt.mənt","uk_link":"../audio/d/ukdensi017.mp3","content":"Add to word list\nAdd to word list\nA2 a part of an organization such as a school, business, or government that deals with a particular area of study or work: the chemistry department/the department of chemistry The sales department is/are having a Christmas party this week. the Department of Health and Social Security\none of the areas that France is divided into, that has its own local government: Angers is the capital of the department of Maine-et-Loire.\nMore examplesFewer examplesPlease submit your claim for travelling expenses to the accounts department.If this project fails it will affect not only our department, but also the whole organization.Our kitchenware department is in the basement.The art department and the main college are in two separate buildings.He blamed the lack of liaison between the various government departments.\nSMART Vocabulary: related words and phrases\nSubjects & disciplines\nAfrocentrism\nandragogy\nAP\napplicative\napplied\nfuturology\nGermanist\nglaciology\nhard science\nhistoriography\nology\nontology\noology\norientalist\nPE\nstem\nsubscience\nsuicidology\ntechnical\ntechnically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTowns & regions: parts of countries\nIdioms\nbe someone's department\nin the brain/looks department\nAdd to word list\nAdd to word list\nany of the divisions or parts of esp. a school, business, or government: Chavez is the head of the geography department. The shoe department is on the fifth floor. She lives in Washington and works for the Department of Defense. fig.infml I thought buying the tickets was your department (= area of responsibility). departmental adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/dɪˌpɑrtˈmen·təl, ˌdi-/\na departmental meeting\nAdd to word list\nAdd to word list\nMANAGEMENT one part of a large organization, such as a company or university, that deals with a particular area of work, business, study, etc.: run/manage a department the sales/human resources/finance department He was previously a lecturer in the pharmacy department of Queen's University. a department director/supervisor\nCOMMERCE one part of a large store that sells many different types of goods: the book/electrical/menswear department She has a Saturday job in the footwear department of a large city centre store.\nGOVERNMENT one part of a government that is responsible for a particular part of its work: the Department of Education/Health/Justice\nbe sb's department informal\nto be something that a particular person knows a lot about or is responsible for: You'll need to ask Joe about that - it's more his departmant than mine. See also\nbank trust department"}