{"id":121852,"name":"dependency","type":"noun","us_sound":"dɪˈpen.dən.si","us_link":"../audio/d/usdenat019.mp3","uk_sound":"dɪˈpen.dən.si","uk_link":"../audio/d/ukdensi025.mp3","content":"dependency noun\n(NEED)\nAdd to word list\nAdd to word list\n[ S or U ] a situation in which you need something or someone and are unable to continue normally without them: Some parents infantilize young adults and keep them in a permanent state of dependency. We need to reduce our dependency on fossil fuels. Synonym\ndependence\n[ C or U ] an inability to stop doing something harmful, or using something harmful, especially a drug: Many of the people who come to the clinic have drug or alcohol dependencies. He wrote a memoir about his struggles with chemical dependency. Synonym\naddiction\nMore examplesFewer examplesHe deplores what he regards as an excessive dependency on government.Dependency on petroleum is at the heart of many of our problems today.How much of an issue is benefits dependency?She treats a range of compulsive dependencies, such as alcohol, drugs, sex, gambling and shopping.\nSMART Vocabulary: related words and phrases\nEssential or necessary\nbasically\nbasis\nbe a question of doing something idiom\nbox ticking\nbusiness-critical\ndependence\nelemental\nif/when push comes to shove idiom\nincumbent\nindispensable\nindispensably\ninhere in something\nnecessitate\nnecessity\nneed\nneeded\nneedful\nowe\nsymbiotically\nwarrant\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBeing based on or depending on something\nDrug addiction\nAddiction\ndependency noun\n(COUNTRY)\n[ C ] a country that is supported and governed by another country: Saint Helena is a British dependency whose inhabitants have full UK citizenship.\nMore examplesFewer examplesThe Channel Islands and the Isle of Man are Crown dependencies.The Baltic states were former Soviet dependencies.Monaco is a French dependency.\nSMART Vocabulary: related words and phrases\nColonization & self-government\nacknowledgement of country\nannex\nannexation\nanti-colonial\nanti-colonialism\ncolony\ncommonwealth\ncondominium\ncrown colony\ndecolonization\nIndependence Day\nintercolonial\nland acknowledgment\nNat\nnationalism\nsecession\nself-determination\nself-governing\nself-government\nself-rule\nSee more results »"}