{"id":122058,"name":"deposit","type":"verb","us_sound":"dɪˈpɑː.zɪt","us_link":"../audio/d/deposit.mp3","uk_sound":"dɪˈpɒz.ɪt","uk_link":"../audio/d/ukdepil020.mp3","content":"deposit verb\n(LEAVE)\nAdd to word list\nAdd to word list\n[ T usually + adv/prep ] to leave something somewhere: The flood waters fell, depositing mud over the whole area. The bus deposited me miles from anywhere. The cuckoo deposits her eggs in other birds' nests. I deposited my luggage in a locker at the station.\nSMART Vocabulary: related words and phrases\nPlacing and positioning an object\n-based\nappose\naround\nchange something around\ncircle\nconsign\nfit\ngone\ninstall\nlie\npile (something) up\nplant\nredeposit\nreinstall\nreinstallation\nrelocate\nreorientate\nsuperimpose\ntranspose\ntransposition\nSee more results »\ndeposit verb\n(MONEY)\nC1 [ T ] to put something valuable, especially money, in a bank or safe (= strong box or cupboard with locks): There's a night safe outside the bank, so you can deposit money whenever you wish. I deposited £500 in my account this morning.\n[ T ] to pay someone an amount of money when you make an agreement with that person to pay for or buy something, that either will be returned to you later, if the agreed arrangement is kept, or that forms part of the total payment: When we moved in, we had to deposit $1,000 with the landlord in case we broke any of his things. You deposit 20 percent now and pay the rest when the car is delivered.\nSMART Vocabulary: related words and phrases\nSaving money\nbank\ndeposit account\ndepositor\ndirect deposit\ninterest rate\nISA\non deposit idiom\npension plan\nput\nput something aside\nput something by\nredeposit\nretirement plan\nsalt\nsalt something away\nsquirrel\nsquirrel something away\nTESSA\nundersaver\nwar chest\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPaying money\ndeposit noun\n(LAYER)\nC2 [ C or U ] a substance or layer that is left, usually after a liquid is removed: Decant the wine carefully, so that you leave the deposit in the bottom of the bottle. In hard-water areas, a chalky deposit often forms in pipes and kettles. The flood left a thick deposit of mud over the entire ground floor of the house.\nC2 [ C ]\n&#160; geology\n&#160; specialized a layer that has formed under the ground, especially over a long period: mineral/oil/coal deposits\nSMART Vocabulary: related words and phrases\nThings remaining\n(and) all the rest idiom\nbalance\nbastion\nbe left phrase\ncremains\ncutpiece\nground\nhangover\nredoubt\nrelic\nremainder\nremains\nremnant\nresidual\nrest\nsurvival\nthrowback\ntime capsule\nunallocated\nuneaten\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeology: mineralogy\ndeposit noun\n(MONEY)\nC1 [ C ] a payment, especially into a bank account: To open an account, you need to make a minimum deposit of $500.\nB1 [ C ] an amount of money that you pay as the first part of the total payment for something: The shop assistant says if I leave £10 as a deposit, they'll keep the dress for me. We paid/put a deposit of £5,000 on the house, and paid the balance four weeks later. They asked us to put down a deposit.\nC1 [ C ] an amount of money that you pay when you rent something, and is returned to you when you return the thing you have rented: It costs $2,000 a week to rent the yacht, with a $200 refundable/returnable deposit. You pay a 10p deposit/deposit of 10p on the bottle, which you get back when you return the empty bottle.\nSMART Vocabulary: related words and phrases\nInvesting money\nbacker\nbet\nbet big on something/someone idiom\ncapitalize\nco-investor\ndiscretionary\ndivestiture\ndivestment\nendow\nethical\ninvestor\nmature\nmicrofinance\npay something in\npension plan\nplough\nplough into something/someone\nprotect\npump something into something\nspeculate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBanks\nRenting & hiring\nCosts & expenses\nPayment methods\nIdiom\non deposit\ndeposit noun [C]\n(MONEY)\nAdd to word list\nAdd to word list\nan amount of money paid into an account: She made a large deposit last Thursday.\nA deposit is also a sum of money that is given in advance as part of a total payment for something: Will you get your deposit back if you cancel the trip?\nA deposit is also an additional sum of money that you pay when you rent something to make sure you return the item or to pay for repairs: The apartment rents for $1200 a month, and we want one month’s rent for a deposit.\nA deposit is also an amount paid in addition to the cost of something to make sure you bring its container back when you have used it: a bottle deposit\ndeposit noun [C]\n(LAYER)\na layer of a substance: The flood left a thick deposit of mud on the floor. The region has lots of gas and coal deposits.\ndeposit verb\n(MONEY)\n[ T ] to put money in a bank: I deposited $500 in my savings account last week.\ndeposit verb\n(LEAVE)\n[ T always + adv/prep ] to leave something somewhere: The cat deposited a dead mouse at my door.\nAdd to word list\nAdd to word list\n[ C ]\n&#160; BANKING an amount of money that someone pays into a bank account: Using the cash machine I can make a deposit at any time of the day.have/keep/hold money on deposit Rather than hold money on deposit, you should pay off your debts. Compare\nwithdrawal\n[ C ]\n&#160; COMMERCE, PROPERTY a part of the cost of something such as a product or property that a buyer pays to a seller so that it will not be sold to anyone else: make/pay/put down a deposit (on sth) Many families put down a deposit for their summer holidays as early as January. a €50/$100, etc. depositask for/request a deposit Normally someone selling a house would ask for a deposit of at least 5%. non-refundable deposit Compare\ndown payment\ndeposits\n[ plural ]\n&#160; BANKING, ECONOMICS the total amount of money that has been paid into a particular bank, or into the banks in a particular place: The bank now has more than 1m account holders and deposits of around £1.7bn. The government closed banks for a week, trying to prevent a run on deposits.\n[ C ]\n&#160; PROPERTY an amount of money that someone renting a property pays to the owner of the property, which they get back when they leave only if they have not caused any damage: ask for/require a deposit Landlords will usually require a deposit.lose a deposit I once lost a deposit on a flat when I knocked something over and stained the carpet. See also\nbank deposit\ncash ratio deposits\ncertificate of deposit\ncore deposits\ndemand deposit\ndirect deposit\nfixed deposit\nmoney market deposits\npublic deposits\nretail deposits\nView all\nsight deposit\nterm deposit\ntime deposit\nBANKING to put money into a bank account, especially one that pays interest: deposit money/a cheque/fundsdeposit sth in/into sth You can choose to have your salary deposited directly into your bank account. Compare\nwithdraw\nto leave money or something that is valuable in a safe place: deposit sth with sb The documents have been deposited with the solicitor for safe-keeping."}