{"id":122153,"name":"depression","type":"noun","us_sound":"dɪˈpreʃ.ən","us_link":"../audio/d/depression.mp3","uk_sound":"dɪˈpreʃ.ən","uk_link":"../audio/d/ukdepre011.mp3","content":"depression noun\n(UNHAPPINESS)\nAdd to word list\nAdd to word list\nB2 [ U ] the state of feeling very unhappy and without hope for the future: I was overwhelmed by feelings of depression.\nB2 [ C or U ] a mental illness in which a person is very unhappy and anxious (= worried and nervous) for long periods and cannot have a normal life during these periods: Tiredness, loss of appetite, and sleeping problems are all classic symptoms of depression. If you suffer from depression, it's best to get professional help. See also\nclinical depression\nMore examplesFewer examplesHis wife's been hospitalized for depression.Every day she sinks further and further into depression.The drugs, the divorce and the depression - it's an episode in his life that he wants to forget.Don't let feelings of depression swamp you.Withdrawal is a classic symptom of depression.\nSMART Vocabulary: related words and phrases\nSadness and regret\naw\nbe/weigh on your conscience idiom\nbitter\nblack dog\nbreastbeating\ncry\ndistress\nfeel bad idiom\ngloominess\nglumness\ngroan\nguilt\nprick\nprick someone's conscience idiom\nregretful\nregretfully\nremorse\nrepentant\nwrench\nwretchedness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMental illnesses\ndepression noun\n(NO ACTIVITY)\nC2 [ C ] a period in which there is very little business activity and not many jobs: The stock market crash marked the start of a severe depression.\nSMART Vocabulary: related words and phrases\nEconomics\naccommodative\nanti-economic\nanti-inflation\nanti-inflationary\nanti-recession\ndeindustrialization\ndouble-dip\nhuman development index\nindustrialism\ninflation\nKeynesian\nliberal\nmarket economy\nmarketeering\nmonetary\npeace dividend\nrecession\nretrench\nstagflation\nthe public purse\nSee more results »\ndepression noun\n(WEATHER)\n[ C ]\n&#160; environment\n&#160; specialized an area where the air pressure is low: The deep depression over the mid-Atlantic will gradually move eastwards during the day.\nSMART Vocabulary: related words and phrases\nDescribing bad weather\nbleakly\nbleakness\nbreak\ndreich\nfickle\nfickleness\ngray\ngrey\ngreyly\ninclement\novercast\nrough\nsock something/someone in (with sb)\nsunless\nthreatening\ntreacherous\ntreacherously\nunseasonable\nunseasonably\nunseasonal\nSee more results »\ndepression noun\n(HOLE)\n[ C ] part of a surface that is slightly lower than the rest: There was a depression in the sand where he'd been lying.\nSMART Vocabulary: related words and phrases\nHoles, hollows and dips\nanti-crack\naperture\nblistered\nchink\ncranny\ncratering\ngouge\nhatch\nhollow\nimpression\nimprint\ninterstice\nladder\nleak\nleaky\nnook\npinprick\nshaft\nspyhole\nvoid\nSee more results »\ndepression noun\n(CAUSE UNHAPPINESS)\nAdd to word list\nAdd to word list\n[ U ] a feeling of sadness, or medical a type of mental illness that causes long periods of unhappiness: I’m just beginning to get over the depression from losing my job. medical Tiredness, loss of appetite, and sleeping problems are symptoms of depression.\ndepression noun\n(PRESS DOWN)\n[ C ] a part in a surface that is slightly lower than the rest: There was a depression in the sand where he’d been lying.\ndepression noun\n(REDUCE)\n[ C ]\n&#160; world history a period in which there is very little business activity and little employment: My parents lived through the Great Depression of the 1930s.\nAdd to word list\nAdd to word list\na recession (= time of low economic activity, when investments lose value, businesses fail and people lose their jobs) that lasts for a long period of time, usually several years: plunge/slide into depression The Thirties saw the world plunge into depression. The Wall Street Crash of 1929 brought severe economic depression and hardship to Canada. This was a period of deep depression. For most of the 20th century, economists focused on understanding and controlling inflation and depressions. New mines are being developed and old mines reopened, lifting communities across Northern Nevada out of the depression left by the industry's last crash. Compare\nboom\nrecession\nslump\nthe Depression (also the Great Depression)\nthe period in the years after 1929 until the middle of the 1930s, or, in some cases, the 1940s, when there was a very low level of economic activity in the US, Europe, and many other countries. Many people lost their jobs and were very poor: The Federal Home Loan Bank system was created in the 1930s by the federal government to stimulate lending during the Depression. Compare\nWall Street Crash"}