{"id":122145,"name":"depressed","type":"adjective","us_sound":"dɪˈprest","us_link":"../audio/d/depressed.mp3","uk_sound":"dɪˈprest","uk_link":"../audio/d/ukdepre008.mp3","content":"depressed adjective\n(SAD)\nAdd to word list\nAdd to word list\nB1 unhappy and without hope: He seemed a bit depressed about his work situation. She became deeply depressed when her husband died.\nThesaurus: synonyms, antonyms, and examples\nfeeling sadsadShe's been sad ever since her cat died.unhappyShe'd had a very unhappy childhood.miserableI just woke up feeling miserable.upsetThey'd had an argument and he was still upset about it.broken-heartedShe was broken-hearted when her partner left.\nSee more results »\nMore examplesFewer examplesHe's been listless and a bit depressed ever since he got his exam results.She became very depressed in her old age.He sounded very depressed when we spoke on the phone yesterday.Pete was so depressed after his girlfriend left him that I actually thought he was suicidal.Try not to get depressed - after all, what's the use of worrying?\nSMART Vocabulary: related words and phrases\nFeeling sad and unhappy\na dog's life idiom\na long face idiom\nabjection\nangsty\nbe cut up idiom\nbe down in the mouth idiom\nbe in a funk idiom\ndistraught\ndistressed\ndog\ndoleful\nlovelorn\nlovesick\nlow-spirited\nlugubrious\nwistful\nwistfully\nwoe\nwoe is me idiom\nwoebegone\nSee more results »\ndepressed adjective\n(REDUCED)\nC2 not having enough money, jobs, or business activity: In a depressed market, it's difficult to sell goods unless you lower your prices. an economically depressed area\nSMART Vocabulary: related words and phrases\nEconomics\naccommodative\nanti-economic\nanti-inflation\nanti-inflationary\nanti-recession\ndeindustrialization\ndouble-dip\nGDP\nhuman development index\nindustrialism\ninflation\nKeynesian\nliberal\nmarket economy\nmarketeering\nmonetary\npeace dividend\nretrench\nstagflation\nthe public purse\nSee more results »\ndepressed adjective\n(UNHAPPY)\nAdd to word list\nAdd to word list\nfeeling unhappy and without hope: He’s depressed about losing his job.\ndepressed adjective\n(HAVING NO MONEY)\nshowing a lack of money or business activity: This is an economically depressed area.\nAdd to word list\nAdd to word list\nused to describe a situation in which there is less manufacturing or business activity than usual, fewer jobs, etc.: The depressed state of the aerospace market made acquisitions difficult. Banks took action yesterday to try to boost the depressed economy.\nbelow the amount or level that is usual: Anyone who did buy at the depressed 1987 prices has since been able to reap rich rewards as shares have hit new highs. Sales remained depressed as a result of consumers' reluctance to spend on home improvements."}