{"id":122204,"name":"depth","type":"noun","us_sound":"depθ","us_link":"../audio/d/depth.mp3","uk_sound":"depθ","uk_link":"../audio/d/ukdepre019.mp3","content":"depth noun\n(DISTANCE DOWN)\nAdd to word list\nAdd to word list\nB1 [ C or U ] the distance down either from the top of something to the bottom, or to a distance below the top surface of something: the depth of a lake/pond There are very few fish at depths (= distances below the surface) below 3,000 metres. The river froze to a depth of over a metre. the depths [ plural ] literary\nthe lowest part of the sea: The ship sank slowly to the depths of the ocean.\nSee more\nMore examplesFewer examplesUse a garden fork to loosen the soil to a depth of 12 inches.Northern elephant seals and Weddell seals can dive to depths of 600-1,250 meters.The submarine stayed submerged at a depth of over 45 meters.The seals usually dive to a depth of 400 meters where they feed on fish such as Antarctic cod.The depth of the children's pool is only 0.85 meters.\nSMART Vocabulary: related words and phrases\nMeasurements in general\naltitude\nbathymetric\nbathymetrically\nbathymetry\nbe running at something idiom\ncalibrate\ndistance\ndrop\nelevation\nfactor\nknee-length\nmetric\nmetrication\nmilli-\nscale\nsetting\ntera-\nuncalibrated\nunmeasurable\nunsized\nSee more results »\ndepth noun\n(SERIOUSNESS)\nB2 [ C or U ] the state of having serious qualities or the ability to think seriously about something: Terry lacks depth - he's a very superficial person. Her writing shows astonishing depth. Jo has hidden depths (= serious qualities that you do not see immediately). in depth\nB2 in a serious and detailed way: I'd like to look at this question in some depth.\nSee more\nMore examplesFewer examplesI don't dispute that Lucas' films are entertaining, but they haven't got much depth.He's entertaining enough but he lacks a little depth.Her later writing showed more depth.She may seem fairly frivolous but I suspect she has hidden depths.Yet his work rarely shows the depth of his father's oeuvre.\nSMART Vocabulary: related words and phrases\nThinking and contemplating\na brown study idiom\nagonize\nagonize over/about something\nbeard-stroking\nbethink\ngrapple\nharbour\nin the cold light of day idiom\nintrospect\nintrospection\njoined-up thinking\nlateral thinking\nnavel\nreckon\nreweigh\nrumination\nrun through someone's mind/head idiom\nscratch your head idiom\nself-contemplation\nweigh\nSee more results »\ndepth noun\n(DISTANCE BACKWARDS)\n[ C or U ] the distance from the front to the back of something: Measure the depth of the cupboard/shelf.\nSMART Vocabulary: related words and phrases\nMeasurements in general\naltitude\nbathymetric\nbathymetrically\nbathymetry\nbe running at something idiom\ncalibrate\ndistance\ndrop\nelevation\nfactor\nknee-length\nmetric\nmetrication\nmilli-\nscale\nsetting\ntera-\nuncalibrated\nunmeasurable\nunsized\nSee more results »\ndepth noun\n(STRENGTH)\nC2 [ C or U ] the fact of a feeling, state, or characteristic being strong, extreme, or detailed: He spoke with great depth of feeling. I was amazed at the depth of her knowledge. in the depth(s) of something\nexperiencing an extreme and negative emotion: He was in the depths of despair/depression about losing his job.\nduring the worst period of a bad situation: The company was started in the depth of the recession of the 1930s.\nSee more\nSMART Vocabulary: related words and phrases\nPower and intensity\nascendant\nbe (as) solid as a rock idiom\nbrunt\ncast iron\nclout\ngrunt\nintensity\ninvincibility\ninvulnerability\njuggernaut\nkeenness\nkick-ass\nresilient\nrichness\nripely\nrobustness\nstridency\nvigour\nvirulence\nvividness\nSee more results »\ndepth noun\n(LOW SOUND)\n[ U ] the quality of having a low sound: The depth of his voice makes him sound older than he is.\nSMART Vocabulary: related words and phrases\nDescribing qualities of sound\naudibly\nboomy\nchocolatey\nchuff\nclomp\ncrackling\near-splitting\nlistenable\nmellifluously\nmelodically\nmelodious\nmelodiously\nmetallically\nraucous\nstaccato\nsymphonically\ntextured\nthready\ntinnily\ntunefully\nSee more results »\ndepth noun\n(DARKNESS)\n[ U ] the fact of something, especially a colour, having the quality of being dark and strong: I love the depth of colour in her early paintings.\nSMART Vocabulary: related words and phrases\nThe qualities of colour\nanalogous\nbrightly\nbrightness\ncolourful\ncolourfully\ndarkness\nfluorescent\nharsh\nneutrally\nnon-complementary\nnon-fluorescent\nnon-yellowing\nover-bright\npsychedelic\nvibrancy\nvibrantly\nviolent\nvivid\nvividly\nvividness\nSee more results »\nGrammar\nMeasurementsWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nArea: length, width, depth and heightWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nWeight and volumeWe use the verb weigh to measure weight: …\nFrequency, speed, timeWe use many different expressions to describe frequency, speed and time. Here are some of them: …\nIdioms\nin the depth(s) of somewhere\nin the depth(s) of winter\nout of your depth\ndepth noun [C/U]\n(DISTANCE DOWN)\nAdd to word list\nAdd to word list\nthe distance down from the top surface of something to the bottom: [ C ] They were scuba diving at a depth of 22 meters. [ U ] The numbers on the left show the depth in inches.\ndepth noun [C/U]\n(DISTANCE BACKWARD)\nthe distance from the front to the back of something: [ U ] Bookshelves should be at least nine inches in depth.\ndepth noun [C/U]\n(STRENGTH)\nthe strength, quality, or degree of being complete: [ U ] It’s hard to get a handle on the depth of her knowledge.\ndepth noun [C/U]\n(SERIOUSNESS)\nthe ability to think seriously about something: [ U ] Don’t look for depth in this show. in depth\nSomething done in depth is done carefully and in great detail: I interviewed her in depth. an in-depth report Idiom\nin the depths of something"}