{"id":122399,"name":"derivative","type":"adjective","us_sound":"dɪˈrɪv.ə.t̬ɪv","us_link":"../audio/d/eus71238.mp3","uk_sound":"dɪˈrɪv.ə.tɪv","uk_link":"../audio/d/ukdereg011.mp3","content":"Add to word list\nAdd to word list\nIf something is derivative, it is not the result of new ideas, but has been developed from or copies something else: His painting/style is very derivative.\nSMART Vocabulary: related words and phrases\nCopying and copies\nanti-counterfeiting\nanti-piracy\nape\nbiomimicry\nblueprint\nfacsimile\nforge\nforgery\nhijack\nhijacking\nimaging\nmimetic\nphotostat\nphotostatic\npiracy\npirate\npirated\ntranscript\nwarmed-over\nXerox\nSee more results »\nderivative noun [C]\n(FORM)\na form of something made or developed from another form: This is a derivative of seaweed that is currently used as a food additive.\nlanguage\n&#160; specialized a word developed from another word: \"Detestable\" is a derivative of \"detest\".\nMore examplesFewer examplesThe programming languages most often used are C and its derivatives or JavaScript.The courts ruled that any soda containing cola derivatives could be called a cola.Retinoids are derivatives of vitamin A.The word \"stress\" has numerous modern derivatives, including \"stressed out\", \"de-stress\" and \"stressy\". Self-explanatory words are regularly formed compounds and derivatives that require no formal definition.\nSMART Vocabulary: related words and phrases\nCategories and varieties\nbad/big boy idiom\nbreed\ncategoric\ncategorical\ncategory\nclassification\nform\ngenre\nhue\nmark\nmisclassification\nmodel\npolymorphism\nrun\nshade\nsort\nstratification\nsubcategory\nsubstance\nupdate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: morphology & parts of words\nderivative noun [C]\n(FINANCIAL PRODUCT)\nfinance &amp; economics\n&#160; specialized a financial product such as an option (= the right to buy or sell something in the future) that has a value based on the value of another product, such as shares or bonds: The company became the leading marketplace for foreign exchange derivatives. Brokers predict the derivatives market will continue expanding at a fast pace.\nMore examplesFewer examplesThe brokerage business had changed: from merely selling stocks and bonds, it was now dealing in all sorts of derivatives.There are rules for dealing in derivatives and other complex financial instruments.\nderivative noun [C]\n(MATHS)\nmathematics\n&#160; specialized in calculus (= an area of advanced mathematics in which continuously changing values are studied), a measure of the rate at which a function is changing: The derivative of the position of a moving object with respect to time is the object's velocity. Find the derivative of the function f(x) = (x2 - 5) (x3 - 2x + 3). Compare\nintegral\nMore examplesFewer examplesIn order to calculate the mean, we take the first derivative of (1) with respect to t.The right-hand side of (3.2) is readily deduced by calculating the partial derivatives of F(x, t) and replacing them in (2.3). The matrix of partial derivatives is obtained from differentiating the equation.\nSMART Vocabulary: related words and phrases\nCalculations & calculating\nalgebraic\nalgebraically\nalgo\nalgorithmic\namount\ncalculate\nguesstimate\ninterpolate\ninverse function\nlinear equation\nmathematical\nmatrix\nmiscalculate\nmiscalculation\nmiscount\nmultigrid\noperator\nroot\nsum\nwork something out\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBranches & types of mathematics\nAdd to word list\nAdd to word list\nhaving qualities taken from something else: Too much of the music feels derivative.\nsomething made from something else: Retinol is a derivative of vitamin A.\ngrammar A derivative is also a word that is made from another word.\nAdd to word list\nAdd to word list\nSTOCK MARKET, FINANCE a financial product such as an option (= the right to buy or sell something in the future) that has a value based on the value of another asset, such as shares, or bonds: GS Financial Products buys and sells derivatives such as swaps and options linked to interest rates, currencies, commodities and indexes. derivatives trading In the past 20 years there has been a huge growth in the derivatives markets."}