{"id":122739,"name":"description","type":"noun","us_sound":"dɪˈskrɪp.ʃən","us_link":"../audio/d/description.mp3","uk_sound":"dɪˈskrɪp.ʃən","uk_link":"../audio/d/ukdescr001.mp3","content":"Add to word list\nAdd to word list\nB1 something that tells you what something or someone is like: Write a description of your favourite beach. She has given the police a very detailed/full description of the robber. A girl answering (= matching) the description of the missing teenager was spotted in Glasgow. Your paper contains too much description, and not enough discussion of the issues. of every description\nof all types: Boats of every description were entering the harbour.\nSee more be beyond description (also defy description)\nto be something that you cannot describe accurately because of its great size, quality, or level: Her beauty is beyond description.\nSee more\nMore examplesFewer examplesA witness gave a detailed description of the man.He gave a very vivid and often shocking description of his time in prison.The book contains lyrical descriptions of the author's childhood.Would you say that is an accurate description of the current situation?A woman of your description was seen in the area on the night of the crime.\nSMART Vocabulary: related words and phrases\nAccounts and stories\nanecdote\nanother\nanti-narrative\nbe another story idiom\nbodice-ripper\nbrushstroke\ncautionary tale\ncommentary\nlore\nmisdescription\nmulti-stranded\nmyth\nmythic\nscenario\nsemi-legendary\nshaggy-dog story\nshort story\nsleeping beauty\nstrand\nwrite something up\nSee more results »\nAdd to word list\nAdd to word list\nliterature a statement or a piece of writing that tells what something or someone is like: [ C ] Your description of Della was hilarious. [ U ] Boats of every description (= of all types) entered the harbor. [ U ] The beauty of the Rockies is beyond description (= is impossible to describe). descriptive adjective us\nYour browser doesn't support HTML5 audio\n/dɪˈskrɪp·tɪv/\nHis poetry skillfully incorporates descriptive details."}