{"id":122692,"name":"descendant","type":"noun","us_sound":"dɪˈsen.dənt","us_link":"../audio/d/descendant.mp3","uk_sound":"dɪˈsen.dənt","uk_link":"../audio/d/ukdereg027.mp3","content":"Add to word list\nAdd to word list\nC2 a person who is related to you and who lives after you, such as your child or grandchild: He has no descendants. They claim to be descendants of a French duke. We owe it to our descendants (= people younger than us who will live after we have died) to leave them a clean world to live in. Compare\nancestor\nan animal that lives after and is related to another animal that lived in the past: Lemurs are descendants of the earliest primates.\nsomething that is similar to and influenced by something that existed before it: Freeride skiing is a hybrid, trick-oriented descendant of skateboarding and snowboarding. The file-sharing service and its descendants allowed users to download music for free.\nMore examplesFewer examplesMost of these people are refugees or the descendants of refugees. Surely our descendants will wonder why we didn't notice, why we did nothing about greenhouse gases.These wild horses are the living descendants of untold generations of Ozarks history.He hopes descendants of these monkeys will spread beyond the reserve to repopulate nearby mountains.What makes these mutations particularly dangerous is that they are passed down from a cell to all its descendants.This celebrated Coen brothers debut is a worthy descendant of classic 1940s film noir.\nSMART Vocabulary: related words and phrases\nFamily: ancestors & descendants\nancestor\nancestral\nancestry\nbe in the/someone's blood idiom\nblood\nblood is thicker than water idiom\nfamily tree\nforbear\nforebear\nforefather\nforemother\ngeneration\ngenerationally\nheraldic\nheraldically\nheraldry\nlineage\nrun in the family idiom\nsandwich generation\nsuccessor\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlants & animals - general words\nReplacing and exchanging\nChange and changes\nAdd to word list\nAdd to word list\na person related to someone from an earlier generation (= all the people of about the same age within a particular family): The Pennsylvania Dutch are descendants of early German immigrants."}