{"id":122789,"name":"desert","type":"noun","us_sound":"ˈdez.ɚt","us_link":"../audio/d/desert_03_00.mp3","uk_sound":"ˈdez.ət","uk_link":"../audio/d/ukdescr011.mp3","content":"Add to word list\nAdd to word list\nA2 an area, often covered with sand or rocks, where there is very little rain and not many plants: They were lost in the desert for nine days. We had to cross a large area of arid, featureless desert. the desert sun\n35007/E+/GettyImages cultural, intellectual, etc. desert disapproving\na place that is considered to have no cultural, intellectual, etc. quality or interest: This town is a cultural desert.\nSee more\nMore examplesFewer examplesThe flatness of the desert was broken only by a few large piles of rocks.She gave a hair-raising account of her escape through the desert.Living rough in the desert hardened the recruits a lot.The terrorists assumed control of the plane and forced it to land in the desert.At night, adult scorpions prowl the desert for insects.\nSMART Vocabulary: related words and phrases\nGeography: deserts, prairies & wildernesses\nbrush\nbush\nBushman\ndust bowl\ngrassland\nheathland\nmarginal land\nmoor\nmoorland\nmulga\npasture\nplain\nprairie\nSahara\nthe Gobi Desert\nveld\nvirgin\nwadi\nwasteland\nwilderness\nSee more results »\nGrammar\nGeographical placesWe use the before the names of rivers. We usually write the without a capital letter. If we use the word river, we usually write it without a capital letter: the river Thames, the river Severn, the Yangtze river. …\ndesert verb\n(RUN AWAY)\n[ I or T ] to leave the armed forces without permission and with no intention of returning: Soldiers who deserted and were caught were shot. How many people desert from the army each year?\nSMART Vocabulary: related words and phrases\nJoining or leaving the army\nanti-draft\nbuy\nbuy someone out\ncall\ncall someone up\ncommission\nconscript\nconscription\ndemob\ndemobilization\ndeserter\ndesertion\ndraft\ndraft dodger\nenlist\njoin\njoin up\nre-enlist\nre-enlistment\nre-up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDisloyalty, betrayal & treason\ndesert verb\n(LEAVE BEHIND)\n[ T ] to leave someone without help or in a difficult situation and not come back: He deserted his wife and family for another woman.\n[ T ] If a quality deserts you, you suddenly and temporarily lose it: All my confidence/courage deserted me when I walked into the exam.\nSMART Vocabulary: related words and phrases\nDeparting\nabandon\nabandon ship\nabandonment\nabsquatulate\nbackward\ngone\nmove\np.o.q.\npeel away/off\npiss off\npull\npull out\npull something off\npush along\nsea\nturf something out\nvacate\nvamoose\nwalk\nwalk off (somewhere)\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLosing and loss\nAdd to word list\nAdd to word list\nto leave someone or something without help or in a difficult situation: Local people deserted the city as hordes of tourists arrived.\nIf you desert the armed forces, you leave without permission and with no intention of returning: He denied that he had deserted his post.\na large, dry area where there is very little rain and few plants: [ U ] When you live in the desert, water is your most vital resource."}