{"id":122834,"name":"desi","type":"noun","us_sound":"ˈdeɪ.si","us_link":"../audio/d/cdo1121usdesi1374.mp3","uk_sound":"ˈdeɪ.si","uk_link":"../audio/d/cdo1121ukdesi1341.mp3","content":"Add to word list\nAdd to word list\na person who comes from or whose family comes from India, Pakistan, or Bangladesh but who lives in another country: Urban desis are mixing Hindi and hip-hop. There were only a handful of other desis in the area when he was in elementary school.\nMore examplesFewer examplesThese days we try and use our own word for homeboy so we just call ourselves desis.She experienced the \"confused desi\" phenomenon after she moved to the United States as a child, and felt conflicted about her East Indian roots.As desis established themselves in the community, they found it important to become involved in the political arena.A group of young Desis chats over coffee, complaining about generalizations such as the widespread assumption that Indian kids are perfect students.\nin a traditional or home-made Indian style: All Pilau dishes are served with fresh salad and special desi chutney. Shaami kebab is our desi version of a burger.\nMore examplesFewer examplesGhee is also sometimes called desi (country-made) ghee to distinguish it from \"vegetable ghee\".Caramelized onions are used as the base for almost every desi dish you can think of.The two characters are like a snapshot of modernizing India: one English-speaking, foreign-influenced and affluent; the other desi, or traditional.The Eighties London sound was a bit more innovative and mixed with other genres of music, whereas Birmingham was desi because the community was solid Punjabi and Sikh.\nSMART Vocabulary: related words and phrases\nCustom, tradition & conformity\nAmericanization\nanti-classical\nanti-conventional\nanti-institutional\nanti-traditional\nconventionalized\nconventionally\ncounter-tradition\ncrowd\ncustom\nmulticultural\nmulticulturalism\nmulticulturally\nnon-classical\nnon-conservative\ntraditionally\nultra-conservatism\nultra-conservative\nultra-traditional\nunconventional\nSee more results »"}