{"id":122865,"name":"design","type":"verb","us_sound":"dɪˈzaɪn","us_link":"../audio/d/design.mp3","uk_sound":"dɪˈzaɪn","uk_link":"../audio/d/ukdescr023.mp3","content":"design verb\n(PLAN)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to make or draw plans for something, for example clothes or buildings: Who designed this building/dress/furniture? This range of clothing is specially designed for shorter women.\nMore examplesFewer examplesIn 1960, Pierre Cardin became the first couturier to design men's clothes.He's designed dresses for many celebrities, most famously the Queen.All our advertising material is designed in-house.The building isn't designed very well from the point of view of wheelchair access.Adam designed and wrote the software.\nSMART Vocabulary: related words and phrases\nInventing, designing and innovation\nabsorptive capacity\narchitect\nartificer\nbionics\nblueprint\ndesigner\ndevise\ndream something up\nergonomic\nergonomically\nmodularization\nnanotechnology\nnon-imitative\noperational research\noriginator\nthink outside the box idiom\nthink something up\ntrailblaze\nwhole cloth\nwind tunnel\nSee more results »\ndesign verb\n(INTEND)\nB2 [ T usually passive ] to intend: This dictionary is designed for advanced learners of English. [ + to infinitive ] These measures are designed to reduce pollution.\nMore examplesFewer examplesThe advertisements were designed to shock - that was the whole point of the campaign.The government has produced a series of leaflets designed to extend public awareness of the dangers of AIDS.This course is designed to give drivers a grounding in car maintenance.By its nature, terrorism is designed to strike at the heart of our democratic values.The new law is designed to protect people's privacy.\nSMART Vocabulary: related words and phrases\nPlanning, expecting and arranging\naccidentally\naccidentally on purpose idiom\nadvertent\nadvisedly\naim at something\nbargain\nhorizon scanning\nhow are you fixed for something? idiom\nI might have known idiom\nI'll/we'll cross that bridge when I/we come/get to it idiom\nin someone's crosshairs idiom\nplanner\nprovision\npurpose\npurposefully\npurposely\nput the cart before the horse idiom\nput their heads together idiom\nsettle\nsleeve\nSee more results »\ndesign noun\n(PLAN)\nC1 [ C ] a drawing or set of drawings showing how a building or product is to be made and how it will work and look: Have you seen the designs for the new shopping centre?\nB1 [ U ] (also designing) the art of making plans or drawings for something: She's an expert on kitchen/software design. He's studying design in Paris.\nB1 [ S or U ] the way in which something is planned and made: I don't like the design of this sofa. The building was originally Victorian in design. a serious design fault The car has some excellent design features.\nMore examplesFewer examplesThe design of the church echoes that of St. Paul's Cathedral.There was a very positive response to our new design - people seemed very pleased with it.The designs for the new mosque have attracted widespread criticism.The fault surely lies in the design of the equipment.The car has a serious design fault.\nSMART Vocabulary: related words and phrases\nArchitecture\nanti-modernism\nanti-modernist\narchitect\narchitectural\narchitecturally\nbuilt environment\ncolonial\ndefensive architecture\necotecture\nfloor plan\nLatinization\nLatinize\nLatinized\nmid-century modern\nmodernism\nrococo\nRomanesque\nsympathetically\ntrefoil\nunbuildable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInventing, designing and innovation\ndesign noun\n(PATTERN)\nB1 [ C ] a pattern used to decorate something: a floral/abstract design I like the design on your sweatshirt.\nSMART Vocabulary: related words and phrases\nPatterns and shapes\namorphous\narabesque\nargyle\nasymmetrically\nasymmetry\nfishbone\nfishhook\nflecked\nformless\nformlessly\npalmate\nreticulation\nrhomboid\nsemilunaris\nshapeable\nshaped\nshapeless\nshapelessly\nsilhouetted\nzigzag\nSee more results »\ndesign noun\n(INTENTION)\nby design\nintentionally: I'm sure he ignored you by accident and not by design.\nSee more designs [ plural ]\nplans, often ones that are not honest, to get something or someone for yourself: to have territorial designs (on neighbouring countries)\nSee more\ndesign verb\n(PLAN)\nAdd to word list\nAdd to word list\n[ I/T ] to make or draw plans for something: [ T ] A famous engineer designed the new bridge. [ I ] She designs for a dress manufacturer.\ndesign verb\n(INTEND)\n[ T ] to intend a result: These measures are designed to reduce pollution.\ndesign noun\n(PLAN)\n[ C/U ] a plan or drawing: [ C ] Have you seen the designs for the new lobby?\n[ C/U ] Design is the skill of making plans or drawings for something: [ U ] She’s an expert in software design.\n[ C/U ]\n&#160; art Design is also the way in which something is arranged or shaped: [ U ] I like the design of this microwave oven.\n[ C/U ]\n&#160; art A design is also a pattern used to decorate something: a geometric design\ndesign noun\n(INTENTION)\n[ U ] purpose or intention: The details of the case are unclear, and this is by design (= intentional).\ndesign noun\n(PLANS)\n[ pl ] plans to get something or someone for yourself, esp. secret or dishonest plans: Troop movements suggest the country has designs on its neighbor.\nAdd to word list\nAdd to word list\n[ I or T ] to make or draw plans for something that will be produced: Who designed your website? This range of clothing is specially designed for shorter women.\n[ T ] to intend for a particular purpose: This dictionary is designed for people using English in a business situation.be designed to do sth These measures are designed to reduce pollution.\n[ C or U ] the way in which something is planned and made: I don't like the design of this control panel.produce/develop/improve a design The company excelled at producing new designs for established products.innovative/original design The innovative design of the product won several awards. good/poor design a serious design fault The car has some excellent design features. The building was originally Victorianin design.\n[ C ] a drawing or set of drawings showing how a building or product is to be made and how it will work and look: Have you seen the designs for the new shopping centre?\n[ U ] the work of making plans or drawings for something: She works in software design. He is studying interior design. There are a lot of good opportunities in the area of web design. The product was abandoned when it was still at the design stage. See also\ngraphic design\nindustrial design\nregistered design"}