{"id":122933,"name":"desire","type":"verb","us_sound":"dɪˈzaɪr","us_link":"../audio/d/desire.mp3","uk_sound":"dɪˈzaɪər","uk_link":"../audio/d/ukdesir003.mp3","content":"desire verb [T not continuous]\n(WANT)\nAdd to word list\nAdd to word list\nC1 to want something, especially strongly: I desire only to be left in peace. The hotel had everything you could possibly desire.desire someone to do/desire of What does her Ladyship desire me to do/desire of me? [ + to infinitive ] The president desires to meet the new prime minister.\nSMART Vocabulary: related words and phrases\nWanting things\nache for something\nacquisitive\nambitious\nambitiously\nangle for something\ndesperate\nexpense\nfancy\nhunger\nhunger after/for something\nhungrily\nhungry\npine\nset your heart on something/doing something idiom\nset your sights on something idiom\nshook\nshopping list\nsight\nsomeone's heart's desire idiom\nstraw\nSee more results »\ndesire verb [T not continuous]\n(SEXUAL)\nto have a strong sexual attraction to someone Idiom\nsomeone's heart's desire\ndesire noun\n(WANT)\nB2 [ C or U ] a strong feeling that you want something: have no desire I certainly have no desire to have children.desire for There is a strong desire for peace among the people.satisfy someone’s desire for something He needed to satisfy his desire for revenge. [ + to infinitive ] She had a burning/strong desire to go back to her home country before she died.express a desire to Several people have expressed a desire to see the report. Synonyms\ninclination (FEELING)\nwillingness\nwish (WANT)\nMore examplesFewer examplesThe team were goaded on by their desire to be first to complete the course.He is genuinely motivated by a desire to help people.She felt an overwhelming desire to tell someone about what had happened.He repressed a sudden desire to cry.His desire for political power apparently knows no bounds.\nSMART Vocabulary: related words and phrases\nFeelings of desire\nappetite\ncaprice\ncarnality\ncarnally\ncompulsion\ndream\nhankering\nhunger\nimpulse\nimpulse buy\nimpulse buying\nimpulsion\nthirst\nurge\nvaulting\nwhim\nwhimsy\nwish\nyearning\nyen\nSee more results »\ndesire noun\n(SEXUAL NEED)\n[ U ] formal the strong feeling that you want to have sex with someone: sexual desireobject of someone’s desire Beatrice was the object of Dante's desire. Synonym\nlust (DESIRE)\nAdd to word list\nAdd to word list\na strong feeling of wanting something, or something you want: [ U ] He claims to have no desire for wealth. [ C ] She expressed a desire to speak with her attorney. [ C ] Teenagers often have a burning desire to look older. [ C ] My desires in life are few.\nto want something strongly: They don’t really seem to desire change."}