{"id":122884,"name":"designer","type":"noun","us_sound":"dɪˈzaɪ.nɚ","us_link":"../audio/d/designer.mp3","uk_sound":"dɪˈzaɪ.nər","uk_link":"../audio/d/ukdescr027.mp3","content":"Add to word list\nAdd to word list\nB1 a person who imagines how something could be made and draws plans for it: a fashion/software/theatrical designer\nMore examplesFewer examplesShe's a highly original young designer.Mary Quant was the first fashion designer to raise hemlines.This designer has recently branched out into children's wear.She set herself up as an interior designer.She was a very imaginative designer.\nSMART Vocabulary: related words and phrases\nFashion\nanti-fashion\nclothes horse\ncollection\ncome\ncouture\ncouturier\ncover girl\nfashionista\nfast fashion\ngeek chic\nhaute couture\nhigh fashion\nlook\nmock croc\nmode\nmodel\nmodelling\nrocker\nsteampunk\nsupermodel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInventing, designing and innovation\nB2 made by a famous or fashionable designer: designer jeans/sunglasses I can't afford designer labels/designer label clothes.\nMore examplesFewer examplesHer favourite designer label is Armani.Trendy trainers and designer labels have become aspirational status symbols, especially among the young.These suits have designer names and a price ticket to match.Among young people, this brand of designer clothing is the ultimate status symbol.I don't possess any designer clothes.\nSMART Vocabulary: related words and phrases\nModern & fashionable\nbe (all) the rage idiom\nbe having a moment idiom\nbe the last word in something idiom\nfunky\nfuturistic\nfuturistically\nget with the programme idiom\ngranola\nshabby chic\nsleekly\nsleekness\nsmartly\nsmartness\nthe avant-garde\nultra-progressive\nultra-slick\nultra-sophisticated\nup to date\nup-to-the-minute idiom\nà la mode\nSee more results »\nAdd to word list\nAdd to word list\na person who imagines how something could be made and draws or creates plans for it: a fashion/graphic designer\nAdd to word list\nAdd to word list\na person who imagines how something could be made, or what it would look like, and makes plans for it: a fashion designer She set herself up as an interior designer. a software/web designer.\nmade by a famous or fashionable designer: designer jeans/sunglasses\nmade to interest or attract people by being new and fashionable: designer coffee\nmade by changing the natural or chemical structure of something: designer drugs/foods"}