{"id":122868,"name":"designate","type":"verb","us_sound":"ˈdez.ɪɡ.neɪt","us_link":"../audio/d/designate.mp3","uk_sound":"ˈdez.ɪɡ.neɪt","uk_link":"../audio/d/ukdescr024.mp3","content":"Add to word list\nAdd to word list\nto choose someone officially to do a particular job: Traditionally, the president designates his or her successor. Thompson has been designated (as/to be) team captain. [ + to infinitive ] She has been designated to organize the meeting.\nto say officially that a place or thing has a particular character or purpose: This area of the park has been specially designated for children. They officially designated the area (as) unsuitable for human habitation.\nSMART Vocabulary: related words and phrases\nApplying for a job\nacqui-hire\nadvertisement\nanoint\nanointed\napplicant\nassign\nelect\nemployable\nemployment\nemployment agency\nequality, diversity and inclusion\nget in\nnomination\nprospect\nreinstatement\nrelocation expenses\nresume\nretain\nrope\ntestimonial\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAssertions & asserting\nused after the title of a particular official job to refer to someone chosen to do that job, but who has not yet started doing it: the Secretary General/Managing Director designate Compare\nelect adjective\nSMART Vocabulary: related words and phrases\nApplying for a job\nacqui-hire\nadvertisement\nanoint\nanointed\napplicant\nassign\nelect\nemployable\nemployment\nemployment agency\nequality, diversity and inclusion\nget in\nnomination\nprospect\nreinstatement\nrelocation expenses\nresume\nretain\nrope\ntestimonial\nSee more results »\nAdd to word list\nAdd to word list\nto choose someone or something for a special job or purpose, or to state that something has a particular character or purpose: The chairman designated his daughter as his successor. North-south streets are designated by numbers. designated adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈdez·ɪɡˌneɪ·t̬ɪd/\na designated waiting area\nAdd to word list\nAdd to word list\nto choose someone officially to do a particular job: Traditionally, the director designates his or her successor.designate sb (as) sth/to be sth Thompson has been designated as new department head. designate sb to do sth She has been designated to organize the meeting.\nto state officially that a place or thing has a particular character or purpose: designate sth for sth This area of the plant has been specially designated for research and development.designate sth (as) sth They officially designated the building as unsuitable for human habitation.\nused after the title of a particular official job to refer to someone who has been chosen to do that job, but who has not yet started doing it: the Managing Director designate Compare\n-elect"}