{"id":122840,"name":"desiccate","type":"verb","us_sound":"ˈdes.ɪ.keɪt","us_link":"../audio/d/cdo0319usdesi0482.mp3","uk_sound":"ˈdes.ɪ.keɪt","uk_link":"../audio/d/cdo0319ukdesi0425.mp3","content":"desiccate verb [T or I]\n(DRY)\nAdd to word list\nAdd to word list\nto remove the moisture from something so it becomes completely dry; to lose all moisture and become completely dry: Intensive farming has desiccated the land. Some plants wither quickly and lose their power of recovery if allowed to desiccate.\nThesaurus: synonyms, antonyms, and examples\nto lose moisture and become drydryIt will take three hours for the paint to dry.dehydrateToo much coffee will dehydrate you.desiccatePlant pests will desiccate in dry air.dry (something) outIf you don't put the cake back in the cake tin, it will dry out.dry upThe lake dried up during the drought.parchThey will turn off the irrigation and parch the crops right before harvest.\nSee more results »\nMore examplesFewer examplesSeeds were then desiccated by means of fast drying.The cultures were allowed to desiccate for 2 weeks.Maintaining low humidity in the refrigerated space tends to desiccate and discolour meat.\nSMART Vocabulary: related words and phrases\nDry weather, arid conditions & dryness\naridity\nbone\nbone dry idiom\ndehydrate\ndesertification\ndried\ndrought\ndry (something) out\ndry something up\ndryness\ndust devil\nfrazzled\nhigh and dry\nhyper-arid\noverdry\nparch\nparched\nsandstorm\nsemi-dry\nsun-baked\nSee more results »\ndesiccate verb [T or I]\n(DAMAGE)\nto become damaged or destroyed by losing an important quality; to damage or destroy something in this way: The global economy is desiccating by the day. He was politically and emotionally desiccated by the scandal.\nMore examplesFewer examplesYou must not desiccate to the point where life itself loses its flavour.The music is desiccated by the refinements of professionalism.The orchestra pit desiccates the sound of the fine musicians who play for the opera.\nSMART Vocabulary: related words and phrases\nDestroying and demolishing\nannihilate\nannihilation\napocalypse\nbash\nbash through (something)\nbe sacrificed on the altar of something idiom\nerosive\nextirpate\nextirpation\nfall in\ngully erosion\nsacking\nsacrifice\nscarred\nself-destruct\nself-devouring\nshred\nsink\ntear\nwipe\nSee more results »"}