{"id":122967,"name":"desktop","type":"noun","us_sound":"ˈdesk.tɑːp","us_link":"../audio/d/desktop.mp3","uk_sound":"ˈdesk.tɒp","uk_link":"../audio/d/ukdesir007.mp3","content":"desktop noun\n(COMPUTING)\nAdd to word list\nAdd to word list\nB2 [ C ] a view on a computer screen that contains icons (= small symbols or pictures) representing files, programs, and other features of the computer: The menu bar with its windows is one of the features of the desktop.\nGrassetto/iStock / Getty Images Plus/GettyImages\nB2 [ C ] (also desktop computer) a type of computer that is able to fit on the top of a desk Compare\nlaptop\nnotebook (COMPUTER)\npalmtop\nPhotographer is my life/Moment/GettyImages\nMore examplesFewer examplesClick the icon on your desktop to open the Cambridge Advanced Learner's Dictionary.Click here to download a screensaver for your desktop.She has a picture of her cat on her desktop.This software allows you to view the latest football scores on your desktop.Right-click anywhere on your desktop to change your screen settings.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nword processing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer hardware\ndesktop noun\n(FURNITURE)\n[ C usually singular ] the top of a desk\nSMART Vocabulary: related words and phrases\nTables & desks\nbedside table\nbench\nbenchtop\nbooth\nbreakfast bar\nbureau\ncard table\ndrafting table\ndressing table\ndrop-leaf table\nhigh table\nleaf\nrolltop desk\nstanding desk\ntabletop\nthe dinner table\ntrestle\ntrestle table\nworktop\nwriting desk\nSee more results »\nable to fit on the top of a desk: a desktop device/printer/system\nrelating to a view on a computer screen that contains icons (= small symbols or pictures) representing files, programs, and other features of the computer: desktop icons desktop wallpaper\nMore examplesFewer examplesI'm looking for a desktop machine for use at home. The desktop computer application aims to seamlessly integrate e-mail, instant messaging, videoconferencing, traditional phone service, and Internet-based calling.I finally wised up and created a desktop shortcut to System Properties. A new desktop search feature lets you locate information on your hard drive as easily as Google lets you find it on the web.\nSMART Vocabulary: related words and phrases\nComputer hardware\n3-D printer\nassociative memory\nblackberry\nbrick\nbubblejet\nconsole\ndata projector\nelectronic organizer\nflat screen\nhard drive\nmainframe\nmicrochip\nmicroprocessor\nnumber pad\noptical character reader\noptical reader\noptically\npalmtop\npatch\nplug and play\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer concepts\ndesktop adjective [not gradable]\n(FOR USE IN ONE PLACE)\nAdd to word list\nAdd to word list\ndesigned to be used on or at a desk, and not carried around: a desktop computer\ndesktop noun [C]\n(WORK AREA)\nthe screen area of a personal computer when no programs are being used, or the top of a desk: A shortcut to the program will be created on your desktop.\nAdd to word list\nAdd to word list\nthe top of a desk: My desktop is too cluttered for me to be able to work efficiently.\nIT a view on a computer screen which contains icons (= small symbols or pictures) that represent files, programs, and other features of the computer: The menu bar is one of the standard features of the desktop.\n→\ndesktop computer\ndesktop adjective [ before noun ]\na desktop device/printer/system a desktop PC"}