{"id":123107,"name":"desperate","type":"adjective","us_sound":"ˈdes.pɚ.ət","us_link":"../audio/d/desperate.mp3","uk_sound":"ˈdes.pər.ət","uk_link":"../audio/d/ukdesir021.mp3","content":"desperate adjective\n(SERIOUS)\nAdd to word list\nAdd to word list\nC2 very serious or bad: desperate povertydesperate shortage The refugees are living in camps, where there's a desperate shortage of food/supplies.desperate situation The situation is desperate - we have no food, very little water and no medical supplies.\nvery great or extreme: The earthquake survivors are in desperate need of help. He has a desperate desire to succeed.informal I'm in a desperate hurry.\nMore examplesFewer examplesI felt I couldn't cope with the situation and was in desperate need of some reassurance.They spun us a story about being in desperate need of money.Her desperate request for help was met with a rebuff.They spun us a story about being in desperate need of money.This is a desperate situation which requires a truly radical solution.\nSMART Vocabulary: related words and phrases\nSerious and severe\nacutely\nacuteness\ncatastrophic\ncatastrophically\nchronic\ncritically\ndire\nfatal\ngrave\ngrievously\nheaviness\nhyperacute\nnon-fatal\nnon-serious\nseriously\nswingeing\nterminal\nterminally\ntoughness\nutmost\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: very & extreme\ndesperate adjective\n(WANTING)\nB2 [ usually after verb ] needing or wanting something very much: desperate for They are desperate for help.UK humorous I'm desperate for a drink! [ + to infinitive ] UK humorous He was desperate to tell someone his good news.\nMore examplesFewer examplesThe fashion industry is always desperate to innovate.He seems to have a desperate need to be loved by everyone.As he left the theatre, the singer was set upon by fans desperate for autographs.I was desperate to find a way out of teaching so when this job came along I snatched at it.It was a bit insensitive of Fiona to go on so much about fat people when she knows Mandy is desperate to lose weight.\nSMART Vocabulary: related words and phrases\nWanting things\nache for something\nacquisitive\nambitious\nambitiously\nangle for something\nexpense\nfancy\nhave your eye on something idiom\nhunger\nhunger after/for something\nhungrily\nimpulse\npine\nseeker\nset your heart on something/doing something idiom\nset your sights on something idiom\nshook\nshopping list\nsight\nsomeone's heart's desire idiom\nSee more results »\ndesperate adjective\n(RISKY)\nB2 feeling that you have no hope and are ready to do anything to change the bad situation you are in: desperate attempt/effort The doctors made one last desperate attempt/effort to save the boy's life.desperate measures Desperate measures are needed to deal with the growing drug problem.desperate plea They made a desperate plea for help.\nwilling to be violent, and therefore dangerous: This man is desperate and should not be approached since he may have a gun.\nMore examplesFewer examplesIt was a desperate attempt to salvage the situation.The government took desperate measures to keep the economy running.I'm not so desperate as to agree to that.Security forces fired tear gas and rubber bullets in a desperate attempt to maintain control.Villagers used sandbags in a desperate attempt to save their homes from the flood water.\nSMART Vocabulary: related words and phrases\nDangers and threats\nbalefully\nbaneful\nbanefully\nblack spot\nhang\nhang over something\nhazard\nhazardous\nhazardously\nnon-lethal\non/under pain of death idiom\nor else idiom\nparlous\nparlously\nsomeone's bark is worse than his/her bite idiom\nthreatening\nthreateningly\ntombstoning\ntreacherously\ntriple threat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nViolent or aggressive\ndesperate adjective\n(RISKY)\nAdd to word list\nAdd to word list\nshowing a willingness to take any risk in order to change a bad or dangerous situation: The ads are a desperate attempt to win last-minute votes.\nA desperate person is willing to take any measures and may be dangerous: desperate criminals\ndesperate adjective\n(SERIOUS)\nvery serious or dangerous: There’s a desperate shortage of medical supplies in the area. The earthquake survivors are in desperate need of help.\ndesperate adjective\n(IN NEED)\nhaving a very great need: She was desperate for news of her family. I’m desperate for some coffee."}