{"id":123075,"name":"despair","type":"noun","us_sound":"dɪˈsper","us_link":"../audio/d/despair.mp3","uk_sound":"dɪˈspeər","uk_link":"../audio/d/ukdesir013.mp3","content":"Add to word list\nAdd to word list\nB2 the feeling that there is no hope and that you can do nothing to improve a difficult or worrying situation: mood/sense of despair Hope began to fade, leaving a mood/sense of despair. They're in (the depths of) despair over/about the money they've lost.to someone’s despair To her teacher's despair, Nicole never does the work that she's told to do.drive someone to despair Their fourth year without rain drove many farmers to despair. be the despair of someone mainly UK\nto cause someone such difficulties that they do not know how to deal with you: He's the despair of his parents because he shows no interest in getting a job.\nSee more\nMore examplesFewer examplesA feeling of despair descended on us as we realized that we were completely lost.He was plunged into despair when his wife left him.In despair, the theatre director searched everywhere for a new lead actor.Over a bottle of wine, we shared our despair over the state of our marriages.He sank into deep despair when he lost his job.\nSMART Vocabulary: related words and phrases\nSadness and regret\naw\nbe/weigh on your conscience idiom\nbitter\nblack dog\nbreastbeating\ncry\nfeel bad idiom\ngloominess\nglumness\ngroan\nguilt\nguilt complex\nmelancholia\nprick someone's conscience idiom\nregretful\nregretfully\nremorse\nremorseful\nrepentant\nwretchedness\nSee more results »\nto feel despair about something or someone: Don't despair! We'll find a way out!despair at/over I despair at/over the policies of this government.despair of They began to despair of ever being rescued.\nSMART Vocabulary: related words and phrases\nNot hopeful\nbe in a funk idiom\nbe on a hiding to nothing idiom\nbleakly\nbleakness\ndispiritedness\ndispiritingly\ndoomed\ndoomster\ndowncast\ndownhearted\ngloom\nhope\nhopeless\nhopelessly\nhopelessness\nlose heart idiom\nprophet of doom idiom\nsomeone can't win idiom\nundone\nwhat are you going to do? idiom\nSee more results »\nRelated words\ndespairing\ndespairingly\nAdd to word list\nAdd to word list\na feeling of being without hope or of not being able to improve a situation: A few sad moments doesn’t imply feelings of despair. She flung up her arms in despair and wailed.\nto lose hope or be without hope: Don’t despair – things will improve. He began to despair of ever finding a job."}