{"id":123229,"name":"destination","type":"noun","us_sound":"ˌdes.təˈneɪ.ʃən","us_link":"../audio/d/destination.mp3","uk_sound":"ˌdes.tɪˈneɪ.ʃən","uk_link":"../audio/d/ukdespo014.mp3","content":"Add to word list\nAdd to word list\nB1 the place where someone is going or where something is being sent or taken: arrive at your destination We arrived at our destination tired and hungry.reach its destination His letter never reached its destination.holiday destination UK The Caribbean is a popular holiday destination.\nMore examplesFewer examplesThe gunman then took a hostage and demanded a plane and safe passage to an unspecified destination.It's the good weather that makes Spain such a popular tourist destination.What guided your choice of destination or was it arbitrary?California, along with Florida and Hawaii, is among the most popular US tourist destinations.Enter the competition and you could win a pair of return tickets to one of more than 30 European destinations.\nSMART Vocabulary: related words and phrases\nArrivals and departures\nadmittance\nadvent\napproach\narr.\narrival\nbourne\ncheck\nconnection\ndeparture\ndescent\nentry\neta\ngain admittance\ngoing\ninflux\ninvasion\nmisconnect\nmisconnection\noff\noutflow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTravelling\nworth making a special journey for: a destination restaurant a destination wedding\nSMART Vocabulary: related words and phrases\nExtremely good\nadmirable\namazing\namazingly\nask for someone\naward-winning\nfirst-rate\nfive-star\ngold-plated\ngourmet\ngreatness\nhave no parallel phrase\npar excellence\nsensational\nshining\nsock\nsplendid\nsplendidly\nstellar\nsuperiority\nwonderfully\nSee more results »\nAdd to word list\nAdd to word list\nthe place where someone is going or where something is being sent or taken: The Virgin Islands are a popular tourist destination.\nAdd to word list\nAdd to word list\nthe place where someone is going or where something is being sent or taken: The shipment should arrive at its destination in three days. We had to change planes twice before reaching our final destination. a holiday destination"}