{"id":123485,"name":"deterrent","type":"noun","us_sound":"dɪˈter.ənt","us_link":"../audio/d/eus71251.mp3","uk_sound":"dɪˈter.ənt","uk_link":"../audio/d/ukdetai022.mp3","content":"Add to word list\nAdd to word list\nC2 something that deters people from doing something: nuclear deterrent There has been a public call to rid the country of its nuclear deterrent (= nuclear weapon system).act/serve as a deterrent to Tougher prison sentences may act/serve as a deterrent to other would-be offenders. Synonym\ncheck\nMore examplesFewer examplesSome people say that capital punishment acts as a deterrent.Drink-driving is one case where severe punishment seems to work as a deterrent.I should think the smell of her breath must act as a deterrent to any man.They executed him, as a deterrent to any other young soldiers thinking of trying to desert from the army.As a deterrent, they have imposed a heavy fine for late payment.\nSMART Vocabulary: related words and phrases\nPreventing and impeding\nanti-jamming\navoid\navoidable\navoidably\nbar\nbottleneck\nderail\nfireproof\nhead off\nhinder\nhogtie\nhold back\nhold/keep someone/something at bay idiom\nprevent\npreventable\npreventative\nprevention\nprevention is better than cure idiom\nscuttle\nsmother\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDiscouraging and putting off\nmaking someone less likely to do something by making it difficult for them to do it or by making them realize that it will have bad results: a deterrent effect\nMore examplesFewer examplesThere have been many examples of long deterrent sentences which have undoubtedly acted as a warning to others. The considerable deterrent value of weapons monitoring went unacknowledged. This $134-million fine should send a strong deterrent message to those who participate in or knowingly aid these activities.The division has served as the main deterrent force in the Pacific region.Lawrence police say their tougher enforcement is deterrent.\nSMART Vocabulary: related words and phrases\nDiscouraging and putting off\naversive\ndaunt\ndaunting\ndauntingly\ndeadening\ndiscourage\ndiscouragement\ndiscouraging\ndiscouragingly\ndisempower\ndishearteningly\ndisincentive\nemasculate\nemasculation\npour/throw cold water on something idiom\nput a spoke in someone's wheel idiom\nspoke\ntake the wind out of someone's sails idiom\nthrow\nthrow cold water on something idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnhelpful and Uncooperative"}