{"id":123473,"name":"determining","type":"verb","us_sound":"dɪˈtɝː.mɪn","us_link":"../audio/d/determine.mp3","uk_sound":"dɪˈtɜː.mɪn","uk_link":"../audio/d/ukdetai017.mp3","content":"Add to word list\nAdd to word list\npresent participle of\ndetermine\ndetermine verb\n(DECIDE)\nC1 [ T often passive ] to control or influence something directly, or to decide what will happen: The number of staff we can take on will be determined by how much money we're allowed to spend. Your health is determined in part by what you eat. Eye colour is genetically determined. [ + question word ] formal Officials will determine whether or not the game will be played. People should be allowed to determine their own future.\n[ T ] formal to make a strong decision: [ + that ] She determined that one day she would be an actor. [ + to infinitive ] On leaving jail, Joe determined to reform.\nMore examplesFewer examplesGenes determine how we develop from the moment the sperm fuses with the egg.The economy is regarded as the decisive/key factor which will determine the outcome of the general election.The success of the event will be determined by the vagaries of the weather.People want to determine their own destinies.The amount of money the bank is willing to lend is determined by the value of the property.\nSMART Vocabulary: related words and phrases\nDecisions and deciding\nascription\nbe make or break for someone/something idiom\nbe on the horns of a dilemma idiom\nchoose\nclinch\nconclusion\nfix\nget it together idiom\nget something into your head idiom\nhammer something out\nhave a, some, etc. say in something idiom\nif/when it comes to the crunch idiom\njudge\nresolution\nsleep\ntake the plunge idiom\ntightrope\ntilt\ntilt the balance/scales idiom\ntop-down\nSee more results »\ndetermine verb\n(DISCOVER)\nC1 [ T ] formal to discover the facts or truth about something: The police never actually determined the cause of death. [ + question word ] It is the responsibility of the court to determine whether these men are innocent. [ + that ] The jury determined that the men were guilty.\nSMART Vocabulary: related words and phrases\nFinding and discovering\nascertain\nbreak (fresh/new) ground idiom\nbreakthrough\nbring something to light idiom\ncatch someone red-handed idiom\nflush someone/something out\nfossick\nfound\ngeocache\ngeocaching\npinpoint\nrake\nred-handed\nrediscover\nrediscovery\nrefind\nrefound\nsniff\nsuss\nuncover\nSee more results »"}