{"id":123470,"name":"determiner","type":"noun","us_sound":"dɪˈtɝː.mə.nɚ","us_link":"../audio/d/determiner.mp3","uk_sound":"dɪˈtɜː.mɪ.nər","uk_link":"../audio/d/ukdetai020.mp3","content":"Add to word list\nAdd to word list\nB2 in grammar, a word that is used before a noun to show which particular example of the noun you are referring to: In the phrases \"my first boyfriend\" and \"that strange woman\", the words \"my\" and \"that\" are determiners.\nMore examplesFewer examplesOur English teacher taught us about determiners, which identify which particular noun you're talking about.When I say 'your diary' or 'this example', the determiners before each noun show which one I mean in particular.\nSMART Vocabulary: related words and phrases\nLinguistics: parts of speech\nabstract noun\nadj\nadjectival\nadjectivally\nadjunct\nadv\nadverb\nadverbial\narticle\ncommon noun\nconcrete noun\nconj\nconjunction\nconnective\ncount noun\ncountable noun\ndefinite article\npart of speech\nprep\nrelative pronoun\nSee more results »\nGrammar\nDeterminers and types of nounWe cannot use all the determiners with all types of noun. We can use some determiners with any type of noun, but others must be followed by certain types of noun. …\nDeterminers and singular countable nounsSome determiners can only be used with a singular countable noun. These are: …\nDeterminers and singular uncountable nounsMuch, (a) little, less and least can only be used with a singular uncountable noun: …\nDeterminers and singular countable or uncountable nounsWe use this and that with singular countable or uncountable nouns, but not with plural nouns. This refers to something near the speaker; that refers to something further away: …\nDeterminers and plural countable nounsBoth, many, (a) few, the numbers two, three, four, etc., several, these and those are only used with plural nouns: …\nDeterminers and uncountable nouns or plural countable nounsSome determiners can only be used with an uncountable noun or with a plural noun: …\nDeterminers and any type of nounSome determiners can be used with any type of noun, singular or plural, countable or uncountable. …\nDeterminers followed by pronounsWe can use these determiners + of before pronouns: …\nDeterminers: position and orderDeterminers come first in noun phrases, before adjectives and noun modifiers. …\nWhere do determiners go?Determiners come first in noun phrases, before adjectives and noun modifiers. …\nMore than one determinerWe can use more than one determiner in a noun phrase: …\nDeterminers and modifiersDeterminers which show quantity (underlined) may occasionally have words before them (modifiers, in bold) which make them more specific or stronger: …\nDeterminers used as pronounsDeterminers are words such as the, my, this, some, twenty, each, any, which are used before nouns. We can also use some determiners as pronouns (i.e. without a noun following and when the meaning is clear without including the noun). …\nDeterminers: typical errorsSome determiners are restricted to certain types of noun: …\nDeterminers (the, my, some, this)Determiners are words such as the, my, this, some, twenty, each, any, which are used before nouns: …\nWhat do determiners do?Determiners have two main functions: referring and quantifying. …\nAdd to word list\nAdd to word list\ngrammar a word that is used before a noun to show which particular example of the noun you are referring to: In the phrase “my history book” the word “my” is a determiner."}