{"id":123460,"name":"determination","type":"noun","us_sound":"dɪˌtɝː.mɪˈneɪ.ʃən","us_link":"../audio/d/determination.mp3","uk_sound":"dɪˌtɜː.mɪˈneɪ.ʃən","uk_link":"../audio/d/ukdetai016.mp3","content":"determination noun\n(TRYING HARD)\nAdd to word list\nAdd to word list\nB2 [ U ] the ability to continue trying to do something, although it is very difficult: a man of fierce/ruthless determination [ + to infinitive ] You can't help but admire her determination to succeed. See also\nself-determination\nThesaurus: synonyms, antonyms, and examples\nthe ability to keep doing something difficultperseveranceA years-long political scandal broke last week thanks to the dogged perseverance of local reporters.determinationAfter years of hard work and determination, she was finally promoted to CEO.persistenceHe was known for his persistence in the pursuit of justice.stick-to-it-ivenessUS This type of work requires a long-term commitment and a lot of stick-to-it-iveness.single-mindednessHer single-mindedness helped her win six US Open singles titles. doggednessTheir sheer doggedness and ambition helped them ignore criticism and carry on.\nSee more results »\nMore examplesFewer examplesHer ambition and dogged determination ensured that she rose to the top of her profession.Stoically, and with great determination, the people set about rebuilding the village.Her determination, teamwork skills and leadership capabilities convinced us that she was perfect for the job.\"The team has great determination to win, \" declared the coach. \"I've no doubts on that score.\"The expression on his face was one of grim determination.\nSMART Vocabulary: related words and phrases\nStrength of will and determination\naggressiveness\nbitter\nbloody-mindedness\ncharacter\ncharacter-building\ndoggedness\nfibre\ninsusceptible\nintransigence\ninveteracy\nmettle\nmilitancy\nrecalcitrance\nresiliently\nresolution\nresolve\nsingle-mindedness\nstamina\nunsusceptible\nwilfulness\nSee more results »\ndetermination noun\n(DECISION)\n[ U ] formal the process of controlling, influencing, or deciding something: The determination of policy is not your business - your job is to implement it.\nSMART Vocabulary: related words and phrases\nPower to control\nahold\nall-powerful\nascendancy\nauthoritarianism\nbe above someone's pay grade idiom\nbig beast\ncradle\ndiscretionary\nhe who pays the piper calls the tune. idiom\nhegemonic\nhegemonism\nhegemony\nimplant\npower structure\npower struggle\npower vacuum\npredominance\npuissance\nsway\nthe hand that rocks the cradle rules the world idiom\nSee more results »\ndetermination noun\n(DISCOVERING)\n[ C or U ] formal the process of finding something out: the determination of his whereabouts\nSMART Vocabulary: related words and phrases\nFinding and discovering\nascertain\nbreak (fresh/new) ground idiom\nbreakthrough\nbring something to light idiom\ncatch someone red-handed idiom\nfossick\nfound\ngeocache\ngeocaching\nget hold of idiom\npinpoint\nrake\nrediscover\nrediscovery\nrefind\nrefound\nretrievable\nrumble\nsniff\nuncover\nSee more results »\nAdd to word list\nAdd to word list\nthe ability to continue trying to do something, even if it is difficult: [ + to infinitive ] She has a lot of determination to succeed.\nAdd to word list\nAdd to word list\n[ U ] the ability to continue trying to do something, although it is very difficult: I admired his drive and determination - he never gave up.determination to do sth She had great determination to succeed.\n[ U ] the process of controlling, influencing, or deciding something: The determination of policy is not your business - your job is to implement it.\n[ U ] the process of finding something out: the determination of his whereabouts\n[ C ] an official judgement or decision: The court is required to issue a final determination on those issues by the end of the year."}