{"id":123389,"name":"detect","type":"verb","us_sound":"dɪˈtekt","us_link":"../audio/d/detect.mp3","uk_sound":"dɪˈtekt","uk_link":"../audio/d/ukdetai005.mp3","content":"Add to word list\nAdd to word list\nC1 to notice something that is partly hidden or not clear, or to discover something, especially using a special method: Some sounds cannot be detected by the human ear. Financial experts have detected signs that the economy is beginning to improve.\nC1 to discover something, usually using special equipment: High levels of lead were detected in the atmosphere. Radar equipment is used to detect (= find the position of) enemy aircraft.\nMore examplesFewer examplesThe alarm should go off automatically as soon as smoke is detected.Many serious illnesses can be nipped in the bud if they are detected early enough.I thought I could detect a slight West Country accent.In the future, cars equipped with on-board computers will be able to detect and avoid traffic jams automatically.I could detect subtle variances in fragrance as we strolled through the garden.\nSMART Vocabulary: related words and phrases\nFinding and discovering\nascertain\nbreak (fresh/new) ground idiom\nbreakthrough\nbring something to light idiom\ncatch someone red-handed idiom\nfossick\nfound\ngeocache\ngeocaching\nget hold of idiom\npinpoint\nrake\nrediscover\nrediscovery\nrefind\nrefound\nretrievable\nrumble\nsniff\nuncover\nSee more results »\nRelated word\ndetectable\nAdd to word list\nAdd to word list\nto notice something that is partly hidden or not clear or to discover something, esp. using a special method: Some sounds cannot be detected by the human ear. X-ray procedures can detect a tumor when it is still small. detectable adjective us\nYour browser doesn't support HTML5 audio\n/dɪˈtek·tə·bəl/\nThere has been no detectable change in the patient’s condition. detection noun [ U ] us\nYour browser doesn't support HTML5 audio\n/dɪˈtek·ʃən/\nThese tests can result in the early detection of disease. detector noun [ C ] us\nYour browser doesn't support HTML5 audio\n/dɪˈtek·tər/\nMotion detectors help monitor elderly residents who live alone."}