{"id":123547,"name":"detour","type":"noun","us_sound":"ˈdiː.tʊr","us_link":"../audio/d/detour.mp3","uk_sound":"ˈdiː.tɔːr","uk_link":"../audio/d/ukdetou001.mp3","content":"Add to word list\nAdd to word list\na different or less direct route to a place that is used to avoid a problem or to visit somewhere or do something on the way: make a detour You'd be wise to make a detour to avoid the roadworks.\nUS (UK diversion) a different route that is used because a road is closed: Traffic detours will be kept to a minimum throughout the festival.\nan occasion when someone does something that is different from what is usual or expected, or says something that is not part of the main subject that is being talked or written about: detour into His anti-alcohol campaign was a rare detour into the field of public health. Barring any surprise detours, the governor is expected to sign both proposals. While discussing education, she took a sharp detour into trade policy.\nSMART Vocabulary: related words and phrases\nRoads & routes in general\nadopt\nadopted\napproach\nascent\nbicycle lane/path\nbike lane\ncommunication\ndead end\nexit\nimpassable\nlane\nmilk round\nmulti-lane\none-way\nroadworks\nroute\nRR\nskid marks\ntoll road\ntollway\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChanging direction\nDigressing and being indirect or evasive\n[ I or T ] to go or make someone go a different or less direct route to a place, in order to avoid a problem or to visit somewhere or do something on the way: We had to detour around downtown, so it took us longer than usual.\n[ T ] to prevent someone from doing something or making progress for a period of time: Detoured by family and children, she didn't focus on performing until the early 1990s.\n[ I ] to do something that is different from what is usual or expected, or to say something that is not part of the main subject that is being talked or written about: detour into He came to the area to be a country doctor and detoured into state politics. The book tries to speak to the layman but often detours into territory most interesting to medical technologists and statisticians.\nMore examplesFewer examples If just a tiny fraction of the outlet shoppers detoured downtown to visit the museum and do a little more shopping, it would be a big boost for the area.Traffic was being detoured around potential hotspots in Manila. Leaving the bedroom, he detoured into the kitchen to rinse out the mug and then wearily climbed back up the stairs to bed.Conversation quickly detoured after Burch told his class The New York Times was interested in the story.This country's sports fans have embraced a host of athletes whose careers appeared to be derailed or at least detoured by scandal.Several factors could detour the agency's attempt at closure. Your day might be detoured by a chance encounter with a friend. Theroux was not happy to be reminded of this, and detoured into a long disquisition on literary sibling rivalry.\nSMART Vocabulary: related words and phrases\nChanging direction\nabout-face\nabout-turn\nbear\nbranch\nbranch off\nbreak\ndecoy\ndo an about-turn\nexcursive\nexcursively\nflippy\nglance off (something)\nregear\nreverse\nslew\nsomeone's back is turned idiom\nswerve\nturn around\nturn off (something)\nwheel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCancelling and interrupting\nDigressing and being indirect or evasive\nAdd to word list\nAdd to word list\na way of getting to a place that is indirect and longer than the usual way, and which is taken in order to avoid a particular problem or to do something special: You’re advised to take a detour to avoid the road construction. We made a little detour to drop Sarah off on the way home. detour verb [ I ] us\nYour browser doesn't support HTML5 audio\n/ˈdi·tʊər/\nWe had to detour around the flooded road."}