{"id":123560,"name":"detoxified","type":"verb","us_sound":"diːˈtɑːk.sə.faɪ","us_link":"../audio/d/usb00428.mp3","uk_sound":"diːˈtɒk.sɪ.faɪ","uk_link":"../audio/d/ukb00428.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\ndetoxify\ndetoxify verb\n(REMOVE POISONS)\n[ T ] to remove harmful chemicals from the body or from something: The chamber is used to detoxify patients with acute carbon-monoxide poisoning. Caterpillars eat cherry leaves containing cyanide, but they rapidly detoxify them.\n[ I or T ] to stop using drugs or alcohol or eating certain foods for a period of time in order to get rid of harmful substances from your body: The idea of the diet was to detoxify the body. Believing that a person can rid themselves of poisons through detoxifying, he says, is magical thinking.\nMore examplesFewer examplesAn enlarged liver loses its ability to detoxify the body's waste products.Conscientious mothers regularly detoxify kitchen surfaces in order to cut down risk of infection.They promote detoxifying products like seaweed wraps and sea-salt baths.She and her husband decided to detoxify as a pathway to healthier eating.\nSMART Vocabulary: related words and phrases\nPoisoning and allergy\nallergen\nallergenic\nallergic\nanaphylactic\nanaphylactic shock\nanaphylaxis\nanimatedly\nhypersensitivity\nhypoallergenic\nintolerance\nintolerant\njimson weed\nlactose intolerance\nlisteriosis\npoisoner\npoisoning\ntoxicology\nvenom\nvenomous\nWarfarin\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical treatment: general words\nBeauty treatments\ndetoxify verb\n(IMPROVE REPUTATION)\n[ T ] to change or get rid of negative or damaging ideas that people connect with a company, product, political party, etc.: He embarked on a systematic campaign to detoxify the party brand.\nMore examplesFewer examplesHis literary bestseller \"The Name Of The Rose\" detoxified the medieval mystery genre.\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ncustomer relationship management\ndetoxify\ndifferentiator\ndogfooding\nflyer\no.n.o.\noff-brand\non-brand\noverexpose\noverexposure\ntie (something) in\ntout\nunadvertised\nunbilled\nunbranded\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReputation"}