{"id":123786,"name":"development","type":"noun","us_sound":"dɪˈvel.əp.mənt","us_link":"../audio/d/development.mp3","uk_sound":"dɪˈvel.əp.mənt","uk_link":"../audio/d/ukdetou024.mp3","content":"development noun\n(GROWTH)\nAdd to word list\nAdd to word list\nB1 [ U ] the process in which someone or something grows or changes and becomes more advanced: healthy growth and developmentdevelopment of The documentary traced the development of popular music through the ages. The region suffers from under-/over-development (= having too little/much industry). a development project (= one to help improve industry) in Pakistan\nMore examplesFewer examplesEver since was formed in 1968, the company has been at the forefront of computer development.All our profits are re-invested in research and development.The protests were part of their campaign against the proposed building development in the area.Opponents of the new shopping development are trying to rally local people against it.To stay competitive, they'll have to increase product development as well as cutting prices.\nSMART Vocabulary: related words and phrases\nMaking progress and advancing\nadvance the cause\nadvancement\nage\nahead\nahead of\nboom\nevolve\nevolved\nflourish\nflower\nformatively\nfrom A to B idiom\njourney\nmature\nprogressively\npunctuated equilibrium\nrebuild\nregenerate\nripen\nspread\nSee more results »\ndevelopment noun\n(THING THAT HAPPENS)\nB2 [ C ] a recent event that is the latest in a series of related events: an important development in the fuel crisis Call me if there are any new developments.\nSMART Vocabulary: related words and phrases\nEvents and occurrences\n-athon\nback story\nbe (all) part of life's rich tapestry/pageant idiom\nbenefit\nbinge\ncar wash\ndate night\nedition\nepiphenomenon\nepisode\nevent\ngoings-on\noccurrence\npast\nproceedings\nreoccurrence\nsaga\nspree\nsynchronicity\nthing\nSee more results »\ndevelopment noun\n(START)\nB1 [ U ] the process of developing something new: product development Mr Berkowitz is in charge of product development.\nSMART Vocabulary: related words and phrases\nInventing, designing and innovation\nabsorptive capacity\narchitect\nartificer\nbionics\nblueprint\ndesign\ndesigner\ndevise\ndream something up\nergonomic\nlead time\nmodularization\nnanotechnology\nnon-imitative\noperational research\nthemed\nthink outside the box idiom\nthink something up\ntrailblaze\nwhole cloth\nSee more results »\ndevelopment noun\n(BUILDINGS)\n[ C ] an area on which new buildings are built in order to make a profit: housing development They moved into a new housing development on the edge of town.\nSMART Vocabulary: related words and phrases\nTowns & regions: areas in towns & cities\nanti-development\narrondissement\nbackstreet\nbackstreets\nborough\nbotanic garden\nbusiness park\nChinatown\nindustrial estate\nmarketplace\nold town\non skid row idiom\nouter ring\nplaza\nresidential\nshantytown\nskid\nslummy\nsubdivision\nWimbledon\nSee more results »\nRelated word\ndevelopmental\ndevelopment noun [C/U]\n(GROWTH)\nAdd to word list\nAdd to word list\nthe process of growing or changing and becoming more advanced: [ U ] A good diet and lots of exercise are essential for a child’s healthy growth and development. [ U ] I took a history course that dealt with the development of popular culture.\nliterature In a literary work, development is the movement from one event to another or the changes in the characters’ understanding.\nA development is a recent important event that is the latest in a series of related events: [ C ] There is a new development in the plans to reorganize the fire department.\nDevelopment is also the organized increase of a country’s industry and wealth.\ndevelopment noun [C/U]\n(CREATION)\nthe process of coming into existence or of creating something new or more advanced: [ U ] We were waiting for the development of new plans for the city’s convention center. [ U ] I’m in charge of product development (= the creation and design of new products) for the company. [ C ] Cotton fields were replaced by housing developments (= groups of similar houses built at the same time) as the city experienced rapid growth.\nDevelopment is also the building of houses, stores, or offices, esp. by a company to make a profit, on an area of land where there were none before.\nAdd to word list\nAdd to word list\n[ U ] growth or changes that make something become more advanced: The first year of the plan is primarily focused on organizational development. He was recruited to oversee international business development.\n[ U ] the process of creating something such as a new product or service: software development The next stage in the development of this product line is a retail version.\n[ U ] the process of producing a plan, idea, etc.: Motorola said it did not expect its policy, which has been in development since June, to affect its bottom line.\n[ C ] a recent event which is the latest in a series of related events: Keeping up with new developments on the web is not easy. These beneficial economic developments have followed trade and investment liberalization.\n[ U ]\n&#160; ECONOMICS the planned increase of a country’s industry and wealth: The EU has exercised leadership and argued for policies that support the expansion of trade, growth, and development. development projects\n[ U ]\n&#160; HR improvement of a skill, ability, quality, etc.: An industry convention is a terrific venue for business skills training and professional development. They invested resources into employee training and development. individual/career/staff development\n[ C ]\n&#160; PROPERTY\n&#160; (also UK housing development); (also US real estate development) a group of similar buildings built in an area by a particular developer: They recently bought a house in one of the town's new developments.\n[ U ]\n&#160; PROPERTY the building of houses, stores, offices, etc. usually by a company to make a profit, usually on an area of land where there were none before: The land will be used for private development. He began his career at Goldman Sachs and moved on to real-estate development in the New York City area. commercial/industrial development\n[ C or U ]\n&#160; NATURAL RESOURCES an area of land that is used for its natural resources, or the use of an area of land for its natural resources: Oil producers have focused their efforts on optimizing production from existing fields and investing more aggressively in new developments.\nSee also\nbrand development\nchannel development\neconomic development\nhuman resource development\nmanagement development\nmarket development\nnew-product development\npersonal development\nproduct development\nproperty development\nView all\nredevelopment\nresearch and development\nself-development\nweb development"}