{"id":123890,"name":"devise","type":"verb","us_sound":"dɪˈvaɪz","us_link":"../audio/d/eus71258.mp3","uk_sound":"dɪˈvaɪz","uk_link":"../audio/d/ukdevil009.mp3","content":"Add to word list\nAdd to word list\nC2 to invent a plan, system, object, etc., usually using your intelligence or imagination: He's good at devising language games that you can play with students in class. The cartoon characters Snoopy and Charlie Brown were devised by Charles M. Schultz.\nMore examplesFewer examplesClinton and Zedillo ordered their respective Cabinets to devise a common counter-drug strategy.We need to devise some sort of system whereby people can liaise with each other.The umbrella was ingeniously devised to fold up into your pocket.The scheme is devised for young people in the 15 - 20 age band.The company has also devised a computer program that enables people to design their own homes.\nSMART Vocabulary: related words and phrases\nInventing, designing and innovation\nabsorptive capacity\narchitect\nartificer\nbionics\nblueprint\ndesign\ndesigner\ndream something up\nergonomic\nergonomically\nmodularization\nnanotechnology\nnon-imitative\noperational research\noriginator\nthink outside the box idiom\nthink something up\ntrailblaze\nwhole cloth\nwind tunnel\nSee more results »\nAdd to word list\nAdd to word list\nto invent something, esp. with intelligence or imagination: He devised a new way to treat mental depression. The committee is devising an agenda for the upcoming political convention.\nAdd to word list\nAdd to word list\nto use knowledge and imagination to think of or plan something: He set about devising a plan to revive the automaker and improve its profitability. She led a small team that worked for years to devise a way to create a silicon power amp for an earlier generation of cell phones.\nLAW to leave someone money or property in a will (= document stating what will happen to someone's property after their death): devise sth to sb I hereby give, devise, and bequeath to my daughter Eva $10,000.\nproperty given to someone in a will (= document stating what will happen to someone's property after their death), or the part of a will that gives property to someone: He made specific devises of various items of furniture."}