{"id":123838,"name":"devil","type":"noun","us_sound":"ˈdev.əl","us_link":"../audio/d/devil.mp3","uk_sound":"ˈdev.əl","uk_link":"../audio/d/ukdevil001.mp3","content":"devil noun\n(EVIL BEING)\nAdd to word list\nAdd to word list\nB2 [ C ] an evil being, often represented in human form but with a tail and horns the devil [ S ] (often the Devil)\na powerful evil force and the enemy of God in Christianity and Judaism\nExamples\nGothic churches are full of devils and grotesque figures.One survivor described his torturers as devils incarnate.The devil was painted with horns and cloven hoofs.\nSMART Vocabulary: related words and phrases\nReligious concepts: devils\nantichrist\ndemon\ndemoniacally\ndemonically\ndevildom\ndevilry\nLucifer\nMephistopheles\nOld Nick\nSatan\nsatanic\nsatanically\ndevil noun\n(PERSON)\nC2 [ C ] informal someone, especially a child, who behaves badly: little/young devil Those little/young devils broke my window.\n[ C ] informal humorous a person who enjoys doing things people might disapprove of: \"I'm going to wear a short black skirt and thigh-length boots.\" \"Ooh, you devil!\"be a devil Have another slice of cake - go on, be a devil!\n[ C ] informal used with an adjective to describe someone and express your opinion about something that has happened to them: lucky devil I hear you've got a new car, you lucky devil!poor devil He's been ill for weeks, poor devil.\nMore examplesFewer examplesHe's a sly old devil - I wouldn't trust him with my money.André's got a new job, the lucky devil.\nSMART Vocabulary: related words and phrases\nChildren & babies\nankle-biter\narrival\nbabe\nbabe in arms\nbaby\ncomfort blanket\ncrawler\ndesigner baby\ndiddums\ndummy\nonly child\noops-a-daisy\npacifier\npapoose\nperisher\ntoddler\ntoilet-trained\ntomboy\ntot\ntyke\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople in general\nIdioms\nbe between the devil and the deep blue sea\nthe devil finds work for idle hands\nthe devil to pay\nthe devil's own\n(to) give the devil his due\ngo to the devil\nspeak/talk of the devil\nthe/a devil of a something\nwhat/where/how/why the devil\nAdd to word list\nAdd to word list\nan evil being, often represented in human form but with a tail and horns the Devil\nThe Devil, in Christianity, Islam, and Judaism, is the most powerful evil spirit.\nThe devil can be used to give emphasis to a question: What the devil are you doing?"}