{"id":124591,"name":"dialogue","type":"noun","us_sound":"ˈdaɪ.ə.lɑːɡ","us_link":"../audio/d/dialogue.mp3","uk_sound":"ˈdaɪ.ə.lɒɡ","uk_link":"../audio/d/ukdextr023.mp3","content":"Add to word list\nAdd to word list\nB2 conversation that is written for a book, play, or film: The play contained some very snappy/witty dialogue.dialogue between Act Two begins with a short dialogue between father and son.\nC2 formal talks between opposing countries, political groups, etc.: enter into dialogue with The rebel leaders stated that they are willing to enter into dialogue with the government.engage in dialogue The two sides have at last begun to engage in a constructive dialogue.\nMore examplesFewer examplesThe actors struggled manfully with some of the worst lines of dialogue ever written.The dialogue was unconvincing, partly because it was American actors trying to speak London English.The dialogue sounded stilted and unnatural, perhaps because of the translation from the original Russian.During certain scenes of the play there isn't any script and the actors just improvise the dialogue.The two governments have agreed to engage in a comprehensive dialogue to resolve the problem.\nSMART Vocabulary: related words and phrases\nCinema & theatre: casting, roles & scripts\nbilling\nbit part\ncallback\ncast list\ncasting couch\ncharacterization\nchorus\nexit\nHarlequin\nmiscast\noff script\non script\nopposite\nscript\ntable read\ntapescript\nteleplay\ntheatre\ntitle role\ntypecast\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDebate & discussion\ndialogue noun [C/U]\n(CONVERSATION)\nAdd to word list\nAdd to word list\nliterature conversation between the characters in a story, such as in a book or movie: [ U ] Oscar Wilde’s plays are famous for their witty dialogue.\ndialogue noun [C/U]\n(EXCHANGE OF OPINION)\na serious exchange of opinion, esp. among people or groups that disagree: [ C ] We have held a number of meetings, and the dialogue is ongoing."}