{"id":124783,"name":"diary","type":"noun","us_sound":"ˈdaɪr.i","us_link":"../audio/d/diary.mp3","uk_sound":"ˈdaɪə.ri","uk_link":"../audio/d/ukdiaph005.mp3","content":"Add to word list\nAdd to word list\na book in which you record your thoughts or feelings or what has happened each day: keep a diary While in hiding, Anne Frank kept a diary.\nSuchart Doyemah/EyeEm/GettyImages\nA2 UK (US datebook) a book with a separate space or page for each day, in which you write down your future arrangements, meetings, etc.: Don't forget to write/enter the date of the meeting in your diary.\nMark Weiss/The Image Bank/GettyImages\nMore examplesFewer examplesThe following is an extract from her diary.Hold on, I'll check in my diary.I've kept a diary for twelve years now.I've put the date of the party down in my diary.As his illness progressed, he made fewer entries in his diary.\nSMART Vocabulary: related words and phrases\nPieces of writing\nannotation\nbiographic\nblog post\nChyron\ncreative writing\ncutting\ndraft\nfemslash\ninscription\nintertextual\nintertextuality\nintertextually\njottings\njuvenilia\nlegend\npassage\nself-portrait\nsubheading\ntranscript\ntypescript\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSchedules & agendas\nAdd to word list\nAdd to word list\na person’s private record of events, thoughts, feelings, etc., that are written down every day, or a book where such things are recorded: That's my private diary - you shouldn't be reading it. We kept a food-and-exercise diary and measured the amount of food we ate.\nAdd to word list\nAdd to word list\nWORKPLACE\n&#160; UK ( US calendar) a book or piece of software with a space or page for each day, in which you record future arrangements, meetings, etc.: in sb's diary Is there anything in your diary for tomorrow afternoon? Please check the appointments diary before scheduling a meeting. She has a very full diary this week but she could see you next week. Our CEO is seeking a part-time diary secretary to help him manage his appointments efficiently.\na record of what has happened during a period of time: It may help to keep a diary of problems you encounter. His diary entries for July describe the final stages of the project."}