{"id":124828,"name":"diaspora","type":"noun","us_sound":"daɪˈæs.pɚ.ə","us_link":"../audio/d/usdiari002.mp3","uk_sound":"daɪˈæs.pər.ə","uk_link":"../audio/d/ukdiaph006.mp3","content":"Add to word list\nAdd to word list\na group of people who spread from one original country to other countries, or the act of spreading in this way: Nearly two-fifths of Spain's foreign residents come from the Latin diaspora - mostly from Ecuador and Colombia. The Hmong diaspora evolved against the backdrop of terror that unfolded in their homeland. France's population of Arabic origin is the continent's largest, drawing on Francophone diasporas from North Africa and Lebanon.\nMore examplesFewer examplesHe is part of an Indian diaspora that is rising to lead banks in Europe and the U. S. People in a diaspora are often more religious than in their homeland.We now have a Western diaspora and that diaspora is bringing Iranians and Indians together.\nSMART Vocabulary: related words and phrases\nChanging homes & moving\nanti-immigrant\nanti-immigration\nasylum seeker\ndeinstitutionalize\ndownsize\ngreener pastures idiom\nimmigrant\nimmigration\nmigrant\nmigrate\nmigration\nmover\npasture\nrelocation\nremoval\nremovalist\nremover\nresettle\nsettle\nstake\nSee more results »\nthe Jews living in different parts of the world outside Israel, or the various places outside Israel in which they live\nSMART Vocabulary: related words and phrases\nJudaism\nAshkenazi\nbar mitzvah\nbat mitzvah\ncantor\nHanukkah\nJew\nJewish\nJewishness\nJewry\nOrthodox Judaism\npaschal\nPassover\nPentecost\nPharisee\nsynagogue\ntallit\nTalmudic\nTalmudist\nthe ark\nthe Talmud\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChanging homes & moving\nAdd to word list\nAdd to word list\npolitics &amp; government the scattering of people from their original country to other places\nworld history, politics &amp; government Diaspora is the forced movement of Jews from Israel.\nworld history, politics &amp; government The Diaspora is also the Jews who live outside of Israel."}