{"id":125281,"name":"dictionary","type":"noun","us_sound":"ˈdɪk.ʃən.er.i","us_link":"../audio/d/dictionary.mp3","uk_sound":"ˈdɪk.ʃən.ər.i","uk_link":"../audio/d/ukdiaph030.mp3","content":"Add to word list\nAdd to word list\nA1 a book that contains a list of words in alphabetical order and explains their meanings, or gives a word for them in another language; an electronic product giving similar information on a computer, smartphone, etc.: a French-English/English-French dictionary a bilingual/monolingual dictionary To check how a word is spelled, look it up in a dictionary. Our online dictionary is regularly updated with new entries.\nunclepodger/iStock/Getty Images Plus/GettyImages\na book that gives information about a particular subject, in which the entries (= words or phrases) are given in alphabetical order, or a similar electronic product: a biographical/science dictionary a dictionary of quotations The world's most ambitious online dictionary of Architects has been launched in Scotland.\ncomputing\n&#160; specialized a list of words in electronic form that is used by a computer or smartphone, for example, in a program that checks your spelling when you type: Each word is checked by the computer against its internal dictionary.\nMore examplesFewer examples\"Is that the correct spelling?\" \"I don't know - look it up in a dictionary.\"In this dictionary, verbs which are intransitive are marked [I].This dictionary went online in 1999.Notes on how to use this dictionary can be found at the beginning of the book.One great advantage of an online dictionary is that it can be constantly expanded.If you will be using the same computer all the time, you may also want to add your name to your computer's dictionary.\nSMART Vocabulary: related words and phrases\nBooks: reference books\nalmanac\nannual\natlas\nbible\ncoursebook\ndirectory\nguide\nguidebook\nhandbook\nheadword\nmanual\npeerage\nphrase book\nprimer\nspeller\nthe Yellow Pages\nthesaurus\nwho\nwho's who idiom\nyearbook\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer programming & software\nAdd to word list\nAdd to word list\na book that lists words with their meanings given in the same or in another language, and often includes other information"}