{"id":125248,"name":"dictating","type":"verb","us_sound":"ˈdɪk.teɪt","us_link":"../audio/d/dictate.mp3","uk_sound":"dɪkˈteɪt","uk_link":"../audio/d/ukdiaph023.mp3","content":"Add to word list\nAdd to word list\npresent participle of\ndictate\ndictate verb\n(GIVE ORDERS)\nC1 [ I or T ] to give orders, or tell someone exactly what they must do, with total authority: The UN will dictate the terms of troop withdrawal from the region. [ + question word ] He disagrees with the government dictating what children are taught in schools. [ + that ] The rules dictate that only running shoes must be worn on the track.\n[ T ] to influence something or make it necessary: The party's change of policy has been dictated by its need to win back younger voters. [ + that ] I wanted to take a year off, but my financial situation dictated that I got a job.\nMore examplesFewer examplesMany people feel they must do whatever their doctor dictates, and never question the advice they are given.After dictating what is to be done, she then leaves her husband to do all the work!When I went to the hairdresser, my mum just dictated how it was to be cut.He shouldn't be allowed to dictate all the terms and conditions - it's supposed to be a democratic decision.\nSMART Vocabulary: related words and phrases\nGiving orders & commands\nall-points bulletin\nboss\nboss someone around\nbossily\nbossiness\nbossyboots\ncharge\ndecree\ndefy\ndemand\ndictate\nexpect\nharry\nimportunate\nlay down the law idiom\nprescribe\nput something on\nshove\nshove someone around\nstick out for something\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nControlling and being in charge\ndictate verb\n(SPEAK)\n[ I or T ] to speak something aloud for a person or machine to record what is said, so that it can be written down: I dictated my order over the phone. She spent the morning dictating letters to her secretary.\nSMART Vocabulary: related words and phrases\nOffice practices\nadmin\nadministrative\nadministratively\nbadge in\nbadged\ndictate\ndictation\nhuman resources\nhygiene factor\nin-house\ninteroffice\nkaizen\nphotocopy\nphotostat\npower breakfast\npower lunch\npp\nremittance\nscrum\ntyping\nSee more results »\nPhrasal verb\ndictate to someone"}