{"id":125245,"name":"dictate","type":"verb","us_sound":"ˈdɪk.teɪt","us_link":"../audio/d/dictate.mp3","uk_sound":"dɪkˈteɪt","uk_link":"../audio/d/ukdiaph023.mp3","content":"dictate verb\n(GIVE ORDERS)\nAdd to word list\nAdd to word list\nC1 [ I or T ] to give orders, or tell someone exactly what they must do, with total authority: The UN will dictate the terms of troop withdrawal from the region. [ + question word ] He disagrees with the government dictating what children are taught in schools. [ + that ] The rules dictate that only running shoes must be worn on the track.\n[ T ] to influence something or make it necessary: The party's change of policy has been dictated by its need to win back younger voters. [ + that ] I wanted to take a year off, but my financial situation dictated that I got a job.\nMore examplesFewer examplesMany people feel they must do whatever their doctor dictates, and never question the advice they are given.After dictating what is to be done, she then leaves her husband to do all the work!When I went to the hairdresser, my mum just dictated how it was to be cut.He shouldn't be allowed to dictate all the terms and conditions - it's supposed to be a democratic decision.\nSMART Vocabulary: related words and phrases\nGiving orders & commands\nall-points bulletin\nboss someone around\nbossily\nbossiness\nbossyboots\ncommanding\ndecree\ndemand\nexpect\nharry\ninstruct\nlay down the law idiom\nprescribe\npush someone around\nput something on\nshove\nshove someone around\nstick\nstick out for something\ntask\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nControlling and being in charge\ndictate verb\n(SPEAK)\n[ I or T ] to speak something aloud for a person or machine to record what is said, so that it can be written down: I dictated my order over the phone.dictate something to someone She spent the morning dictating letters to her secretary.\nSMART Vocabulary: related words and phrases\nOffice practices\nadmin\nadministrative\nadministratively\nbadge in\nbadged\nbranch\ndictation\nhuman resources\nhygiene factor\nin-house\ninteroffice\nkaizen\nphotocopy\nphotostat\npower breakfast\npower lunch\npp\nremittance\nscrum\ntyping\nSee more results »\nPhrasal verb\ndictate to someone\nan order that should be obeyed, often one that you give to yourself: dictate of conscience/common sense A jury must make its decision according to the dictates of conscience/common sense and the laws of the country. Compare\ndiktat disapproving\nSMART Vocabulary: related words and phrases\nInstructions and orders\nas per instructions idiom\nbriefing\ncharge\nclarion call\ncommandment\ncounter-order\ndiktat\ndoctor's orders\nfiat\nimperatively\ninstruction\ninterdict\nmarching orders\norder\norders are orders idiom\nunbriefed\nwalkthrough\nwith\nword\nSee more results »\ndictate verb\n(GIVE ORDERS)\nAdd to word list\nAdd to word list\n[ T ] to give orders, or state something with total authority: [ + question word ] Tennis club rules dictate what kind of footwear may be worn on the courts.\n[ T ] To dictate also means to make necessary: The characteristics of the land dictate much of what can be built.\ndictate verb\n(SPEAK)\n[ I/T ] to say something aloud for another person or for a machine to record, so that your words can be prepared in writing for use in business or a legal case: [ T ] She spent the morning dictating letters.\nAdd to word list\nAdd to word list\n[ I or T ]\n&#160; WORKPLACE to speak something aloud for a person or machine to record, so that what is said can be written down: dictate a letter/memo/reply to sb I dictated a memo to my assistant, to be sent to all staff.\n[ T ] to decide and say what will happen, usually in a forceful way: dictate terms/conditions At that time the trade unions were allowed to dictate terms, and nothing happened without their agreement.dictate how/when/what, etc. The government shouldn't dictate how we run our businesses.\n[ T ] to influence something or make it necessary: The rise in fuel prices was dictated by the market."}