{"id":125413,"name":"die","type":"verb","us_sound":"daɪ","us_link":"../audio/d/die.mp3","uk_sound":"daɪ","uk_link":"../audio/d/ukdictu013.mp3","content":"Add to word list\nAdd to word list\nA1 to stop being alive, either suddenly or slowly: Twelve people died in the accident. She died of/from hunger/cancer/a heart attack/her injuries. Do they count people who die with Covid-19 (= who have it when they die)? It is a brave person who will die for their beliefs. I would like to die in my sleep (= while I am sleeping). Many people have a fear of dying.\nThesaurus: synonyms, antonyms, and examples\nto stop livingdieMy dog died last week.die a natural/violent deathShe dies a natural death at home, surrounded by loved ones.pass awayHe passed away peacefully in hospital.pass onI'm sorry to hear that your grandfather has passed on.passUS My father passed last year.\nSee more results »\ndie a natural/violent/etc. death\nto die naturally, violently, etc.: He died a violent death.\nSee more\nto stop existing or continuing; to end: Our love will never die. Small covered markets are slowly dying, unable to compete with supermarkets.\ninformal If a machine, battery, or phone dies, it stops working, usually because it has no power: The engine just died on us. I'm sorry I didn't reply to your text - my phone died.\nMore examplesFewer examplesThese men are ready to die for their country.When the queen dies, her eldest son will succeed to the throne.We had a very hard winter last year and some of the plants died.Trees are dying in areas where acid rain is most prevalent.If disturbed, the bird may abandon the nest, leaving the chicks to die.She won't tell anyone; the secret will die with her.Their goal is to salvage cultural traditions that would otherwise die.\nSMART Vocabulary: related words and phrases\nDeath and dying\nbereave\nbite\nbleed out\nbuy the farm idiom\ncadaveric\ndeath toll\ndepart this life idiom\nfatality\nghost\nmacabre\npredecease\nraise\nremains\nsnuff\nstarvation\nsuicidally\nterminally\nthose whom the gods love die young idiom\ntoll\nwatery\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnds and endings\nNon-existence and not being\nMachines - not functioning\nIdioms\nalmost/nearly die of something\nbe dying for/to do something\ndie a/the death\ndie hard\ndo or die\nnever say die\nor die in the attempt\nto die for\nto/until my dying dayPhrasal verbs\ndie away\ndie down\ndie off\ndie out\ndie noun [C]\n(TOOL)\na shaped piece or mould (= hollow container) made of metal or other hard material, used to shape or put a pattern on metal or plastic\nSMART Vocabulary: related words and phrases\nModels & moulds\ncardboard cutout\ncast\ndiorama\nmock\nmock something up\nmodel\nmould\nprecast\nrecreation\nscale\nsection\ntruckle\nwireframe\ndie noun [C]\n(GAME)\nUS also or old use (UK dice) a small cube (= object with six equal square sides) with a different number of spots on each side, used in games involving chance\nhammerston/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nMiscellaneous games & activities\nair hockey\nbeer pong\nbelly dancing\nboomerang\nbran tub\nbuildering\nChinese puzzle\njigsaw\njuggling\njump rope\nkeepy-uppy\nkorfball\nLARP\norigami\npinball\nstory mode\nsubworld\nsudoku\ntable football\ntabletop\nSee more results »\nIdiom\nthe die is cast\nAdd to word list\nAdd to word list\nto stop living: He died of a heart attack. She died in her sleep at the age of 94. fig. The engine just died (= stopped working).\nIf you say that you could have/nearly died of a particular feeling, you mean that you felt the feeling very strongly: I was so embarrassed, I could have died. be dying\nTo be dying to do something, or for something, is to be eager to do or to have it: I’m dying to hear the news. I’m dying for a cup of coffee. Phrasal verbs\ndie down\ndie off\ndie out"}