{"id":125445,"name":"dielectric","type":"adjective","us_sound":"ˌdaɪ.ɪˈlek.trɪk","us_link":"../audio/d/cdo0123usdiel0731.mp3","uk_sound":"ˌdaɪ.ɪˈlek.trɪk","uk_link":"../audio/d/cdo0123ukdiel0894.mp3","content":"Add to word list\nAdd to word list\nable to contain an electric field without conducting (= passing along) electricity: Dielectric grease can be applied to the exposed metal parts of virtually any electrical connection to seal and protect it. The polymers are dielectric, meaning they are not conductors of electric currents but act as vehicles for the registration of electric fields.\nMore examplesFewer examplesA dielectric barrier layer is formed to cover the metallic layer.The gel is a dielectric lubricant that fights corrosion.When a dielectric material is placed in an electric field, electric charges do not flow through the material as they do in an electrical conductor.The optical device uses a non-metallic, dielectric coating that reflects 99 percent of all visible light.\nSMART Vocabulary: related words and phrases\nElectricity & electronics\nanodize\nanti-static\narc\nbitstream\nbrownout\ncapacitance\nchargeable\nelectricity\nelectrify\ngenerate\nhigh-voltage\ninsulating tape\nlinesman\nmagnet\nnegatively\nnon-electric\nnon-electrical\nnon-electronic\nnon-magnetic\nsolid-state\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysics: energy, force & power\nIsolating and separating\na substance or device that is able to contain an electric field without conducting (= passing along) electricity: Dielectrics are an essential constituent of capacitors. Compare\ninsulator\nMore examplesFewer examplesA copper film is used but other films, such as dielectrics, may also be suitable.The high voltage current flowing in the primary would have destroyed the capacitor dielectric.Silicon's other role, when it is pure, is as a dielectric - a material that can be penetrated by an electric field, but not an electric current.\nSMART Vocabulary: related words and phrases\nElectricity & electronics\nanodize\nanti-static\narc\nbitstream\nbrownout\ncapacitance\nchargeable\nelectricity\nelectrify\ngenerate\nhigh-voltage\ninsulating tape\nlinesman\nmagnet\nnegatively\nnon-electric\nnon-electrical\nnon-electronic\nnon-magnetic\nsolid-state\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIsolating and separating"}