{"id":125498,"name":"diet","type":"noun","us_sound":"ˈdaɪ.ət","us_link":"../audio/d/diet.mp3","uk_sound":"ˈdaɪ.ət","uk_link":"../audio/d/ukdictu017.mp3","content":"Add to word list\nAdd to word list\nB1 [ C or U ] the food and drink usually eaten or drunk by a person or group: Diet varies between different countries in the world. a healthy/balanced/varied diet Rice is the staple diet (= most important food) of many people in China. The children seem to exist on a diet of fried food.\nB1 [ C ] an eating plan in which someone eats less food, or only particular types of food, because they want to become thinner or for medical reasons: I'm going on a diet next week and hope to lose ten pounds before Christmas. a crash/strict/calorie-controlled diet The doctor put me on a low-salt diet to reduce my blood pressure.\n[ S ] a particular type of thing that you experience or do regularly, or a limited range of activities: He was brought up on a diet of political propaganda from birth. Network TV only offers a diet of bad reality shows every night.\nMore examplesFewer examplesYour skin would clear if you had a healthier diet.I'm afraid I'm not a very good advertisement for the diet since I've actually put on weight!Fresh fruit and vegetables are an essential component of a healthy diet.A good diet helps build the body's natural defences.The deformation of the bones was caused by poor diet.\nSMART Vocabulary: related words and phrases\nDiets & dieting\ncaloric\ncalorie-controlled\ncarb-free\nclean eating\ncleanse\ndetox\ndiabetic\nfatty\nfunctional food\nketogenic diet\nlacto-ovo vegetarian\nlacto-vegetarian\nlacto-vegetarianism\nlocavore\nmacrobiotic\nregimen\nVeganuary\nvegetarianism\nweight loss\nwell balanced\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStandard and routine\nHabitual behaviour\nDiet food or drink contains less sugar or fat than the usual type, and often contains an artificial sweetener: diet cola\nSMART Vocabulary: related words and phrases\nVarious qualities of food\ncandy coat\ncandy-coated\ncitric\ncordon bleu\ncreamily\nfarmhouse\nfruity\nherby\nhomegrown\nhomemade\nhoppy\ninstant\nnutritious\nnutty\nsharpness\nshelf-stable\nsingle-estate\nstore-bought\nsugar-coated\nunbalanced\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDiets & dieting\nto limit the food and/or drink that you have, especially in order to lose weight: You should be able to reduce your weight by careful dieting.\nSMART Vocabulary: related words and phrases\nDiets & dieting\ncaloric\ncalorie-controlled\ncarb-free\nclean eating\ncleanse\ndetox\ndiabetic\nfatty\nfunctional food\nketogenic diet\nlacto-ovo vegetarian\nlacto-vegetarian\nlacto-vegetarianism\nlocavore\nmacrobiotic\nregimen\nVeganuary\nvegetarianism\nweight loss\nwell balanced\nSee more results »\nAdd to word list\nAdd to word list\nthe food and drink usually taken by a person or group: [ C ] A healthy diet includes fresh vegetables. [ C ] fig. Gifted students given a steady diet of grade-level curriculum learn they don’t need to work hard.\nA diet is also the particular food and drink you are limited to when you cannot eat or drink whatever you want to: [ C ] a low-salt diet [ C ] I’m going on a diet because I’ve got to lose some weight. dietary adjective us\nYour browser doesn't support HTML5 audio\n/ˈdɑɪ·ɪˌter·i/\nHealth experts say dietary changes have to start with children, who can be taught to appreciate a healthy diet.\nto limit the food that you take, esp. in order to lose weight: He began dieting a month ago and says he has lost ten pounds already. dieter noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈdɑɪ·ɪ·t̬ər/\nStudies show there may be as many as 30 million American dieters at any one moment.\n(of food or drink) containing much less sugar than usual and often sweetened artificially, or containing less fat than usual: diet soda"}