{"id":125601,"name":"difficulty","type":"noun","us_sound":"ˈdɪf.ə.kəl.t̬i","us_link":"../audio/d/eus71272.mp3","uk_sound":"ˈdɪf.ɪ.kəl.ti","uk_link":"../audio/d/ukdiffi001.mp3","content":"Add to word list\nAdd to word list\nB1 [ U ] the fact of not being easy to do or understand: We finished the job, but only with great difficulty. The difficulty of the task excited them. [ + -ing verb ] She had great difficulty finding a job.UK People with asthma have difficulty in breathing.\nB2 [ C ] a problem: to have financial/personal difficulties children with learning difficulties People learning a new language often encounter some difficulties at first. An unforeseen difficulty has arisen.\nThesaurus: synonyms, antonyms, and examples\na problemproblemWhat's the problem here?difficultyThe company is having some financial difficulties at the moment.troubleWe've had a lot of trouble with the new computer system.hitchThe ceremony went without a hitch.glitchWe've had a few technical glitches, but I'm confident we'll be ready on time.hurdleGetting a work permit is only the first hurdle.\nSee more results »\nbe in difficulties UK (US be in difficulty)\nto have problems or be in a difficult situation: A ship is in difficulties off the coast of Ireland.\nSee more\nMore examplesFewer examplesIf you show the receipt, there ought not to be any difficulty getting your money back.Many people have difficulty in rebuilding their lives when they come out of prison.If you're in financial difficulty, we're happy to let you spread your payments over two years.\"Did you have any difficulty finding the theatre?\" \"No, your directions were excellent.\"There are three levels of difficulty in this game: low, intermediate and high.\nSMART Vocabulary: related words and phrases\nDifficult things and people\nalbatross\nball and chain\nbane\nbe dead meat idiom\nbe in the clear idiom\nbump\nequation\nhindrance\nhot potato\nimpediment\nincubus\ninsupportably\nmarathon\nnut\nteaser\nteething troubles\nthe tip of the iceberg idiom\nthorn in your flesh/side idiom\ntie someone up\ntwist\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDifficult to understand\nAdd to word list\nAdd to word list\nthe fact of not being easy, or of being hard to do or understand: [ U ] He has some difficulty hearing people when they speak softly.\nA difficulty is also a problem: [ C usually pl ] In 1986 he experienced financial difficulties and was forced to sell his business."}