{"id":125585,"name":"differentiation","type":"noun","us_sound":"ˌdɪf.ə.ren.ʃiˈeɪ.ʃən","us_link":"../audio/d/usdiari029.mp3","uk_sound":"ˌdɪf.ər.en.ʃiˈeɪ.ʃən","uk_link":"../audio/d/ukdictu028.mp3","content":"differentiation noun\n(DIFFERENCE)\nAdd to word list\nAdd to word list\n[ C or U ] the act of showing or finding difference between things that are compared: We make no differentiation between so called high and low culture. He suggests a differentiation between the brain and the mind. The condition may resemble multiple sclerosis and differentiation is sometimes difficult.\n[ C or U ] the process or fact of being different or making something different from other similar things: Product differentiation is essential to the future of the company. His art training helps him look for differentiations that indicate the telltale signs of a fossil.\nMore examplesFewer examplesFrom an insurance point of view, making a differentiation between female and male drivers isn't discrimination, it's sense.Capital gains are only taxed when people actually sell assets, an important differentiation from other sources of income.For the purpose of this poll, we're going to try to boil the responses down to a few key differentiations.When you go up against huge companies, you had better come up with clear differentiations.\nSMART Vocabulary: related words and phrases\nComparing and contrasting\nanalogy\nantithesis\napple\nas against idiom\nbalance something against something\ncomparative\ncompetitive\ncompetitively\ncontradistinction\ncontrast\ncontrastive\nmeasure\nnext\nnonrelative\nperspective\nrelative\nrelatively\nshame\nstack\nstack up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDifferent and difference\ndifferentiation noun\n(CELL)\n[ U ]\n&#160; biology\n&#160; specialized (of cells or tissue) the process of developing specialized structures or functions: Studies showed that an adult stem cell was capable of differentiation. They observed an increased differentiation of these stem cells into neurons. See also\ndifferentiated\nMore examplesFewer examplesAll this work involves differentiation, or getting the embryonic stem cells to turn into specific kinds of cells and tissues.It has been reported that prostaglandins are important for proper differentiation and growth of fetal organs.Adult human mesenchymal stem cells (hMSC) are capable of differentiation into a variety of cell tissues which include bone, cartilage, muscle, ligament, tendon, and adipose.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanother\nanything\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\ndistinction\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nnon-uniform\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nvariant\nSee more results »\ndifferentiation noun\n(MATHS)\n[ C or U ]\n&#160; mathematics\n&#160; specialized the process of calculating the derivative of a function: He begins with the differentiation of y = ax.\n[ U ]\n&#160; mathematics\n&#160; specialized the part of calculus in which rates of change and connected quantities are calculated: This module is an introduction to differentiation. Synonym\ndifferential calculusCompare\nintegration\nMore examplesFewer examplesDifferentiation of algebraic and trigonometric expressions can be used for calculating rates of change, stationary points and their nature, or the gradient and equation of a tangent to a curve.Differentiations are obtained for several functional equations. We haven't started learning about differentiation yet.\nSMART Vocabulary: related words and phrases\nCalculations & calculating\nalgebraic\nalgebraically\nalgo\nalgorithmic\namount\ncalculate\nguesstimate\ninterpolate\nlinear equation\nmathematical\nmatrix\nmiscalculate\nmiscalculation\nmiscount\nmultigrid\nmultigroup\noperator\nroot\nsum\ntriangulation\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBranches & types of mathematics\ndifferentiation noun\n(EDUCATION)\n[ U ]\n&#160; education\n&#160; specialized the use of different teaching materials and methods within the same lesson to suit the abilities and needs of different students: Teachers see differentiation as a vital tool in countering under-achievement.\nMore examplesFewer examplesInvestigation of the physical and mental development of various pupils revealed the need for differentiation in the teachers' approach.She wrote a paper on improving bilingual students' writing through culturally responsive teaching and differentiation.\nSMART Vocabulary: related words and phrases\nTeaching in general\nasynchronous\nchief academic officer\nCLIL\nclue\nclue in\ncommunicative\ndidactic\ninstruct\nMoodle\nmulti-course\nnon-conditioned\nnon-didactic\nnon-education\nsocialize\nsocializing\nspecial education\nSRE\nsynchronous\nteach someone a lesson idiom\ntutelage\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClasses & courses\ndifferentiation noun\n(GROWING CELL)\nAdd to word list\nAdd to word list\n[ U ]\n&#160; biology the process by which cells in an embryo (= growing organism in the uterus, egg, or seed) become different types of cells and organs\ndifferentiation noun\n(ROCKS)\n[ U ]\n&#160; earth science the process by which different kinds of rock are created from magma (= melted rock) as it cools because of various chemical and physical forces\nAdd to word list\nAdd to word list\nMARKETING the process of showing how a product is different from similar products and what its advantages are, especially in order to attract a particular group of consumers: Through differentiation, coffee could come to be marketed like wine, which is prized for specific locations and other qualities.\nthe process of showing or finding a difference between one thing and another: The four-letter code will enable differentiation between separate projects within the same department.\nthe fact that something is different from something else: There is considerable differentiation between different users in terms of IT skills."}