{"id":125571,"name":"different","type":"adjective","us_sound":"ˈdɪf.ɚ.ənt","us_link":"../audio/d/different.mp3","uk_sound":"ˈdɪf.ər.ənt","uk_link":"../audio/d/ukdictu024.mp3","content":"Add to word list\nAdd to word list\nA1 not the same: She seems to wear something different every day. He's different now that he's been to college. We're reading a different book this week. Emily is very/completely/entirely different from her sister. Emily and her sister are completely different. There are many different types/kinds of bacteria. Synonyms\ndissimilar\ndiverse\nheterogeneous formal\nThesaurus: synonyms, antonyms, and examples\ndifferentdifferentI like her haircut - it's different! dissimilarThe twins may look alike, but they are quite dissimilar when it comes to personality.diverseLondon is a culturally diverse city.heterogeneousThey tested a heterogeneous population.\nSee more results »\ninformal used when you think someone or something is unusual or shows bad judgment: What do I think of your purple shoes? Well, they're certainly different.\nMore examplesFewer examplesAustralia has its own cultural identity, which is very different from that of Britain.You turn this dial to find a different radio station.We sell 32 different flavours of ice cream.Eggs are sorted into different sizes by a machine.The word 'flight' has two different meanings : a plane journey, and the act of running away.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanother\nanything\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\ndistinction\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nnon-uniform\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nvariant\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnique and unusual\nRelated word\ndifferentlyGrammar\nDifferent from, different to or different than?The adjective different means ‘not the same’. When we compare two or more items, it is usually followed by from. We also use different to, especially in speaking: …\nAdd to word list\nAdd to word list\nnot the same: Monet and other Impressionists painted the same scene at different times of day to discover how the colors change in the different light. The weather down here is a lot different than it is at home. Emily is entirely different from her sister. differently adverb us\nYour browser doesn't support HTML5 audio\n/ˈdɪf·rənt·li, -ər·ənt·li/\nI would have done things differently if I had the chance to do them over again. Idioms\ndifference of opinion\nhave your differences"}