{"id":125655,"name":"diffusion","type":"noun","us_sound":"dɪˈfjuː.ʒən","us_link":"../audio/d/usdiffi007.mp3","uk_sound":"dɪˈfjuː.ʒən","uk_link":"../audio/d/ukdiffi011.mp3","content":"Add to word list\nAdd to word list\nthe action of spreading in many directions: Powerful global institutions drive the diffusion of new technologies. Modern communications make the diffusion of ideas extremely rapid.\n(of a gas or liquid) the process of spreading through or into a surrounding substance by mixing with it: the process of diffusion in gases/liquids/solids The inward diffusion of oxygen was fairly rapid at room temperature. See\ndiffuse\nMore examplesFewer examplesThe government needs to promote wider diffusion of e-commerce in the economy.There was a rapid diffusion of the crisis from one country to all countries in the region.He never shared their belief in progress through the advancement of science or diffusion of knowledge.\nSMART Vocabulary: related words and phrases\nSpreading and scattering\nall over the place idiom\nbedaub\nbell\nbestrew\nbillow\ndispersion\ndisseminate\ndredge\ndusting\nencroach on/upon something\nfan out\ngo around\nrambling\nslap something on\nslather\nsmear\nsmudge\nsmudgily\nsmudging\nsprinkle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysical & chemical processes\nAdd to word list\nAdd to word list\nscience (of gases and liquids) the process of spreading into a surrounding substance\nbiology Diffusion is also the method by which substances pass in and out of cells through their membrane (= outside covering).\nphysics Diffusion is also the way light spreads when it is reflected from a rough surface or passed through a translucent substance (= substance that allows only some light to pass through).\nAdd to word list\nAdd to word list\nMARKETING, COMMUNICATIONS the process by which information, ideas, changes in behaviour, etc. spread through a group of people: The research looks at factors influencing the diffusion of innovative products in consumer markets."}