{"id":125600,"name":"difficult","type":"adjective","us_sound":"ˈdɪf.ə.kəlt","us_link":"../audio/d/eus75602.mp3","uk_sound":"ˈdɪf.ɪ.kəlt","uk_link":"../audio/d/ukdictu030.mp3","content":"Add to word list\nAdd to word list\nA1 needing skill or effort: a difficult problem/choice/task/language [ + to infinitive ] It will be very difficult to prove that they are guilty. Many things make it difficult for women to reach the top in US business. [ + -ing verb ] It is extremely difficult being a single parent. Opposite\neasy (NOT DIFFICULT)\nThesaurus: synonyms, antonyms, and examples\nnot easy to deal with or understanddifficultIt's very difficult to find a job in this city. hardThe exam was really hard.complicatedThe instructions were so complicated I just couldn't follow them.complexDesigning a house is a complex process.trickyIt's quite tricky getting the puzzle pieces to fit together.\nSee more results »\nB1 not friendly, easy to deal with, or behaving well: [ + to infinitive ] The manager is difficult to deal with/a difficult person to deal with. His wife is a very difficult woman.mainly UK Please children, don't be so difficult!\nMore examplesFewer examplesThis meat is difficult to chew.The noise outside made it difficult to concentrate.It must be difficult to cope with three small children and a job.She has had to make some very difficult decisions.This novel is too difficult for intermediate students of English.\nSMART Vocabulary: related words and phrases\nComplicated and difficult to do\nadvanced\nambitious\nambitiously\nanother\narduous\nformidably\nget blood out of/from a stone idiom\ngrail\ngruelling\ngruellingly\nonerously\noverdemanding\npainstaking\npicnic\nproblematic\ntricky\ntuff\nultra-sensitive\nunintuitive\nunresolvable\nSee more results »\nAdd to word list\nAdd to word list\nnot easy or simple; hard to do or to understand: It’s a difficult choice, but I’ve got to decide which job is better.\nDifficult also means having problems: He’s in a difficult situation and could go bankrupt.\nA person who is difficult is not easy to deal with: I loved him, but he could be difficult at times."}