{"id":125581,"name":"differentiate","type":"verb","us_sound":"ˌdɪf.əˈren.ʃi.eɪt","us_link":"../audio/d/differentiate.mp3","uk_sound":"ˌdɪf.əˈren.ʃi.eɪt","uk_link":"../audio/d/ukdictu027.mp3","content":"differentiate verb\n(DIFFERENCE)\nAdd to word list\nAdd to word list\nC1 [ I or T ] to show or find the difference between things that are compared: We do not differentiate between our employees on the basis of their race, religion, or national origin. Most consumers have no trouble differentiating our brand's cereal from our leading competitor's. Service providers are all keen to differentiate themselves from their competitors.\nC2 [ T ] to make someone or something different: The slate roof differentiates this house from others in the area. We look for features that differentiate the products.\nMore examplesFewer examplesWe must carefully differentiate between fact and opinion.The syndromes are very similar and can be hard to differentiate.Please explain why you want to work in this role and what differentiates you from other applicants.\nSMART Vocabulary: related words and phrases\nComparing and contrasting\nanalogy\nantithesis\napple\nas against idiom\nbalance something against something\ncomparative\ncompetitive\ncompetitively\ncontradistinction\ncontrast\ncontrastive\nmeasure\nnext\nnonrelative\nperspective\nrelative\nrelatively\nshame\nstack\nstack up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBeing and appearing different\ndifferentiate verb\n(CELL)\n[ I ]\n&#160; biology\n&#160; specialized (of cells or tissue) to develop specialized structures or functions: The cell divides and differentiates to form new, specialized tissue. Embryonic stem cells are able to differentiate into any cell type. Such cell lines can be induced to differentiate to cells that produce insulin. See also\ndifferentiated\nMore examplesFewer examplesHas anyone studied the way sheep mammary tissues differentiate? Stem cells can be induced to differentiate into the specific cell type required to repair damaged or depleted adult cells.There is a possibility that these cells are also capable of differentiating to diverse cell types in vitro. After birth, muscles are also made from satellite cells, which are capable of dividing themselves and also of differentiating to form muscle.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanother\nanything\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\ndistinction\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nnon-uniform\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nvariant\nSee more results »\ndifferentiate verb\n(MATHS)\n[ I or T ]\n&#160; mathematics\n&#160; specialized to calculate the derivative of a function: Differentiate the following functions with respect to x. Compare\nintegrate\nMore examplesFewer examplesTo differentiate a function like (2x +1)3, the only method available to you is to use the binomial theorem to multiply out the brackets, and then to differentiate term by term. You should be able to differentiate a variety of trigonometric functions using the chain rule. The matrix of partial derivatives is obtained from differentiating the equation.\nSMART Vocabulary: related words and phrases\nCalculations & calculating\nalgebraic\nalgebraically\nalgo\nalgorithmic\namount\ncalculate\nguesstimate\ninterpolate\nlinear equation\nmathematical\nmatrix\nmiscalculate\nmiscalculation\nmiscount\nmultigrid\nmultigroup\noperator\nroot\nsum\ntriangulation\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBranches & types of mathematics\ndifferentiate verb\n(EDUCATION)\n[ I or T ]\n&#160; education\n&#160; specialized to use different teaching materials and methods within the same lesson to suit the abilities and needs of different students: This approach allows me to differentiate my instruction for all my students.\nMore examplesFewer examplesTeachers are trained to differentiate their instruction to suit a range of student abilities and learning styles. Most teachers will be used to differentiating work, so should be able to provide your child with extension tasks. He fears that personalized learning will be used to force teachers to differentiate by task for every single lesson taught.\nSMART Vocabulary: related words and phrases\nTeaching in general\nasynchronous\nchief academic officer\nCLIL\nclue\nclue in\ncommunicative\ndidactic\ninstruct\nMoodle\nmulti-course\nnon-conditioned\nnon-didactic\nnon-education\nsocialize\nsocializing\nspecial education\nSRE\nsynchronous\nteach someone a lesson idiom\ntutelage\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClasses & courses\nAdd to word list\nAdd to word list\nto show or find the difference between one thing and another, or between things that are compared: [ T ] What differentiates wheat from other crops is that it is almost exclusively used as a food product. [ I always + adv/prep ] The axons are like phone wires that carry the signals that allow the brain to differentiate between various smells.\nAdd to word list\nAdd to word list\n[ T ]\n&#160; MARKETING to show how a product or company is different from other similar ones and what its advantages are, especially in order to attract a particular group of consumers: differentiate sth from sth The company wanted a website that would differentiate them from their competitors. In order to differentiate our service, it was decided that the brochure would depart from the traditional format.\n[ I or T ] to show or find a difference between people or things: A purchase tax can differentiate between luxuries and necessities.\n[ T ] to be the quality or feature that makes one thing different from another: differentiate sth from sth Customers may wonder what differentiates one type of beer from another."}