{"id":125707,"name":"digesting","type":"verb","us_sound":"daɪˈdʒest","us_link":"../audio/d/digest_01_00.mp3","uk_sound":"daɪˈdʒest","uk_link":"../audio/d/ukdiffi013.mp3","content":"Add to word list\nAdd to word list\npresent participle of\ndigest\ndigest verb\n(EAT)\nC1 [ I or T ] to change food in your stomach into substances that your body can use: I find that I don't digest meat easily. Sit still and allow your meal to digest.\nMore examplesFewer examplesThe adult owls feed their young with food which they've already partly digested.Don't rush off - let's just sit here a while and digest our food.How can you expect to digest your food properly when you eat your meals so fast?The snake lay absolutely motionless for hours as it digested its meal.Meat-eaters must produce extensive bile acids in their intestines to properly digest the meat that they eat.\nSMART Vocabulary: related words and phrases\nEating\nal desko\nbinge\nbinge eating\nbite\nbreak bread idiom\ncram\ndevour\nfeast\nfeast on something\nfeeder\nfeeding\nfinish\ngulp\ninhale\nmainline\npicnic\npig\npig out\npostprandial\npostprandially\nSee more results »\ndigest verb\n(UNDERSTAND)\nC1 [ T ] to read or hear new information and take the necessary time to understand it: This chapter is so difficult to digest, I'll have to read it again later.\nThesaurus: synonyms, antonyms, and examples\nto understand somethingunderstandI understand why he did that.comprehendHe doesn't seem to comprehend the scale of the problem.get the pictureOK. Don't say any more. I get the picture.followIt was so complicated I couldn't follow what he was saying.graspI think I grasped the main points of the lecture.digestThis chapter is so difficult to digest. I'll have to read it again later.\nSee more results »\nSMART Vocabulary: related words and phrases\nUnderstanding and comprehending\nappreciation for something\napprehend\napprehensible\napprehension\nastutely\nbear\ncatch\ncolour\nhandle\nkeep someone up\nknow a hawk from a handsaw idiom\nknow the score idiom\nknow/see where someone is coming from idiom\nlatch\ntease something apart\nto get a handle on something idiom\nto have a handle on something idiom\ntumble to something\ntune in\nunderstanding\nSee more results »"}