{"id":125734,"name":"digital","type":"adjective","us_sound":"ˈdɪdʒ.ə.t̬əl","us_link":"../audio/d/uscld00338.mp3","uk_sound":"ˈdɪdʒ.ɪ.təl","uk_link":"../audio/d/ukcld00338.mp3","content":"Add to word list\nAdd to word list\nA2 recording or storing information as a series of the numbers 1 and 0, to show that a signal is present or absent: digital data\nA2 using or relating to digital signals and computer technology : a digital recording a digital camera digital TV\nusing or relating to computers and the internet: The digital revolution has made it much easier for us to work from home. Social media is an essential tool in a digital world.\nB1 showing information in the form of an electronic image: a digital clock/display a digital watch\nMore examplesFewer examplesConverting an entire CD to digital format and downloading it to an MP3 player takes only about 10 to 15 minutes.Viewers can get more than 100 channels of incredibly sharp pictures with digital cable or satellite.Governments have sometimes been slow to respond to the challenges of the digital era.She founded a program to help educate children of all ages about the importance of being a good digital citizen.A green light appeared on the digital display and the door swung open.digital imagingThe security features on the new ID cards include holograms and a digital identification photo.\nSMART Vocabulary: related words and phrases\nCommunications - general words\nanti-satellite\napp\nautodial\nautodialler\nbar\nhack\nmulti-line\nmultimode\nmultipath\nnoise\nnon-computer\nnon-network\nreplay\nsilent\ntrace\nwatch party\nwebchat\nZoom bomb\nZoombomber\nZoombombing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRecording sounds and images\nComputer concepts\nSigns, signals and symbols\nInternet terminology\nWatches & clocks\nRelated word\ndigitally\nAdd to word list\nAdd to word list\nrecording or showing information in the form of numbers, esp. 0 and 1: The old movie was re-released with digital sound.\nA digital watch or clock shows the time with numbers that change as the time changes.\nAdd to word list\nAdd to word list\nIT, COMMUNICATIONS using a system that can be used by a computer and other electronic equipment, in which information is sent and received in electronic form as a series of the numbers 1 and 0: digital content/data/information digital camera/photography/image digital television/TV/radio After the switchover all our TV channels went digital. Compare\nanalogue\nIT, INTERNET relating to computer technology, especially the internet: The business has invested heavily in the latest digital technology. In the digital world, the tools available to a marketer are utterly different. The magazine that year ranked YouTube as one of its top ten digital brands.\nshowing information as whole numbers rather than in another form such as a picture, graph, etc.: The unit has a clear digital display showing the temperature and humidity. a digital watch/clock/alarm clock\ndigitally adverb /ˈdɪdʒɪtəli/\nThe system captures CCTV images and stores them digitally on hard disk."}