{"id":126090,"name":"dilution","type":"noun","us_sound":"daɪˈluː.ʃən","us_link":"../audio/d/eus71281.mp3","uk_sound":"daɪˈluː.ʃən","uk_link":"../audio/d/ukdigs_022.mp3","content":"Add to word list\nAdd to word list\nthe action of making a liquid weaker by mixing in something else, or a liquid that has been made weaker in this way: The drug's effectiveness is decreased by dilution. Tests are underway to see whether two dilutions of this vaccine are effective.\nthe action of reducing the strength of a feeling, action, etc: a dilution of standards There was certainly a dilution of team spirit.\nfinance &amp; economics\n&#160; specialized a fall in the value of a company's shares when more shares in it are made available: There were concerns about corporate finances and the dilution of shares. Shareholders, including retirees, might suffer from the dilution of such a large investment. The company would have to offer existing shareholders the same terms to avoid dilution. Related word\ndilute\nMore examplesFewer examplesUse the tincture topically in a dilution of 1:25.Homeopaths use dilutions of substances which essentially remove all traces of the substance from the final dilution.There has been a dilution of quality because of this change. Buybacks are sometimes used to offset the dilution of existing shareholders' ownership when companies issue stock options to employees.There are UK guidelines that protect existing shareholders from forced dilution.\nSMART Vocabulary: related words and phrases\nBecoming and making less strong\nabate\nabatement\nadulterate\nadulterated\nadulteration\ndecline\nenervating\nenervatingly\nenfeeble\nenfeebled\nevisceration\nfade\nmelt\nrelieve\nsink\nundimmed\nunsubdued\nwane\nwaste away\nwater something down\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysical & chemical processes\nStock markets\nAdd to word list\nAdd to word list\nthe process or action of making something less strong or valuable: The destroyer of brand integrity is \"brand dilution\", which is the perverse reward for popularity.\nFINANCE the process or action of making a company's shares less valuable by making more shares available: The company is working to prevent dilution resulting from stock splits or similar transactions."}