{"id":126078,"name":"dilute","type":"verb","us_sound":"daɪˈluːt","us_link":"../audio/d/dilute.mp3","uk_sound":"daɪˈluːt","uk_link":"../audio/d/ukdigs_020.mp3","content":"Add to word list\nAdd to word list\nto make a liquid weaker by mixing in something else: Dilute the juice (with water) before you drink it.\nto reduce the strength of a feeling, action, etc.: These measures are designed to dilute public fears about the product's safety.\nMore examplesFewer examplesDilute this squash with water - one part squash to seven parts water.You should always dilute juice that you serve to children.\nSMART Vocabulary: related words and phrases\nBecoming and making less strong\nabate\nabatement\nadulterate\nadulterated\nadulteration\ndecline\nenervate\nenervating\nenervatingly\nenfeeble\nenfeebled\nfade\nmelt\nrelieve\nsink\nturn to jelly idiom\nundimmed\nunsubdued\nwane\nwaste away\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysical & chemical processes\nRelated word\ndilution\nmade weaker by diluting: dilute hydrochloric acid\nSMART Vocabulary: related words and phrases\nBecoming and making less strong\nabate\nabatement\nadulterate\nadulterated\nadulteration\ndecline\nenervate\nenervating\nenervatingly\nenfeeble\nenfeebled\nfade\nmelt\nrelieve\nsink\nturn to jelly idiom\nundimmed\nunsubdued\nwane\nwaste away\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysical & chemical processes\nAdd to word list\nAdd to word list\nto make a liquid weaker by mixing it with water or another liquid: Dilute the bleach in water before adding it to the wash.\nchemistry If you dilute a substance you make it weaker or less pure by mixing it with another substance. diluted adjective us\nYour browser doesn't support HTML5 audio\n/dɑɪˈlut̬·əd, də-/\nHe disinfected the tub with a solution of diluted bleach.\nchemistry made weaker or less pure by the addition of another substance\nAdd to word list\nAdd to word list\nto make something less strong or less valuable: Our recent acquisitions are going to dilute earnings in the next few years. The rise in foreclosures is likely to dilute real estate prices.\nFINANCE to make a company's shares less valuable by increasing the total number of shares, so that each shareholder gets a smaller part of the profit and owns a smaller percentage of the company than before: The company's share issue will increase the number of shares on the market, diluting their value and upsetting current stockholders. diluted shares/stock dilutive adjective\nIn the short-term, this strategy will be dilutive to earnings."}