{"id":126123,"name":"dimensional","type":"adjective","us_sound":"dɪˈmen.ʃən.əl","us_link":"../audio/d/cdo0622usdime0501.mp3","uk_sound":"ˌdaɪˈmen.ʃən.əl","uk_link":"../audio/d/cdo0622ukdime0635.mp3","content":"Add to word list\nAdd to word list\napproving having many different features or qualities, especially in a way that makes something seem real; not too simple: I would say all the characters are strong, dimensional, fully-imagined women.\nhaving or appearing to have height, length, and width; not flat: The recycling facility uses mechanical equipment to separate dimensional items - cans, plastic and juice or milk boxes - from flat paper items. Synonym\nthree-dimensional\nrelating to the dimensions (= measurements such as height, length, or width) of something: The project was a challenge because of the dimensional limitations of the space.\nMore examplesFewer examplesThe new version of the game is a much more immersive, dimensional and original experience than the original.Even this great actress struggles to make her character dimensional and to bring such a poor script to life. The coffee has rich, dimensional flavours of hazelnut and dried fruits.A variety of line patterns can be used to suggest dimensional shadows.His early animations were basically just dimensional line drawings on the screen.\nSMART Vocabulary: related words and phrases\nTrue, real, false, and unreal\nactual\nactuality\nactually\nall that glitters is not gold idiom\nanger\nfalsely\nfantastical\nfever dream\nfictional\nfictionality\nnon-realistic\nnot so much idiom\nnothing could be further from the truth idiom\nnothing could have been further from my mind/thoughts idiom\nparallel universe\nuntrue\nuntruly\nunverifiable\nurban myth\nvalidity\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComplexity\nGeometrical shapes\nMeasurements in general\nhaving measurements in the stated directions: a three-dimensional figure\nSMART Vocabulary: related words and phrases\nGeometrical shapes\n-cornered\ncircularly\ncone\ncongruently\nconic\ncrescent\ncylindrically\nisosceles triangle\npolyhedron\npolytope\nprism\npyramid\nrectangular\nrectangularly\nrhombus\nright triangle\nsemicircle\nsemicircular\nthree-dimensional\ntrapezoid\nSee more results »\n-dimensional suffix\n(MEASUREMENT)\nAdd to word list\nAdd to word list\nhaving measurements in one or more different directions, esp. height, length, or width: a three-dimensional figure\n-dimensional suffix\n(QUALITY)\n(of a thing or situation) having one or more parts or qualities that have an effect on the way you think about it: a multi-dimensional problem\nAdd to word list\nAdd to word list\nhaving a particular number of dimensions (= measurements or features): a three-dimensional figure The response to future crises needs to be multi-dimensional."}