{"id":126125,"name":"dimensionally","type":"adverb","us_sound":"daɪˈmen.ʃən.əl.i","us_link":"../audio/d/cdo0623usdime0971.mp3","uk_sound":"daɪˈmen.ʃən.əl.i","uk_link":"../audio/d/cdo0623ukdime0963.mp3","content":"Add to word list\nAdd to word list\nin a way that relates to the dimensions (= measurements such as height, length, or width) of something: The material is lightweight, non-absorbent, fire resistant, and dimensionally stable. The two designs have elements that are dimensionally identical. See also\n-dimensionally\nformal in a way that measures something on a scale (= a set of numbers to measure or compare the level of something): Trained interviewers rated the disorder dimensionally on a 5-point scale. Each anxiety symptom was assessed dimensionally rather than as the presence or absence of a disorder.\nMore examplesFewer examplesThe crystals were dimensionally characterized along the three axes.The use of moulds is commonly associated with a dimensionally homogeneous product. There are a variety of scales to dimensionally measure severity of symptoms, disability, and quality of life.\nSMART Vocabulary: related words and phrases\nMeasurements in general\naltitude\nbathymetric\nbathymetrically\nbathymetry\nbe running at something idiom\ncalibrate\ndistance\ndrop\nelevation\nfactor\nkilo\nlengthways\nmetric\nmetrication\nmilli-\nscale\nsetting\nuncalibrated\nunmeasurable\nunsized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nConditions and characteristics\nin a way that has or appears to have the stated number of dimensions (= measurements such as height, length, or width): The backgrounds are rendered in beautiful lifelike graphics rather than being drawn two-dimensionally. This is a type of navigation that allows an aircraft to fly a specific path between two 3-dimensionally defined points in space.\nMore examplesFewer examplesCancer cells grown in a petri dish in the lab are not like cancer cells in the body, because they tend to grow two-dimensionally.He had the idea of draping fabric in a way that fits onto the body almost three-dimensionally.The treatment addresses scoliosis 3-dimensionally, to correct the spine in every direction.I prefer creating sculptural works because it is actually easier for me to think three-dimensionally.\nSMART Vocabulary: related words and phrases\nGeometrical shapes\n-cornered\ncircularly\ncone\ncongruently\nconic\ncrescent\ncylindrically\nisosceles triangle\npolyhedron\npolytope\nprism\npyramid\nrectangular\nrectangularly\nrhombus\nright triangle\nsemicircle\nsemicircular\nthree-dimensional\ntrapezoid\nSee more results »"}