{"id":126217,"name":"diminutive","type":"adjective","us_sound":"dɪˈmɪn.jə.t̬ɪv","us_link":"../audio/d/eus71284.mp3","uk_sound":"dɪˈmɪn.jə.tɪv","uk_link":"../audio/d/ukdigs_028.mp3","content":"Add to word list\nAdd to word list\nvery small: He's a diminutive figure, less than five feet tall. Synonyms\ndinky informal\nexiguous formal\ninfinitesimal formal\nitsy-bitsy humorous\nlittle (SMALL)\nmicroscopic informal humorous\nmidget\nmini-\nminiature\nminute\nsmall (LITTLE)\nteensy informal\nteeny informal\nwee Scottish English or informal\nweeny UK informal\nlanguage\n&#160; specialized used to express the fact that something is small, often either to show affection or to suggest that something or someone is not important: Adding diminutive suffixes is often a disparaging tactic. For instance, add- illo to a respected lawyer, abogado, and you have an ignorant one, un abogadillo.\nMore examplesFewer examplesA disastrous chain of events nearly wiped out California's diminutive island fox.In the photo, Abraham Lincoln looms over his diminutive rival for the White House, Stephen Douglas, in 1860.In other words, Russian diminutive affixes happen to be especially strong and salient cues to noun gender.\"-erl\" is a diminutive suffix in German.\nSMART Vocabulary: related words and phrases\nSmall\nbaby\nbijou\nbite-sized\nclaustrophobically\ncompactly\ndwarf\nmidget\nmissy\nmodest\nmodestly\nno/not enough room to swing a cat idiom\non the large, small, etc. side idiom\nparsimonious\nsampler\nscaled-down\nscrubby\nshoe box\nshrunken\nskimpily\nwee\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: grammatical terms\nlanguage\n&#160; specialized a word or part of a word that expresses the fact that something is small, often used either to show affection or to suggest something or someone is not important: The findings do not support previous studies on gender differences in parental use of diminutives with young children.\nthe short form of a name: Her friends call her Margaret, never using diminutives such as Maggie.\nMore examplesFewer examples In his Growth and Structure of the English Language, Otto Jespersen noted how few diminutives English has, and how little it uses them.The article discusses Spanish diminutives in mother-child conversation.This spelling difference is a reflection of the non-standardized and informal nature of diminutives, not unlike doggie/doggy in English.They held posters saying \"We love you Misha,\" the diminutive of Mikheil by which the president is universally known.\nSMART Vocabulary: related words and phrases\nLinguistics: grammatical terms\nablative\napposition\nappositive\nappositively\nattributively\nconcord\ndative\nfeminine\ngenitive\ninflected\nnominative\nparticle\npostposition\npostpositional\npostpositive\npostpositively\npredicatively\nquantifier\nsingular\nsyntax\nSee more results »\nAdd to word list\nAdd to word list\nsmall: My grandmother was a diminutive woman, less than 5 feet tall."}