{"id":126462,"name":"dinner","type":"noun","us_sound":"ˈdɪn.ɚ","us_link":"../audio/d/dinner.mp3","uk_sound":"ˈdɪn.ər","uk_link":"../audio/d/ukdimme019.mp3","content":"Add to word list\nAdd to word list\nA1 [ C or U ] the main meal of the day, usually the meal you eat in the evening but sometimes, in Britain, the meal eaten in the middle of the day: We were just having (our) dinner. We had some friends over for dinner on Saturday. a romantic candlelit dinner Compare\nlunch noun\n[ C usually singular ] a formal social occasion in the evening at which a meal is served, or the meal itself: They held a dinner to celebrate his retirement. Many prominent people were on the guest list for the dinner. He organized a dinner consisting of several fish courses. a charity/society/formal dinner\nMore examplesFewer examplesWe're having roast chicken for dinner.You can cook dinner tonight because I did it last night.We've got eight people coming to dinner.After dinner we settled in front of the television for the evening.\"Would you like to have dinner with us?\" \"No thanks, I've already had mine.\"She was seated next to the president at a dinner.We are going to a dinner this evening in town.\nSMART Vocabulary: related words and phrases\nMeals & parts of meals\naccompaniment\nafternoon tea\nafters\namuse-bouche\nantipasto\nEnglish breakfast\nfeast\nfeeding\nfinger buffet\nfinger food\nplate meal\nploughman's lunch\npostprandial\npot luck\npower breakfast\ntapas\ntea\ntea party\nteatime\ntiffin\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCelebrations, parties & special occasions\nAdd to word list\nAdd to word list\nthe main meal of the day, whether eaten in the evening or in the middle part of the day: [ U ] The restaurant is open for dinner from 5 p.m. to 10 p.m. [ U ] What’s for dinner (= What food are we having for our main meal)? [ U ] Conversation around the dinner table was always lively.\nA dinner is also a formal social occasion in the evening at which a meal is served: [ C ] There will be a black-tie dinner and fund-raiser for Jubilee Housing on April 18th at the Mayflower Hotel."}