{"id":126676,"name":"dip","type":"verb","us_sound":"dɪp","us_link":"../audio/d/dip.mp3","uk_sound":"dɪp","uk_link":"../audio/d/ukdimme030.mp3","content":"dip verb\n(PUT INTO LIQUID)\nAdd to word list\nAdd to word list\nB2 [ T ] to put something into a liquid for a short time: Dip the fish in the batter, then drop it into the hot oil. She dipped her toe into the pool to see how cold it was.\n[ T ] to put sheep for a short time into a container of liquid containing chemicals that kill harmful insects on the sheep's bodies\nMore examplesFewer examplesShe dipped the material into the dye.The girls sat at the edge of the pool and dipped their toes into the water.Dad likes to dip his toast into his soup.He dipped the nib of the pen into the ink before starting to write.The cat dipped its paw into the goldfish bowl, but quickly pulled it out again.\nSMART Vocabulary: related words and phrases\nMovement on or through water\nbuoyantly\ncast\ncast someone adrift idiom\ndabble\nfloat\nhydroplane\noutsail\npaddle\npaddler\nraft\nrow\nsail\nslingshot\nsmoothness\nsurface\nswim\ntack\nwade\nwallow\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal farming - general words\ndip verb\n(DROP)\nB2 [ I ] to go down to a lower level: As you turn the corner, the road dips suddenly. The sun dipped below the horizon. House prices dipped in the first three months of the year.\n[ T ] UK to make the beam from the lights at the front of a vehicle point down: You'll dazzle oncoming drivers if you don't dip your headlights.\nSMART Vocabulary: related words and phrases\nRaising and lowering\ndepress\nelevate\nelevated\nhike\nhike something up\nhoick\nhoist\njack\njack something up\nprise\nprize\npry\nput something up\nraise\nre-erect\nride\nride up\nrun\nwinch\nyo-yo\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOn the road: driving & operating road vehicles\nIdiom\ndip a/your toe in (the water)Phrasal verbs\ndip (something) in/dip (something) into something\ndip into something\ndip noun\n(LIQUID)\n[ C or U ] a cold, thick sauce that you eat by dipping pieces of uncooked vegetable or biscuits, etc. into it\nWestend61/Getty Images /GettyImages\n[ C usually singular ] a quick swim: a dip in the sea/pool\n[ C or U ] a special liquid used for cleaning, etc.: a silver dip sheep dip\nSMART Vocabulary: related words and phrases\nSauces, dressings, dips & pickles\naioli\naji\nAlfredo\napple sauce\narrowroot\nCumberland sauce\ncustard\ncustard powder\ndashi\ndeglaze\nmignonette\nmint sauce\nmirin\nmiso\nmolasses\nsalad dressing\nsalsa\nsambal\nscalloped\nsecret sauce\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSwimming\nCleaning agents\ndip noun\n(DROP)\n[ C usually singular ] a part of something that is at a lower level or a movement to a lower level: a dip in the road a sudden dip in temperature\nSMART Vocabulary: related words and phrases\nHoles, hollows and dips\nanti-crack\naperture\nblistered\nchink\ncranny\ncratering\ngouge\nhatch\nhollow\nimpression\nimprint\ninterstice\nladder\nleak\nleaky\nnook\npinprick\nshaft\nspyhole\nvoid\nSee more results »\ndip noun\n(QUICK LOOK)\n[ C usually singular ] a short time spent considering a subject: We begin our dip into local history by examining the town's origins.\nSMART Vocabulary: related words and phrases\nThinking and contemplating\na brown study idiom\nagonize\nagonize over/about something\nbeard-stroking\nbethink\ngrapple\nharbour\nin the cold light of day idiom\nintrospect\nintrospection\njoined-up thinking\nlateral thinking\nnavel\nreckon\nreweigh\nrumination\nrun through someone's mind/head idiom\nscratch your head idiom\nself-contemplation\nweigh\nSee more results »\ndip verb\n(PUT INTO LIQUID)\nAdd to word list\nAdd to word list\n[ T ] to put something briefly into a liquid: He dipped his doughnut in the coffee.\ndip verb\n(DROP)\n[ I ] to go down to a lower level; become less or lower: Beans and lettuce may suffer if temperatures dip below freezing. Stock market prices dipped slightly, losing four points. Phrasal verb\ndip into something\ndip noun\n(DROP)\n[ C usually sing ] a small drop in the amount or level of something: After the yellow house, there’s a dip in the road.\ndip noun\n(FOOD)\n[ C ] a thick sauce you can put crackers, raw vegetables, etc., into before eating them.\n[ C ] A dip is also a quick swim: He took a dip in the pool.\nAdd to word list\nAdd to word list\nto go down to a lower level, often by a small amount or for a short time: House prices are likely to dip in the first three months of the year.dip from sth to sth Employment gains dipped from 2.6% to only 1.7%. Group sales dipped by 4% last quarter.\ndip a/your toe into sth\nto start very carefully to do or become involved in something that you are not experienced at: Ordinary investors need to feel they are getting a good deal when they dip their toes into the stock market. If you are keen to dip your toes into European funds, there are a number to choose from.\ndip into your pocket informal\nto spend some of your money on something: She admitted that she had been forced to dip into her own pocket to make up a funding shortfall.\nSee also\ndouble-dipPhrasal verb\ndip into sth\na reduction in something, or the fact of something moving to a lower level: The dip in revenue does not mean the industry's several-year winning streak is coming to an end. The newspaper is reporting the third straight monthly dip in advertising.suffer/experience a dip Nearly all of our members have experienced a dip in their business this year. a sharp/slight dip See also\ndouble dip"}