{"id":126950,"name":"dipole","type":"noun","us_sound":"ˈdaɪ.poʊl","us_link":"../audio/d/cdo1121usdipo1398.mp3","uk_sound":"ˈdaɪ.pəʊl","uk_link":"../audio/d/cdo1121ukdipo1361.mp3","content":"dipole noun [C]\n(IN SCIENCE)\nAdd to word list\nAdd to word list\nphysics\n&#160; specialized two poles that have opposite and equal electrical charge or magnetic force, with a space between them: Geomagnetic South Pole represents the axis of the Earth's magnetic dipole.\nchemistry\n&#160; specialized a molecule with an area of negative charge and an area of positive charge that are separated: Many molecules (such as those of water) are electric dipoles, meaning that they have a partial positive charge at one end and a partial negative charge at the other.\nMore examplesFewer examplesBy Maxwell's time, it was clear that the electromagnetic field was the means by which electrical charges and magnetic dipoles act on each other at a distance. If the dipolarity of the generator in the power system is lost, mechanical energy has to be fed into the shaft of the generators to restore the dipole.The centre of positive charge does not coincide with the centre of negative charge; we say that the bond is polar or that it has a dipole. The bent molecule H2O has a dipole, but the linear CO2 (O=C=O) does not.\nSMART Vocabulary: related words and phrases\nPhysics: energy, force & power\nanimal magnetism\nanti-gravity\natmospheric pressure\nattract\nattraction\nballistic\nexcited\nfrictional\nfrictionless\nfundamental force\nG-force\ngeothermal\ninertia\nself-propulsion\nsine curve\nsinusoid\nsolarize\nspecific heat\nthe sound barrier\nthermodynamics\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysics: atoms, molecules & sub-atomic particles\ndipole noun [C]\n(FOR RADIO)\n(also dipole antenna) a simple type of radio aerial (= a structure that receives or sends out radio signals) that is shaped like the letter T: With most FM radio stations today, a vertical dipole gives as much signal as a horizontal one.\nubonwanu/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesThe world's first radio astronomer, he presided over a field of dipoles (antennas) 3,500 feet in diameter while continuing his private research. I use a 440mHz transmitter radio with a 6.5\" horizontal dipole antenna.\nSMART Vocabulary: related words and phrases\nBroadcasting: radio\nam\nantenna\nanti-jamming\nanti-radar\nautotune\nbeacon\nCB\nmedium wave\nmulti-wavelength\nmultichannel\nMW\nomnidirectional\nreceiver\nreception\nshort wave\nshout-out\ntranny\ntransponder\ntuner\ntwo-way\nSee more results »"}