{"id":127049,"name":"direct","type":"adjective","us_sound":"daɪˈrekt","us_link":"../audio/d/eus75604.mp3","uk_sound":"daɪˈrekt","uk_link":"../audio/d/ukdipht016.mp3","content":"direct adjective\n(STRAIGHT)\nAdd to word list\nAdd to word list\nB1 going in a straight line towards somewhere or someone without stopping or changing direction: direct route/line a direct route/line Is there a direct train to Edinburgh?\nB2 without anyone or anything else being involved or between: She decided to take direct control of the project. He denied that he had any direct involvement in the deal. Do you have any direct experience of this kind of work?direct result/consequence He left as a direct result/consequence of what she said.direct link/connection There is a direct link/connection between smoking and lung cancer. direct light/heat\nstrong light or heat that has nothing protecting and separating you from it: This plant should be kept out of direct sunlight.\nSee more direct relation/relative/descendant\na relation who is related to you through one of your parents, not through an aunt or uncle, etc.: Diana is a direct descendant of Robert Peel.\nSee more\nMore examplesFewer examplesWe are in direct communication with Moscow.If you're in a hurry to get there, take the path through the park - it's more direct.It's direct line from here to London King's Cross, so you won't have to change trains.The rebel headquarters took a direct hit from a bomb during the attack.His broken leg is the direct result of his own carelessness.\nSMART Vocabulary: related words and phrases\nGeometry: describing angles, lines & orientations\nangle of incidence\nangularity\nantinode\nasymptote\nasymptotic\ndiagonal\ngradient\ninterior angle\nmultiaxial\nnon-coplanar\nnon-intersecting\nnon-planar\nreflex\nscalene triangle\nshallow\nsupplementary\ntransversal\ntriangulate\nvanishing point\nvertically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCloseness in distance and time\ndirect adjective\n(COMPLETE)\ncomplete: a direct contrastdirect opposite She's very thoughtful - the direct opposite of her sister.\nSMART Vocabulary: related words and phrases\nComplete and whole\n(all) in one piece idiom\nabsolute\naggregate\nall or nothing idiom\nall told idiom\nall-in-one\nall-inclusive\nfell\nfibre\nfull strength\nfull-fledged\nfull-length\nfully\nfully fledged\nthorough\nthoroughgoingly\nthoroughly\nthrough and through idiom\nto the last idiom\ntotality\nSee more results »\ndirect adjective\n(HONEST)\nC1 Someone who is direct says what they think in a very honest way without worrying about other people's opinions: I like her open and direct manner.\nSMART Vocabulary: related words and phrases\nBlunt and direct in speech & behaviour\nabruptly\nabruptness\nbald\nbaldly\nbaldness\nblisteringly\nbluff\ncurt\ndirectness\ndownrightly\nedgelord\nflat out phrase\nforthright\noutspoken\noutspokenly\nplain speaking\nplain-spoken\nplainness\nsuffer\nvocal\nSee more results »\nRelated word\ndirectness\ndirect adverb\n(STRAIGHT)\nB1 in a straight line towards somewhere without stopping or changing direction: Does this bus go direct to the airport?\nB1 without anyone or anything else being involved or between: I intended to go direct to the manager with my complaint.\nSMART Vocabulary: related words and phrases\nGeometry: describing angles, lines & orientations\nangle of incidence\nangularity\nantinode\nasymptote\nasymptotic\ndiagonal\ngradient\ninterior angle\nmultiaxial\nnon-coplanar\nnon-intersecting\nnon-planar\nreflex\nscalene triangle\nshallow\nsupplementary\ntransversal\ntriangulate\nvanishing point\nvertically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDescribing movement towards\nCloseness in distance and time\ndirect verb\n(CONTROL)\nC1 [ T ] to control or be in charge of an activity, organization, etc.: She directs a large charity.\nC1 [ T ] to tell people the direction in which they must drive: There was a police officer directing the traffic.\nB1 [ I or T ] to be in charge of a film or play and tell the actors how to play their parts: He wanted to give up acting and start directing (his own films). \"Jaws\" was directed by Steven Spielberg. Compare\nproduce verb (FILM/MUSIC)\nMore examplesFewer examplesHe's directed so many movies that you might expect a few duff ones.Coaches will set down and uplift passengers only as directed by the police in the streets mentioned.The movie, three hours long, is directed in his usual idiosyncratic style.He was on another one of his ego trips, directing and taking the main part in a movie.She directs one of Europe's largest book festivals.\nSMART Vocabulary: related words and phrases\nManaging and organizing\nadmin\nadminister\nadministration\nanti-bureaucracy\nbronze command\nfixer\nflabbily\nget up\nget your act together idiom\ngold command\nmobilize\nmount\npaperwork\nparty planner\nparty planning\nproject-manage\nrationalization\nrationalize\nvice-presidential\nwieldy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTaking someone somewhere or telling them the way\nCinema & theatre: production, direction & recording\ndirect verb\n(AIM)\nC1 [ T usually + adv/prep ] to aim something in a particular direction: Was that remark directed at/towards me?be directed against/at Criticism was directed against/at the manufacturers of the product.\nMore examplesFewer examplesIt's much healthier to direct your emotions outwards than to bottle them up inside you.Much of the violence was directed against large multinational companies.The government's latest anti-smoking campaign is directed at children.The tragedy directed public attention away from the government's domestic problems.Criticism is being directed at parents rather than teachers for the breakdown in classroom discipline.\nSMART Vocabulary: related words and phrases\nAiming and aim\naim\ncrosshairs\nhome\nhome in on something/someone\nlevel\nlevel something at someone\nretarget\ntarget\ntrain\nzero\nzero in on something/someone\ndirect verb\n(SAY WHERE)\nB1 [ T ] to tell someone how to get somewhere: direct someone to something Could you direct me to the airport? I couldn't find the station, so I asked someone if they could direct me.\nSMART Vocabulary: related words and phrases\nTaking someone somewhere or telling them the way\naccompanied by someone/something\naccompany\naccompany someone to something\nbring\nbring someone/something along\nchaperone\nconvoy\ndrop\nlead\nmarch\nrefer to someone/something\nride\nsee someone off\nshepherd\nshow someone around (something)\nshow someone over something\nstick\nusher\nusherette\nwalk\nSee more results »\ndirect verb\n(ORDER)\n[ T + obj + to infinitive ] formal to order someone, especially officially: direct someone to do something The judge directed the defendant to remain silent.\nSMART Vocabulary: related words and phrases\nGiving orders & commands\nall-points bulletin\nboss someone around\nbossily\nbossiness\nbossyboots\ncommanding\ndecree\ndemand\ndictate\nexact\nexpect\ninstruct\nprescribe\npush someone around\nput something on\nshove\nshove someone around\nstick\nstick out for something\ntask\nSee more results »\ndirect adverb\n(WITHOUT STOPPING)\nwithout having to stop or change direction: Does this train go direct to Edinburgh?\nwithout anything or anyone else being involved or in between: Can I dial this number direct or do I have to go through the switchboard?\nSMART Vocabulary: related words and phrases\nTravelling\naround Robin Hood's barn idiom\nbackpack\nbag drop\nbourne\nbum\nbum around\ncommunication\ncommuting\nconnection\nhitch\nmove\nnegotiate\npublic transport\nRobin Hood\nshuttle\nsuper-commuting\ntaken\ntransoceanic\nvisa\nwell travelled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCloseness in distance and time\ndirect adjective\n(STRAIGHT)\nAdd to word list\nAdd to word list\ngoing in a straight line toward somewhere or someone without stopping or changing direction and without anything coming in between: Is there a direct flight to Madison, or do we have to change planes in Chicago? This plant should be kept out of direct sunlight.\nDirect also means without anyone or anything else being involved: She fired the principal and took direct control of the school.\nDirect also means very honest in saying what you mean: Her manner was businesslike and direct.\ndirect verb\n(AIM)\n[ T always + adv/prep ] to aim something in a particular direction or at particular people: His criticism was directed at everybody who disagreed with him.\n[ T always + adv/prep ] To direct is also to show someone the particular way to get somewhere: Can you direct me to the nearest bus stop?\ndirect verb\n(CONTROL)\n[ I/T ] to control or be in charge of an activity, organization, etc.: [ T ] General Eisenhower directed the allied forces in World War II.\n[ I/T ] When someone directs a movie, play, etc., that person tells the actors how to play their parts.\ndirect verb\n(ORDER)\n[ T ] fml to give an order or instruction to someone: The judge directed the defendant to be quiet.\ndirect adverb\n(WITHOUT INVOLVING OTHERS)\nwithout anything or anyone else being involved: Can I dial this number direct or do I have to go through the operator?\nAdd to word list\nAdd to word list\nwithout anyone or anything else being involved or coming between two people or things: She decided to take direct control of the project. He had had no direct involvement with the deal. Have you any direct experience of this kind of work? The managers talked about the need for more direct communication between employees. We do not and cannot accept any direct compensation or gifts.\nhappening as an immediate effect of something: Delays in project schedules are often the direct result of cutting costs. We hope that the increase in the marketing budget will have a direct impact on sales.\nTRANSPORT going to a place without any stops or changes in direction: a direct flight/route\nto control or be in charge of an activity, organization, etc.: She directs a large charity. They've appointed someone from outside the organization to direct the fiscal review.\nto aim something in a particular direction, or at a particular person or group of people: direct sth toward(s) sb This sales promotion is directed toward retail customers.direct sth to sth/sb Please direct concerns and queries to the project administrator. Any future donations will be directed to the housing fund. We need to direct the board's attention to this matter immediately.\nwithout anything or anyone else being involved, or coming between two people or things: Can I dial this number direct or do I have to go through the switchboard?\nTRANSPORT without making a stop or a change in direction: I'm not sure if you can fly direct to Buenos Aires from here."}