{"id":127059,"name":"direction","type":"noun","us_sound":"dɪˈrek.ʃən","us_link":"../audio/d/eus75605.mp3","uk_sound":"daɪˈrek.ʃən","uk_link":"../audio/d/ukdipht017.mp3","content":"direction noun\n(POSITION)\nAdd to word list\nAdd to word list\nB1 [ C ] the position towards which someone or something moves or faces: \"No, go that way,\" I said, pointing in the opposite direction. He was going in the direction of the bedroom. They drove away in opposite directions. directions A2 [ plural ]\ninstructions that you give to someone about how to find a particular place: Can you give me directions to your house?\nSee more in someone's direction (also UK towards someone's direction); (also US toward someone's direction)\nB2 the area or position that someone is in: She keeps looking in my direction.\nSee more sense of direction\nB2 the ability to find places or to know which direction to go: a good sense of direction\nSee more\nMore examplesFewer examplesWe felt the plane bank steeply as it changed direction.Why will supermarket trolleys never move in the direction that you push them in?I was waving my hand madly but he never once looked in my direction.When he asked where the children were, she gestured vaguely in the direction of the beach.From the top, we could see for miles in every direction.\nSMART Vocabulary: related words and phrases\nDirection of motion\nabduct\nabduction\nadduct\nadduction\naround\ncircumduction\ncross-country\ndestined\ndirection of travel\nen route\nfacing\nfollow\ngo\ninland\ninto\noutbound\noverland\nright\nstraightly\nthe right/wrong/other way around idiom\nSee more results »\ndirection noun\n(CONTROL)\nC1 [ U ] control or instruction: The project was under the direction of a well-known academic. directions C1 [ plural ]\ninformation or orders telling you what to do: I couldn't understand the directions on the packet.\nSee more\nSMART Vocabulary: related words and phrases\nManaging and organizing\nadmin\nadminister\nadministration\nanti-bureaucracy\nbronze command\nflabbily\nget up\nget your act together idiom\ngold command\nhave/get your shit together idiom\nmobilize\nmount\nparty planner\nparty planning\nproject-manage\nrationalization\nrationalize\nrecentralization\nscrum\nwieldy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInstructions and orders\ndirection noun\n(DEVELOPMENT)\nC2 [ C or U ] the way that someone or something changes or develops: There is disagreement over the direction the project is taking. Her latest album represents a change of direction for her. This plan isn't perfect, but it's a step in the right direction.\nIdiom\nlack direction\ndirection noun\n(POSITION)\nAdd to word list\nAdd to word list\n[ C ] the position toward which someone or something moves or faces: Cars were facing every direction after slamming into each other on the icy road. I glanced in her direction (= toward her). You’re headed in the direction of (= toward) Toronto.\n[ pl ] Directions are instructions about how to find the place you are looking for: We’re lost – let’s stop and ask (for) directions .\ndirection noun\n(CONTROL)\n[ U ] the condition of being in charge or in control: Under her direction, the agency doubled in size."}