{"id":127145,"name":"dirty","type":"adjective","us_sound":"ˈdɝː.t̬i","us_link":"../audio/d/dirty.mp3","uk_sound":"ˈdɜː.ti","uk_link":"../audio/d/ukdirnd004.mp3","content":"dirty adjective\n(NOT CLEAN)\nAdd to word list\nAdd to word list\nA2 marked with dirt, mud, etc., or containing something such as pollution or bacteria: Her face was dirty and tear-stained. Don't drink the water—it's dirty. Dirty needles can cause serious infections. Synonyms\ncruddy\nfilthy (DIRTY)\ngrimy\ngrubby\ngrungy informal\nmucky informal\nseedy\nsoiled\nunclean\nThesaurus: synonyms, antonyms, and examples\nnot cleandirtyThis shirt is dirty.filthyWash your hands before dinner - they're filthy!scruffyHe's the typical scruffy student.messyBen's bedroom is always really messy.grimyDon't wipe your grimy hands on that clean towel!\nSee more results »\nMore examplesFewer examplesIt amazes me how you can put up with living in such a dirty house.There were dirty marks on her trousers where she had wiped her hands.You're treading muck into the carpet with your dirty shoes!You'd better roll your sleeves up or you'll get them dirty.Just put the dirty dishes in the washing-up bowl, and I'll do them later.\nSMART Vocabulary: related words and phrases\nDirty & untidy\nall over the place idiom\nAugean\nbesmeared\nbespattered\nbloodied\nlook like something the cat brought/dragged in idiom\nmanky\nmessily\nmessy\nmucky\nsluttish\nsluttishly\nsoiled\nsordid\nsordidly\nunsterilized\nuntidily\nuntidy\nuntrimmed\nunwashed\nSee more results »\ndirty adjective\n(NOT HONEST)\ninformal unfair, dishonest, or unkind: She played a dirty trick on me by telling me Diane was having a party when she wasn't. That's a dirty lie!\nSMART Vocabulary: related words and phrases\nDishonest\nartificiality\nbad faith\nbe rotten to the core idiom\nbent\ncowboy\nfalse\nfinagle\nfishy\nfly-by-night\nfraudulence\nmendacious\nmendaciously\nmisleading\nmisleadingly\nperjured\nunder false pretences phrase\nunderhand\nunreliability\nunreliable\nunscrupulous\nSee more results »\ndirty adjective\n(NOT POLITE)\ninformal used to describe something that is connected with sex, in a way that many people think is offensive: a dirty magazine/movie/joke You have a really dirty mind! Synonyms\nX-rated\nblue (SEXUAL)\ncoarse (RUDE)\ncrude (RUDE)\nexplicit\nfilthy (OFFENSIVE)\nindecent (IMMORAL)\nmucky UK informal\nobscene\noffensive (UPSETTING)\nrude (NOT POLITE)\nsalacious disapproving\nsmutty disapproving\nvulgar (RUDE) disapproving\ndirty adjective\n(UNHEALTHY)\nUK used to refer to unhealthy food such as burgers served in fashionable or expensive restaurants: We relish the forbidden, greasy pleasures of dirty food: burgers, ribs, and fried chicken. Idioms\ndo someone's dirty work\ndo the dirty on someone\ngive someone a dirty look\ndo the dirty work\ndirty great/big\nUK informal very great/big: The old power station's nothing but a dirty great blot on the landscape.\nSee more Idiom\nplay dirty\nto make something dirty: Don't sit on the floor - you might dirty your dress.\nSMART Vocabulary: related words and phrases\nMaking things dirty & untidy\nblacken\nblot\nclutter\ncontaminate\ndefile\ndisarrange\nmark\nmess\nmess something up\nmix\nmuddle\nmuddle something up\nmuss\npollute\npolluter\nrecontaminate\nself-contamination\nsoil\nstain\ntarnish\nSee more results »\nIdiom\ndirty your hands\ndirty adjective [-er/-est only]\n(NOT CLEAN)\nAdd to word list\nAdd to word list\nhaving esp. dirt on the surface of something: He left his dirty towels on the bathroom floor.\ndirty adjective [-er/-est only]\n(UNFAIR)\nunfair or dishonest: That was a dirty trick – telling me you were out of town when you were right here all the time!\nDirty is also used to emphasize how strongly you feel that something is wrong or bad: That’s a dirty lie!\ndirty verb [T]\n(GET DIRT ON)\nto allow something to get dirt on it: Don’t sit on the ground – you’ll dirty your new suit.\nAdd to word list\nAdd to word list\nunfair or dishonest: The rival company's dirty tricks campaign had cost it many millions of pounds. a dirty campaign/business dirty dealings/politics/tactics\nENVIRONMENT containing dangerous substances that may be harmful to the environment: dirty air dirty coal plants\ndo sb's dirty work\nto do something unpleasant or difficult for someone because they do not want to do it themselves: The building societies have done the chancellor's dirty work for him, by cutting the cost of a mortgage in anticipation of a base rate cut.\nquick and dirty\nproduced quickly and without spending much money: Developers make quick and dirty versions of the final product so that the client can interact with it and provide feedback."}