{"id":127414,"name":"disastrous","type":"adjective","us_sound":"dɪˈzæs.trəs","us_link":"../audio/d/disastrous.mp3","uk_sound":"dɪˈzɑː.strəs","uk_link":"../audio/d/ukdisap011.mp3","content":"Add to word list\nAdd to word list\nC1 extremely bad or unsuccessful: disastrous for Such a war would be disastrous for the country. This decision will have a disastrous impact on foreign policy. His first attempt was disastrous. Synonym\nfatal\nThesaurus: synonyms, antonyms, and examples\nnot producing a desired resultunsuccessfulOur attempts to change the law were unsuccessful.failedThe company went bankrupt pouring money into yet another failed product.badSales have been really bad this quarter.fruitlessAll our pleas that she remain in university were fruitless - she left anyway.unfruitfulThe negotiations were unfruitful.\nSee more results »\nMore examplesFewer examplesPollution can have disastrous effects on the delicately balanced ecosystem.No matter how disastrous the situation there always seems to be a funny side to it.I tried to repaint the kitchen walls with disastrous results.After a disastrous first month in office, many people are beginning to wonder if the new president is up to the job.The cumulative effect of using so many chemicals on the land could be disastrous.\nSMART Vocabulary: related words and phrases\nAccidents and disasters\naccident\naccidental\naccidentally\naccidentally on purpose idiom\nan accident waiting to happen idiom\ncalamitously\ncalamity\ncataclysm\ncataclysmic\ncataclysmically\ndisaster\ndisaster area\ndisastrously\ndumpster fire\nemergency\nmishap\nnatural disaster\nnon-emergency\nperfect storm\npost-accident\nSee more results »\nRelated word\ndisastrously\nAdd to word list\nAdd to word list\ncausing great harm, damage, or suffering: It was a disastrous mistake which he lived to regret. In 1837, there was a disastrous smallpox epidemic.\nfig. Something that is disastrous is a complete failure: His attempt to play the piano was disastrous."}