{"id":127254,"name":"disagree","type":"verb","us_sound":"ˌdɪs.əˈɡriː","us_link":"../audio/d/disagree.mp3","uk_sound":"ˌdɪs.əˈɡriː","uk_link":"../audio/d/ukdirnd015.mp3","content":"Add to word list\nAdd to word list\nB1 to not have the same opinion, idea, etc.: I'm afraid I have to disagree with you (on that issue). [ + that ] Few people would disagree that something should be done to reduce crime in the area. I profoundly/strongly disagree with (= do not accept) the decision that has been made. Opposite\nagree (SAY YES)\nThesaurus: synonyms, antonyms, and examples\nto argue with someoneargueThe kids are always arguing about something.have an argumentI had an argument with my sister.fightThe two sides continue to fight over control of the assembly.quarrelStop quarrelling, you two!rowUK My parents were always rowing about money.squabbleThey are still squabbling over who will get the big office.\nSee more results »\nIf two or more statements, ideas, sets of numbers, etc. disagree, they are not the same.\nMore examplesFewer examplesI sympathize with the general aims of the party, but on this particular issue I'm afraid I disagree.Let's not disagree for the sake of a few pounds.Certain members of the audience may disagree with what I'm about to say.Many of us in the editorial department disagree with the changes that are happening.We disagree on most things, but on this question we are at one with each other.\nSMART Vocabulary: related words and phrases\nArguing & disagreeing\nagent provocateur\nalienate\nalienated\nargue with someone\nargumentatively\nbandy\nbet\nbone\nconflict\ncross swords idiom\nhammer\nlock horns idiom\npiggy in the middle\nprovocateur\nquarrel\nsays who? idiom\nset someone against someone\nshadowbox\nshadowboxing\nthrow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDenying & contradicting\nBeing and appearing different\nPhrasal verb\ndisagree with someone\nAdd to word list\nAdd to word list\nto have a different opinion or be unable to agree: I disagree with you about that. Most scientists agree there is a risk, but disagree over the exact amount of risk. Phrasal verb\ndisagree with someone\nAdd to word list\nAdd to word list\nto not have the same opinion, idea, etc. as someone or to not agree with them: disagree about/on sth The two sides in the pay dispute strongly disagree about raises.disagree with sb The sales manager and project manager still disagree with each other on pricing and product development.\nif two or more reports, ideas, sets of numbers, etc. disagree, they are not the same: disagree about/on sth The studies disagreed, however, about whether shareholders of buying firms typically made tiny gains, or tiny losses."}