{"id":127159,"name":"disability","type":"noun","us_sound":"ˌdɪs.əˈbɪl.ə.t̬i","us_link":"../audio/d/eus71293.mp3","uk_sound":"ˌdɪs.əˈbɪl.ə.ti","uk_link":"../audio/d/ukdirnd005.mp3","content":"Add to word list\nAdd to word list\nB2 an illness, injury, or condition that makes it difficult for someone to do some things that other people do, and that is usually permanent or lasts for a long time: a physical/learning disability She is deaf, but refuses to let her disability prevent her from doing what she wants to do. Trying to change attitudes to disability is an uphill struggle. Compare\ninability\nMore examplesFewer examplesThey showed great courage when they found out about their baby's disability.Discrimination on the basis of race, gender, age, or disability is not allowed.His disability prevents him from driving.Most public places are simply not geared to the needs of people with disabilities.People tend to make assumptions about you when you have a disability.\nAdd to word list\nAdd to word list\na physical or mental condition that makes someone unable to act in a way that is considered usual for most people: [ C ] The law bars discrimination against those with disabilities. [ U ] The regulations apply to people unable to work because of disability.\nAdd to word list\nAdd to word list\n[ C ] an illness, injury, or medical condition that makes it difficult for someone to do the things that other people do: All service providers need to think about how they cater for customers with disabilities. If the injury caused by the job does not qualify as a disability, the employer is not legally obliged to find the employee other work. a physical/mental disability\n[ U ] the state of having an illness, injury, or medical condition that makes it difficult to do the things that other people do: The law prohibits workplace discrimination against employees because of disability, race, creed, color, sex, age, or national origin. short-term/long-term/permanent disability physical/mental disability disability allowance/claims/compensation\n[ U ]\n&#160; GOVERNMENT, FINANCE\n&#160; US money that is paid by the government to someone who cannot work because of an illness, injury, or medical condition: Terry used to work in a local factory but is now on disability because of an accident. a disability check"}