{"id":127962,"name":"discovered","type":"verb","us_sound":"dɪˈskʌv.ɚ","us_link":"../audio/d/discover.mp3","uk_sound":"dɪˈskʌv.ər","uk_link":"../audio/d/ukdisco016.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\ndiscover\nB1 [ T ] to find information, a place, or an object, especially for the first time: Who discovered America? We searched all morning for the missing papers and finally discovered them in a drawer. [ + question word ] Scientists have discovered how to predict an earthquake. [ + (that) ] She discovered (that) her husband was having an affair. [ + to infinitive ] Following a routine check-up, Mrs Mason was discovered to have heart disease. [ + obj + -ing verb ] The boss discovered him stealing money from the cash register.\nThesaurus: synonyms, antonyms, and examples\nto find someone or somethingfindI've looked everywhere for my keys but can't find them.discoverThe missing wallet was discovered under the chair.locatePolice are still trying to locate the suspect.uncoverReporters uncovered evidence of corruption.unearthOur investigation unearthed mountains of evidence that implicated the city.come acrossWe came across a lovely little restaurant in the village.\nSee more results »\n[ T often passive ] to notice that a person has a special ability or quality and to help them to become successful: Los Angeles is full of young actors working as waiters, hoping to be discovered by a movie agent.\nMore examplesFewer examplesShe was annoyed to discover that her husband had taken her car keys.They set out to discover a cure for cancer.Human rights campaigners have discovered documentary evidence of torture.The cause of the accident may never be discovered.Police discovered the body hidden in thick undergrowth.\nSMART Vocabulary: related words and phrases\nFinding and discovering\nascertain\nbreak (fresh/new) ground idiom\nbreakthrough\nbring something to light idiom\ncatch someone red-handed idiom\nflush someone/something out\nfossick\nfound\ngeocache\ngeocaching\npinpoint\nrake\nred-handed\nrediscover\nrediscovery\nrefind\nrefound\nsniff\nsuss\nuncover\nSee more results »\nRelated word\ndiscoverer"}