{"id":128036,"name":"discrimination","type":"noun","us_sound":"dɪˌskrɪm.əˈneɪ.ʃən","us_link":"../audio/d/discrimination.mp3","uk_sound":"dɪˌskrɪm.ɪˈneɪ.ʃən","uk_link":"../audio/d/ukdisco030.mp3","content":"discrimination noun [U]\n(DIFFERENT TREATMENT)\nAdd to word list\nAdd to word list\nC1 treating a person or particular group of people differently, especially in a worse way from the way in which you treat other people, because of their race, gender, sexuality, etc.: racial/sex/age discrimination Until 1986 most companies would not even allow women to take the exams, but such blatant discrimination is now disappearing.\nMore examplesFewer examplesAIDS victims often experience social ostracism and discrimination.There should be no discrimination on the grounds of colour.She believes the research understates the amount of discrimination women suffer.She will be remembered as an unrelenting opponent of racial discrimination.The law has done little to prevent racial discrimination and inequality.\nSMART Vocabulary: related words and phrases\nHuman rights\naffirmative action\nageism\nageist\nanti-discrimination\nanti-feminism\ndesegregation\ndiscriminate\ndistributive justice\ndiversity and inclusion\ndiversity, equity and inclusion\nfeminist\nfree speech\nfreedom\ngay liberation\ngay rights\nsexism\nsexist\nsister under the skin idiom\nsisterhood\nsuffragette\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnfairness and favouring someone unfairly\ndiscrimination noun [U]\n(SEEING A DIFFERENCE)\nformal the ability to see the difference between two things or people\nSMART Vocabulary: related words and phrases\nWise and sensible\nbe a victory for common sense idiom\ncannily\ncanny\nclear-headed\nclear-headedly\njudiciously\nlevel-headed\nlong-sightedness\nmethod\nneat\nresponsibility\nresponsible\nresponsibly\nright-minded\nsagacious\nvictory\nwell advised\nwily\nwisdom\nwise\nSee more results »\ndiscrimination noun [U]\n(WORSE TREATMENT)\nAdd to word list\nAdd to word list\nthe treatment of a person or particular group of people differently, in a way that is worse than the way people are usually treated: Some immigrants were victims of discrimination. The law made racial discrimination in employment a serious crime. She claims she is a victim of age discrimination.\npolitics &amp; government Discrimination is also prejudice against people and a refusal to give them their rights.\ndiscrimination noun [U]\n(SEEING A DIFFERENCE)\nthe ability to judge the quality of something based on its difference from other, similar things: He showed discrimination in his reading habits.\nAdd to word list\nAdd to word list\nthe practice of treating particular people, companies, or products differently from others, especially in an unfair way: He will work in partnership with a range of organizations to help eliminate discrimination against disabled people.victims/targets of discrimination People sometimes have difficulty perceiving themselves as victims of discrimination.discrimination on the basis of/grounds of sth Federal law bans discrimination on the basis of gender.discrimination between sth (and sth) The new laws reduce the possibility of unfair discrimination between companies seeking to list on the Exchange. racial/sex/age discrimination fight/prohibit/tackle discrimination The commission was created to address issues of discrimination in the workplace. allegations/claims/complaints of discrimination a discrimination case/lawsuit See also\nage discrimination\nemployment discrimination\ngenetic discrimination\npositive discrimination\nprice discrimination\nrace discrimination\nreverse discrimination\nsex discrimination\nworkplace discrimination"}