{"id":128014,"name":"discretion","type":"noun","us_sound":"dɪˈskreʃ.ən","us_link":"../audio/d/discretion.mp3","uk_sound":"dɪˈskreʃ.ən","uk_link":"../audio/d/ukdisco026.mp3","content":"discretion noun [U]\n(CAREFUL BEHAVIOUR)\nAdd to word list\nAdd to word list\nC2 the ability to behave without causing embarrassment or attracting too much attention, especially by keeping information secret: the soul of discretion \"Can you trust him with this?\" \"Yes, he's the soul of discretion (= he will not tell other people).\"\nSMART Vocabulary: related words and phrases\nPaying attention and being careful\nattention span\nattentiveness\nbe good, and if you can't be good, be careful idiom\nbe on (your) guard idiom\ncared-for\nguard\nhandle/treat someone with kid gloves idiom\nhang\nhang on/upon something\nhave a care idiom\nhave/keep your ear to the ground idiom\nreligion\nrevolve\nrevolve around someone/something\nsafety\nsafety first idiom\nsee past something\nsit\nzero\nZoom\nSee more results »\ndiscretion noun [U]\n(RIGHT TO CHOOSE)\nformal the right or ability to decide something: at the discretion of Students can be expelled at the discretion of the principal (= if the principal decides it). I leave the decision to your discretion (= for you to decide).\nSMART Vocabulary: related words and phrases\nDecisions and deciding\nascription\nbalance\nbe make or break for someone/something idiom\nbe on the horns of a dilemma idiom\nchoose\nclinch\nconclusion\nfix\nget it together idiom\nhammer something out\nhave a, some, etc. say in something idiom\nif/when it comes to the crunch idiom\nin the balance idiom\nresolution\nsleep\ntightrope\ntilt\ntilt the balance/scales idiom\ntop-down\ntoss up\nSee more results »\nIdiom\ndiscretion is the better part of valour\nAdd to word list\nAdd to word list\nchoice, or the right to make a choice, based on judgment: Troopers have discretion in deciding whom to stop for speeding. Whether or not to hold the meeting is at the discretion of the president (= a decision to be made by the president).\nAdd to word list\nAdd to word list\nthe right to choose something, or to choose to do something, according to what seems most suitable in a particular situation: at sb's discretion/at the discretion of sb Payment in lieu of notice to redundant workers is at the company's discretion.exercise/use (your) discretion Economic and institutional constraints can make it difficult for senior managers to exercise discretion in their decisions.leave it (up) to sb's discretion/leave it (up) to the discretion of sb Top-up insurance cover is left to the discretion of individuals and firms. Bankruptcy managers have discretion to decide disputes. broad/complete/considerable discretion Sales staff were given discretion to offer customers a 10% discount."}