{"id":127522,"name":"disc","type":"noun","us_sound":"dɪsk","us_link":"../audio/d/disc.mp3","uk_sound":"dɪsk","uk_link":"../audio/d/ukdisap021.mp3","content":"disc noun [C]\n(ROUND OBJECT)\nAdd to word list\nAdd to word list\nB2 mainly UK (US usually disk) a circular flat object: The dog's name was engraved on a little metal disc attached to its collar.\nB1 (US also disk) a musical record or a compact disc: She hopes to top the charts again with her third studio disc. A DVD is a five-inch disc that plays video as well as music. See also\nCD\nkyoshino/E+/GettyImages\nMore examplesFewer examplesFlatten the pastry into a thin disc with your hands.The sun looked like an orange disc, barely visible through the haze of gas and ash that filled the sky.His greatest hits album consists of 2 discs and over 40 songs.A gold disc is awarded when a million dollars worth of records are sold.\nSMART Vocabulary: related words and phrases\nSpherical, circular and annular objects\nair bubble\nball\nbead\nbobbin\nbobble\nbowling ball\ncylinder\ncylindrically\ndisk\ngame ball\nhoop\nknob\npearl\npelleted\nring\nroll\nsphere\nspheroid\nspool\ntubal\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSound and image recordings\ndisc noun [C]\n(IN BODY)\nC2 (US also disk) a small piece of cartilage (= strong body tissue that stretches) between the bones in your back: I was off work after suffering a ruptured disc in my back.\nMore examplesFewer examplesThe procedure cannot be used to heal herniated discs.Disc replacement may be a possible treatment for some forms of back pain.\nSMART Vocabulary: related words and phrases\nBone structures\nacetabular\nacetabulum\nacromial\nacromioclavicular\nacromion\nbreastbone\nendoskeleton\nilium\nintercarpal\nintercondylar\ninterlaminar\ninterosseous\nkneecap\nsacroiliac\nsacrospinous\nsacrotuberous\nsacrum\nsagittal\nshinbone\ntrapezium\nSee more results »\nSee also\ndisk\nAdd to word list\nAdd to word list\na disk\nDisc is also another name for a musical record or a CD: This recording is available on disc and on tape.\nAdd to word list\nAdd to word list\na flat circular object used for recording and storing music or films, for example, a CD or DVD\nIT a\ndisk See also\ncompact disc"}