{"id":127824,"name":"disconnection","type":"noun","us_sound":"ˌdɪs.kəˈnek.ʃən","us_link":"../audio/d/usdisar017.mp3","uk_sound":"ˌdɪs.kəˈnek.ʃən","uk_link":"../audio/d/ukdisci020.mp3","content":"disconnection noun [C or U]\n(OF APPLIANCE, SERVICE)\nAdd to word list\nAdd to word list\nthe action of unfastening something, especially breaking the connection between a device or piece of equipment and an electricity, gas or water supply, or the internet, etc. : This key lock prevents inadvertent disconnection of the computer. On several occasions there were accidental disconnections of the intravenous line.\nthe action of stopping the supply of a service such as electricity, gas, water, or phone to a place, especially because money has not been paid: Customers who don't pay the deposit within 10 days would face disconnection. The city temporarily stopped disconnections so that people would not lose service during the severe heat.\nan occasion when a phone connection is broken and the conversation cannot continue: They can identify the location of the phone at the time of disconnection.\nMore examplesFewer examplesThe judge ordered the disconnection of all computers that have access to individual trust data.It is useful to measure CO2 to indicate disconnection of the breathing system or ventilator.The gas company said she had been notified that she faced disconnection. The company reviewed its policies for disconnections following a lawsuit.\nSMART Vocabulary: related words and phrases\nCutting off and disconnecting\namputate\namputation\namputee\nBrexit\ncastration\nchop\nchop something off\ncrop\ncut back\ndisconnect\ndisconnected\ndismember\ndismemberment\ndissection\ndock\nnonconnection\npost-amputation\nsaw something off\nsever\nunjoined\nSee more results »\ndisconnection noun [C or U]\n(FEELING)\nthe feeling or fact of being separate from someone or something else, and not fitting well together or understanding each other: disconnection from In the book, she describes her sense of disconnection from her bourgeois suburban family. disconnection between One of the biggest problems was the disconnection between head office and the workforce. Many are suffering a vague disconnection, fueled by economic worries.\nMore examplesFewer examplesThere is, unfortunately, a widespread sense of disconnection between the country's institutions and its citizens.I experienced a feeling of immense disconnection from society at large.There is a disconnection between humans and other plant and animal species.He seems to suffer no after-effects from this terrible experience, and this kind of emotional disconnection appears throughout the book.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanother\nanything\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\ndistinction\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nnon-uniform\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nvariant\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLacking interest and enthusiasm\nMisunderstanding\nSee\ndisconnect"}