{"id":128000,"name":"discrepancy","type":"noun","us_sound":"dɪˈskrep.ən.si","us_link":"../audio/d/discrepancy.mp3","uk_sound":"dɪˈskrep.ən.si","uk_link":"../audio/d/ukdisco024.mp3","content":"Add to word list\nAdd to word list\na difference between two things that should be the same: discrepancy between There is some discrepancy between the two accounts.discrepancy in The committee is reportedly unhappy about the discrepancy in numbers.\nThesaurus: synonyms, antonyms, and examples\na differencedifferenceWhat's the difference between the two cars?distinctionThere's a clear distinction between the two countries' cultures.contrastI like the contrast of those red shoes with your black suit.discrepancyThere is some discrepancy between the two accounts.chasmThere is a widening chasm between public health officials and popular opinion.gulfPeace talks attempted to bridge the gulf between the two warring nations.\nSee more results »\nSMART Vocabulary: related words and phrases\nFaults and mistakes\naberration\nAchilles heel\nadrift\nblack mark\nblemish\nfailing\nfalse move\nfaux pas\nflaw\nfossilization\nmalapropism\nmisfunction\nmisperception\nmisprint\nmisspelling\nmisstep\ntypo\nwardrobe malfunction\nweakness\nwhat price...? idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDifferent and difference\nRelated word\ndiscrepant\nAdd to word list\nAdd to word list\nan unexpected difference, esp. in two amounts or two sets of facts or conditions, which suggests that something is wrong and has to be explained: There were troubling discrepancies between his public and private opinions on how to balance the budget.\nAdd to word list\nAdd to word list\na difference between two figures, results, etc. that are expected to be the same: A balance sheet review uncovered discrepancies totalling €30 million. Shareholders questioned the discrepancy between pay figures in the trust's annual report and those shown in the accounts. Employers will have 90 days to resolve discrepancies in their records. a huge/growing/wide discrepancyaccount for/explain a discrepancy An official spokesman refused to explain the discrepancy."}