{"id":128028,"name":"discriminate","type":"verb","us_sound":"dɪˈskrɪm.ə.neɪt","us_link":"../audio/d/discriminate.mp3","uk_sound":"dɪˈskrɪm.ɪ.neɪt","uk_link":"../audio/d/ukdisco028.mp3","content":"discriminate verb\n(TREAT DIFFERENTLY)\nAdd to word list\nAdd to word list\nC1 [ I ] to treat a person or particular group of people differently, especially in a worse way from the way in which you treat other people, because of their race, gender, sexuality, etc.: be discriminated against She felt she had been discriminated against because of her age.discriminate in favour of In order to increase the number of female representatives, the selection committee decided to discriminate in favour of women for three years.\nSMART Vocabulary: related words and phrases\nHuman rights\naffirmative action\nageism\nageist\nanti-discrimination\nanti-feminism\ndesegregation\ndiscrimination\ndistributive justice\ndiversity and inclusion\ndiversity, equity and inclusion\nfeminist\nfree speech\nfreedom\ngay liberation\ngay rights\nsexism\nsexist\nsister under the skin idiom\nsisterhood\nsuffragette\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnfairness and favouring someone unfairly\ndiscriminate verb\n(SEE A DIFFERENCE)\nC2 [ I + adv/prep ] formal to be able to see the difference between two things or people: discriminate between Police dogs can discriminate between the different smells.\nSMART Vocabulary: related words and phrases\nIdentifying\nascribe something to something\nascription\nbadged\nbadging\nband\ndistinguishable\ndistinguishably\ndistinguishing\ngeotag\nid\nidentity card\nmicrochip\nmicrochipped\nmisidentification\nmisidentify\npassport\npick\nstamp\ntell something/someone apart\ntraceable\nSee more results »\nRelated word\ndiscriminatory\ndiscriminate verb\n(TREAT WORSE)\nAdd to word list\nAdd to word list\n[ I ] to treat a person or particular group of people differently and esp. unfairly, in a way that is worse than the way people are usually treated: It is illegal to discriminate on the basis of race, sex, national origin, or age. They argued that whites in the area in the 1800s discriminated against the Lakota.\ndiscriminate verb\n(SEE A DIFFERENCE)\n[ I/T ] to be able to see the difference between two things or types of things: [ I ] We need to discriminate between stopgap methods and long-term solutions.\nAdd to word list\nAdd to word list\nto treat particular people, companies, or products differently from others, especially in an unfair way: Under the law, the state must administer its programs in ways that do not discriminate against anyone based on race.discriminate on the basis of/on the grounds of sth The board ruled that the company had committed \"unfair labor practices\" by discriminating on the basis of union membership.discriminate between sb/sth (and sb/sth) The government was accused of putting up tariffs and discriminating between domestic and foreign firms.\nto be able to recognize the difference between people or things: discriminate between sb/sth (and sb/sth) Conventional credit scoring systems do not reliably discriminate between good and bad payers among people in the 18 to 25 age group."}