{"id":127676,"name":"disclosure","type":"noun","us_sound":"dɪˈskloʊ.ʒɚ","us_link":"../audio/d/disclosure.mp3","uk_sound":"dɪˈskləʊ.ʒər","uk_link":"../audio/d/ukdisci008.mp3","content":"Add to word list\nAdd to word list\nthe act of making something known or the fact that is made known: disclosure of Any public disclosure of this information would be very damaging to the company. The newspaper made damaging disclosures of management incompetence. Synonym\nrevelation\nSMART Vocabulary: related words and phrases\nAnnouncing, informing & stating\nacquaint someone/yourself with something\nannunciation\napprise someone of something\navowedly\nawaken someone to something\nbreak\nbreathe/say a word idiom\ndisseminate\nimpart\nknown\non the record idiom\npass\nproclaim\npropagate\nput something before someone\nput something out\nput something out of its misery idiom\nrapporteur\nreportable\nstatement\nSee more results »\nAdd to word list\nAdd to word list\nsomething that was not previously known, or the act of giving such information to the public: [ C ] Some of the disclosures in the final report were very surprising. [ U ] Full financial disclosure is required.\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; FINANCE\n&#160; (also financial disclosure) a private financial record that a person or company must show to the government, investors, banks, etc. for business purposes, or the fact of making this record available: Her financial disclosure describes her work for the company as \"consulting/media/public relations.\" Disclosure of sales and operating profit has confirmed the company's growth within the electronics sector.\n[ U ]\n&#160; INSURANCE the act of making information available to an insurance company when you get insurance or make a claim (= ask for a payment), especially personal information about your health, age, etc.: Insurers may request the disclosure of existing genetic test results.\n[ C or U ]\n&#160; LAW private, personal, or secret information that you must tell to someone such as a court judge, the police, or a government organization, or the duty to give them this information: The FDA requires pharmaceutical companies to provide full disclosure about the risks of their drug products.\nCompare\nnon-disclosure"}