{"id":128081,"name":"discuss","type":"verb","us_sound":"dɪˈskʌs","us_link":"../audio/d/discuss.mp3","uk_sound":"dɪˈskʌs","uk_link":"../audio/d/ukdiscr004.mp3","content":"Add to word list\nAdd to word list\nA2 to talk about a subject with someone and tell each other your ideas or opinions: discuss something with someone The police want to discuss these recent racist attacks with local people.\nto talk or write about a subject in detail, especially considering different ideas and opinions related to it: The later chapters discuss the effects on the environment.\nThesaurus: synonyms, antonyms, and examples\nto be about somethingbe aboutWhat is the story about?have (got) to do withWhat's that got to do with it?relate toThat relates to what I was saying earlier about the need for reform.concernThe film concerns the complicated nature of marriage.coverWe will cover the passive voice later in the course.deal withWe will deal with the use of antidepressants in chapter three.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto talk about somethingtalk aboutI don't like talking about my feelings.speak aboutHe is often asked to speak about the decline of global energy supplies.discussWe need to discuss arrangements for next week.talk overI need to talk it over with my wife before I accept the job.talk throughWe're used to talking things through, so we don't have many arguments.debateThe bill will be debated in parliament next week.\nSee more results »\nMore examplesFewer examplesDraft a proposal for the project and we can discuss it at the meeting.Late last night, the French ambassador was summoned to the Foreign Office to discuss the crisis.I'm very interested in your idea - shall we discuss it over lunch?Stop shouting and let's discuss this reasonably.Sex never used to be discussed in polite society.\nSMART Vocabulary: related words and phrases\nDebate & discussion\nagent provocateur\nargue\nargue against something\nargue for something\nbargain\nbargainer\nbat around\ncontroversial\ncontroversialist\nfloat\nhash\nout-debate\noutbargain\npalaver\npanel discussion\npolarized\nsophism\ntendentious\nwash (something) up\nwell argued\nSee more results »\nAdd to word list\nAdd to word list\nto talk about something to other people, often exchanging ideas or opinions: We have been discussing the possibility of working together. [ + question word ] This booklet discusses how to invest money wisely."}