{"id":127965,"name":"discovery","type":"noun","us_sound":"dɪˈskʌv.ɚ.i","us_link":"../audio/d/discovery.mp3","uk_sound":"dɪˈskʌv.ər.i","uk_link":"../audio/d/ukdisco018.mp3","content":"discovery noun\n(FINDING)\nAdd to word list\nAdd to word list\nB2 [ C or U ] the process of finding information, a place, or an object, especially for the first time, or the thing that is found: discovery of Who is credited with the discovery of electricity?make a discovery Leonardo made many scientific discoveries. a journey/voyage of discoverydiscovery of The discovery of a body in the undergrowth started a murder enquiry.\nMore examplesFewer examplesScientists are on the brink of a major new discovery.The discovery of oil brought many benefits to the town.Various ecological issues have come to the fore since the discovery of the hole in the ozone layer.The two scientists both made the same discovery independently, at roughly the same time.Word of the discovery caused a stir among astronomers.\nSMART Vocabulary: related words and phrases\nFinding and discovering\nascertain\nbreak (fresh/new) ground idiom\nbreakthrough\nbring something to light idiom\ncatch someone red-handed idiom\nfossick\nfound\ngeocache\ngeocaching\nget hold of idiom\npinpoint\nrake\nrediscover\nrediscovery\nrefind\nrefound\nretrievable\nrumble\nsniff\nuncover\nSee more results »\ndiscovery noun\n(IN LAW)\nlaw\n&#160; specialized part of a legal process in which the lawyers from one side in a case give documents relating to their case to the other side, before the trial begins: in discovery Among the thousands of documents Litt was able to obtain in discovery from the city was a memo written by a councilman's aide in response to one resident's complaint.\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\ndiminished responsibility\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\nflight risk\npower of attorney\nprecedent\npretrial\nprobate\nprovide\nthe Webster ruling\nwitness to something\nwobbler\nSee more results »\nAdd to word list\nAdd to word list\nthe act of finding something that had not been known before: [ C ] Many scientific discoveries have been made by accident. [ U ] The discovery of gold in California opened up the west.\nA discovery is also something that you did not know about before: [ C ] It was quite a discovery when I came upon this beautiful mountain stream."}