{"id":128017,"name":"discretionary","type":"adjective","us_sound":"dɪˈskreʃ.ən.er.i","us_link":"../audio/d/discretionary.mp3","uk_sound":"dɪˈskreʃ.ən.ər.i","uk_link":"../audio/d/ukdisco027.mp3","content":"Add to word list\nAdd to word list\nable to be decided by a particular person or group, rather than being controlled by rules, or relating to the power to make these decisions: discretionary powers Judges have great discretionary powers.discretionary sentencing Discretionary sentencing is intended to take into account the range of possible aggravating and mitigating factors in any serious crime. These pay rises are purely discretionary.discretionary grant/bonus/award All contributors will receive a discretionary grant/bonus/award.\nfinance &amp; economics\n&#160; specialized relating to things that you pay for that are not considered completely necessary, or to money spent on these things: discretionary spending Households have already cut back on discretionary spending amid worries about the economic outlook.discretionary purchases Consumer spending has shrunk, with most people cutting back on discretionary purchases, such as hotel stays.discretionary income He suggests that any discretionary income should be used to pay off loans before using it to make investments. Opposite\nnon-discretionary\nfinance &amp; economics, law\n&#160; specialized A discretionary fund (= an amount of money saved or invested for someone) allows the person who manages the fund to make decisions about how the money in it is managed and used, without asking the person who the money belongs to: discretionary trust Trustees of a discretionary trust may be able to decide which beneficiary to make payments to and how often payments are made. With a discretionary account, a broker makes trades for you. Opposite\nnon-discretionary\nMore examplesFewer examplesThere are many points in the sentencing process where prosecutors and judges can exercise discretionary authority to reduce drug sentences.School districts have discretionary funds that they can use for activities such as athletics.Senior managers are eligible for discretionary bonuses.Company contributions to the employee's pension scheme are discretionary, based on the company's profitability.It's a discretionary expenditure — you don't have to buy the tickets.Sales of discretionary items such as jewellery and furniture have suffered the most.\nSMART Vocabulary: related words and phrases\nDecisions and deciding\nascription\nbalance\nbe make or break for someone/something idiom\nbe on the horns of a dilemma idiom\nchoose\nclinch\nconclusion\nfix\nget it together idiom\nget something into your head idiom\nhammer something out\nhave a, some, etc. say in something idiom\nif/when it comes to the crunch idiom\nresolution\nsleep\ntake the plunge idiom\ntightrope\ntilt\ntilt the balance/scales idiom\ntop-down\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPower to control\nPaying money\nInvesting money\nAdd to word list\nAdd to word list\navailable to someone by choice, without having to get permission or authority: Once your kids have discretionary money of their own, they can pay for their own DVDs.\nAdd to word list\nAdd to word list\nACCOUNTING used to describe an amount of money in a budget that can be reduced if necessary: discretionary expenditure/spending He renewed his call on the Legislature to freeze discretionary funds already approved but not spent.\nFINANCE allowed or decided according to what is considered suitable in a particular situation: discretionary benefits/bonuses/payments The draft law gives companies discretionary power to block merger and acquisition deals with foreign investors.\nFINANCE relating to an arrangement in which an investment manager or broker has the authority to make investment decisions without instructions from their client: Wealth management companies offer discretionary and advisory services to those with more than £100,000 to invest."}