{"id":127818,"name":"disconnect","type":"verb","us_sound":"ˌdɪs.kəˈnekt","us_link":"../audio/d/disconnect.mp3","uk_sound":"ˌdɪs.kəˈnekt","uk_link":"../audio/d/ukdisci018.mp3","content":"Add to word list\nAdd to word list\nto unfasten something, especially to break the connection between a supply of electricity, gas, water, etc. and a device or piece of equipment: disconnect something from something Never try to fix a broken machine without disconnecting it from the electricity supply.\nto stop supplying electricity/gas/water/phone services, especially because money has not been paid\nIf you are disconnected while speaking on the phone, the phone connection is suddenly broken and you can no longer continue your conversation.\nSMART Vocabulary: related words and phrases\nCutting off and disconnecting\namputate\namputation\namputee\nBrexit\ncastration\nchop\nchop something off\ncrop\ncut back\ndisconnected\ndisconnection\ndismember\ndismemberment\ndissection\ndock\nnonconnection\npost-amputation\nsaw something off\nsever\nunjoined\nSee more results »\nRelated word\ndisconnection\na situation in which two or more things are not connected in the way that they should be: disconnect between The study found a disconnect between the state's social programs and some people who need government assistance. Synonym\ngulf\nSMART Vocabulary: related words and phrases\nCutting off and disconnecting\namputate\namputation\namputee\nBrexit\ncastration\nchop\nchop something off\ncrop\ncut back\ndisconnected\ndisconnection\ndismember\ndismemberment\ndissection\ndock\nnonconnection\npost-amputation\nsaw something off\nsever\nunjoined\nSee more results »\nAdd to word list\nAdd to word list\nto break a connection that carries a substance or electricity, or to break such a connection used by someone or something: He disconnected a gas line. Carefully tip the grill on its back and disconnect the burner from the gas valves. Our phone was disconnected (= turned off by the telephone company).\nIf you are disconnected while speaking on the telephone, the telephone connection is suddenly stopped and you can no longer continue your conversation.\na lack of connection; a failure of two things to relate: There’s a disconnect between the public and the media.\nAdd to word list\nAdd to word list\n[ T ] to stop a machine or piece of equipment being connected to a supply of electricity, gas, water, etc.: The electricity board threatened to disconnect the supply.disconnect sth from sth Always disconnect the computer from the mains before you remove the lid.\n[ I or T ]\n&#160; IT, INTERNET to stop being connected to the internet: be/get disconnected Our broadband keeps getting disconnected. If the signal is still weak, try disconnecting from your current network and using a different wireless connection.\n[ T ]\n&#160; COMMUNICATIONS if you are disconnected while talking on the phone, your phone service stops working and interrupts your conversation: If we get disconnected, I'll call you right back.\na situation in which two or more things are not connected in the way that they should be: a disconnect between sth and sth The study found a disconnect between the state's social program and some people who need government assistance."}