{"id":127913,"name":"discount","type":"noun","us_sound":"ˈdɪs.kaʊnt","us_link":"../audio/d/discount_01_00.mp3","uk_sound":"ˈdɪs.kaʊnt","uk_link":"../audio/d/ukdisco008.mp3","content":"Add to word list\nAdd to word list\nA2 a reduction in the usual price: give someone a discount They usually give you a discount if you buy multiple copies.discount on They offer a ten percent discount on travel for students.\nMore examplesFewer examplesIt was the offer of a large discount on the TV that was the real clincher.There is a 25% discount on all electrical goods until the end of the week.Students and pensioners are entitled to a discount.The discount applies only to children under (the age of) ten.People who work in the trade can buy their books at a discount.\nSMART Vocabulary: related words and phrases\nPrice decreases\nbargain\nbear market\nbearish\nbearishly\ncloseout\nconcessional\ncouponer\ncouponing\ndeflate\ndeflation\ndepreciate\ndevalue\ndrop off\nfreeze\nknock off (something)\nmark something down\noverdiscount\npost-devaluation\nprojected value\nspiral\nSee more results »\ndiscount verb\n(NOT CONSIDER)\n[ T ] to decide that something or someone is not worth considering or giving attention: You shouldn't discount the possibility of him coming back.\nSMART Vocabulary: related words and phrases\nExcluding\nacid-free\napart\naside\nbar\nbar none idiom\nbarring\ncount\nexclude\nexcluding\nexclusion\nexclusionist\nexclusive\nexclusively\nnegative\non/from the sidelines idiom\nostracism\nostracize\notherwise\nout of it idiom\nstand-alone\nSee more results »\ndiscount verb\n(REDUCE)\n[ T often passive ] to reduce the price of something: discounted goods/rates\nSMART Vocabulary: related words and phrases\nPrice decreases\nbargain\nbear market\nbearish\nbearishly\ncloseout\nconcessional\ncouponer\ncouponing\ndeflate\ndeflation\ndepreciate\ndevalue\ndrop off\nfreeze\nknock off (something)\nmark something down\noverdiscount\npost-devaluation\nprojected value\nspiral\nSee more results »\nAdd to word list\nAdd to word list\na reduction in the usual price for something: Students receive a 10 percent discount. He gets a senior citizen discount at the theater.\ndiscount verb [T]\n(NOT CONSIDER)\nto decide that something or someone is not worth consideration or attention: He discounted fears about computer programming problems involving the year 2000 as exaggerated.\ndiscount verb [T]\n(REDUCE PRICE)\nto reduce the usual price for something: The airline has discounted domestic fares.\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; COMMERCE a reduction in the usual price of a product or service: get/receive a discount You get a discount if you buy four ink cartridges.give/offer a discount Car manufacturers are offering discounts of up to 15% on all new models.huge/deep/big discount They purchased the stock at a huge discount. The price without discount will be around $55.\n[ C, usually singular ]\n&#160; FINANCE the difference between the reduced price that you originally paid for a security, and the amount you will be paid back when it is ready to be paid: All these securities are sold at a discount to their par value. See also\nbanker's discount\nbond discount\nbulk discount\ncash discount\ncase rate discount\ndeep discount\nfrequency discount\nno claims bonus\ntrade discount\nvolume discount\n[ T ]\n&#160; COMMERCE to sell a product or service for less than the usual price: Our entire inventory is discounted below retail prices.discount sth by 55%/a quarter, etc. The initial charges will be 5.25%, discounted by 2% to 3.25 % until 31 January.\n[ T, usually passive ]\n&#160; STOCK MARKET if shares are discounted, they go down in price, often following bad news: Stocks were being discounted because of political concerns related to the upcoming election.\n[ T ]\n&#160; FINANCE to buy a bill of exchange before its payment date at a price that is lower than its value, in order to make a profit when it is paid on its payment date: If an exporter has good credit, the bank may purchase or discount his collection bills.\nCOMMERCE →\ndiscounted : discount airfares/tickets/hotels\nFINANCE, STOCK MARKET →\ndiscounted : discount bills of exchange"}