{"id":127642,"name":"discipline","type":"noun","us_sound":"ˈdɪs.ə.plɪn","us_link":"../audio/d/discipline.mp3","uk_sound":"ˈdɪs.ə.plɪn","uk_link":"../audio/d/ukdisci004.mp3","content":"discipline noun\n(TRAINING)\nAdd to word list\nAdd to word list\nB2 [ U ] training that makes people more willing to obey or more able to control themselves, often in the form of rules, and punishments if these are broken, or the behaviour produced by this training: parental/military/school discipline There should be tougher discipline in schools.(self) discipline I don't have enough (self) discipline to save money.\n[ U ] the ability to control yourself or other people, even in difficult situations: Maintaining classroom discipline (= control of the students) is the first task of every teacher.\nMore examplesFewer examplesIn some of these schools, army-style drills are used to instil a sense of discipline.The new teacher had failed to enforce any sort of discipline.Problems arise if the parents' approach to discipline is inconsistent.He's always harping on about lack of discipline.Several of the teachers were ineffectual at maintaining discipline.\nSMART Vocabulary: related words and phrases\nTeaching in general\nasynchronous\nchief academic officer\nCLIL\nclue\nclue in\ncommunicative\ndidactic\nhothouse\ninstruct\nmiseducation\nMoodle\nmulti-course\nnon-conditioned\nnon-didactic\nsocialization\nsocializing\nspecial education\nSRE\nsynchronous\ntutelage\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPower to control\ndiscipline noun\n(SUBJECT)\nC2 [ C ] a particular area of study, especially a subject studied at a college or university\nSMART Vocabulary: related words and phrases\nSubjects & disciplines\n-ological\nAfrocentrism\nandragogy\nAP\napplicative\napplied\nfunctional skills\nfuturology\nGermanist\nglaciology\nhard science\nology\nontology\noology\norientalist\nsports scientist\nstem\nsubscience\nsuicidology\ntechnical\nSee more results »\ndiscipline verb\n(PUNISH)\n[ T ] to punish someone: be disciplined for A senior army officer has been disciplined for revealing secret government plans to the media.\nSMART Vocabulary: related words and phrases\nPunishing & punishments\nankle bracelet\nankle tag\nattach\nball and chain\nbar\nbe brought/called to account idiom\nendorse\nendorsement\nexcommunication\nfixed penalty\nflay\nflay someone alive idiom\nget what's coming to you idiom\npenalty\nsentence\nskin someone alive idiom\nslam dunk\nsomeone should be shot idiom\nsort\nsort something out\nSee more results »\ndiscipline verb\n(CONTROL)\n[ T ] to teach someone to behave in a controlled way: [ + to infinitive ] I'm trying to discipline myself to eat less chocolate.\nSMART Vocabulary: related words and phrases\nTeaching in general\nasynchronous\nchief academic officer\nCLIL\nclue\nclue in\ncommunicative\ndidactic\nhothouse\ninstruct\nmiseducation\nMoodle\nmulti-course\nnon-conditioned\nnon-didactic\nsocialization\nsocializing\nspecial education\nSRE\nsynchronous\ntutelage\nSee more results »\ndiscipline noun\n(TRAINING)\nAdd to word list\nAdd to word list\n[ U ] training that produces obedience or self-control, often in the form of rules and punishments if these are broken, or the obedience or self-control produced by this training: military discipline\n[ U ] Discipline is also the ability to control a mental activity: Learning a foreign language requires discipline.\ndiscipline noun\n(SUBJECT)\n[ C ] a particular area of study, esp. a subject studied at a college or university: an academic discipline\ndiscipline verb [T]\n(PUNISH)\nto punish someone: He was disciplined for his bad conduct.\nAdd to word list\nAdd to word list\n[ U ] the practice of making sure that people obey rules and do not cause problems: Personnel rules are used to govern worker conduct and impose discipline on violators. the strict discipline of prison\n[ U ] (also self-discipline) the ability to make yourself do something, even if it is difficult, so that you can achieve a goal: the discipline to do sth Working for a large firm gave him the confidence and discipline to start his own business. For most people, saving money requires a lot of self-discipline.\n[ C ] a subject or a particular type of work: Our company actively recruits graduates for a wide range of disciplines including engineering, science, and business.\nHR to deal with a worker who does not obey company rules, for example by giving them a written warning: discipline sb for (doing) sth He was disciplined for serious misconduct.\nto carefully control the way that you work, live, or behave, especially to achieve a goal: discipline yourself to do sth Discipline yourself to clear out old files on a regular basis."}