{"id":127939,"name":"discourse","type":"noun","us_sound":"ˈdɪs.kɔːrs","us_link":"../audio/d/discourse.mp3","uk_sound":"ˈdɪs.kɔːs","uk_link":"../audio/d/ukdisco012.mp3","content":"Add to word list\nAdd to word list\n[ C or U ]\n&#160; language\n&#160; specialized the use of language to communicate in speech or writing, or an example of this: spoken discourse Ellipsis is a characteristic feature of spoken discourse. They may have difficulty in retrieving words and organizing a complex discourse. See also\ndiscourse analysis\ndiscourse marker\n[ C or U ] formal discussion or debate (= formal or political argument), or an example of this: the discourse On social media, angry and aggressive voices seem to dominate the discourse.the public discourse These ideas have been part of the public discourse for years.the political discourse He accused the media of \"dumbing down\" the political discourse.discourse between I am worried these events could poison discourse between our nations for years to come.discourse with We need to have a discourse with the public about our work and how it is funded.\n[ C ] formal a speech or piece of writing about a particular, usually serious, subject: discourse on She gave a discourse on the nature of life after death. The essay was a discourse on the country's future energy needs. He then began a long discourse explaining why I was wrong.\nThesaurus: synonyms, antonyms, and examples\na talktalkShe will give a talk on keeping kids safe on the internet.lectureThe lecture is entitled \"War and the Modern American Presidency\".presentationWe were given a presentation of progress made to date.speechYou might have to make a speech when you accept the award.addressHe took the oath of office then delivered his inaugural address.orationIt was to become one of the most famous orations in American history.\nSee more results »\nMore examplesFewer examplesEmails and online chat exhibit features that were not formerly seen in written discourse.She argued that children do not acquire the ability to fully organize their extended discourse until relatively late in their primary school years.He was unused to verbal discourse with the outside world.Acrimony has characterized much of their discourse.A literary work can be seen as a discourse between a writer and reader.We hope that reasonable and respectful discourse will be possible.He gave an enthusiastic discourse on the new astronomical discoveries.\nSMART Vocabulary: related words and phrases\nLinguistics: terminology & vocabulary\nabbreviated form\naccommodation\nalphabetic\nAmericanism\nAnglicism\nantonymous\nbuzzword\ncognate\ncoinage\nhomographic\nhomography\nhomonymic\nhomonymy\nhomophonic\npalindrome\npragmatics\nproductive\nproductively\nreceptive\nreceptively\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDebate & discussion\nLecturing & addressing\nGrammar\nDiscourse markers (so, right, okay)Discourse markers are words or phrases like anyway, right, okay, as I say, to begin with. We use them to connect, organise and manage what we say or write or to express attitude: …\nDiscourse markers that organise what we saySome discourse markers are used to start and to end conversations. Some are used to start new topics or to change topics. …\nDiscourse markers that monitor what we sayAs we talk, we monitor (or listen to) what we are saying and how our listener is responding to what they hear. We often rephrase or change what we say depending on how our listener is responding. We use words and phrases such as well, I mean, in other words, the thing is, you know, you know what I mean, you see, what I mean is. …\nDiscourse markers as responsesAs we listen to someone speaking, we usually show our response to what we hear either by gesture (head nod) or by a short response (Mm, yeah, really, that’s a shame). This shows that we are listening to and interested in what is being said. We call these short responses ‘response tokens’. …\nDiscourse markers showing attitudeSome expressions are used to mark attitude or point of view in speaking or writing. …\nDiscourse markers: sounding less directWe are careful when we speak not to sound too direct or forceful. We use words and phrases such as like, maybe, sort of to soften what we say (hedges). …\nDiscourse markers: um and ermWe can use um to introduce a new topic carefully: …\nDiscourse markers: interjections (Oh! Gosh!)An interjection is a single-word exclamation such as hooray, oops, ouch which shows a positive or negative emotional response: …\nto talk or write about a subject, especially for a long time and in a way that suggests you know a lot about it: discourse on We see him discoursing on family life while neglecting his own children.\nto have a conversation or discussion: discourse with Scientists must be prepared to discourse with non-scientists.\nMore examplesFewer examplesHe seems happy to discourse at length on any subject.The festival features writers, historians, and scientists discoursing on a wide range of topics.In one interview, he discoursed for four hours, barely pausing for breath.They discoursed on various matters until dinner was served.\nSMART Vocabulary: related words and phrases\nLecturing & addressing\nad lib\nco-present\neunoia\nextemporize\nfloor\njawbone\nlead off\nlightning talk\nmaiden speech\nmonologue\nonto\noratorically\npresentation\nsermon\nsermonize\nspeak\nspeech\nspeechify\ntalk at someone\nvalediction\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDebate & discussion\nInformal talking & conversation\nAdd to word list\nAdd to word list\nliterature spoken or written discussion: [ U ] political discourse [ C ] The play is a wonderful discourse on love."}