{"id":128043,"name":"discriminatory","type":"adjective","us_sound":"dɪˈskrɪm.ə.nə.tɔːr.i","us_link":"../audio/d/discriminatory.mp3","uk_sound":"dɪˈskrɪm.ɪ.nə.tər.i","uk_link":"../audio/d/ukad5074.mp3","content":"Add to word list\nAdd to word list\ntreating a person or group differently from and usually worse than other people, because of their race, gender, sexuality, etc.: discriminatory practices Business leaders must take a stand against discriminatory practices.discriminatory treatment She criticizes what she sees as discriminatory treatment of overweight people.racially discriminatory He argued that the justice system was racially discriminatory. See\ndiscriminate\nThesaurus: synonyms, antonyms, and examples\nunfairunfairThey objected to the state's unfair treatment of dissenters. unjustThey protested unjust laws.biasedThe newspaper gave a very biased report of the meeting.slantedThe report was slanted in favour of the developers.discriminatoryThe company has a zero-tolerance policy toward discriminatory practices.prejudicedIt is well known that the company is prejudiced against older workers and refuses to hire anyone over the age of 50.\nSee more results »\nMore examplesFewer examplesWe see it as a very unfair and discriminatory tax on our industry.He criticized what he called their discriminatory immigration policy.Students claimed the all-male society was discriminatory against women.This legislation is blatantly discriminatory.\nSMART Vocabulary: related words and phrases\nUnfairness and favouring someone unfairly\nableism\nableist\nagism\nagist\nAnglocentric\ndiscrimination\ndiscriminative\ndiscriminatorily\ndrumhead\nelitism\none-sided\none-sidedly\none-sidedness\none-way\nthe old school tie\ntwo-tier\nunbalance\nunequal\nunequally\nuneven\nSee more results »\nAdd to word list\nAdd to word list\nunfairly treating a person or particular group of people differently from others: discriminatory practices\nAdd to word list\nAdd to word list\ntreating particular people, companies, or products differently from others, especially in an unfair way: The EU has already denounced the new regulations as discriminatory. Several hundred Sikh women complained about discriminatory treatment by the company. discriminatory laws/legislation/measures discriminatory policies/practices"}