{"id":127928,"name":"discourage","type":"verb","us_sound":"dɪˈskɝː.ɪdʒ","us_link":"../audio/d/eus71300.mp3","uk_sound":"dɪˈskʌr.ɪdʒ","uk_link":"../audio/d/ukdisco009.mp3","content":"discourage verb [T]\n(MAKE LESS CONFIDENT)\nAdd to word list\nAdd to word list\nB2 to make someone feel less confident, enthusiastic, and positive about something, or less willing to do something: The thought of how much work she had to do discouraged her. Opposite\nencourage\nMore examplesFewer examplesDon't let me discourage you if it's what you want to do.Her criticism had discouraged him.Don't let her comments discourage you.It discouraged me to hear so little enthusiasm for the project.I don't want to discourage her - merely inject a note of realism.\nSMART Vocabulary: related words and phrases\nDiscouraging and putting off\naversive\ndaunt\ndaunting\ndauntingly\ndeadening\ndeterrent\ndiscouragement\ndiscouraging\ndiscouragingly\ndisempower\ndishearteningly\ndisincentive\nemasculate\nemasculation\npour/throw cold water on something idiom\nput a spoke in someone's wheel idiom\nspoke\ntake the wind out of someone's sails idiom\nthrow\nthrow cold water on something idiom\nSee more results »\ndiscourage verb [T]\n(PREVENT)\nB2 to prevent or try to prevent something happening or someone doing something, by making things difficult or unpleasant, or by showing disapproval: a campaign to discourage people from smoking The authorities have put tanks on the streets to discourage any protest. Opposite\nencourage\nMore examplesFewer examplesWe need tougher penalties to discourage miscreants.Leaving an outside light on after dark can discourage a potential burglar.Police fired rubber bullets to disperse the crowds and to discourage looters who ransacked shops and set fire to cars.A new campaign is aimed at discouraging children from watching too much television.The shop employs uniformed security guards to discourage shoplifters.\nSMART Vocabulary: related words and phrases\nPreventing and impeding\nanti-jamming\navoid\navoidable\navoidably\nbar\nbottleneck\nderail\nfireproof\nhead off\nhinder\nhogtie\nhold back\nhold/keep someone/something at bay idiom\nprevent\npreventable\npreventative\nprevention\nprevention is better than cure idiom\nscuttle\nsmother\nSee more results »\nRelated word\ndiscouraging\ndiscourage verb [T]\n(MAKE LESS CONFIDENT)\nAdd to word list\nAdd to word list\nto cause someone to feel less confident or less hopeful: She sometimes got discouraged about her social life, which was going nowhere, she felt.\ndiscourage verb [T]\n(PREVENT)\nto try to prevent something from happening or someone from doing something, or to have the effect of making something less likely: We tried to discourage him from spending so much money. Higher taxes could discourage business investment. The tough competition discourages many athletes from making a serious attempt to make the Olympic team."}