{"id":127591,"name":"discharge","type":"verb","us_sound":"dɪsˈtʃɑːrdʒ","us_link":"../audio/d/discharge_01_00.mp3","uk_sound":"dɪsˈtʃɑːdʒ","uk_link":"../audio/d/ukdisap029.mp3","content":"discharge verb\n(ALLOW TO LEAVE)\nAdd to word list\nAdd to word list\n[ T ] to allow someone officially to leave somewhere, especially a hospital or a law court: be discharged from Patients were discharged from the hospital because the beds were needed by other people. More than half of all prisoners discharged are reconvicted within two years.be conditionally discharged UK A peace protester was conditionally discharged for twelve months (= allowed to go free only if they do not commit a crime again for this period of time).\nSMART Vocabulary: related words and phrases\nNot punishing & reducing punishment\nabsolve\namnesty\ncommutation\ndiplomatic immunity\ndiversion\nget away with murder idiom\nget off\nget off lightly phrase\nhook\nimpunity\nlet someone off\nlightly\noff the hook idiom\nprivilege\nreprieve\nroyal pardon\nscot-free\nspare\nunpunished\nunsanctioned\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLiberating, relaxing and releasing\ndischarge verb\n(SEND OUT)\n[ I or T ] to send out a substance, especially waste liquid or gas: Large amounts of dangerous waste are discharged daily by the factory.discharge into The oil that discharged into the sea seriously harmed a lot of birds and animals.\nSMART Vocabulary: related words and phrases\nEmitting and ejecting\ndisplace\ndisplaced\ndisplacement\nejaculation\neject\nejection\nejector\nemission\nemit\nemitter\nexpel\nexpulsion\nexude\npuff\nre-emission\nre-emit\nsend\nsend something out\nshed\ntoss\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMovement of liquids\ndischarge verb\n(PERFORM)\n[ T ] formal to perform a task, especially an official one: discharge a duty The city must discharge its legal duty to house the homeless. discharge (a) debt formal (also discharge someone's debt)\nto pay back or cancel a debt completely: She filed for bankruptcy in 2010 and discharged her debts the following year.\nSee more\nSMART Vocabulary: related words and phrases\nPerforming a function\nact as something\nfunction as something/someone\nfunctional\nfunctionalist\nhigh-performance\nhyperfunction\nmake\nman\nmanned\nmultifunction\nmultifunctional\non\non it idiom\noperate\noperation\npurpose\nserve\ntake\nwork\nwork a treat idiom\nSee more results »\ndischarge verb\n(FIRE GUN)\n[ T ] formal to fire a gun, or to fire a shot from a gun: The police stated that some 50 rounds had been discharged.\nSMART Vocabulary: related words and phrases\nGuns\nblaster\nblaze\ncannon\ncannonade\ncannonball\ncock\ngo off\ngunnery\ngunpoint\ngunsmith\nkick\nmachine gun\nplug\npot\nsalvo\nsemi-automatically\nsemiautomatic\nshoot something down\nshoot up\nshooter\nSee more results »\ndischarge noun\n(PERMISSION TO LEAVE)\n[ C or U ] official permission to leave the armed forces, a prison, or a hospital: discharge from He returned home following his discharge from the Army.give someone a conditional discharge UK The judge gave him a one-year conditional discharge.\nSMART Vocabulary: related words and phrases\nNot punishing & reducing punishment\nabsolve\namnesty\ncommutation\ndiplomatic immunity\ndiversion\nget away with murder idiom\nget off\nget off lightly phrase\nhook\nimpunity\nlet someone off\nlightly\noff the hook idiom\nprivilege\nreprieve\nroyal pardon\nscot-free\nspare\nunpunished\nunsanctioned\nSee more results »\ndischarge noun\n(SUBSTANCE)\n[ C or U ] the act of sending out waste liquid or gas: discharge of Thousands of fish were killed as a result of a discharge of poisonous chemicals from a nearby factory.\n[ C or U ] liquid matter that comes from a part of the body and is often infected: a vaginal discharge\nSMART Vocabulary: related words and phrases\nMovement of liquids\nbacksplash\nbe dripping with something idiom\ncounter-stream\ndecant\ndrainage\ndrip\nfunnel\nleakage\nreinjection\nrespray\nripple\nrun a bath phrase\nrun someone/something over\nrunnel\nspate\nswash\nswill\nswirl\nswirling\ntop something up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal physiology: bodily fluids & their production\ndischarge noun\n(PERFORMANCE)\n[ U ] formal the performance of duties or payment of money that is owed: the discharge of his duties\nSMART Vocabulary: related words and phrases\nPaying money\n2FA\n2SV\nante up (something)\nburn a hole in someone's pocket idiom\nchargeable\ncost-cutting\ndiscretionary\nlash out (something)\npay top dollar idiom\nreimburse\nrepay\nsettle an account idiom\nshell (something) out\nshortchange\nsink into something\nspend\nspend money like water idiom\nspent\nsplurge\nsponsor\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPerforming a function\ndischarge noun\n(FIRING GUN)\n[ U ] formal the action of firing a gun\nSMART Vocabulary: related words and phrases\nGuns\nblaster\nblaze\ncannon\ncannonade\ncannonball\ncock\ngo off\ngunnery\ngunpoint\ngunsmith\nkick\nmachine gun\nplug\npot\nsalvo\nsemi-automatically\nsemiautomatic\nshoot something down\nshoot up\nshooter\nSee more results »\ndischarge verb\n(ALLOW TO LEAVE)\nAdd to word list\nAdd to word list\n[ T ] to allow someone to leave: Allen was discharged from the hospital yesterday.\n[ T ] Someone who is discharged from a job is asked to leave it.\ndischarge verb\n(SEND OUT)\n[ I/T ] to send out a substance, esp. waste matter: [ I ] The soapy water from the washing machine will discharge directly into the waste line.\ndischarge verb\n(SHOOT)\n[ I/T ] to shoot a gun: [ I ] A gun accidentally discharged.\ndischarge verb\n(PERFORM)\n[ T ] fml to perform a duty, esp. an official one: He continued to discharge his duties as administrator of the fund.\ndischarge noun [C/U]\n(LEAVING )\nthe act of asking or allowing someone to leave a place, esp. a job: [ C ] McCarthy held the rank of captain at the time of his discharge from the army.\ndischarge noun [C/U]\n(LIQUID)\nthe act of sending a liquid or gas out of something, or the substance that comes out: [ C ] an oily discharge\nA discharge is also liquid matter that comes from a part of the body.\nAdd to word list\nAdd to word list\n[ T ] to give someone an official order or legal permission to end their duty in the army, a court, a prison, etc.: The judge discharged the jury and ordered a retrial. He was honourably discharged from the Army three years ago.\n[ T ]\n&#160; HR if a company or organization discharges an employee, it makes them leave their job: discharge sb for sth Several of the directors were later discharged for mismanaging shareholder funds. Compare\nfire\n[ T ]\n&#160; LAW, FINANCE to give a bankrupt person legal permission to stop owing a particular debt: discharge a bankrupt First-time bankrupts are typically discharged automatically after 12 months.discharge a debt Bankruptcy laws generally won't let people discharge their student loan debt. Compare\ndischarge in bankruptcy\n[ T ]\n&#160; FINANCE to pay the total amount owed for a debt, loan, payment, etc.: The company continues to discharge its loan repayment obligations in time.\n[ T ] to do an official task or duty: discharge a duty/responsibility/obligation\n[ I or T ]\n&#160; ENVIRONMENT if a business or factory discharges gas, chemicals, liquid waste, etc., it sends these substances into the air or water: Companies must be issued a permit from the EPA before they are allowed to discharge.discharge sth into sth The mine has a federal permit to discharge mine wastewater into the river.\n[ I or T ]\n&#160; TRANSPORT to take goods off a ship or plane or to allow passengers to get off: It took a whole day to discharge the ship.\n[ C ]\n&#160; FINANCE the end of a debt, or an official order that ends someone’s duty to pay a debt: Bankrupts must undergo credit counselling before receiving a discharge of their debts. loan discharges and cancellations\n[ C or U ]\n&#160; ENVIRONMENT a waste substance that is sent into the air or water from a factory or business: $1 billion was spent to reduce the plant’s mercury discharge.\n[ U ]\n&#160; HR\n&#160; formal an official order that ends someone’s job: He sued the company for wrongful discharge.\n[ C or U ] an official order or legal permission to leave your duty in the army, a court, a prison, etc.: honourable/dishonourable discharge If convicted, his sentence will include a reduction in rank to private and a dishonourable discharge.\n[ U ] formal the act of doing a task or duty that you must do: discharge of duties/responsibilities Employees found to have committed any breaches in the discharge of their duties will be reprimanded.\n[ U ]\n&#160; TRANSPORT the job or activity of getting goods or passengers off a ship or plane: The west docks are used for the loading and discharge of cargo. See also\norder of discharge"}