{"id":127889,"name":"discordance","type":"noun","us_sound":"dɪˈskɔːr.dəns","us_link":"../audio/d/cdo0318usdisc1420.mp3","uk_sound":"dɪˈskɔː.dəns","uk_link":"../audio/d/epd08660.mp3","content":"Add to word list\nAdd to word list\n[ U ] an unpleasant sound or combination of sounds: The third movement failed to impress me and came close to discordance in my ears. The world of pop music isn't exactly full of artists who are experimenting with discordancy.\n[ C or U ] a disagreement, or the quality of not being in agreement with something or someone else: discordance between \"There is no discordance between this report and the president's position on climate,\" he claimed. Perhaps this incident will allow us to move on from current political discordances. There was some discordancy between the doctors upon other points.\n[ C or U ] the quality of looking or sounding different or wrong compared with other things, or an example of this: discordance between The discordance between the play's bleak philosophy and its cheerful surface is interesting. The language of a novel should fit the tone of the story - unless a sense of discordance is the intended effect. The impulse to avoid painful discordancies is one of several typical elements in his travel writing. Related word\ndiscordant\nMore examplesFewer examplesThe piece consists of standard avant-garde discordance.We want a society in which discordances can be peacefully accommodated.How do you account for the weight discordance of the twins? There is a great discordance between the skill of the craftsman and the bad taste of the finished ornament.This alternation between anarchy and precision sparks some pleasing discordances.\nSMART Vocabulary: related words and phrases\nTechnical music terms\naccidental\nadagio\naleatory\nantiphonal\narpeggio\narr.\ncadence\nglide\ngroove\nharmonic\nharmonic progression\nharmony\nkey signature\nlegato\nsyncopation\ntempered\ntempo\ntimbre\ntime signature\ntonal\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDescribing qualities of sound\nOpposing & against\nDifferent and difference"}