{"id":128482,"name":"disguise","type":"verb","us_sound":"dɪsˈɡaɪz","us_link":"../audio/d/disguise.mp3","uk_sound":"dɪsˈɡaɪz","uk_link":"../audio/d/ukdisgu001.mp3","content":"Add to word list\nAdd to word list\nB2 to give a new appearance to a person or thing, especially in order to hide its true form: disguise yourself He disguised himself by wearing a false beard. Minor skin imperfections can usually be disguised with a spot of make-up. We tried to disguise the fact that it was just a school hall by putting up coloured lights and balloons.\nC2 to hide an opinion, a feeling, etc.: I couldn't disguise my disappointment.\nMore examplesFewer examples\"Well, I have shown you how to do this before, \" she said, unable to disguise her impatience.Strenuous efforts were made throughout the war to disguise the scale of civilian casualties.She has had a lot of cosmetic surgery in an attempt to disguise her age.My friend rang me up at the office and tried to disguise her voice, but I knew it was her.The journalist disguised himself as a waiter in order to get into the celebrity party.\nSMART Vocabulary: related words and phrases\nHiding and disguising\nbe holed up idiom\nbooby trap\ncamo\ncamouflage\ncamouflaged\ncloak\ndrown\nillusion\nillusionistically\nillusively\nillusorily\nincognito\nobscure\nsecrete\nsidle\nskulk\nsmokescreen\nstash\nstealthy\ntuck\nSee more results »\nB2 something that someone wears to hide their true appearance: He put on a large hat and glasses as a disguise and hoped no one would recognize him. in disguise\nB2 If people, objects, or activities are in disguise, they appear to be something that they are not, especially intentionally: She usually goes out in disguise to avoid being bothered by the public.\nSee more\nSMART Vocabulary: related words and phrases\nHiding and disguising\nbe holed up idiom\nbooby trap\ncamo\ncamouflage\ncamouflaged\ncloak\ndrown\nillusion\nillusionistically\nillusively\nillusorily\nincognito\nobscure\nsecrete\nsidle\nskulk\nsmokescreen\nstash\nstealthy\ntuck\nSee more results »\nAdd to word list\nAdd to word list\nto give a new appearance to a person or thing, esp. in order to hide its true form: His mask doesn’t disguise his identity. I think Mom could disguise her voice better than you could disguise yours.\nTo disguise an opinion, feeling, etc., is to hide it: I couldn’t disguise my unhappiness at this decision. disguise noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/dɪsˈɡɑɪz/\n[ U ] In Shakespeare’s plays, many characters appear in disguise."}