{"id":128449,"name":"disgrace","type":"noun","us_sound":"dɪsˈɡreɪs","us_link":"../audio/d/disgrace.mp3","uk_sound":"dɪsˈɡreɪs","uk_link":"../audio/d/ukdiscr026.mp3","content":"Add to word list\nAdd to word list\nB2 embarrassment and the loss of other people's respect, or behaviour that causes this: in disgrace They were sent home in disgrace.bring disgrace on He brought disgrace on the whole team by falsifying the results. be a disgrace\nB2 to be a very bad situation: Three families living in one room - it's a disgrace!\nSee more be a disgrace (to someone/something)\nC2 to be so bad or unacceptable that you make people lose respect for the group or activity you are connected to: You're a disgrace (to the family) - what a way to behave! Fans like these are a disgrace to our country. What he did was outrageous. He's a disgrace to the medical profession. She was an absolute disgrace at the party, offending the hosts and attendees with her vile behaviour. The way veterans are treated by the government is a disgrace.\nMore examplesFewer examplesIt's a disgrace that some war widows don't get a decent pension.I think the way she's been treated is a downright disgrace.She found the disgrace of losing her job very hard to deal with.There is no disgrace in admitting that you cannot do something - it's always best to ask for help.Andrew behaved so badly on the school trip that he was sent home in disgrace.\nSMART Vocabulary: related words and phrases\nHumiliating and degrading\nabase\nabasement\nbe under a cloud idiom\nbring/take someone down a peg (or two) idiom\nbruise someone's ego idiom\ndishonour\ndishonourable\ndishonourably\ndoghouse\nexhibition\nignobly\nignominious\nignominiously\nignominy\nin the doghouse idiom\nshoddiness\nshoddy\nstoop\nstoop to something\nundignified\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMorally wrong and evil\nto make people stop respecting you or your family, team, etc. by doing something very bad: You have disgraced us all with your behaviour.\nSMART Vocabulary: related words and phrases\nHumiliating and degrading\nabase\nabasement\nbe under a cloud idiom\nbring/take someone down a peg (or two) idiom\nbruise someone's ego idiom\ndishonour\ndishonourable\ndishonourably\ndoghouse\nexhibition\nignobly\nignominious\nignominiously\nignominy\nin the doghouse idiom\nshoddiness\nshoddy\nstoop\nstoop to something\nundignified\nSee more results »\nRelated word\ndisgraced\nAdd to word list\nAdd to word list\nembarrassment and the loss of other people’s respect, or behavior that causes this: He resigned in disgrace. He’s a disgrace to his family. disgraceful adjective us\nYour browser doesn't support HTML5 audio\n/dɪsˈɡreɪs·fəl/\nThe lies my opponent is telling about me are disgraceful."}