{"id":128505,"name":"dish","type":"noun","us_sound":"dɪʃ","us_link":"../audio/d/dish.mp3","uk_sound":"dɪʃ","uk_link":"../audio/d/ukdisgu007.mp3","content":"dish noun\n(CONTAINER)\nAdd to word list\nAdd to word list\nA2 [ C ] a container, flatter than a bowl and sometimes with a lid, from which food can be served or which can be used for cooking: an oven-proof dish See also\nsatellite dish\nFirmafotografen/iStock/Getty Images Plus/GettyImages the dishes A2 [ plural ]\nall the plates, glasses, knives, forks, etc. that have been used during a meal: do/wash the dishes Have you done/washed the dishes?\nSee more\nMore examplesFewer examplesThere's no butter left in the butter dish.When you have rolled out the pastry, place it in a pie dish.Shred the lettuce and arrange it around the edge of the dish.Are you sure this dish is ovenproof?I keep the serving dishes in that cupboard in the corner.\nSMART Vocabulary: related words and phrases\nDishes, bowls, cups & glasses\nballon\nbeaker\nbowl of something\ncake stand\nchafing dish\negg cup\nfinger bowl\nflute\nglassware\ngo-cup\nramekin\nsalver\nsaucer\nserving board\nside dish\ntrencher\ntumbler\ntureen\nwashbowl\nwine glass\nSee more results »\ndish noun\n(FOOD)\nA2 [ C ] food prepared in a particular way as part of a meal: a chicken/vegetarian dish\nMore examplesFewer examplesHere's a dish I prepared earlier.It takes a long time to prepare the dish but the results are so good that it's worth the effort.It's a simple dish to prepare, consisting mainly of rice and vegetables.I had the the most expensive dish on the menu - a choice fillet of fish.He concocted the most amazing dish from all sorts of unlikely ingredients.\nSMART Vocabulary: related words and phrases\nMeals & parts of meals\naccompaniment\nafternoon tea\nafters\namuse-bouche\nantipasto\nelevenses\nEnglish breakfast\nfeast\nfeeding\nfinger buffet\nplat du jour\nplate meal\nploughman's lunch\npostprandial\npot luck\ntakeout\ntapas\ntea\ntea party\nteatime\nSee more results »\ndish noun\n(ATTRACTIVE PERSON)\n[ S ] old-fashioned a sexually attractive person: He's gorgeous - what a dish!\ndish the dirt\nto tell people unpleasant or shocking personal information about someone: dish the dirt on She agreed to dish the dirt on her ex-husband for a large fee.\nSee more\ndish verb\n(SPORTS)\n[ I or T ] US informal in team sports such as basketball or ice hockey, to pass the ball to another player in your team: dish off to He skated down the right wing, dishing off to Owen for a slam-dunk goal. She can improve at dishing the ball, making decisions, and shooting from midrange.\nMore examplesFewer examplesHe's more likely to be the one to dish to that open shooter. She scored 17 points, grabbed 7 rebounds, and dished off 3 assists. It's frustrating to see him skilfully bring up the puck only to have no one to dish it to.\nSMART Vocabulary: related words and phrases\nBasketball, netball & volleyball\nairball\nbackboard\nballer\nbeach volleyball\nbrick\ncatch and face idiom\ncharge\ncoast\ndunk\nelbow\nfoul\nfree throw\ninbounds pass\nkorfball\nlay someone up\nlay something in\nnetball\noutrebound\nscreen\nsquare\nSee more results »\nPhrasal verbs\ndish something out\ndish (something) up\ndish something up\ndish noun [C]\n(CONTAINER)\nAdd to word list\nAdd to word list\na round, flat container with a raised edge, used for serving or holding food\nThe dishes are all the plates, glasses, knives, forks, etc., that have been used during a meal: Who’s going to do the dishes (= clean the plates, glasses, etc.)?\ndish noun [C]\n(FOOD)\na particular type of food or food prepared in a particular way as part of a meal: This restaurant serves both Cuban and Chinese dishes."}