{"id":128819,"name":"disjunctive","type":"adjective","us_sound":"dɪsˈdʒʌŋk.tɪv","us_link":"../audio/d/cdo0318usdisj1431.mp3","uk_sound":"dɪsˈdʒʌŋk.tɪv","uk_link":"../audio/d/cdo0318ukdisj0432.mp3","content":"disjunctive adjective\n(DISCONNECTED)\nAdd to word list\nAdd to word list\nlacking any clear connection: The play consists of a series of brief, disjunctive scenes.\nMore examplesFewer examplesFor those familiar with only one or two pieces, the medley may sound more like a series of disjunctive sections. The incorporation of disjunctive elements is by now a cliché of architectural renovations.The company's non-compliance clearly resulted from a disjunctive organisational structure. The poems, always difficult, got more difficult in the mid-1980s and have remained so: disjunctive and unpredictable, often zany.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanother\nanything\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\ndistinction\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nnon-uniform\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nvariant\nSee more results »\ndisjunctive adjective\n(GRAMMAR)\nlanguage\n&#160; specialized expressing a choice between two or more things, where only one is possible: Technically speaking, the question is not disjunctive.\nMore examplesFewer examples \"And\" is normally read conjunctively, \"or\" is normally read disjunctively, but in some circumstances the context may require \"and\" to be disjunctive or \"or\" to be conjunctive.We can represent a binary constraint by means of a small number of disjunctive relations.Because the statute uses the disjunctive \"or\", the court must separately evaluate each of the four factual scenarios.These five reasons are disjunctive so that the party serving the notice can rely on any one of them.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a contrast\nagain\nany way you slice it idiom\nat any rate idiom\nat least idiom\nbest\nbut\ngiven\nhand\nhowever\nin the face of something idiom\nin the teeth of something idiom\nleast\nmight\nnevertheless\nonly\nrate\nslice\ntooth\nwhen\nwhereas\nSee more results »\nCompare\nconjunctive"}