{"id":128825,"name":"disk","type":"noun","us_sound":"dɪsk","us_link":"../audio/d/disc.mp3","uk_sound":"dɪsk","uk_link":"../audio/d/ukdisap021.mp3","content":"Add to word list\nAdd to word list\nB1 a flat, circular device that is used for storing information: Put the disk into the drive. I saved the photos onto a disk for you. a digital/audio/magnetic/optical disk See also\nfloppy noun\nhard drive\nB2 US (UK disc) a circular flat object: The dog's name was engraved on a little metal disk attached to its collar.\nB1 US another spelling of\ndisc\nkyoshino/E+/GettyImages\nMore examplesFewer examplesHow much data can you store on a floppy disk?A virus erased my hard disk.The data is stored on a hard disk and backed up on a floppy disk.The display problems might be due to a shortage of disk space.There's too much data to fit onto just the one disk.\nSMART Vocabulary: related words and phrases\nComputer programming & software\nabandonware\nad blocker\nad blocking\nadware\nanalytics\nCD-ROM\nfacial recognition software\nfactory setting\nfeature-limited\nfemtech\nfile system\nfirmware\nmalware\nprogrammer\nsource code\nspam filter\nspambot\nspeech recognition software\nspellchecker\nspyware\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSpherical, circular and annular objects\nSound and image recordings\nBone structures\nAdd to word list\nAdd to word list\na flat, circular object: The dog’s name is on a metal disk attached to its collar.\nA disk is also a small piece of cartilage (= strong, elastic body tissue) between the bones of a person’s back.\nA disk is also a flat, circular device that is used for storing information: a hard disk\nAdd to word list\nAdd to word list\n(also magnetic disk) a flat circular piece of metal or plastic used for storing information on a computer: a computer/back-up disk The data has been automatically stored on a back-up disk. This information can be accessed online as well as on disk.disk space/storage Its more advanced features include disk compression to save disk space. transfer/copy/save sth to (a) disk\nmainly US\ndisc See also\ncompact disc\nfloppy disk\nhard disk"}