{"id":128999,"name":"dismiss","type":"verb","us_sound":"dɪˈsmɪs","us_link":"../audio/d/dismiss.mp3","uk_sound":"dɪˈsmɪs","uk_link":"../audio/d/ukdisin021.mp3","content":"dismiss verb\n(NOT TAKE SERIOUSLY)\nAdd to word list\nAdd to word list\nC1 [ T ] to decide that something or someone is not important and not worth considering: dismiss someone as something I think he'd dismissed me as an idiot within five minutes of meeting me. Let's not just dismiss the idea before we've even thought about it.dismiss something from something Just dismiss those thoughts from your mind - they're crazy and not worth thinking about.\nMore examplesFewer examplesThe M.P.'s speech was dismissed by her opponents as crude electioneering.The call for a one-day national strike was dismissed as gesture politics.The prime minister's proposal was immediately dismissed as a back door tax increase.Rumours that they are about to marry have been dismissed as pure speculation.He dismissed Bryan as nothing more than an amateur.\nSMART Vocabulary: related words and phrases\nTreating as unimportant\nblow\nblow something/someone off\nbrush\nbrush someone/something aside\nchopped liver\ndamn\ndenigrate\ndenigration\nlaugh\nleave something at the door idiom\nlook down on someone\nminoritize\nnever\non the front burner idiom\nshrug away\nshrug something off\nskate\nskate over/around something\nsniff at something\nsweep something aside\nSee more results »\ndismiss verb\n(END JOB)\nC1 [ T often passive ] to remove someone from their job, especially because they have done something wrong: dismiss someone from something He has been dismissed from his job for incompetence. Synonyms\nfire (REMOVE FROM A JOB)\nsack (JOB) mainly UK\nSMART Vocabulary: related words and phrases\nFiring staff\narse\naxe\nbe out on your ear idiom\ncast someone adrift idiom\nchop\nconstructive dismissal\ndecertification\nget the push idiom\ngive someone the heave-ho idiom\nheave-ho\ninvalid someone out\nlay someone off\nrelieve\nrelieve someone of something\nremoval\nremove\nrightsize\nrightsizing\nterminate\ntermination\nSee more results »\ndismiss verb\n(SEND AWAY)\n[ T ] to formally ask or order someone to leave: The professor dismissed the class early because she had a meeting.\n[ T ] When a judge dismisses a court case, he or she formally stops the trial, often because there is not enough proof that someone is guilty: The defending lawyer asked that the charge against his client be dismissed.\nSMART Vocabulary: related words and phrases\nEvicting and forcing to leave\nboot someone off (something)\nboot someone out (of something)\nbump\nchuck\nchuck someone out\nclear someone off something\nclearance\ndislocated\nextraditable\nextradite\nextradition\nfling something/someone out\nflush someone/something out\nship\nship someone off\nshow someone the door idiom\nslam dunk\nsling someone out\nsmoke\nthrow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nJudges & juries\ndismiss verb [T]\n(NOT CONSIDER)\nAdd to word list\nAdd to word list\nto decide that something or someone is not important and not worth considering: Let’s not dismiss the idea without discussing it.\ndismiss verb [T]\n(SEND AWAY)\nto formally ask or order someone to leave: The teacher dismissed the class early.\nSomeone who is dismissed from a job is officially told not to work at that job any longer.\nAdd to word list\nAdd to word list\nHR, WORKPLACE to remove someone from their job, especially because they have done something wrong: dismiss sb for sth Salespeople may be dismissed for many reasons, the most common of which is poor performance.dismiss sb from sth He was dismissed from his job for 'serious misconduct'.\nLAW to formally stop a trial in a court of law, often because there is not enough proof that someone is guilty: dismiss charges/a case/a lawsuit The company has asked the judge to dismiss the case saying that the claim it stole trade secrets is not legally well-founded.\nto decide that something or someone is not important and not worth considering: dismiss claims/complaints/concerns He dismissed claims by members of the union that the layoffs are motivated by budgetary concerns.dismiss reports/speculation/talk The chairman dismissed talk of a merger with the rival company."}