{"id":129425,"name":"disposal","type":"noun","us_sound":"dɪˈspoʊ.zəl","us_link":"../audio/d/disposal.mp3","uk_sound":"dɪˈspəʊ.zəl","uk_link":"../audio/d/ukdispl009.mp3","content":"Add to word list\nAdd to word list\nB2 the act of getting rid of something, especially by throwing it away: waste disposal the disposal of hazardous substances at someone's disposal B2 formal\navailable to be used by someone: I would take you if I could, but I don't have a car at my disposal this week.\nSee more\nMore examplesFewer examplesSome cities in the world do not have proper facilities for the disposal of sewage.Do you know what the regulations are for the disposal of pesticides and other chemicals?These bins should not be used for the disposal of kitchen waste.Efficient refuse disposal is essential for the health of society generally.I wrapped the broken glass carefully in thick newspaper and took it outside for safe disposal.\nSMART Vocabulary: related words and phrases\nRemoving and getting rid of things\nabandonment\nbanish\nbe scattered to the four winds idiom\nbin\ncast someone/something aside/away/off\nelimination\nerase\nevacuation\nexorcism\nexpunge\nexpurgate\nexpurgated\nshrug something off\nshuck\nshuck something off\nshuffle something off\nsling\nsling someone out\ntoss\nturf\nSee more results »\nAdd to word list\nAdd to word list\nthe act of getting rid of something: the disposal of toxic wastes Idiom\nat your disposal\nAdd to word list\nAdd to word list\n[ U ]\n&#160; ENVIRONMENT the act or process of getting rid of something, especially by throwing it away: This agency regulates the disposal of hazardous substances. The manufacturing process is being changed in an effort to reduce waste disposal costs.\n[ C or U ]\n&#160; FINANCE something that is sold by a company, such an asset, property, or part of its business, or the act of doing this: The company is looking at the disposal of non-core operations. The official blamed lower sales on the disposal last year of assets that did not fit into the retail-and-luxury empire the company is trying to craft.make a disposal The supermarkets group is required by the competition authorities to make disposals as a condition of the merger. Sales by volume, excluding acquisitions and disposals, rose 3%, up from 2.5% in the first quarter. No firm timetable was set for asset disposals. The company has launched a disposal programme to generate cash.\n[ U ]\n&#160; FINANCE, BANKING a situation in which it is stated that a debt does not need to be paid or will never be paid: The company also put aside 5.29 billion yen in reserves for disposal of bad debt.\nat someone's disposal\navailable to someone: Advertising and public relations specialists have a range of techniques at their disposal. It's great that we have this innovative technology at our disposal. The booming company has many billions at its disposal to fund new initiatives and acquisitions."}