{"id":129423,"name":"disposable","type":"adjective","us_sound":"dɪˈspoʊ.zə.bəl","us_link":"../audio/d/disposable.mp3","uk_sound":"dɪˈspəʊ.zə.bəl","uk_link":"../audio/d/ukdispl008.mp3","content":"Add to word list\nAdd to word list\nC2 A disposable product is intended to be thrown away after use: disposable nappies disposable cups/cutlery/plates a disposable camera daily disposable contact lenses a disposable razor/syringe/needle/glove High-tech gadgets have become disposable.\nThesaurus: synonyms, antonyms, and examples\ntemporarytemporaryThis is just a temporary solution.disposableI bought a disposable camera at the airport.makeshiftWe built a makeshift shelter under the trees.short-livedI had a few relationships at university, most of which were fairly short-lived.provisionalAfter the war, a provisional government was set up.\nSee more results »\nusually disapproving not intended to last or be remembered for a long time, especially because of not being of a high quality: In this age of disposable entertainment, the series stands out as carefully crafted and made to last. Pop music these days has become so disposable. See also\ndisposable income\nMore examplesFewer examplesMillions of disposable nappies are discarded every day.She put on a pair of disposable medical gloves.Here are guilt-free ways to use paper plates, foil pans and other handy disposable items.Cars have become disposable, like cheap household appliances.I don't want a low-level job that becomes disposable when the financial situation in a department changes.\nSMART Vocabulary: related words and phrases\nEnvironmental issues\nagroecology\nair pollution\nanoxia\nanoxic\nanti-conservation\ncarbon capture\ndumping ground\neco-footprint\nenvironmentalism\nenvironmentally\nESG\nfeed-in tariff\nfood insecure\nparticulate\nreduce, reuse, recycle idiom\nsequester\nsequestration\nsingle-use\nskip diving\nsmoggy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShort in time\nNot of good quality\na product that is intended to be thrown away after use: paper/plastic/medical disposables Do you use disposables or washable nappies?\nSMART Vocabulary: related words and phrases\nEnvironmental issues\nagroecology\nair pollution\nanoxia\nanoxic\nanti-conservation\ncarbon capture\ndumping ground\neco-footprint\nenvironmentalism\nenvironmentally\nESG\nfeed-in tariff\nfood insecure\nparticulate\nreduce, reuse, recycle idiom\nsequester\nsequestration\nsingle-use\nskip diving\nsmoggy\nSee more results »\nAdd to word list\nAdd to word list\nintended to be thrown away after use: disposable cups\nAdd to word list\nAdd to word list\n[ usually before noun ] used to describe a product that can be bought cheaply and is meant to be thrown away after use: The market no longer offers disposable plastic bags at checkout. disposable cameras/razors/lenses disposable diapers/nappies Compare\nsingle-use\n[ only before noun ]\n&#160; FINANCE available for use: disposable assets/capital/cash\n[ C, usually plural ] a disposable product: medical/plastic disposables Many people now use cloth nappies instead of disposables. The company claims that one rechargeable battery replaces 500 to 1,000 disposables.\ndisposables [ plural ]\nECONOMICS →\nnon-durable goods"}