{"id":129540,"name":"dispute","type":"noun","us_sound":"dɪˈspjuːt","us_link":"../audio/d/dispute.mp3","uk_sound":"dɪˈspjuːt","uk_link":"../audio/d/ukdispl023.mp3","content":"Add to word list\nAdd to word list\nC2 an argument or disagreement, especially an official one between, for example, workers and employers or two countries with a common border: a bitter/long-running dispute a border dispute a pay/legal/trade disputedispute over They have been unable to settle/resolve the dispute over working conditions.in dispute with The unions are in dispute with management over pay.\nThesaurus: synonyms, antonyms, and examples\nan argumentargumentI don't want to get into an argument with you about this.disagreementThere was a disagreement over who should pay the bill.quarrelThere were bitter quarrels between the two neighbours.rowUK My parents had a row about money.squabbleI'm always dealing with squabbles between the children.tiffShe had a tiff with her boyfriend last night.\nSee more results »\nbeyond (all) dispute\nC2 so certain or true that you cannot disagree: He is beyond all dispute the finest actor in Hollywood today.\nSee more in dispute\nbeing doubted: I don't think her ability is in dispute - what I question is her attitude.\nSee more open to dispute\nnot certain: He says it's the best musical equipment you can buy, but I think that's open to dispute.\nSee more\nMore examplesFewer examplesAll attempts at conciliation failed and the dispute continued.An outside adviser has been brought in to arbitrate the dispute between the management and the union.Management have demonstrated almost unbelievable incompetence in their handling of the dispute.I'd like to help but I don't have the power to intervene in this dispute.The chances of settling this dispute through talks seem increasingly slender.\nSMART Vocabulary: related words and phrases\nArguments & disagreements\nargument\nbe (on) non-speakers idiom\nbelligerence\nbickering\nblow (someone/something) up\nbust up\nclash\nconflict\ncontentiousness\ncontretemps\nding-dong\ndust-up\nhostility\nkerfuffle\nlogjam\nmisunderstanding\npile\nrhubarb\nspat\nsquabble\nSee more results »\nC2 to disagree with something that someone says: Few would dispute his status as the finest artist of the period.be hotly disputed The circumstances of her death have been hotly disputed. [ + (that) ] I don't dispute (that) his movies are entertaining, but they don't have much depth. Synonyms\ngainsay formal\nquarrel\nThesaurus: synonyms, antonyms, and examples\nto argue with someoneargueThe kids are always arguing about something.have an argumentI had an argument with my sister.fightThe two sides continue to fight over control of the assembly.quarrelStop quarrelling, you two!rowUK My parents were always rowing about money.squabbleThey are still squabbling over who will get the big office.\nSee more results »\nMore examplesFewer examplesHow can you be a Christian and dispute the divinity of Jesus?Several experts now dispute the usual attribution of the work to Leonardo.Are you disputing the judge's decision, madam?Many people would dispute that statement.I don't dispute her ability, but what I question is her attitude.\nSMART Vocabulary: related words and phrases\nSuspecting & questioning\nask questions of someone/something idiom\ncall into question idiom\nchallenge\nchallengingly\ncynic\ncynical\ncynically\ncynicism\ndoubt\ndoubter\nfisking\nmisgiving\nquery\nreserve\nsceptical\nskeptic\nskeptically\nsuspected\nsuspiciously\nunchallengeable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDenying & contradicting\nRelated words\ndisputation\ndisputatious\ndisputed\nAdd to word list\nAdd to word list\nan argument or disagreement: [ C ] Management and the union are trying to resolve the dispute over working conditions. Her skill is not in dispute (= there is no disagreement about her skill), but she doesn’t produce enough work. dispute verb [ I/T ] us\nYour browser doesn't support HTML5 audio\n/dɪˈspjut/\n[ + that clause ] I don’t dispute that his films are entertaining, but they don’t have much depth.\nAdd to word list\nAdd to word list\nan argument or disagreement, especially an official one: The judge urged the feuding partners to settle their legal dispute . Staff have been in a long-running pay dispute with the company. An official involved in the dispute said that the attorney has indicated he is likely to agree to the revised terms. He was in dispute with his last company, which had terminated his contract. Workers at the car plant are to stage a fresh strike in a dispute over pay.dispute between/with sb/sth (and sb/sth) The dispute between Brazil and the United States over immigration checks continued. a bitter/long-running dispute\nin dispute\nnot yet agreed on or accepted by everyone: Sensitive documents related to personnel that ought to be protected for privacy reasons are the only documents that are in dispute. The facts in this matter are in dispute. See also\nalternative dispute resolution\ncredit dispute letter\ndemarcation dispute\nemployment dispute\nindustrial dispute\ninsurance dispute\nletter of dispute\ntrade dispute\nto disagree with or express doubts about something: Health insurers dispute the doctors' statement that they don't pay enough to make up for the cost of the vaccine. Many in the television industry dispute research findings suggesting negative long-term effects of television violence."}