{"id":129549,"name":"disqualify","type":"verb","us_sound":"dɪˈskwɑː.lə.faɪ","us_link":"../audio/d/disqualify.mp3","uk_sound":"dɪˈskwɒl.ɪ.faɪ","uk_link":"../audio/d/ukdispl026.mp3","content":"Add to word list\nAdd to word list\nC2 to stop someone from being in a competition or doing something because they are unsuitable or they have done something wrong: be disqualified from Two top athletes have been disqualified from the championship after positive drug tests.UK He's been disqualified from driving for a year.\nThesaurus: synonyms, antonyms, and examples\nto forbid someone or somethingforbidHe grew up in a strict household where dating was forbidden.disallowUpon review, the goal was disallowed.banThe government has banned the sale of lead-based paint.prohibitVehicles are prohibited from parking on the grass.\nSee more results »\nSMART Vocabulary: related words and phrases\nForbidding and banning things\nabolish\nabolition\nabolitionist\nanti-censorship\nban\ndebar\ndecertification\ndecertify\ndisallow\ndisqualification\noff-limits\nout of bounds idiom\noutlaw\nprohibit\nprohibition\nunapproved\nunauthorized\nunkosher\nunsanctioned\nverboten\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPunishing & punishments\nRelated word\ndisqualification\nAdd to word list\nAdd to word list\nto take away from someone the ability to do or play a part in something because that person is unsuitable or has done something wrong: He was disqualified from competing in the games. disqualification noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/dɪsˌkwɑl·ə·fɪˈkeɪ·ʃən/\nAdd to word list\nAdd to word list\nto officially stop someone from being in a competition or doing something because they are not suitable or they have done something wrong: Of the enlistees who signed up last month, 12.3% required waivers for past criminal activity that would have disqualified them for service.be disqualified from sth/doing sth An ex-convict can't be disqualified from public employment based solely on a prior conviction. disqualification noun [ C or U ] uk/dɪˌskwɒlɪfɪˈkeɪʃən/ us/-ˌskwɑːlə-/\nThe Chair of the Board shall have authority to order the disqualification of a Governor appointed under this ruling. I will bring forward legislative proposals to enable us to handle the disqualification of unfit directors more efficiently and effectively."}