{"id":129666,"name":"disruption","type":"noun","us_sound":"dɪsˈrʌp.ʃən","us_link":"../audio/d/disruption.mp3","uk_sound":"dɪsˈrʌp.ʃən","uk_link":"../audio/d/ukdisre010.mp3","content":"Add to word list\nAdd to word list\nC1 the action of preventing something, especially a system, process, or event, from continuing as usual or as expected: widespread disruption The accident brought widespread disruption on the roads.disruption to It would cause a tremendous disruption to our work schedule to install a different computer system.\nbusiness\n&#160; specialized the action of completely changing the traditional way that an industry or market operates by using new methods or technology: the disruption of the telecoms industry See\ndisrupt\nMore examplesFewer examplesThe military coup brought further disruption to a country already struggling with famine.The strike brought severe disruption to flights over the holiday weekend.Further disruption is expected later tonight when more heavy snow is expected.We apologize for the disruption while essential motorway repairs are being carried out.Some medications can disrupt hormone levels; the effects of this disruption can include an impaired attention span or behavioral problems.The industry was ripe for disruption using peer-to-peer technology.\nSMART Vocabulary: related words and phrases\nUpsetting and destabilizing\nbring\nbring someone down\ndelegitimize\ndestabilization\ndestabilize\ndisruptively\ndiversionist\nknock/throw someone for a loop idiom\nloop\nmake waves idiom\nput the skids under something idiom\nskid\nstir\nturn\nunsettle\nunsettling\nunspool\nunspooling\nupset\nwave\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReplacing and exchanging\nAdd to word list\nAdd to word list\nan interruption in the usual way that a system, process, or event works: It would cause a tremendous disruption to our work schedule to install a different computer system. A crackdown on illegal-immigrant hiring could create widespread workplace disruptions."}