{"id":129930,"name":"dissolve","type":"verb","us_sound":"dɪˈzɑːlv","us_link":"../audio/d/dissolve.mp3","uk_sound":"dɪˈzɒlv","uk_link":"../audio/d/ukdissi008.mp3","content":"dissolve verb\n(BE ABSORBED)\nAdd to word list\nAdd to word list\nC2 [ I or T ] (of a solid) to be absorbed by a liquid, especially when mixed, or (of a liquid) to absorb a solid: Dissolve two spoons of powder in warm water. Nitric acid will dissolve most animal tissue.\nMore examplesFewer examplesPour the powder into the solution and stir it gently until the powder has dissolved.Drop two tablets into a glass of water and leave them to dissolve.We have to keep stirring until all the cubes of jelly have dissolved.Sugar is a soluble substance, which means that it dissolves in water.This all-purpose fertilizer comes in the form of blue granules that dissolve easily.\nSMART Vocabulary: related words and phrases\nPhysical & chemical processes\nabsorbable\nabsorptive\nabsorptive capacity\nabsorptivity\nacidification\ndegradable\nexcitability\nexcitation\nexcite\nexergonic\nexothermic\nexothermic reaction\nimpregnate\nre-emission\nre-emit\nreabsorb\nreact\nreboil\nscald\nvaporize\nSee more results »\ndissolve verb\n(END)\nC1 [ T often passive ] to end an official organization or a legal arrangement: Parliament has been dissolved. Their marriage was dissolved in 1968.\n[ I ] to disappear: The tension in the office just dissolves when she walks out.\nSMART Vocabulary: related words and phrases\nCausing something to end\nabandon\nabandonment\nall good things (must) come to an end idiom\nand have done with it idiom\nbe over the hump idiom\nbrake\ncure\nhalt\nhang\njack something in\nkill something stone-dead idiom\nknock\nlay\nlid\nsnap\nsnuff something out\nstamp on something\nstamp something out\nstanch\nstaunch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAppearing & disappearing\nIdiom\ndissolve into tears/laughter\ndissolve verb [I/T]\n(BE ABSORBED)\nAdd to word list\nAdd to word list\nto be absorbed or to cause a solid to be absorbed by a liquid, or of a liquid to absorb a solid: [ T ] Dissolve two teaspoons of yeast in warm water.\ndissolve verb [I/T]\n(END)\nto end an official organization or a legal arrangement: [ T ] They decided to dissolve the partnership. Phrasal verb\ndissolve into something\nAdd to word list\nAdd to word list\nto end an official organization or a legal arrangement: A vote to dissolve the power-sharing government is scheduled for next week. The committee has announced that it will dissolve or completely reshape the Information Management Group. A final shareholders meeting has been scheduled to take all necessary actions to dissolve the company."}