{"id":130152,"name":"distortion","type":"noun","us_sound":"dɪˈstɔːr.ʃən","us_link":"../audio/d/eus75626.mp3","uk_sound":"dɪˈstɔː.ʃən","uk_link":"../audio/d/ukdisti007.mp3","content":"distortion noun\n(FALSE MEANING)\nAdd to word list\nAdd to word list\n[ C or U ] a change to the intended or true meaning of something: a gross distortion of the facts Nobody has challenged his distortions on education and the economy.\nMore examplesFewer examplesThey are furthering their agenda through lies and distortion.The producers insisted the show was a truthful portrayal and there was no distortion. These are unsubstantiated attacks containing exaggerations and distortions.\nSMART Vocabulary: related words and phrases\nLies, lying & hypocrisy\na pack of lies idiom\nartifice\nbad faith\nblack is white idiom\ncakeism\ncanard\nfalsification\nfeed someone a line idiom\nfib\nfiction\nflimflam\nlie\nmythologize\nperjure\nperjury\npolygraph\nstretch the truth idiom\nweasel words\nwhite lie\nwhopper\nSee more results »\ndistortion noun\n(SHAPE)\n[ C or U ] a change to the original or natural shape of something: When you project the photographs onto a surface, some distortion of the image may occur. The painting features Dali's characteristic distortions of form.\nMore examplesFewer examplesThe supersensitive camera reduces noise, image distortion and blur to create amazingly sharp images.A handwriting expert was unable to determine who had written the note due to the distortion of the writing.It could be argued that any photographic image is already a distortion of what one sees in the real world.\nSMART Vocabulary: related words and phrases\nBending, twisting and curving\narch your back\nball up\nbendy\nbent\nbowed\ndescribe\nflex\nflexion\nflexure\nfluted\nintertwine\nrewind\nsinuous\nswoopy\ntangle\ntangled\ntangly\ntorsion\nwrithe\nzigzag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDamaging and spoiling\nRecording sounds and images\ndistortion noun\n(SOUND)\n[ U ] a change in or loss of sound quality, due to changes in the shape of the sound wave: The audio track sounds clean and free of distortion.\nMore examplesFewer examplesUsing this phone, the person I was speaking to said I sounded distant, with more distortion.His grimy guitar, with lots of distortion, is key to the band's sound. The system corrects for distortion caused by sound bouncing off glass or being absorbed by upholstery. They use DC-coupled amplifiers for low distortion.\nSMART Vocabulary: related words and phrases\nDescribing qualities of sound\naudibly\nboomy\nchocolatey\nchuff\nclomp\ncrackling\near-splitting\nmellifluously\nmelodically\nmelodiously\nmetallically\nmurmurous\nraucous\nsilvery\nstaccato\ntextured\nthready\ntinnily\ntunefully\ntunefulness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRecording sounds and images"}