{"id":130206,"name":"distribute","type":"verb","us_sound":"dɪˈstrɪb.juːt","us_link":"../audio/d/distribute.mp3","uk_sound":"dɪˈstrɪb.juːt","uk_link":"../audio/d/ukdisti019.mp3","content":"Add to word list\nAdd to word list\nB2 to give something out to several people, or to spread or supply something: The books will be distributed free to local schools. Several people were arrested for distributing racist leaflets/pamphlets (to the spectators). The company aims eventually to distribute (= supply for sale) its products throughout China. Synonym\ndisseminate formal\nMore examplesFewer examplesA number of charities are coordinating their efforts to distribute food to the region.Their teacher distributed a review for the exam.Tons of internationally donated food was distributed to the starving peasants.She incited racial hatred by distributing anti-Semitic leaflets.It's thought that the pornographic films are being distributed by an international vice ring.\nSMART Vocabulary: related words and phrases\nSpreading and scattering\nall over the place idiom\nbedaub\nbell\nbestrew\nbillow\ndispersion\ndisseminate\ndredge\ndusting\nencroach on/upon something\nfan out\ngo around\nrambling\nslap something on\nslather\nsmear\nsmudge\nsmudgily\nsmudging\nsprinkle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSharing\nAdd to word list\nAdd to word list\nto divide something among several or many people, or to spread or scatter something over an area: Food and clothing are being distributed among/to the flood victims. Shopping malls are widely distributed across the country.\nAdd to word list\nAdd to word list\n[ T ] to give something to a large number of people, for example a share of a company's profits to shareholders: distribute sth to sb Operating expenses are first paid from the fund's assets before any earnings are distributed to shareholders.distribute sth among sb $80 million dollars were due to be distributed among the firm's creditors.\n[ I or T ]\n&#160; COMMERCE, TRANSPORT to make a company's goods available to the public, for example, by transporting, storing, and selling them: As small American companies generate more sales overseas, the infrastructure for selling and distributing U.S. products will continue to improve.distribute to sb The Scottish company aims to be distributing to retailers within the US and Canada by next year. See also\ndistribution\ndistributor"}