{"id":130259,"name":"disturbance","type":"noun","us_sound":"dɪˈstɝː.bəns","us_link":"../audio/d/eus75632.mp3","uk_sound":"dɪˈstɜː.bəns","uk_link":"../audio/d/ukdisti026.mp3","content":"Add to word list\nAdd to word list\nC1 something that interrupts someone or makes someone feel worried: Residents are tired of the disturbance caused by the nightclub. Phone calls are the biggest disturbance at work.\nC2 violence or trouble: There was a minor disturbance during the demonstration, but nobody was injured. Synonyms\nanarchy\nballyhoo old-fashioned slang\nbedlam\nchaos\ncommotion\nconfusion\ndisarray formal\ndisorder (CONFUSION)\ndisorganization\nhavoc\nhoo-ha informal\nhoopla (EXCITEMENT) mainly US\nhullabaloo old-fashioned\nkerfuffle UK informal\nmadness\nmayhem\npandemonium\nruckus mainly US informal\nrumpus informal\nto-do informal\ntumult formal\nturmoil\nuproar cause a disturbance\nto break the law by fighting or behaving extremely noisily in public: His girlfriend was also arrested for allegedly causing a disturbance.\nSee more\na condition in which someone is not thinking or behaving normally because of mental or emotional problems: The state spent close to $6 million on prescription drugs - the bulk of which were used to treat emotional or mental disturbances. There are many degrees of mental frailty or disturbance, ranging from mild confusion to Alzheimer's disease.\nSMART Vocabulary: related words and phrases\nNoise & noisy\nabuzz\nbang something out\nbarky\nbash\nbash something out\nblast\nboisterously\nbrouhaha\ncacophony\nclash\nexplosive\nnoisy\nresonant\nring with something\nrowdily\nrowdiness\nrowdyism\nrumbustious\nstrident\ntumult\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInconvenience\nAdd to word list\nAdd to word list\n[ C ] something that interrupts you, esp. something loud or causing trouble: You must take care of yourself and avoid upsetting disturbances.\n[ C ]\n&#160; earth science A disturbance is also something that affects usual wind conditions: The disturbance became a typhoon in the Philippine Sea and headed due west."}