{"id":130192,"name":"distress","type":"noun","us_sound":"dɪˈstres","us_link":"../audio/d/eus75630.mp3","uk_sound":"dɪˈstres","uk_link":"../audio/d/ukdisti014.mp3","content":"Add to word list\nAdd to word list\nC1 a feeling of extreme worry, sadness, or pain: She claimed that the way she had been treated at work had caused her extreme emotional and psychological distress. Many of the horses were showing signs of distress at the end of the race. Synonyms\nalarm (WORRY)\nconcern (WORRY)\nconsternation\npreoccupation\nworry\nC2 a situation in which you are suffering or are in great danger and therefore in urgent need of help: Six people were rescued by helicopter from a fishing boat in distress off the coast. a distress signal\nMore examplesFewer examplesHe seems to be quite unaware of other people's distress.It was terrible for her to see her child in such distress.Terry is always willing to help out a lady in distress!The animal was clearly in distress, so we called the vet immediately.The old lady's distress at the news could have brought on a heart attack.\nSMART Vocabulary: related words and phrases\nSadness and regret\naw\nbe/weigh on your conscience idiom\nbitter\nblack dog\nbreastbeating\ncry\nfeel bad idiom\ngloominess\nglumness\ngroan\nguilt\nguilt complex\nmelancholia\nprick someone's conscience idiom\nregretful\nregretfully\nremorse\nremorseful\nrepentant\nwretchedness\nSee more results »\nto make someone feel very upset or worried: I hope I haven't distressed you with all these personal questions.\nSMART Vocabulary: related words and phrases\nMaking people sad, shocked and upset\naback\namiss\nappal\nbe laughing on the other side of your face idiom\nbite\nbum\ngnaw\nhaunt\nheartbreaker\nheartbreakingly\nhit/touch a (raw) nerve idiom\nnerve\nsensitivity\nshake someone out of something\nshake someone up\nshake/rock something to its foundations idiom\nshattering\nshatteringly\ntear\ntoxic\nSee more results »\nAdd to word list\nAdd to word list\ngreat mental or physical suffering, such as extreme anxiety, sadness, or pain, or the state of being in danger or urgent need: emotional/financial distress Four men were rescued from a fishing boat in distress off the coast. distress verb [ T ] us\nYour browser doesn't support HTML5 audio\n/dɪˈstres/\nRice appeared distressed about the argument and could not talk about it. distressing adjective us\nYour browser doesn't support HTML5 audio\n/dɪˈstres·ɪŋ/\n[ + that clause ] It is distressing that so little progress has been made after all this time.\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; LAW the legal action of taking and selling another person’s property in order to get money for a payment or debt that they owe: make a distress A distress should be made for the whole rent in arrears; but if goods cannot be found at the time, the injured party may make a second distress.\n[ U ]\n&#160; ECONOMICS, FINANCE financial failure, for example, not having enough money to pay back a debt or the costs of operating a business: Rising dependence on credit cards could be a sign of distress as some consumers borrow just to meet routine expenses. economic/financial distress"}