{"id":130092,"name":"distinction","type":"noun","us_sound":"dɪˈstɪŋk.ʃən","us_link":"../audio/d/distinction.mp3","uk_sound":"dɪˈstɪŋk.ʃən","uk_link":"../audio/d/ukdissi027.mp3","content":"distinction noun\n(DIFFERENCE)\nAdd to word list\nAdd to word list\nB2 [ C or U ] a difference between two similar things: There's a clear distinction between the dialects spoken in the two regions. This company makes no distinction between the sexes.\nThesaurus: synonyms, antonyms, and examples\na differencedifferenceWhat's the difference between the two cars?distinctionThere's a clear distinction between the two countries' cultures.contrastI like the contrast of those red shoes with your black suit.discrepancyThere is some discrepancy between the two accounts.chasmThere is a widening chasm between public health officials and popular opinion.gulfPeace talks attempted to bridge the gulf between the two warring nations.\nSee more results »\nMore examplesFewer examplesIt's sometimes very difficult to draw a clear distinction between the meanings of different words.There is a sharp distinction between crimes which involve injury to people and those that don't.I wasn't convinced by the minister's nice distinction between a lie and an untruth.This film blurs the distinction between reality and fantasy.The distinction between Ms McArthur and her countless imitators is the elegance of her writing.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanother\nanything\ndisparity\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nnon-uniform\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nvariant\nSee more results »\ndistinction noun\n(HIGH QUALITY)\n[ U ] the quality of being excellent: a writer/scientist/wine of distinction\n[ C ] UK a mark given to students who produce work of an excellent standard\nSMART Vocabulary: related words and phrases\nQuality and standard\nbar\nbenchmark\ncachet\ncalibre\nconform\nconform to/with something\nlevel\nmark\nmulti-levelled\nmultilevel\nnotch\nprestige\nqualitative\nqualitatively\nstar\nstatus\nstyle\ntake first/second place idiom\nunranked\nupscale\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMarks & results\ndistinction noun\n(SPECIAL)\nC2 [ S ] the quality of being special or different: She has the distinction of being one of the few people to have an honorary degree conferred on her by the university this year.\nSMART Vocabulary: related words and phrases\nExceptional qualities, things and people\na gift from the gods idiom\nbe a one idiom\ncharacter\ncuriosity\ndistinctiveness\nenfant terrible\nfavoured\ngift\nhave-a-go hero\nhero\nindividual\nnational treasure\nnonpareil\npersonal touch\nrare breed\nright\nthe chosen few idiom\nthe right stuff idiom\nthe X factor\nuniqueness\nSee more results »\ndistinction noun\n(DIFFERENCE)\nAdd to word list\nAdd to word list\n[ C/U ] a difference between two similar things: [ C ] The comment drew/made a false distinction between domestic and foreign affairs, which are really closely related. [ U ] Martin Luther King, Jr. clearly understood and accepted the distinction between preaching and scholarly criticism.\ndistinction noun\n(QUALITY)\n[ U ] the quality of being excellent or special in some way: He was a scientist of great distinction.\ndistinction noun\n(HONOR)\n[ C ] honor obtained or given because of excellence: Winning a Guggenheim fellowship carries great distinction."}