{"id":129984,"name":"distance","type":"noun","us_sound":"ˈdɪs.təns","us_link":"../audio/d/distance.mp3","uk_sound":"ˈdɪs.təns","uk_link":"../audio/d/ukdissi012.mp3","content":"distance noun\n(SPACE)\nAdd to word list\nAdd to word list\nB1 [ C or U ] the amount of space between two places: What's the distance between Madrid and Barcelona/from Madrid to Barcelona? He travels quite a distance (= a long way) to work every day. Does she live within walking distance of her parents? at/from a distance\nB2 from a place that is not near: From a distance he looks a bit like Johnny Depp.\nSee more in the distance\nB2 at a point that is far away: On a clear day you can see the temple in the distance.\nSee more\nMore examplesFewer examplesThe house is only a very short distance from the sea.Can you read that sign from this distance?Sound can travel over very large distances in water.If you're going to walk those sort of distances you need proper walking boots.We could just see the train approaching in the distance.\nSMART Vocabulary: related words and phrases\nMeasurements in general\naltitude\nbathymetric\nbathymetrically\nbathymetry\nbe running at something idiom\ncalibrate\ndrop\nelevation\nfactor\nknee-length\nmetric\nmetrication\nmicro\nmilli-\nscale\nsetting\ntera-\nuncalibrated\nunmeasurable\nunsized\nSee more results »\ndistance noun\n(MANNER)\n[ S or U ] behaviour that shows little interest or friendliness: I noticed a certain distance between father and son.\nSMART Vocabulary: related words and phrases\nNot being friendly\nabrasive\nabrasively\nabrasiveness\nabruptly\nabruptness\naloof\nestranged\nestrangement\nflintily\nforbidding\nforbiddingly\nfrigid\ngruff\nremote\nremoteness\nreserved\nreservedly\nsaturnine\nself-contained\nwintry\nSee more results »\nIdioms\ngo the distance\nkeep your distance\nAdd to word list\nAdd to word list\nthe amount of space between two places or things: [ C ] The distance from San Francisco to Los Angeles is about 400 miles. at/from a distance\nAt/from a distance means if you are not too near: From a distance, he looks a little like his mother. in the distance\nIn the distance means at or from a point far away: We could see the mountains in the distance.\nIf you distance yourself from something, you try to become less involved or connected with it: The candidate distanced himself from the extremists in the party."}