{"id":130213,"name":"distribution","type":"noun","us_sound":"ˌdɪs.trɪˈbjuː.ʃən","us_link":"../audio/d/distribution.mp3","uk_sound":"ˌdɪs.trɪˈbjuː.ʃən","uk_link":"../audio/d/ukdisti020.mp3","content":"Add to word list\nAdd to word list\nC1 the process of giving things out to several people, or spreading or supplying something: Has the Channel Tunnel improved the distribution of goods between the British Isles and mainland Europe? distribution costs\nC1 the way in which people or things are spread out in a place: a map showing distribution of global population They aimed to achieve a more equitable distribution of resources/wealth.\nmathematics\n&#160; specialized the number of times each value of a variable (= a number that can change) is found in a set of data, shown as a graph, chart, etc.: If too few children are included in the sample, the distribution will be skewed. The distribution of these scores showed a reasonable spread of values. See also\nnormal distribution\nMore examplesFewer examplesThe goods have been sitting in a warehouse for months because a strike has prevented distribution.Prices of goods are governed by the cost of the raw materials, as well as by the cost of production and distribution.We could reduce our costs by developing a more efficient distribution network.He bought a map showing the population distribution of Scotland.There is an uneven distribution of wealth across the country from the north to the south. The graph produced is called the frequency distribution of the variable or just the distribution. Distributions of key selection variables are shown.\nSMART Vocabulary: related words and phrases\nSharing\nallocate\nallocation\nallot\nallotment\nallotted\ncollective\ncorporately\ndistribute\ndistributive\ndistributively\ndivide/split (something) down the middle idiom\njoint\nmate\nportion something out\nration\nration something out\nredistribute\nredistribution\nsplit\nspread\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSpreading and scattering\nStatistics\nTables, graphs & diagrams\nAdd to word list\nAdd to word list\nthe act of dividing something among people, or spreading or supplying something: The bill would prohibit the sale and distribution of firearms.\nDistribution is also the position or arrangement of something in space or time, or among a group of people: a very substantial upward distribution of wealth in society\nAdd to word list\nAdd to word list\n[ U ]\n&#160; COMMERCE, TRANSPORT the process of transporting products from a manufacturer, storing them, and selling them to different stores and customers: control/handle the distribution We handle the distribution of the product in the US and Mexico. Investment will be used to expand marketing and distribution capabilities. We signed a distribution agreement with a company in Spain. distribution partners/networks See also\ndistribute\ndistributor\n[ C or U ]\n&#160; FINANCE a payment of dividends or shares to a company's shareholders: Through our Dividend Reinvestment Plan, you can have your distributions reinvested in your account or the same share class in another fund. This is the final distribution for this year.\n[ C or U ]\n&#160; ECONOMICS the way that money is shared or divided up in an economy or society: income distribution an unequal distribution of wealth/resources"}