{"id":130144,"name":"distort","type":"verb","us_sound":"dɪˈstɔːrt","us_link":"../audio/d/eus75625.mp3","uk_sound":"dɪˈstɔːt","uk_link":"../audio/d/ukdisti005.mp3","content":"distort verb [T]\n(CHANGE SHAPE)\nAdd to word list\nAdd to word list\nto change the shape of something so that it looks strange or unnatural: The map distorted Greenland to appear four times its actual size. a distorting mirror Synonyms\ncontort\ndeform\nMore examplesFewer examplesWith this form of editing you can distort the shape of an object or piece of text.Her face was distorted by anger.We are looking at the picture through a distorting lens.\nSMART Vocabulary: related words and phrases\nBending, twisting and curving\narch your back\nball up\nbendy\nbent\nbowed\ndescribe\nflex\nflexion\nflexure\nfluted\nintertwine\nrewind\nsinuous\nswoopy\ntangle\ntangled\ntangly\ntorsion\nwrithe\nzigzag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPatterns and shapes\nChange and changes\ndistort verb [T]\n(CHANGE MEANING)\nto change something so that it is false or wrong, or no longer means what it was intended to mean: She accused her opponent of distorting the truth. The survey methods can distort reality.\nThesaurus: synonyms, antonyms, and examples\nto say something not true in order to deceivelieAll she does is lie - you can't believe a word she says.tell a lieI cannot tell a lie: I chopped down the cherry tree.lie through your teethHe lied through his teeth that he didn't go to the cinema, though he was still holding the ticket stub in his hand as he said it.fibI don't like fibbing, but I didn't want to hurt his feelings by saying his gift was awful.misleadI'm afraid you've been misled. She is, in fact, married.deludeHe's deluding himself if he thinks that he's getting that promotion.\nSee more results »\nMore examplesFewer examplesThe new movie distorts some key facts.As usual, the media have distorted my words.His enemies have deliberately distorted his character and actions.I believe the press have distorted the situation.\nSMART Vocabulary: related words and phrases\nLies, lying & hypocrisy\na pack of lies idiom\nartifice\nbad faith\nblack is white idiom\ncakeism\ncanard\nfalsification\nfeed someone a line idiom\nfib\nfiction\nflimflam\nlie\nmythologize\nperjure\nperjury\npolygraph\nstretch the truth idiom\nweasel words\nwhite lie\nwhopper\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChange and changes\ndistort verb [T]\n(AFFECT)\nto change or affect something, especially in a way that makes it worse: The government is actually distorting markets and undermining competition. There's a danger this could distort his judgment.\nMore examplesFewer examplesSubsidies can distort competition.The closing of the factory has distorted unemployment figures.Our response should not be distorted by feelings of anger or revenge.\nSMART Vocabulary: related words and phrases\nDamaging and spoiling\nadulterate\nadulterated\nadulteration\napplecart\nat-risk\nbutcher\neat away at something\nerode\nflaw\nfoul\nfoul (something) up\ngild the lily idiom\ngloss\nrain on someone's parade idiom\nrampage\nravage\nravages\nruin\nsour\nwreck\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChange and changes\ndistort verb [T]\n(SOUND)\nto make sound produced on electrical equipment sound strange and unpleasant because of changes in the shape of the sound wave: a powerful amplifier capable of producing sound at high volume without distorting it The sound system distorted the vocals.\nMore examplesFewer examplesIf you turn up the volume on a weak amplifier it starts distorting the sound.They experimented with slowing the tape down to distort the sound.Background noise could distort the sounds he received through his hearing aid.\nSMART Vocabulary: related words and phrases\nRecording sounds and images\nanalogue\naudiovisual\nbalance\ncut\ndeepfake\ndigitally\ndistorted\ndistortion\nerase\nfast-forward\nmix\nplay something back\npostproduction\nprerecord\nre-record\nresynthesis\nresynthesize\nsample\nsampler\nvideotape\nSee more results »\nAdd to word list\nAdd to word list\nto change something from its natural or usual shape or condition: Agony distorted his face. There are those who would distort the facts to serve their own political ends. distorted adjective us\nYour browser doesn't support HTML5 audio\n/dɪˈstɔr·t̬ɪd/\nThe article presents a distorted view of life in small-town America. distortion noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/dɪˈstɔr·ʃən/\n[ C ] Dole charged his opponent with making deliberate distortions of his record.\nAdd to word list\nAdd to word list\nto change something from its original, natural, or intended meaning, condition, or shape, especially in a negative way: Governments are able to maintain discriminatory procurement practices which significantly distort trade and reduce potential growth. Local prices may be distorted by trade barriers, sales taxes, or big differences in the cost of inputs such as rents. They claim she deliberately distorted information and put families at risk. These companies systematically distort the truth - by design. Critics said the speaker not only distorted the facts but unfairly criticized one of the city's great success stories. distortion noun [ C or U ]\nOne way to reduce the resulting price distortions is to cut subsidies. Another distortion of the unemployment rate is the high level of hidden employment."}