{"id":130227,"name":"district","type":"noun","us_sound":"ˈdɪs.trɪkt","us_link":"../audio/d/district.mp3","uk_sound":"ˈdɪs.trɪkt","uk_link":"../audio/d/ukdisti022.mp3","content":"Add to word list\nAdd to word list\nB1 an area of a country or town that has fixed borders that are used for official purposes, or that has a particular feature that makes it different from surrounding areas: the business district of New York the Lake District/the Peak DistrictUS the City of Malden School DistrictUK South Cambridgeshire District Council\nMore examplesFewer examplesAn upsurge in violence in the district has been linked to increased unemployment.Vandals smashed windows and overturned cars in the downtown shopping district.Now 5,000 new children will be attending the district's already overburdened school system.Wales will be divided into 21 unitary authorities instead of eight counties and 37 districts.Villaverde is one of the high-rise districts that encircle Madrid.\nSMART Vocabulary: related words and phrases\nUK politics: local government & politics\nadministrative\nalderman\nalderwoman\nanti-city\nauthority\ncouncilmember\ncouncilwoman\ncounty borough\ncounty council\ndevelopment area\nenterprise zone\nmunicipality\nparish\nparish council\nparochial\nprefecture\nshire\nthe North-South divide\nunitary\nunitary authority\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTowns & regions: parts of countries\nAdd to word list\nAdd to word list\nan area of a country, state, or city that has been given fixed borders for official purposes, or one having a particular feature that makes it different from surrounding areas: The theater district in New York is in midtown Manhattan.\nAdd to word list\nAdd to word list\none of the areas into which a country, state, city, etc. is divided, usually for government or business purposes: financial/business/shopping district His office is located in the city’s financial district. district council/court/administrator The district sales manager is responsible for leading sales teams throughout the Pacific Northwest."}