{"id":130106,"name":"distinguish","type":"verb","us_sound":"dɪˈstɪŋ.ɡwɪʃ","us_link":"../audio/d/eus75624.mp3","uk_sound":"dɪˈstɪŋ.ɡwɪʃ","uk_link":"../audio/d/ukdisti001.mp3","content":"Add to word list\nAdd to word list\nB2 [ I or T, not continuous ] to notice or understand the difference between two things, or to make one person or thing seem different from another: He's colour-blind and can't distinguish (the difference) between red and green easily. I sometimes have difficulty distinguishing Spanish from Portuguese. It's important to distinguish between business and pleasure. It's not the beauty so much as the range of his voice that distinguishes him from other tenors. distinguish yourself\nto do something so well that you are admired and praised for it: He distinguished himself as a writer at a very early age. At school, she distinguished herself as an outstanding debater. He quickly distinguished himself in his chosen career. He didn't especially distinguish himself in any particular field, as far as I recall. Richardson rapidly distinguished himself with his diligence and industry.\nMore examplesFewer examplesThey look so similar it's often difficult to distinguish one from the other.The male bird displays several characteristics which distinguish him from the female.It's his eye for detail that distinguishes him as a painter.It can be difficult to distinguish between poisonous and edible mushrooms.Teachers have to learn to distinguish between behaviour problems associated with learning difficulties and behaviour problems linked to something else.\nSMART Vocabulary: related words and phrases\nIdentifying\nascribe something to something\nascription\nbadged\nbadging\nband\ndistinguishable\ndistinguishably\ndistinguishing\ngeotag\nid\nidentity card\nmicrochip\nmicrochipped\nmisidentification\nmisidentify\npassport\npick\nstamp\ntell something/someone apart\ntraceable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSucceeding, achieving and fulfilling\nRelated word\ndistinguishable\ndistinguish verb [I/T]\n(SEPARATE)\nAdd to word list\nAdd to word list\nto recognize or understand the difference between two things, or to provide a quality that makes someone or something different or special: [ I always + adv/prep ] It’s important to distinguish between scientific fact and fiction. [ T ] Samuel F. B. Morse distinguished himself both as an inventor and as a painter.\ndistinguish verb [I/T]\n(SEE/HEAR)\nto see, hear, or experience something, esp. with difficulty: In the dark, I could barely distinguish the shape of a person."}