{"id":130541,"name":"diversify","type":"verb","us_sound":"dɪˈvɝː.sə.faɪ","us_link":"../audio/d/eus71338.mp3","uk_sound":"daɪˈvɜː.sɪ.faɪ","uk_link":"../audio/d/ukdisun027.mp3","content":"Add to word list\nAdd to word list\n[ I ] to start to include more different types or things: Millions of years ago, changes in the earth's climate caused animal and plant life to diversify.\n[ I or T ] If a business diversifies, it starts making new products or offering new services: Many wheat farmers have begun to diversify into other forms of agriculture.\nSMART Vocabulary: related words and phrases\nBeing and appearing different\na fish out of water idiom\nanomalously\nanother\nanti-conventional\napple\nbe a far cry from something idiom\nbuck\nconflict\ndepart from something\ndeviate\ndifferentiate\ndiverge\nfish\nflow\npolymorphous\npop\nrebrand\nrebranding\nremove\nset something/someone apart\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSuccess & failure in business\nRelated word\ndiversification\nAdd to word list\nAdd to word list\nto become varied or different, or to make something varied or different: [ T ] People are advised to diversify their investments in the stock market to reduce risk. diversification noun [ U ] us/dɪˌvɜr·sə·fɪˈkeɪ·ʃən, dɑɪ-/diversified adjective us\nYour browser doesn't support HTML5 audio\n/dɪˈvɜr·səˌfɑɪd, dɑɪ-/\ndiversified financial services companies\nAdd to word list\nAdd to word list\nCOMMERCE to start to produce a range of different types of products or services, in order to succeed in more markets or protect yourself against risk: Farmers are increasingly diversifying into other activities to supplement their incomes. Using its powerful brand name, the company has successfully diversified and entered new markets. It would be a good idea to diversify the local economy away from its present over-dependence on oil.\nFINANCE to put money into a range of different types of investments in order to reduce risk: He said he bought the shares in 2003 in order to diversify his portfolio. You could consider diversifying into a unit trust to spread the risk. diversification noun [ U or C ] uk/dɪˌvɜːsɪfɪˈkeɪʃən/ us/dɪˌvɝː-/\nCOMMERCE, FINANCE The launch of new products and diversification into new business areas continue to boost sales. Successful farm diversifications are launched by highly motivated people."}