{"id":130546,"name":"diversified","type":"adjective","us_sound":"dɪˈvɝː.sə.faɪd","us_link":"../audio/d/cdo0622usdive0516.mp3","uk_sound":"daɪˈvɜː.sɪ.faɪd","uk_link":"../audio/d/cdo0622ukdive0645.mp3","content":"Add to word list\nAdd to word list\n(of a company, economy, fund, etc.) investing money in many different industries, activities, countries, etc.: Over time, his diversified portfolio of stocks has given a good return. He built up a diversified conglomerate that did business throughout the world. The fund, which is highly diversified, owns 400 stocks. Our economy is more diversified than it was a few years ago: we have tourism and services alongside industry, oil, and gas. globally/geographically/internationally diversified Opposite\nnondiversified\nMore examplesFewer examplesThe property group is extremely diversified, as no single retail tenant makes up more than 5 percent of its rental base.If you set up a properly diversified portfolio, you'll be less likely to panic if a stock hits a rough patch. Smaller building firms tend to be less geographically diversified than their larger rivals. You can generate superior returns by assembling a portfolio based on globally diversified industry sectors rather than on one country alone.\nSMART Vocabulary: related words and phrases\nStock markets\nalgo\nanti-city\nanti-dilution\nanti-speculation\nanti-speculative\nbond\nbroker\nbull\nbull market\ndead cat bounce\nequity\nfootsie\ninconvertible\ninitial coin offering\nintangible asset\nnon-controlling\nnon-convertible\nrogue trader\nstockbroker\nthe Nikkei index\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBusiness - general words\nAdd to word list\nAdd to word list\nCOMMERCE, FINANCE including a range of different types of products, investments, etc. in order to reduce risk or increase the chances of success: The organization needs to cover its operating costs from diversified funding sources; it can not rely upon any single revenue stream.diversified company/enterprise/industry Diversified companies are better equipped to survive recession."}