{"id":130566,"name":"divert","type":"verb","us_sound":"dɪˈvɝːt","us_link":"../audio/d/eus75634.mp3","uk_sound":"daɪˈvɜːt","uk_link":"../audio/d/ukdiver001.mp3","content":"divert verb [T]\n(CHANGE DIRECTION)\nAdd to word list\nAdd to word list\nC2 to cause something or someone to change direction: Traffic will be diverted through the side streets while the main road is resurfaced. Our flight had to be diverted to Newark because of the storm.\nto use something for a different purpose: Should more funds/money/resources be diverted from roads into railways?\nSMART Vocabulary: related words and phrases\nChanging direction\nabout-face\nabout-turn\nbear\nbranch\nbranch off\nbreak\ndecoy\ndo an about-turn\nexcursive\nexcursively\nflippy\nglance off (something)\nregear\nreverse\nslew\nsomeone's back is turned idiom\nswerve\nturn around\nturn off (something)\nwheel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUsing and misusing\ndivert verb [T]\n(TAKE ATTENTION AWAY)\nC1 to take someone's attention away from something: The war has diverted attention (away) from the country's economic problems.\nformal to entertain someone: It's a great game for diverting restless kids on long car rides .\nSMART Vocabulary: related words and phrases\nCelebrating & entertaining\na good time was had by all idiom\namuse\namused\nbacchanalian\nbanqueting\nbar-hop\nentertain\nentertaining\nents\ngo to town idiom\nhoot\nhostess\npropose\npush\nregale someone with something\nrejoice\nrejoicing\nrejoicingly\nrevel\nthrow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCreating a distraction\ndivert verb [T]\n(CHANGE DIRECTION)\nAdd to word list\nAdd to word list\nto cause something or someone to turn in a different direction: Our flight was diverted from San Francisco to Oakland because of the fog.\nTo divert something or someone is also to cause the thing or person to be used for a different purpose: The administration had to divert funds from the defense budget to pay for the emergency relief effort.\ndivert verb [T]\n(TAKE ATTENTION AWAY)\nto take attention away from something: Military action now could divert attention from imminent votes in Congress on health-care legislation.\nfml To divert can also mean to amuse: The dog kept the children diverted for a while.\nAdd to word list\nAdd to word list\nto use something such as money for a purpose that is different from the main one or the one that was originally planned: divert sth to sb/sth Mutuals tend to pay out more than quoted insurers because they do not have to divert a chunk of their profits to shareholders.divert sth from sth to/into sth The company is to divert resources from its traditional retail interiors operation into its furniture business.\nto take a person's or people's attention away from something so that they think about something else: The news of his appointment diverted attention from a 20% fall in pretax profit.\nCOMMERCE to sell goods or services in a different place from the place where it was planned that they should be sold: If you see a hair care product that you think may be an illegally diverted product, call the brand manufacturer right away.\nTRANSPORT to change the way that goods are sent or the place that they are sent to: Many of the shipments have been diverted from air to rail. Shipping lines were considering diverting their vessels to other major Japanese ports to unload cargo.\nCOMMUNICATIONS to arrange for phone calls to go directly to another number: A phone can be set to divert a call when the line is busy. Phrasal verb\ndivert sb from sth"}