{"id":130649,"name":"diving","type":"noun","us_sound":"ˈdaɪ.vɪŋ","us_link":"../audio/d/diving.mp3","uk_sound":"ˈdaɪ.vɪŋ","uk_link":"../audio/d/ukdiver014.mp3","content":"diving noun [U]\n(IN WATER)\nAdd to word list\nAdd to word list\nthe sport or activity of swimming or moving around under water, usually using special breathing equipment: They offer many exciting activities such as dolphin watching, diving, snorkelling, and sailing. We watched a film about deep-sea diving. See also\nfreediving\ncage diving\nscuba diving\nskin diving\nB1 the sport or action of jumping into water, especially with your head and arms going in first: She won an Olympic gold medal for diving when she was only 13. the dangers of cliff diving\nvm/E+/Getty Images /GettyImages\nMore examplesFewer examplesHe took part in a recent underwater archaeology project which involved thousands of hours of diving. Her aching ears are a painful legacy from decades of diving.In cave diving, unlike in open-water diving, you can quickly lose your bearings and get into trouble.The coastline has many beautiful natural inlets with water deep enough for diving. Some people are better suited to team sports, some prefer diving and swimming, and some prefer track. Most of our medals came in table tennis, diving, badminton, and gymnastics.\nSMART Vocabulary: related words and phrases\nWater sports\naerial\naquatics\nbodyboarding\nBoogie Board\nboogie boarding\ngrommet\nlongboarding\noxygen tank\npaddle board\npaddle boarding\nsailboard\nshortboard\nshortboarding\nsurfboard\nsurfer\nwaterskiing\nwaxhead\nwindsurf\nwindsurfer\nwindsurfing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSwimming\ndiving noun [U]\n(FOOTBALL)\nin football, the act of deliberately falling to the ground without another player causing you to fall, in order to try to win a penalty or free kick unfairly: He has been repeatedly booked for diving.\nSMART Vocabulary: related words and phrases\nFootball/soccer\n18-yard box\n2 3 5\n4 3 2 1\n4 4 2\n4 5 1\nfootball pools\nfooty\nformation\nfoul throw\nfour five one\nfour four two\nfour three two one\nreducer\nrelegation zone\nreserve team\nroute one football\nrow Z\nsweeper\ntreble\nwoodwork\nSee more results »\nAdd to word list\nAdd to word list\nan activity in which people jump head first into water, or move down under the water with special breathing equipment: deep-sea diving"}