{"id":130613,"name":"divide","type":"verb","us_sound":"dɪˈvaɪd","us_link":"../audio/d/eus71342.mp3","uk_sound":"dɪˈvaɪd","uk_link":"../audio/d/ukdiver006.mp3","content":"divide verb\n(SEPARATE)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to (cause to) separate into parts or groups: At the end of the lecture, I'd like all the students to divide into small discussion groups. After the Second World War Germany was divided into two separate countries.\nC1 [ T ] to share: I think we should divide (up) the costs equally among/between us.\nB2 [ T ] If something divides two areas, it marks the edge or limit of them: There's a narrow alley that divides our house from the one next door. This path marks the dividing line between my land and my neighbour's.\n[ T ] to use different amounts of something for different purposes or activities: She divides her time between her apartment in New York and her house in the Berkshires.\n[ I ] UK If Members of Parliament divide, they vote by separating into two groups, one group who want the law that is being voted on to be accepted and one group who are against it: After a lengthy debate, MPs/the House of Commons divided.\nMore examplesFewer examplesKnead the dough well, then divide it into four pieces.Texas is divided into 254 counties.The work has been divided into smaller, more manageable sections.Human prehistory is divided into three successive periods: the Stone Age, the Bronze Age and the Iron Age.The money was divided equally between several worthy causes.\nSMART Vocabulary: related words and phrases\nSeparating and dividing\napheresis\natomize\nbifurcate\nbifurcation\nbisect\ndissociate\ndissociate yourself from something\ndissociation\ndisunion\ndisunite\nparcel something out\npartible\nperiodization\nperiodize\npolarize\nunbridgeable\nunforked\nunjoined\nuntangle\nwheat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIsolating and separating\nElections\ndivide verb\n(DISAGREE)\nB2 [ T often passive ] to cause a group of people to disagree about something: The party is divided on/over the issue of capital punishment. divide and rule (also mainly US divide and conquer)\na way of keeping yourself in a position of power by causing disagreements among other people so that they are unable to oppose you: It's just a fact that the principle that underpins any empire is divide and rule.\nSee more\nSMART Vocabulary: related words and phrases\nSeparating and dividing\napheresis\natomize\nbifurcate\nbifurcation\nbisect\ndissociate\ndissociate yourself from something\ndissociation\ndisunion\ndisunite\nparcel something out\npartible\nperiodization\nperiodize\npolarize\nunbridgeable\nunforked\nunjoined\nuntangle\nwheat\nSee more results »\ndivide verb\n(CALCULATE)\ndivide something by something\nto calculate the number of times that one number fits (exactly) into another: 10 divided by 5 is/equals 2.\nSee more divide (something) into something\nC1 If a number divides into another number, it fits (exactly) into it when multiplied a particular number of times: What do you get if you divide 6 into 18?\nSee more\nC1 a difference or separation: The divide between the rich and the poor in this country is continuing to grow.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanother\nanything\ndisparity\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\nnon-comparability\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nunrepresentativeness\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nSee more results »\ndivide verb [I/T]\n(SEPARATE)\nAdd to word list\nAdd to word list\nto separate into parts or groups, or to cause something to separate in such a way: [ T ] Divide the cake into six equal parts. [ I ] The votes divided equally for and against the proposal.\nIf something divides two areas, it marks the edge or limit of both of them: [ T ] A narrow driveway divides our house from the one next door.\nTo divide a group of people is to cause them to disagree: [ T ] The issue of tax reform continues to divide the country.\ndivide verb [I/T]\n(CALCULATE)\nmathematics to calculate the number of times one number is contained in another: [ T ] 10 divided by 5 is/equals 2. [ T ] What do you get if you divide 6 into 18?\ndivide noun [C]\n(SEPARATION)\na separation: The river forms a divide between mountains and coastal plains. It’s on taxes that the divide between the two candidates is widest.\nAdd to word list\nAdd to word list\n[ T ] to calculate the number of times one number fits into another: Convert the euro amount into sterling by dividing the euro amount by the exchange rate.\n[ I or T ] to separate, or make something separate, into different parts or groups: He and his brother decided to divide the company into two parts."}