{"id":130617,"name":"dividend","type":"noun","us_sound":"ˈdɪv.ə.dend","us_link":"../audio/d/dividend.mp3","uk_sound":"ˈdɪv.ɪ.dend","uk_link":"../audio/d/ukdiver008.mp3","content":"Add to word list\nAdd to word list\n(a part of) the profit of a company that is paid to the people who own shares in it: Dividends will be sent to shareholders.\nMore examplesFewer examplesIn addition to their salary, employees receive a profit-related dividend.All that extra training is paying dividends.When you consider how much money the company made, it could have paid its shareholders a much higher dividend.As director and principal shareholder, he receives a substantial annual dividend from the company.Disappointing profits mean that no dividend will be paid to shareholders this year.\nSMART Vocabulary: related words and phrases\nStock markets\nalgo\nanti-city\nanti-dilution\nanti-speculation\nanti-speculative\nbond\nbroker\nbull\nbull market\ndead cat bounce\nequity\nfootsie\nICO\ninconvertible\ninitial coin offering\nintangible asset\nnon-controlling\nrentier\nrogue trader\nthe Nikkei index\nSee more results »\nAdd to word list\nAdd to word list\na payment by a company of a part of its profit to the people who own shares (= units of ownership) in the company\nAdd to word list\nAdd to word list\nFINANCE part of the profit of a company that is paid to shareholders: share/stock dividend You may have investment income that is paid yearly, such as share dividends. an annual/a quarterly dividend a gross/net dividendannounce/declare/propose a dividend In connection with this sale, the Board proposed a special dividend of 25.0 pence per share. pay/produce/yield a dividend Shares paying high dividends are known as 'income stocks'.receive/expect a dividend We anticipate receiving a substantial dividend on our holding.omit/pass/suspend a dividend The company announced that it would be suspending its quarterly dividend in order to reduce debt. This is an official document showing the amount of dividend that has been earned both before and after official deductions have been made (for example for tax). See also\naccumulated dividend\nbonus dividend\ncash dividend\ncumulative dividend\nex-dividend\nextraordinary dividend\nfinal dividend\ninterim dividend\nordinary dividend\npreference dividend\nscrip dividend\nspecial dividend\nunpaid dividend\nINSURANCE a part of the profits of a life insurance company that is paid to people who have insurance with the company: Policy dividends allow policyholders to participate in the financial performance of the life insurance operation."}