{"id":130821,"name":"do","type":"auxiliary verb","us_sound":"də","us_link":"../audio/d/do.mp3","uk_sound":"də","uk_link":"../audio/d/ukdizzi011.mp3","content":"do auxiliary verb\n(FOR QUESTIONS/NEGATIVES)\nAdd to word list\nAdd to word list\nA1 used with another verb to form questions and negative sentences, including negative orders, and sometimes in affirmative sentences for reasons of style: Where do you work? Why did you do that? Why don't we have lunch together on Friday? Doesn't Matthew look old these days? \"Didn't you realize she was deaf?\" \"No I didn't.\"/\"Of course I did.\" Not only did I speak to her, I even got her autograph!formal Never did I hear such a terrible noise. Don't (you) speak to me like that!UK Don't let's argue about it (= let's not argue about it).formal So quietly did she speak (= she spoke so quietly) that I could scarcely hear her. Little does he know (= he knows nothing about it), but we're flying to Geneva next weekend to celebrate his birthday. \"I want two chocolate bars and an ice cream.\" \"Do you now/indeed? (= that is surprising or unreasonable).\"\nA2 used instead of the main verb in questions that are added to the end of a sentence to check information: You met him at our party, didn't you? You don't understand the question, do you?\nused instead of the main verb in questions that are added to the end of a sentence as a way of expressing surprise: So Susannah and May finally got married, did they?\nMore examplesFewer examplesWhat sort of music do you like dancing to?\"And where do you think you're going?\" demanded the police officer.Please don't disturb Georgina when she's working.How much do you earn, if you don't mind me asking?Parking restrictions do not extend to disabled people.\nSMART Vocabulary: related words and phrases\nQuestioning people & asking questions in general\nask after someone\nask questions of someone/something idiom\nbe someone's for the asking idiom\nbeat something out of someone\nbombard\nconsultative\ninquire within idiom\ninterviewer\nply someone with something\npoll\npry\nput someone through the mill idiom\nput someone through the wringer idiom\nput someone to something idiom\nQ, q\nrhetorical question\nroll\nsurvey\nthe third degree idiom\ntrick question\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nYes, no & not\nActing and acts\nLinguistics: intensifying expressions\nExpressions of surprise\ndo auxiliary verb\n(TO AVOID REPEATING)\nB1 used to avoid repeating a verb or verb phrase: She runs much faster than he does. Maria looks much healthier than she did. \"I don't like intense heat.\" \"Neither/Nor do I.\" \"I hate intense heat.\" \"So do I.\" \"You left your umbrella.\" \"So I did. I'm so forgetful these days.\"UK \"Would you mind tidying up the kitchen?\" \"I already have done.\" \"May I join you?\" \"Please do!\" \"Who said that?\" \"I did.\" \"Tilly speaks fluent Japanese.\" \"Does she really?\" \"I thought I'd take a day off school today.\" \"Oh no you don't (= I'm not going to let you do that)!\"\nMore examplesFewer examplesI'm all for sexual equality, but I don't want my wife earning more than I do.The government has failed to raise educational standards, despite its promise to do so.Please don't get involved with him. You'll regret it if you do.Don't mix up the bottles - you'll have to repeat the experiment if you do.On average, people who don't smoke are healthier than people who do.\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\nadjacent\naffinity\nakin\nalike\nallied\nballpark\ncongruent\nditto\nequivalent\nequivalently\nevenly\nevery inch idiom\nnon-distinctive\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\nrespecter\nsynonymous\nSee more results »\ndo auxiliary verb\n(FOR EMPHASIS)\nB2 [ + infinitive without to ] used to give extra force to the main verb: \"Can I buy stamps here?\" \"Well, we do sell them, but we don't have any at the moment.\"UK Do shut up, Georgia, and get on with your homework.UK Do write and let me know how you're getting on.UK He cooks a lot does Alex. He does far more than me.\nMore examplesFewer examplesAlthough I cherish my children, I do allow them their independence.I do like her - after all, she is my sister.If you see James, do convey my apologies to him.Oh darling, I do love you.If ever you're in Cambridge, do give me a ring.\nSMART Vocabulary: related words and phrases\nStressing & emphasizing\naccentuate\naccentuation\nall day long idiom\nbelieve\ndeadass\ndrive your message/point home idiom\ndrive/hammer something home idiom\ninsistence\ninsistency\ninsistently\nintensely\nlike blazes idiom\nmisemphasis\npercent\nram\nstress\nthemselves\nvaunt\nwork/laugh/freeze, etc. your arse off idiom\nwork/laugh/freeze, etc. your ass off idiom\nSee more results »\nGrammar\nDoDo is an irregular verb. Its three forms are do, did, done. The present simple third person singular is does: …\nDo: formsDo is an irregular verb. Its three forms are do, did, done. The present simple third person singular is does: …\nDo: usesWe use do as a main verb and an auxiliary verb. We can also use it as a substitute verb. …\nDo as a main verbDo as a main verb has a number of meanings. …\nDo as an auxiliary verbDo is one of three auxiliary verbs in English: be, do, have. We use do to make negatives (do + not), to make question forms, and to make the verb more emphatic. …\nDo as an auxiliary verb: typical errorsWe don’t use auxiliary do to make questions or negatives for clauses with modal verbs: …\nDo as a substitute verbWe often use do instead of repeating all the words in a clause. Do substitutes for the words we don’t repeat: …\ndo verb\n(PERFORM)\nA1 [ T ] to perform, take part in, or achieve something: That was a really stupid thing to do. What are you doing over the weekend? The only thing we can do now is wait and see what happens.UK Why were you sent to see the headmaster? What have you done now?US Why were you sent to the principal's office? What did you do now? You should be able to do it by yourself/on your own.UK What have you done (= made happen) to her?US What did you do (= make happen) to her? What (on earth) were you doing in the library (= why were you there) at two o'clock in the morning? What are these toys doing here? (= Why are they here?) What do you do (for a living)? (= What is your job?) What can I do for you? (= How can I help you?)UK What have you done with (= where have you put) my coat?US What did you do with (= where did you put) my coat? She just hasn't known what to do with herself (= how to keep herself busy) since she retired. do something about something\nto take action to deal with something: It's a global problem - what can individuals do about it? do well/badly by someone formal\nto treat someone well or badly\nMore examplesFewer examplesThe work that the students do during the year will count towards their final degrees.My boss wants me to do a day-release course in computing.She has to do a lot of driving in her job.They've always encouraged me in everything I've wanted to do.I do a few stretches every morning to loosen up before I run.\nSMART Vocabulary: related words and phrases\nActing and acts\n(your) every move idiom\n-ence\nact\nact for someone\nact/do something on your own responsibility idiom\nADL\nagency\nant\nbeat\ner\nexecution\nexploit\nmove\nput your money where your mouth is idiom\nresponsibility\nrole-play\nrot\nstep\nstuff\ntalk\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTreating someone well\nTreating people or animals badly\ndo verb\n(ACT)\n[ I or T ] to act or take action: Stop arguing with me, Daryl, and do as you're told! She told me not to ask any questions, just to do as she did. \"Was it wrong of me to go to the police?\" \"Oh no, I'm sure you did right/did the right thing.\" You'd do well to take some professional advice on this matter.\nMore examplesFewer examplesShould the government do more to help young couples buy their own homes?I wish you'd do something about your bedroom - it's a real mess.He would never do anything to endanger the lives of his children.Just do whatever you think fit - I'm sure you'll make the right decision.I'm not happy with the situation but, you know, there isn't much I can do about it.\nSMART Vocabulary: related words and phrases\nActing and acts\n(your) every move idiom\n-ence\nact\nact for someone\nact/do something on your own responsibility idiom\nADL\nagency\nant\nbeat\ner\nexecution\nexploit\nmove\nput your money where your mouth is idiom\nresponsibility\nrole-play\nrot\nstep\nstuff\ntalk\nSee more results »\ndo verb\n(CONNECTED)\nto do with\nB2 connected with: \"Why did you want to talk to me?\" \"Well, it's to do with a complaint that's been made about your work.\" \"But I didn't have any money.\" \"What does that have to do with it? You still shouldn't have taken my wallet without asking me.\" She refused to have anything (more) to do with him after he was arrested for drinking and driving. \"I thought I should tell you I saw your son smoking today.\" \"Mind your own business! What my son does has nothing to do with you!\"\nThesaurus: synonyms, antonyms, and examples\nto be about somethingbe aboutWhat is the story about?have (got) to do withWhat's that got to do with it?relate toThat relates to what I was saying earlier about the need for reform.concernThe film concerns the complicated nature of marriage.coverWe will cover the passive voice later in the course.deal withWe will deal with the use of antidepressants in chapter three.\nSee more results »\nSMART Vocabulary: related words and phrases\nLinking and relating\naffiliated\nAL\nappertain to something\napplicable\naround\ncollateral\necosystem\nequation\nincestuously\ninterconnect\ninterconnected\ninterconnectedness\ninterconnection\nrecoupling\nrelatability\nrelatable\nrelate\nrelate to someone/something\nrelatedly\nweld\nSee more results »\ndo verb\n(DEAL WITH)\nA1 [ T ] to deal with or be responsible for something: Lucia is going to do the publicity for the school play. If they ask any awkward questions, just let me do the talking.\nMore examplesFewer examplesI find it convenient to be able to do my banking by phone.I've got enough work to do at the moment, without being given any more.Why should I have to do all the cleaning? It's not fair!\"I'll do the cooking, \" he offered.It's a big garden, but we do all the gardening ourselves .\nSMART Vocabulary: related words and phrases\nDealing with things or people\naddressable\napproach\nattack\nattend to someone/something\nbe all over it idiom\nbeard the lion (in his/her den) idiom\nbed\ncut\ngrip\nhave it out with someone idiom\nhold\nhold on idiom\nI/I've got this idiom\nill-prepared\nsquare\ntend to someone/something\nto get a handle on something idiom\nto have a handle on something idiom\ntough\ntough something out\nSee more results »\ndo verb\n(STUDY)\nA1 [ T ] UK to study a subject: Diane did anthropology at university.\nMore examplesFewer examples\"What degree did you do at York?\" \"Geography.\"Tim did a three-year course in linguistics at Newcastle.She did English literature at St Andrews before going abroad to teach.Richard did engineering at Manchester University.This problem should be easy enough for someone who's done physics at A level.\nSMART Vocabulary: related words and phrases\nLearning & knowing\nabsorptive capacity\nacquirable\nacquire\nacquisition\nassimilate\nbone\nfamiliar\nhit the books idiom\nminor\nmislearn\nmug (something) up\nnon-academic\nnon-library\nrecognition\nshadow\nsubspecialty\nswot up (something)\nteachable\nthose\nuncultivated\nSee more results »\ndo verb\n(SOLVE)\n[ T ] to solve or find the answer to something: to do a puzzle I've never been able to do crosswords.\nMore examplesFewer examplesI do the Times crossword every morning.When you finish doing the crossword, the solution is on the back page.We spent all evening doing a 1000-piece jigsaw.It rained for the entire holiday so they just stayed in and did jigsaws all week.I remember how much I hated doing sums when I was at school.\nSMART Vocabulary: related words and phrases\nSolving and solutions\nband-aid solution\nbe at the bottom of something idiom\nbottom\nclear (something) up\nclue\nconquer\nfix\nholding operation\ninsolvable\niron\niron something out\nirresolvable\nit will (all) come out in the wash idiom\nkill\nresolution\nsolvable\nsolve\nsurmountable\ntalk something out\nunsolvable\nSee more results »\ndo verb\n(MAKE)\nA2 [ T ] to make, produce, or create something: I can't go out tonight - I've got to do my history paper. [ + two objects ] UK Can you do me 20 photocopies of this report/do 20 photocopies of this report for me?\nMore examplesFewer examplesHe's upstairs doing his homework, believe it or not.I've been doing some research on our family history and I've dug up some interesting information.Please don't disturb Georgina - she's trying to do her homework.In our third year at college everyone had to do a special project.He's done some lovely watercolours.\nSMART Vocabulary: related words and phrases\nCreating and producing\nanti-creative\nartefact\nattribute\nattribute something to someone\nbang something out\nbash\ncrank\ngenerative\ngenerativity\ngrind something out\nhandmade\nknock\nremake\nrig\nrig something up\nroll (something) out\nrollout\nrun something up\nspin\nyield\nSee more results »\ndo verb\n(FINISH)\n[ I ] UK If you say that you have done with something or someone, or have done performing a particular action, you mean that you have finished what you were doing with something or someone, or what you were saying to someone, or that you have finished the action: Have you done with those scissors yet? Where are you going? I haven't done with you yet (= I am still talking to you). [ + -ing verb ] I haven't done talking to you yet.\nSMART Vocabulary: related words and phrases\nAbstaining and refraining\nabstain\nabstain from something\nabstainer\nabstemious\nabstemiously\ncut\ndesist\ndisengagement\nfast\nforbear\nforbearance\ngive up\npull\npull back\nstep\nstep back\nstop\nstop short of something idiom\ntouch\ntruck\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing something to end\ndo verb\n(CLEAN/MAKE TIDY)\nB1 [ I or T ] to clean something, or make something look neat and attractive: I cooked the dinner so you can do (= wash) the dishes. do your hair/make-up/nailsUK I want to do (= clean) the living room this afternoon.\nMore examplesFewer examplesI'll do your washing for you this time, but I'm not going to make a practice of it.Have you done the dishes?I like the way you've had your hair done.\"I'll do the kitchen if you clean the car.\" \"OK, it's a bargain.\"Just put the dirty dishes in the washing-up bowl, and I'll do them later.\nSMART Vocabulary: related words and phrases\nCleaning & tidying places & things\nadjust\nairing\nbed\nbioremediation\nclean something out\ndusting\nfreshen (someone/something) up\ngoing-over\nHoover\nhoover something up\nmuck\nsandblast\nsmarten (someone/something) up\nspiff someone/something up\nspit\nspit and polish idiom\nspring-clean\nspruce\ntidy\nvalet\nSee more results »\ndo verb\n(ARRANGE)\n[ T ] mainly UK to arrange something: You've done those flowers beautifully. Can anyone here do (= tie) bow-ties?\nMore examplesFewer examplesWhere did you have your hair done?Give me a couple of minutes while I do my hair.Who did the flowers for the wedding? They're beautiful!Now come on, you're old enough to do your own shoelaces, Carlo.Who did your tie for you? It's not straight.\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nconcordance\ndescribe\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nset something up\nshake someone down\nshort-list\nshortlist\nsort\ntick\nSee more results »\ndo verb\n(TRAVEL)\n[ T ] to travel a particular distance or to travel at a particular speed: It's an old car and it's done over 80,000 miles. My new car does 50 miles to the gallon (= uses one gallon of fuel to travel 50 miles) He was caught doing 80 miles an hour.\n[ T ] to complete a journey: We did the journey to Boston in five hours.\nMore examplesFewer examplesMy car only does about 60 mph, even when it's going flat out.We were doing 90mph, so that other car that passed us must have been really travelling!\nSMART Vocabulary: related words and phrases\nTravelling\naround Robin Hood's barn idiom\nbackpack\nbag drop\nbourne\nbum\nbum around\ncommunication\ncommuting\nconnection\nhitch\nmove\nnegotiate\npublic transport\nRobin Hood\nshuttle\nsuper-commuting\ntaken\ntransoceanic\nvisa\nwell travelled\nSee more results »\ndo verb\n(BE ACCEPTABLE)\nC1 [ I or T ] mainly UK to be acceptable, suitable, or enough: Will this room do or would you prefer one with a shower? This kind of behaviour just won't do. [ + to infinitive ] It doesn't do to criticize your parents. I don't have any grapefruit juice, but I've got some orange juice. Will that do (you)? \"Is that enough potato, or would you like some more?\" \"That'll do (= be enough for) me, thanks.\"\nThesaurus: synonyms, antonyms, and examples\ngood enough but not excellentacceptableYour essay was acceptable, but I think you could have done better.reasonableThey have a reasonable chance of winning.adequateThe law provides adequate compensation for robbery victims.passableI speak passable Spanish. will doIt's not perfect, but it'll do.\nSee more results »\nMore examplesFewer examplesHave you got any ID? A driving licence or cheque card will do.You don't need to dress up just to go to the pub - jeans and a T-shirt will do.\"Would you like the metal or plastic one?\" \"Either will do.\"\"More peas?\" \"No, that'll do, thank you.\"That'll do nicely, thank you.\nSMART Vocabulary: related words and phrases\nBeing suitable or unsuitable\nage-barred\nanswer\nappropriately\nbe made for someone/something idiom\nbecome\nbefit\ncompatibly\ndress/look/act the part idiom\nextravagantly\nface\nfill/fit the bill idiom\nfit\nlevel\nmisdirection\nout of order idiom\nsomeone's face doesn't fit idiom\nsuit\nsuit someone (right) down to the ground idiom\ntopic\nunsympathetically\nSee more results »\ndo verb\n(CAUSE TO HAVE)\n[ T ] to provide or sell something, or to cause someone to have something: They are doing a special offer - three for the price of two. Do you do travel insurance as well as flights? The bar only does food at lunchtimes, not in the evenings.\nMore examplesFewer examplesThey do really good food at that restaurant and it's not very expensive either.They do really good grub in our local.The shop round the corner does shoe repairs very cheaply.The restaurant does a set lunch on Sundays.They're doing a great deal on wine at the local supermarket.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\nafford\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSelling\ndo verb\n(COOK)\n[ T ] to cook or prepare food: Who's doing the food for your party? [ + two objects ] UK I'll do you some scrambled eggs.\nMore examplesFewer examplesI was thinking of doing a meal along the lines of that dinner I did for Annie and Dave.I did mostly vegetarian food but put a couple of meat dishes out for the carnivores.The fish was done to perfection.I've just bought a deep-fat fryer for doing chips.I did the dinner so you can do the dishes.\nSMART Vocabulary: related words and phrases\nPreparing food\nbatch cooking\nbiga\nboil\nbutter\nbuttered\ncan't boil an egg idiom\nclarify\nglaze\nglazed\ngrate\ningredient\njerk\nre-season\nrecipe\nrehydrate\nrestuff\nrice\ntailgate\ntoss\nzap\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProviding & serving meals\ndo verb\n(MANAGE)\nB1 [ I usually + adverb ] to develop or continue with the stated amount of success: How is Mary doing in her new job/school? Both the new mother and her baby are doing very well. Are your roses doing all right this year? Many small businesses are doing badly because of the economic situation. I did pretty well when I traded in my car - they gave me a good price for it. Alexa has done well for herself (= has achieved great personal success), getting such a highly paid job. Synonym\nmanage (SUCCEED)\nMore examplesFewer examplesI wouldn't say she's rich, but she's doing all right.You're doing really well - don't lose heart now.I was doing really well with my diet, but I'm afraid I've let it slide recently.The whole nation was force-fed government propaganda about how well the country was doing.They're doing fantastically well this season.\nSMART Vocabulary: related words and phrases\nCoping and not coping\nbalancing act\nbe left holding the baby idiom\nbear up\nbite\nbite off more than you can chew idiom\ncut\nhead\nhold\njuggling\nkeep body and soul together idiom\nkeep the wolf from the door idiom\nkeep your head above water idiom\nkeep/hold your end up idiom\nmanage\nroll\nsink or swim idiom\nstretch to something\nstride\nsubsist\nsubsistence\nSee more results »\ndo verb\n(PLAY)\n[ T ] to perform a play or to play the part of a character: The children are doing a play at the end of term. She's done all the important Shakespearean roles except for Lady Macbeth. I hope she doesn't do a Helen (= do what Helen did) and get divorced six months after her wedding.\nSMART Vocabulary: related words and phrases\nCinema & theatre: acting, rehearsing & performing\nact out\namateur theater\nappearance\nblocking\ncamp\ncamp it up\nchew\nchew the scenery idiom\nimprovisation\ninterpreter\nre-enact\nre-enactment\nrecreation\nrep\nstage business\nstage fright\nunderstudy\nvoice acting\nwalk\nwalk through something\nSee more results »\ndo verb\n(VISIT)\n[ T ] informal to visit the interesting places in a town or country, or to look around an interesting place: We didn't get to do Nice when we were in France.\nSMART Vocabulary: related words and phrases\nVisiting\nattraction\nbeard the lion (in his/her den) idiom\nbeen\ncall (in) on someone\ncall by\ncome round\nexchange\nhappen along/by (somewhere)\nhaunt\nhave access to someone/something\nhomestay\nhouse-to-house\npay\npop\nround\nstomping ground\nstop by (somewhere)\nstop in\nstop off somewhere\nstop over\nSee more results »\ndo verb\n(STEAL)\n[ T ] UK informal to enter a building illegally and steal from it: Our house was done while we were away.\nSMART Vocabulary: related words and phrases\nStealing\nabscond\nabscond with someone/something\naggravated burglary\nanti-burglar\nanti-burglary\neavesdrop\nhome invasion\nhot-wire\nhousebreaking\njemmy\njimmy\njoyriding\nkleptomania\npiracy\npiratical\npiratically\nplunder\npoach\nsnaffle\nsnarf\nSee more results »\ndo verb\n(CHEAT)\n[ T ] UK informal to cheat someone: $50 for that old bike! You've been done! He did me for a thousand quid for that car.\nSMART Vocabulary: related words and phrases\nCheating & tricking\nanti-fraud\nbad faith\nbamboozle\nbilk\nblackmail\ndeceive\ndiddle\nfeint\nflannel\ngrifter\ngull\nhave an eye to/for the main chance idiom\nhave someone on\nhoax\npretextual\npull\npull a fast one idiom\npull the wool over someone's eyes idiom\npunk\nracket\nSee more results »\ndo verb\n(PRISON)\n[ T ] informal to spend time in prison: He did three years for his part in the robbery. If you're not careful you'll end up doing time again.\nSMART Vocabulary: related words and phrases\nPutting people in prison\nat His/Her Majesty's pleasure idiom\nbang someone up\nbar\nbehind bars idiom\nbird\ncommit\nimmured\nimprison\nimprisonment\nincarcerate\nincarceration\nintern\nlock\npen\nremand\nrestraint\nrot\nrot in jail, prison, etc. idiom\nsend\nstretch\nSee more results »\ndo verb\n(PUNISH)\n[ T ] mainly UK informal to punish someone: If you mess with me again, I'll do you good and proper. I got done (= stopped by the police) for speeding on my way home last night.\nSMART Vocabulary: related words and phrases\nPunishing & punishments\nankle bracelet\nankle tag\nball and chain\nbar\nbe brought/called to account idiom\ndiscipline\nendorse\nendorsement\nexcommunication\nfixed penalty\nflay\nflay someone alive idiom\nget what's coming to you idiom\npenalty\nsentence\nskin someone alive idiom\nslam dunk\nsomeone should be shot idiom\nsort\nsort something out\nSee more results »\ndo verb\n(TAKE DRUG)\n[ T ] informal to take an illegal drug: How long have you been doing heroin? I don't do drugs.\nSMART Vocabulary: related words and phrases\nDrugs - general words\nabstinence\nabstinence-only\nbindle\nbiosimilar\nchase\nmultidrug\nnon-intoxicant\nnon-intoxicating\nnondrug\npeddler\nperformance-enhancing\npill-popping\nsolvent abuse\nspike\nspliff\nsubstance\nsubstance abuse\nwasted\nwhacked\nwiped out\nSee more results »\ndo verb\n(HAPPEN)\nbe doing UK informal\nto be happening: This town is so boring in the evening - there's never anything doing.\nSMART Vocabulary: related words and phrases\nOccurring and happening\nafoot\nasynchronous\nasynchronously\nattend\nattendant\nbe at work idiom\neventuate\nfall into place idiom\nfollow on\ngo hand in hand with something idiom\ngo off\ngo on\ngone\npass\nresynchronize\nroll\nroll around\nshake out\nsucceed\nsupervene\nSee more results »\nGrammar\nDoDo is an irregular verb. Its three forms are do, did, done. The present simple third person singular is does: …\nDo: formsDo is an irregular verb. Its three forms are do, did, done. The present simple third person singular is does: …\nDo: usesWe use do as a main verb and an auxiliary verb. We can also use it as a substitute verb. …\nDo as a main verbDo as a main verb has a number of meanings. …\nDo as an auxiliary verbDo is one of three auxiliary verbs in English: be, do, have. We use do to make negatives (do + not), to make question forms, and to make the verb more emphatic. …\nDo as an auxiliary verb: typical errorsWe don’t use auxiliary do to make questions or negatives for clauses with modal verbs: …\nDo as a substitute verbWe often use do instead of repeating all the words in a clause. Do substitutes for the words we don’t repeat: …\nDo or make?When we use do and make with noun phrases, do focuses on the process of acting or performing something, make emphasises more the product or outcome of an action: …\nIdioms\ncan't be doing with something\ndo as you would be done by\ndo it\ndo something, nothing, etc. for/to someone\nthat does it!\nthat'll do!\nthat's done it!\nwhat's done is donePhrasal verbs\ndo away with something\ndo away with someone\ndo someone down\ndo for someone/something\ndo someone in\ndo yourself in\ndo something out\ndo someone out of something\ndo someone over\ndo something over\nMore phrasal verbs\ndo (something) up\ndo something up\ndo without (something)\ndo noun [C]\n(TREATMENT)\nUK informal a way of treating people: There are no special privileges for the managers - we believe in fair dos all round (= equal treatment for everyone) in this company. It's a poor do (= a bad/unfair situation) when a so-called developed country can't even provide homes for all its citizens.\nSMART Vocabulary: related words and phrases\nBehaving, interacting and behaviour\nas ye sow, so shall ye reap idiom\natavism\nattachment disorder\nattitude\nbearing\nbehave\nconduct\nexample\nhumanization\nhumanize\ninteract\ninteraction\nism\nmake nice idiom\nphase\npresence\nprovincialism\nprovincialist\nprovinciality\nsauce\nSee more results »\ndo noun [C]\n(PARTY)\nmainly UK informal a party or other social event: Colin's having a bit of a do for his 50th birthday. It was one of those dos where nobody really knew each other.\nSMART Vocabulary: related words and phrases\nInformal words for parties\nbash\nbeanfeast\nbeano\nblast\nblowout\nbooze-up\nknees-up\nmixer\npiss-up\nsausage fest\nshindig\nshivoo\ndo noun [C]\n(HAIR)\nUS a\nhairdo old-fashioned\nSMART Vocabulary: related words and phrases\nHairstyles\nAfro\nAfro puff\nbandeau\nBantu knots\nbarnet\nbowl cut\nchignon\nfade\nhair extension\nhaircut\nhairdo\nkiss curl\nplait\npompadour\npony\npudding basin\nrelaxed\nshake out\nsidelock\nundercut\nSee more results »\ndo noun [S]\n(NOTE)\nthe first note of the sol-fa musical scale: Would you sing me a do, please?\nSMART Vocabulary: related words and phrases\nNotes of the musical scale\nB, b\nC, c\nD, d\ndoh\nE, e\nflat\nhigh doh\nla\nlah\nmajor\nmi\nmiddle C\nminor\nregister\nscale\nsemitone\nsoh\nsol\nsol-fa\nte\nSee more results »\nabbreviation for Doctor of Osteopathic Medicine or Doctor of Osteopathy: in the United States, a doctor who is trained in osteopathic medicine (= a system of medicine that emphasizes the care of the whole person, using the latest scientific treatments and also sometimes treating injuries to bones and muscles using pressure and movement), or the medical qualification that this person has: A D.O. is trained to look beyond your symptoms to understand how lifestyle and environmental factors impact your well-being. Michael Walters, D.O. Compare\nM.D.\nMore examplesFewer examplesDoctors of Osteopathic Medicine, or D.O.s, account for approximately 11% of all physicians in the United States.Doctors of osteopathy (D.O.s) receive the same basic training as medical doctors (M.D.s). A D.O. graduate may become licensed as a physician or surgeon and have full medical and surgical practicing rights in all 50 U.S. states.\nSMART Vocabulary: related words and phrases\nMedical treatment: doctors & health workers generally\nacupuncturist\naid worker\nambulanceman\nambulancewoman\nbrain surgeon\ncandy striper\ncare navigator\ncasualty officer\ndentist\nmedico\nministering angel\nNP\nnurse consultant\nnurse practitioner\nnurse specialist\nnurse's aide\noccupational therapist\nstaff nurse\nstretcher-bearer\nsurgeon\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nQualifications: university & college\ndo auxiliary verb\n(FOR QUESTIONS/NEGATIVES)\nAdd to word list\nAdd to word list\npast participle done us/dʌn/ used with another verb to form questions and negative sentences: Where do you work? Why don’t we have lunch together on Friday? \"Didn’t you know Sophie was coming?\" \"Of course I did.\" Don’t talk about that. Note: The negative contractions are doesn’t, didn’t, and don’t.\ndo auxiliary verb\n(FOR EMPHASIS)\nused to give extra force to the main verb: Do be careful. I did say she was a liar, but I was wrong. \"Can I buy stamps here?\" \"Well, we do sell them, but we’re out of them right now.\"\ndo auxiliary verb\n(TO AVOID REPEATING)\npast participle done us/dʌn/ used to avoid repeating a verb or verb phrase: \"I don’t like either candidate.\" \"Neither do I.\" He said he’d leave the car in the garage, but he didn’t. \"May I join you?\" \"Please do!\" \"Did you leave the door open?\" \"Yes, I did.\"\npast participle done us/dʌn/ Do can also replace the main verb in questions that are added to the end of a sentence: You met him at a conference, didn’t you?\nIdioms\ndo credit to someone\ndo justice to someone/something\ndo more harm than good\ndo the trick\ndo wonders for something/someone\ndo verb\n(CAUSE TO HAPPEN)\n[ T ] to cause something to happen or be the cause of something happening; perform or have a part in an activity: Inviting the whole family was a really nice thing to do. What are you doing over the weekend? I’ve got to stay home and do my homework. The theater club is doing \"South Pacific\" this year. I’m sorry, there’s nothing more to be done (= nothing else will help). It isn’t important whether you win or lose – just do your best. It’s been a pleasure doing business with you (= dealing with you). The company is counting on each of you to do your part/share. Would you do me a favor (= help me) and get some bread while you’re out? A little fresh air will do you some good (= make you feel better). What are these toys doing here (= Why are they here)? I’ve been trying to do (= solve) this puzzle for hours. What can I do for you (= How can I help you)? What have you done with my coat (= Where have you put it)? Since she retired, she doesn’t know what to do with herself (= how to keep herself busy).\n[ T ] To do can mean to work at as a regular job: \"What do you do?\" \"I teach high school math.\"\n[ T ] If you ask or say how someone is doing, you are asking or saying how the person is feeling or what the person’s condition is: How are you folks doing today? Both the mother and her new baby are doing fine. We’ve had some difficult times, but we’re doing all right now.\n[ T ] If you say what’s doing or what’s doing at a particular place, you are asking what is happening there: What’s doing at the office?\ndo verb\n(ARRANGE)\n[ T ] to shape, arrange, or fix something in an attractive way: Who does your hair?\ndo verb\n(TRAVEL)\n[ T ] to travel at a stated speed or over a particular distance: We were only doing 70 miles per hour. We did 400 miles yesterday.\ndo verb\n(BE ACCEPTABLE)\n[ I ] to be acceptable, suitable, or enough: \"Will this room do?\" \"Yes, it’ll be fine.\" This kind of behavior just won’t do. Phrasal verbs\ndo someone in\ndo someone in\ndo someone out of something\ndo away with something\ndo over something\ndo without something/someone"}