{"id":130901,"name":"dock","type":"noun","us_sound":"dɑːk","us_link":"../audio/d/doc.mp3","uk_sound":"dɒk","uk_link":"../audio/d/ukdizzi015.mp3","content":"dock noun\n(FOR SHIPS)\nAdd to word list\nAdd to word list\nC1 [ C ] an area of water in a port that can be closed off and that is used for putting goods onto and taking them off ships or repairing ships Compare\nharbour noun UK\nomersukrugoksu/iStock/Getty Images Plus/GettyImages docks [ plural ]\na group of these areas of water in a port and the buildings around them: The strike has led to the cancellation of some ferry services and left hundreds of passengers stranded at the docks.\nSee more\n[ C ] US a long structure built over water where passengers can get on or off a boat or where goods can be put on and taken off\nmysticenergy/E+/GettyImages\nMore examplesFewer examplesThe ship sailed into the dock to be refitted.We are currently in dock waiting to disembark.\nSMART Vocabulary: related words and phrases\nPorts & docks\nanchorage\nbasin\nboatyard\nbreakwater\nderrick\ndockyard\nfree port\nharbour master\nhaven\nmarina\npassport control\nport\nquayside\nsea wall\nshipyard\nslip\nsuperport\nterminal\nthe dockside\nwharf\nSee more results »\ndock noun\n(LAW)\nthe dock [ S ] mainly UK\nthe place in a criminal law court where the accused person sits or stands during the trial: The defendant seemed nervous as he left the dock and stepped up to the witness box. The company will find itself in the dock (= in court) if it continues to ignore the pollution regulations.\nilbusca/E+/GettyImages\nSMART Vocabulary: related words and phrases\nLaw courts\nappellate\nbefore\nbench\nchamber\nchancery\ncircuit court\ncourthouse\ncourtroom\ncriminal court\nCrown Court\nHigh Court\nindustrial tribunal\njury box\njustice\nkangaroo court\nthe Inns of Court\nthe Supreme Court\ntribunal\nvenue\nwitness box\nSee more results »\ndock noun\n(PLANT)\n[ C or U ] a common wild plant with large wide leaves that grows in some northern countries such as Britain: Rubbing dock leaves on nettle stings helps to relieve the pain.\nRuudMorijn/iStock / Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nCommon plants\nAfrican violet\nagave\naloe\naloe vera\nalpine strawberry\ndianthus\ndichondra\ndieffenbachia\ndill weed\ndracaena\nliquorice\nloganberry\nmaidenhair fern\nmaize\nmandrake\nsnake plant\nsorrel\nsotol\nsow thistle\nSpanish moss\nSee more results »\ndock noun\n(EQUIPMENT)\n[ C ] a\ndocking station\nSMART Vocabulary: related words and phrases\nMachines - generators & pumps\n-engined\nalternator\nbreeder reactor\ncharger\ndocking station\ndynamo\nelectromotive\ngenerator\njet engine\nnuclear reactor\npower station\npump-action\nsail\nsolar plant\nsubstation\ntreadmill\nturbofan\nvacuum pump\nwatermill\nwaterwheel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nElectrical switches & connections\ndock verb\n(REMOVE)\n[ T ] to remove part of something: As a punishment, the Army docked the soldiers' pay/wages by 20% and took away their leave. The lambs' tails are docked (= cut short) for hygiene reasons.\nSMART Vocabulary: related words and phrases\nCutting off and disconnecting\namputate\namputation\namputee\nBrexit\ncastration\nchop\nchop something off\ncircumcise\ncrop\ncut back\ndisconnect\ndisconnected\ndisconnection\ndismember\ndismemberment\nlop something off\nnonconnection\npost-amputation\nsaw something off\nsever\nSee more results »\ndock verb\n(SHIP)\n[ I or T ] If a ship docks, it arrives at a dock and if someone docks a ship, they bring it into a dock: Hundreds of people turned up to see the ship dock at the pier. The Russians and Americans docked (= joined together in space) (their spacecraft) just after one o'clock this morning.\nSMART Vocabulary: related words and phrases\nArriving & departing by boat or ship\nanchor\nberth\ncast\ncast off\nland\nlanding\nlaunch\nlauncher\nmoor\npost-landing\nrelaunch\nsail\nsea\nshove\nshove off!\nweigh\nYou can also find related words, phrases, and synonyms in the topics:\nArriving, entering and invading\ndock noun [C]\n(STRUCTURE)\nAdd to word list\nAdd to word list\na structure built out over water in a port along which ships can land to load and unload, or the enclosed area of water between two such structures\nA dock is also a flat, raised area attached to a building and used for loading and unloading trucks.\ndock verb\n(ARRIVE)\n[ I/T ] to arrive at a dock or to bring a ship into a dock: [ I ] The ship docked in Japan, and he took another to Korea.\ndock verb\n(REMOVE)\n[ T ] to take away a part of someone’s pay: I’ve used up my sick days, and if I take another day off they’ll dock me a day’s pay.\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; TRANSPORT an area of water in a port where goods are put onto and taken off ships, or ships are repaired: The vessel is currently in dock in Belfast.\ndocks [ plural ]\nTRANSPORT a group of these areas in a port and the buildings around them: The goods have been unloaded at the docks, but have not yet been cleared by customs.\n[ C ]\n&#160; TRANSPORT\n&#160; (also loading dock) a space at the back of a ship or in a warehouse where goods are put in or taken out\nthe dock mainly UK\n[ S ]\n&#160; LAW the place in a criminal law court where the accused person sits or stands during the trial: The company will find itself in the dock if it continues to ignore pollution regulations.\n[ I or T ]\n&#160; TRANSPORT if a ship docks, it arrives at a dock and if someone docks a ship, they bring it into a dock: The trawler docked in Cairns and the cod was delivered to the filleting factory.\n[ T ] to reduce an amount of money that is given to someone: dock sb's wages/pay They have their pay docked if the work is not finished on time.dock sth off sth Some groups deduct the annual fee from the underlying fund's income while others dock it off capital."}