{"id":130988,"name":"document","type":"noun","us_sound":"ˈdɑː.kjə.mənt","us_link":"../audio/d/eus71351.mp3","uk_sound":"ˈdɒk.jə.mənt","uk_link":"../audio/d/epd31690.mp3","content":"Add to word list\nAdd to word list\nA2 a paper or set of papers with written or printed information, especially of an official type: official/confidential/legal documents They are charged with using forged documents.\nB1 a text that is written and stored on a computer: I'll send you the document by email.\nMore examplesFewer examplesThis certificate is an important document, and should be kept securely .I've lost a file containing a lot of important documents.Many important historical documents were destroyed when the library was bombed.Please sign one copy of the document and return it to us as soon as possible.To open a new document, click 'File', then click 'New'.\nSMART Vocabulary: related words and phrases\nOfficial documents\naccounts\naffidavit\naleatory\nannal\napostille\nengrossment\nfiling\nfree pass\nget-out clause\nGreen Paper\nprenuptial agreement\nproceedings\npt\nPTO\nrecertification\nrecertify\nrenewable\ntitle deed\nwarrant\nwrit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer concepts\nto record the details of an event, a process, etc.: His interest in cars has been well-documented (= recorded and written about) by the media.\nSMART Vocabulary: related words and phrases\nWriting & typing\nannotate\nasemic\nbang\nbang something out\nbash something out\nborrow\nborrow something from something\nchart\ndot\ninscribe\nkeyboard\nre-registration\nreadability\nrecompose\nreformulate\nrekey\nsemiotics\nspeller\ntab\ntranscribe\nSee more results »\nAdd to word list\nAdd to word list\na paper or set of papers with written or printed information, esp. of an official type: Do you have all your documents in order to apply for a passport?\nA document is also a file on a computer in which text is stored.\nto record information about something by writing about it or taking photographs of it: The study documents various aspects of Indian life in this period.\nAdd to word list\nAdd to word list\na paper or set of papers that contains official information or instructions: a one-/five-/twenty-, etc. page document a consultative/consultation/framework documentdraft/circulate/publish a document Each bank will be required to publish a document detailing its annual and final bonus payments.obtain/receive/sign a document Don't sign any documents with items left blank or containing anything you don't understand.a document contains/outlines/describes Federal Agency documents outline the scope of the extensive project. Full details will be included in your policy document. We will accept original documents only, not copies. A spokesman from the Home Office refused to comment on the leaked document. a forged document a legal/official/formal document a classified/internal/confidential document See also\ndefence document\nexport document\noffer document\nshipping documents\nCOMMUNICATIONS, IT a computer file that contains text and sometimes images: print/save/format a document Remember to save your documents at regular intervals when making changes. I was unable to open the attached document.\nto record information about something important by writing about it or photographing it: Companies must document the controls their financial departments use to deter fraud. The harmful effects of greenhouse gases have been well documented. A recent state investigation found that the district has failed to document how it spent some $23 million in federal funds."}