{"id":130992,"name":"documentary","type":"noun","us_sound":"ˌdɑː.kjəˈmen.t̬ɚ.i","us_link":"../audio/d/eus71353.mp3","uk_sound":"ˌdɒk.jəˈmen.tər.i","uk_link":"../audio/d/ukdocud003.mp3","content":"Add to word list\nAdd to word list\nB1 a film or television or radio programme that gives facts and information about a subject: The documentary took a fresh look at the life of Darwin. They showed a documentary on animal communication.\nMore examplesFewer examplesWe're compiling some facts and figures for a documentary on the subject.The documentary was made on location in the Gobi desert.The documentary presented us with a balanced view of the issue.The documentary went through all the graphic details of the operation in unsparing detail.The documentary was a misrepresentation of the truth and bore little resemblance to actual events.\nSMART Vocabulary: related words and phrases\nBroadcasting: programmes & other broadcasts\naction replay\nbinge-watch\nblooper\nbreakfast television\nbreaking news\ncommentary\nfly on the wall idiom\ngame show\nGod slot\ngreen screen\nhate-watch\npilot\nreality show\nreality TV\nrerun\nrom com\nserial\nsketch\nsoap\nsyndicate\nSee more results »\nin the form of documents: Human rights campaigners have discovered documentary evidence of torture.\ngiving facts and information about a subject in the form of a film or television or radio programme: Most of her movies have a documentary style.\nSMART Vocabulary: related words and phrases\nProving and disproving\nactions speak louder than words idiom\nanti-sexist\nattest\nauthenticate\ndemonstrable\ndemonstrably\ndispel\ndisprove\ndo justice to someone/something idiom\nprobatory\nproof positive\nprovability\nprovable\nprovably\nthe acid test\nverify\nvindicate\nvindication\nvindicative\nvindicatory\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTrue, real, false, and unreal\nAdd to word list\nAdd to word list\na film or television or radio program that gives information about a subject and is based on facts: a documentary on animal communication\nconsisting of official documents or other written or printed material: documentary evidence"}