{"id":131012,"name":"dodder","type":"verb","us_sound":"ˈdɑː.dɚ","us_link":"../audio/d/cdo1121usdodd1425.mp3","uk_sound":"ˈdɒd.ər","uk_link":"../audio/d/cdo1121ukdodd1377.mp3","content":"Add to word list\nAdd to word list\nto move slowly and weakly, as if you might fall, especially because of being very old: There's an old family servant who dodders around.\nThesaurus: synonyms, antonyms, and examples\nto walk in a way that is not controlled or evenstumbleHe was stumbling around the house like he was drunk.lumberWe held our breath as a black bear lumbered across the hiking trail ahead of us.galumphThe children galumphed down the steps and raced outside to play.bumbleHe bumbled into her and spilled her drink down her gown.falterThe dancer faltered right before the jump and landed awkwardly.totterHe tottered carefully down the gangplank, clutching at the railing.\nSee more results »\nMore examplesFewer examplesIn this part of town in the past, old ladies doddered about clad in dressing gown, slippers and curlers.If living to 100 means two decades doddering around getting increasingly frail and losing my marbles, then count me out. Nobody wants people doddering around in nursing homes, in pain and heavily medicated.If you're swaying and doddering on the spot, a little the worse for wear, then bar staff can refuse to serve you.\nSMART Vocabulary: related words and phrases\nMoving unsteadily or with difficulty\nblunder\nbumble\ndodderer\ndoddery\nfalter\nfavour\ninflexibly\nlimp\nlollop\nlumber\nlumpily\nlurch\nreel\nsqueeze\nteeter\ntoddle\ntoil\ntotter\ntottering\ntumble\nSee more results »\na type of yellow or orange plant that lives and feeds on other plants: The spindly orange vine known as dodder is a parasitic plant. Dodders are examples of ectoparasites, living outside the host, but attached to it by feeding organs.\nMore examplesFewer examplesThe dodder has no leaves and no connection with the soil after its seeds have germinated; the roots do not develop.Some people believe that dodder takes on the qualities of the plant it lives off, and the dodder that grows on thyme has been a favourite in European folk medicine.It's sometimes better to sacrifice the crop rather than let the dodder go uncontrolled.This sucker-like organ inserted into the cells of the host, through which food is withdrawn, is found in fungi and parasitic flowering plants, such as dodder.\nSMART Vocabulary: related words and phrases\nClimbing plants\nbindweed\nBoston ivy\nbougainvillea\nclematis\nclimber\nfox grape\ngrapevine\nhoneysuckle\nhoya\nivied\nold man's beard\npassion flower\nphilodendron\nplumbago\npoison ivy\nsweet pea\ntraveller's joy\ntrumpet vine\ntwining\nvine\nSee more results »"}