{"id":131071,"name":"dodge","type":"verb","us_sound":"dɑːdʒ","us_link":"../audio/d/dodge.mp3","uk_sound":"dɒdʒ","uk_link":"../audio/d/ukdocud010.mp3","content":"Add to word list\nAdd to word list\n[ I or T ] to avoid being hit by something by moving quickly to one side: He dodged to avoid the hurtling bicycle.\n[ T ] to avoid something unpleasant: The Senator dodged questions about his relationship with the actress.\nThesaurus: synonyms, antonyms, and examples\nto avoid doing somethingavoidAvoid swimming in areas where sharks are known to congregate.evadePlease don’t think I’m trying to evade my responsibility.dodgeHe tried to dodge his military service.run away fromI didn't often run away from difficult decisions.shrink fromI've never been one to shrink from a challenge.sidestepThis is not a responsibility you can sidestep.\nSee more results »\nSMART Vocabulary: related words and phrases\nMoving in order to avoid contact\navoid\navoid something like the plague idiom\navoidance\nbypass\ncircumnavigate\nclear\nduck\nduck and weave idiom\nevasive\nevasively\nevasiveness\nfall\nfall back\njump\nmoving target\nsidestep\nskirt\nsteer clear of someone/something idiom\nweave\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAvoiding action\na clever, dishonest way of avoiding something: They bought another car as a tax dodge (= a way to avoid paying tax).\nSMART Vocabulary: related words and phrases\nAvoiding action\nabrogate\nabrogation\navoid\navoid something like the plague idiom\navoidance\nevade\nevader\nevasion\nfiddle\nfiddle around\nfight shy of idiom\nflinch\ninsure\nshirk\nshort circuit\nshrink from something\nshy away from something\nsit on your arse idiom\nsteer\nwelch\nSee more results »\nAdd to word list\nAdd to word list\nto avoid being hit by something by moving quickly to one side: fig. We have dodged a bullet a lot of times in the last three or four years.\nTo dodge something unpleasant is to avoid it: [ T ] Few men still talk about how they dodged the draft.\na trick to deceive someone or to avoid doing something that you do not want to do: She sells antiques as a tax dodge.\nAdd to word list\nAdd to word list\nto avoid something, especially illegally: He has repeatedly dodged questions from reporters. The company filed for bankruptcy, seeking to dodge $445,000 in debts. Many people caught dodging tax were doing so to hide capital gains made on the stock market.\na way of avoiding something, sometimes illegally: When measured in yen, trade went up by only 2%, but measuring trade in yen is a dodge, because almost all of it is conducted in dollars. See also\ntax dodge"}