{"id":131124,"name":"doff","type":"verb","us_sound":"dɑːf","us_link":"../audio/d/usdizzy027.mp3","uk_sound":"dɒf","uk_link":"../audio/d/ukdocud021.mp3","content":"doff verb\n(REMOVE CLOTHES)\nAdd to word list\nAdd to word list\n[ T ] old-fashioned or humorous to remove your hat, usually to show respect: He doffed his hat and walked away. I don't see why we should doff our caps to him. doff your hat to someone/something (also doff your cap to someone/something)\nto show or express respect for someone or something: The song doffs its hat to the best soul traditions. I doff my cap to my brilliant colleagues and their work.\n[ T ] old-fashioned or humorous to remove a piece of clothing: They were given 30 minutes to don and doff their uniforms. He doffs his robe and steps into the shower. She doffed the ginger wig and said \"It's me, don't you recognize me?\" Opposite\ndon formal\nMore examplesFewer examplesHis hand rose as if to doff his cap, but instead he scratched his head.The men doff their helmets and bow their heads.If women are equal to men, why should men doff their hats?They all seem ready to doff their clothes within minutes of meeting one another.\nSMART Vocabulary: related words and phrases\nNot wearing or removing clothes\naltogether\nau naturel\nbare\nbare naked idiom\nbarefoot\nfling\nimmodest\nimmodestly\nimmodesty\nin shirtsleeves idiom\nin your birthday suit idiom\nrevealing\nshirtsleeve\nshuck\nshuck something off\nslip\nstreaker\nunclad\nundress\nundressed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysical gestures of respect\ndoff verb\n(CLOTH MAKING)\n[ I or T ] to remove full bobbins or spindles (= round parts that hold thread) from a spinning machine (= a machine for making thread by twisting fibres), or to remove full bolts (= rolls of cloth) from a loom (= a machine for making thread into cloth), and replace them with empty ones: In the early 20th century, doffing was a dangerous job that was often done by small children for low pay. In our factory we doff a loom using a fully automated process.\nSMART Vocabulary: related words and phrases\nIndustry & industrial processes\nadditive manufacturing\nbiomanufacturing\ncarding\ncleantech\ncompression moulding\ninjection moulding\ninter-industry\njust-in-time\nlight industry\nmachine carding\nnon-technical\nprebuilt\nprefabricated\nprefabrication\nquality assurance\nsunset industry\nsynthetic\nsynthetically\nvitrification\nvulcanization\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTextiles: general words"}