{"id":131132,"name":"dog","type":"noun","us_sound":"dɑːɡ","us_link":"../audio/d/dog.mp3","uk_sound":"dɒɡ","uk_link":"../audio/d/ukdocud022.mp3","content":"dog noun [C]\n(ANIMAL)\nAdd to word list\nAdd to word list\nA1 a common animal with four legs, especially kept by people as a pet or to hunt or guard things: my pet dog wild dogs dog food We could hear dogs barking in the distance.\nTracy Morgan/Dorling Kindersley/GettyImages\nMore examplesFewer examplesI grabbed the dog by the collar and dragged it out of the room.A dog lay under the table, gnawing on a bone.Steve's gone out to walk the dogs.The security guards set their dogs on the intruders.Please keep your dog on a lead when on the beach.\nSMART Vocabulary: related words and phrases\nCanines (dogs)\nAfghan hound\nAlsatian\nAmerican cocker spaniel\nbasset hound\nbeagle\ndoggie day care\ndoggish\ndoggishly\ndoggy\ndoodle\nmastiff\nmongrel\nmutt\nNewfoundland\noodle\nShih Tzu\nsniffer dog\nspaniel\nSt Bernard\nStaffie\nSee more results »\ndog noun [C]\n(PERSON)\nslang a man who is unpleasant or not to be trusted: He tried to steal my money, the dirty dog.\noffensive an offensive word for an ugly person, especially a woman Idioms\na dog in the manger\na dog's breakfast\nthe dog's bollocks\na dog's life\ndone up/dressed up like a dog's dinner\nevery dog has its day\ngive a dog a bad name\ngo to the dogs\nlet sleeping dogs lie\nput on the dog\nMore idioms\nwhy keep a dog and bark yourself?\nyou can't teach an old dog new tricks\ndog verb [T]\n(FOLLOW)\nto follow someone closely and continuously: Reporters dogged him for answers. See also\ndogged\nThesaurus: synonyms, antonyms, and examples\nto follow someone or somethingfollowFollow me - this way!tag alongDo you mind if my little brother tags along?chaseHe was running and the dog was chasing him.pursueThe robber was pursued by several members of the public.tailThe car was tailed by police for several hours.shadowThe police think the robbers shadowed their victims for days before the crime.\nSee more results »\nSMART Vocabulary: related words and phrases\nPursuing\nbe hot on someone's track/trail idiom\nbe on someone's tail idiom\nbear\nbear down on someone/something\nbring\nbring up the rear idiom\nconvoy\nflight\nhumbug\nin hot pursuit idiom\non the scent idiom\npester\npursue\npursuer\nshadow\nstick\ntailgate\ntargetable\ntrack\ntrack and trace\nSee more results »\ndog verb [T]\n(PROBLEM)\nto cause difficulties: Technical problems dogged our trip from the outset.\nSMART Vocabulary: related words and phrases\nInconvenience\naggravation\naggro\nawkward\nbore\nbother\nbulky\ndisturbance\ndrag\nfag\nimposition\ninconvenience\ninconvenient\ninconveniently\ninopportune\npisser\nput something out\nrigamarole\nrigmarole\nsnag\ntempest\nSee more results »\ndog noun [C]\n(ANIMAL)\nAdd to word list\nAdd to word list\nan animal with four legs, commonly kept as a pet, and sometimes used to guard things\ndog noun [C]\n(PERSON)\nslang a person of a stated type: You won $1000? You lucky dog!\ndog verb [T]\n(FOLLOW)\nto follow someone closely and continually: The scandal seems likely to dog him for months to come.\nAdd to word list\nAdd to word list\ninformal an investment, company, or product that will probably fail\nMARKETING a product that has a small share of a market that has a low rate of growth Compare\nBoston Matrix\ndog eat dog informal\na situation in which competitors are willing to harm each other in order to be successful: It is dog eat dog on Las Vegas's world-famous Strip as huge casino complexes compete for attention. The fast-growing telecom industry was a dog-eat-dog world where firms were either looking to expand or ripe for takeover.\neat your own dog food informal\nif a company eats its own dog food, it uses the products that it makes in its own business activities, rather than using products made by other companies: The company, which makes high-tech equipment, could not have grown as fast as it has without eating lots of its own dog food.\ngo to the dogs informal (also US go to hell in a handbasket/handcart)\nto get into a very bad situation: The economy seems to be going to the dogs. Signs of a global recession inevitably conjure up thoughts of the last time we went to hell in a handbasket: the Great Depression of the 1930s.\nthat dog won't hunt US informal\nused to say that a plan will fail See also\ntop dog"}