{"id":131179,"name":"dogged","type":"adjective","us_sound":"ˈdɑː.ɡɪd","us_link":"../audio/d/eus75640.mp3","uk_sound":"ˈdɒɡ.ɪd","uk_link":"../audio/d/ukdocud028.mp3","content":"Add to word list\nAdd to word list\nvery determined to continue doing something, or trying to do something, even when this is difficult or takes a long time: She was a dogged advocate of the struggle against injustice. He is dogged in his pursuit of his dreams.\nThesaurus: synonyms, antonyms, and examples\nworking to achieve a goal even if it is difficult determinedI was determined not to give up.doggedHer dogged determination to uncover the truth about the scandal led to her winning a reporting prize.persistentThe shop never gives refunds, but if you are persistent, they may. resolvedI am resolved to do something about the issue.resoluteWe must remain resolute in the face of opposition.single-mindedShe was single-minded and uncompromising in her work.\nSee more results »\nused with words that mean 'continued effort' to emphasiz the quality of not stopping or giving up: The campaigners' dogged persistence is finally paying off. He inspired dogged devotion in his followers. Synonyms\npersistent\npertinacious formal\ntenacious\nunyielding\nMore examplesFewer examplesHe was well-known as a dogged investigator who was willing to take on powerful politicians.They finished the race just ahead of their dogged pursuers.Scientific progress is often the result of dogged determination and hard work.She was known for her dogged pursuit of the truth.\nSMART Vocabulary: related words and phrases\nStrong-willed\nadamancy\nadamant\nadamantine\nadamantly\naggressive\ngrittily\ngutsily\ngutsy\ngutty\nhard-boiled\npersistently\npertinacious\npertinaciously\npigheaded\npigheadedly\ntough cookie\nultra-competitive\nultra-militant\nultra-serious\nunbending\nSee more results »\nRelated words\ndoggedly\ndoggedness\nAdd to word list\nAdd to word list\ndetermined to do something, even if it is very difficult: John Regan credited the capture to dogged persistence by police. doggedly adverb us\nYour browser doesn't support HTML5 audio\n/ˈdɔ·ɡɪd·li/\nGove spent much of the last decade of his life doggedly defending his principles."}