{"id":131230,"name":"dogleg","type":"noun","us_sound":"ˈdɑːɡ.leɡ","us_link":"../audio/d/usdogfi008.mp3","uk_sound":"ˈdɒɡ.leɡ","uk_link":"../audio/d/ukdogge008.mp3","content":"Add to word list\nAdd to word list\na sharp bend, especially in a road or on a golf course: The driver lost control as he tried to negotiate a dogleg on a steep mountain road. The 17th hole is a left-hand dog-leg.\nMore examplesFewer examplesThe road makes a dog-leg towards Puerto in the east.The main road describes a dog-leg through the site.The Southern Hills course has many doglegs.The last hole is a nasty uphill dogleg.Near the end of the marathon comes a dog-leg right turn in front of Buckingham Palace.\nSMART Vocabulary: related words and phrases\nGolf\nbogie\ncaddy\nclip\ncrazy golf\ncut\ndriver\ndump\nfade\nfore\nfringe\ngolf\ngolf ball\noutdrive\nouthit\nround\nslice\ntap in\ntee (something) up\ntee someone off\nwood\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeometry: bends, loops & curves\n(of a route) bending sharply, especially in a road or on a golf course: We had to follow a dog-leg diversion around the roadworks. The next hole is a dogleg right.\nMore examplesFewer examplesThe golf course was designed by the famous James Braid, who specialized in dogleg layouts.A dogleg side passageway in a garden means you have the chance to create an element of surprise as you turn the corner.Everyone was following the same dog-leg route.The main hall has a pair of massive Tuscan plaster columns and an elegant dog-leg staircase.\nSMART Vocabulary: related words and phrases\nGeometry: bends, loops & curves\nanfractuous\narc\ncoil\nconic\ncurl\ncurve\nfishhook\nhelically\nhelix\nhyperbola\nhyperbolic\nkink\nloop\nparabola\npeaked\ntight\ntrajectory\nturn\nwhorl\nwraparound\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGolf\nto take a route that bends sharply: The course doglegs right and then left. The highway dog-legs right to cross the river\nMore examplesFewer examplesGo through the gate, dogleg left and right round the end of the barn and then join the farm lane.The road sweeps on to the village of Palékastro, then doglegs south.There was a line of people stretching down South Braddock Avenue and doglegging past the gas station.I took a photo from the plane of the deep water channel that dog-legged in from the west.\nSMART Vocabulary: related words and phrases\nGeometry: bends, loops & curves\nanfractuous\narc\ncoil\nconic\ncurl\ncurve\nfishhook\nhelically\nhelix\nhyperbola\nhyperbolic\nkink\nloop\nparabola\npeaked\ntight\ntrajectory\nturn\nwhorl\nwraparound\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGolf"}