{"id":131451,"name":"dolly","type":"noun","us_sound":"ˈdɑː.li","us_link":"../audio/d/dolly.mp3","uk_sound":"ˈdɒl.i","uk_link":"../audio/d/ukdogge028.mp3","content":"dolly noun [C]\n(DOLL)\nAdd to word list\nAdd to word list\nchild's word a doll (= a toy in the shape of a small person or baby): She'll sit and play with her dollies for hours. Toys get very straightforward names round here, like “Purple Teddy”, “Big Dolly”, “Little Dolly”, “Bunny” and “Dog”.\nvalio84sl/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nToys & dolls\nballoon\nbeach ball\nchew toy\ncuddly toy\ndoll's house\nfidget\nfidget spinner\nfinger puppet\ngacha\nmarble\nmarionette\nmud pie\nrag doll\nRussian doll\nslap bracelet\nslime\nsnow globe\nsock puppet\nSoft Stuff\nstuffed animal\nSee more results »\ndolly noun [C]\n(STRUCTURE ON WHEELS)\nUS (UK sack barrow, sack truck) a board or frame on wheels, usually with a handle at waist height, used for moving heavy objects such as furniture or machines: Using a dolly, they rolled the safe to a loading dock. The machine weighed nearly 650 pounds and had to be delivered on a tilting dolly so that it could be angled through doors. Synonym\nhand truck\nonurdongel/iStock/Getty Images Plus/Getty Images /GettyImages\ntheatre &amp; film\n&#160; specialized a structure on wheels for moving a large film camera: The image shows the director on a dolly filming her documentary. You might want to do a crane shot or a dolly shot.\na board on wheels for lying on so that you can roll yourself under vehicles when examining or repairing them: He lay flat on a dolly under his 18-wheeler, adjusting the brakes with a wrench and a screwdriver. The underground pits allow inspectors to walk underneath trucks to inspect their undercarriages instead of using a dolly to slide underneath vehicles.\nMore examplesFewer examplesThe defence team wheeled a dolly loaded with document boxes into the courtroom.He had bought a large air conditioner, which he was pulling on a dolly behind him.\nSMART Vocabulary: related words and phrases\nHandcarts, trolleys & prams\nbaby carriage\nbarrow\nbuggy\ncart\ndoll's pram\nfood cart\nhand truck\nhandcart\nperambulator\npram\npushchair\nsack barrow\nsack truck\nshopping cart\nstroller\ntea cart\ntrailer\nwheelbarrow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAudio & video equipment\nCinema & theatre: production, direction & recording\nEngineering - mechanical\nAdd to word list\nAdd to word list\na doll"}