{"id":131432,"name":"dollar","type":"noun","us_sound":"ˈdɑː.lɚ","us_link":"../audio/d/dollar.mp3","uk_sound":"ˈdɒl.ər","uk_link":"../audio/d/ukdogge026.mp3","content":"Add to word list\nAdd to word list\nA1 (symbol $) the standard unit of money used in the US, Canada, Australia, New Zealand, and other countries: Can I borrow $10? There are one hundred cents in a dollar. You can pay in euros or in US dollars. The suitcase was full of dollar bills. the dollar\nthe value of the US dollar, used in comparing the values of different types of money from around the world: In the financial markets today, the dollar rose against/fell against (= was worth more than/less than) the pound.\nMore examplesFewer examplesOn the foreign exchanges the pound rose two cents against the dollar to $1.52.The government is spending millions of dollars in its attempt to combat drug abuse.She got $8 million for appearing in that film.I need to change my dollars into English money.I'm a little short this week - could you lend me $10?\nSMART Vocabulary: related words and phrases\nNorth American money\nbuck\nC-note\ncent\ndime\ndollar sign\nG, g\ngreenback\nnickel\npenny\nquarter\nsmacker\ntoonie\ntwo bits\nYou can also find related words, phrases, and synonyms in the topics:\nCurrencies\nIdiom\ntop dollar\nAdd to word list\nAdd to word list\na unit of money, used in the US, Canada, Australia, New Zealand, and other countries, that is worth 100 cents: Could you lend me ten dollars?\nAdd to word list\nAdd to word list\nMONEY a name for the currency used in the US, Australia, Canada, and several other countries: Beverage Marketing Corp estimated that the typical half-liter container of bottled water sells for about a dollar. Many businesses were hit with a surprise tax bill costing them several thousand dollars. Crude oil is priced in dollars.thousands/millions/billions, etc. of dollars Investors lost billions of dollars in the stock market crash.\nthe dollar\nMONEY the value of the US dollar compared to the value of currencies of other countries: the dollar climbed/rose/fell In late New York trading the dollar rose to 112.10 yen.the strong/weak dollar The weak dollar has hurt European companies by making their goods more expensive for US customers. The euro gained 1.6% against the dollar amid expectations of an imminent rise in interest rates.\nadvertising/investment/tax, etc. dollars\nCOMMERCE, FINANCE dollars that come from or are spent on a particular activity: Analysts predict there will not be enough advertising dollars for every online company. Congressional Democrats pledged to find more research dollars for clean energy.\nMONEY a piece of paper money or a coin worth one dollar: dollar bill. dollar coins. See also\nhalf-dollar\ntop dollar\nhaving a particular value in dollars: As growth and profits slow, dollar assets will look less attractive to international investors."}