{"id":131531,"name":"domain","type":"noun","us_sound":"doʊˈmeɪn","us_link":"../audio/d/domain.mp3","uk_sound":"dəˈmeɪn","uk_link":"../audio/d/ukdolph003.mp3","content":"domain noun [C]\n(AREA)\nAdd to word list\nAdd to word list\nC1 an area of interest or an area over which a person has control: She treated the business as her private domain. These documents are in the public domain (= available to everybody).\nMore examplesFewer examplesAre you still looking for some kind of job in the political domain?I don't do any gardening - that's my wife's domain.The report should never have been released into the public domain.Now that she is a teenager, her bedroom is strictly her own personal domain.You'd better ask Paul - electronics is not my domain, I'm afraid.\nSMART Vocabulary: related words and phrases\nDuty, obligation and responsibility\naccountable\naccountable to someone\naccountably\nanswer for something\nbear\ncommitment\nfail\nfall to someone\nfiefdom\ngotta\nhad better/best do something idiom\nhat\nought to\nowe someone a living idiom\npass the buck idiom\npay your dues idiom\nportfolio\nsomeone's answer to someone/something idiom\nstick\nthe onus\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTopics & areas of interest\ndomain noun [C]\n(INTERNET)\ninternet &amp; telecoms\n&#160; specialized a set of websites on the internet that end with the same letters, for example .com\nSMART Vocabulary: related words and phrases\nInternet terminology\n.plc.uk\n2FA\n2SV\nabove/below the fold idiom\naddress bar\naffiliate link\nhybrid\ninternet-enabled\ninterweb\nIP\nkeyboard warrior\nlanding page\nping\npodcast\nservice provider\ntweeter\ntweetstorm\ntwitterati\nTwitterer\ntwittering\nSee more results »\ndomain noun [C]\n(INTEREST)\nAdd to word list\nAdd to word list\nan area of interest or an area over which a person has control: the domain of polymer science public and private domains\ndomain noun [C]\n(GROUP OF VALUES)\nmathematics a group of all the possible replacements for a variable (= letter or symbol that represents any set of values)\nAdd to word list\nAdd to word list\na particular interest, activity, or type of knowledge\na business activity that is controlled by a particular industry, group of people, etc.: Despite many advertising agencies having moved into their domain, specialised direct marketing agencies remain very competitive. Currency trading is usually the domain of big banks. Boardroom decisions are the exclusive domain of company directors. the political/scientific domain See also\nthe private domain\nthe public domain\nINTERNET a group of computers or websites that are organized by purpose, for example, to provide education or sell products: The organization met to discuss adding new 'top-level' domains, the global designations such as .com and .gov."}