{"id":131553,"name":"domestic","type":"adjective","us_sound":"dəˈmes.tɪk","us_link":"../audio/d/domestic.mp3","uk_sound":"dəˈmes.tɪk","uk_link":"../audio/d/ukdolph006.mp3","content":"domestic adjective\n(COUNTRY)\nAdd to word list\nAdd to word list\nB2 relating to a person's own country: domestic airlines/flights Domestic opinion had turned against the war.\nMore examplesFewer examplesThe prime minister's globetrotting has led to accusations that he is ignoring domestic problems.The domestic market is still depressed, but demand abroad is picking up.The reduction of crime levels is the centrepiece of the president's domestic policies.Sadly, his reforms opened up a Pandora's box of domestic problems.As the NEC's deputy for domestic policy issues, Sperling has functioned as both policy wonk and political guru.\nSMART Vocabulary: related words and phrases\nCountries, nationalities & continents: country & nation\nbirthright citizenship\nbody politic\nBRICS\ncitizen\ncompatriot\ncross-border\ndenaturalize\ndomestically\ndual\nfatherland\ninternationalism\nnative\nnaturalization\nnon-country\nnon-domestic\nnon-indigenous\nnon-national\noverseas\nstatehood\nstateless\nSee more results »\ndomestic adjective\n(HOME)\nB2 belonging or relating to the home, house, or family: domestic chores/duties/arrangements\nMore examplesFewer examplesThis week's broadcast features a report on victims of domestic violence.domestic harmonySome of the wolves had interbred with domestic dogs.Most domestic hobs have four gas or electric rings.The report documents the staggering amount of domestic violence against women.\nSMART Vocabulary: related words and phrases\nHome\nabode\naccommodation\nan Englishman's home is his castle idiom\nbolthole\ncrib\ndomestically\ndoorstep\nfold\ngaff\ngive something/someone houseroom phrase\nhabitation\nhangout\nlodging\nnest\nnon-domestic\nnon-home\npad\npremises\nrabbit hutch\nroof\nSee more results »\nRelated word\ndomestically\ndomestic noun [C]\n(CRIME)\nmainly UK informal a fight or attack that happens in a home between people who know each other: Police officers should never dismiss a violent incident as \"a domestic\".\nSMART Vocabulary: related words and phrases\nCrime - general words\nanti-crime\nanti-fraud\nanti-narcotics\narrestable\ncaper\ncarrying-on\ndelinquently\ndriving under the influence\nDUI\nfelonious\nfeloniously\nillegality\noffence\noutrage\npetty crime\nprotection racket\nrap sheet\nwhite-collar crime\nwrongdoing\nzero tolerance\nSee more results »\ndomestic noun [C]\n(SERVANT)\nold-fashioned (also domestic help) someone paid to do work, such as cleaning and cooking, in someone else's house\nSMART Vocabulary: related words and phrases\nPeople who clean & tidy places & things\nchambermaid\nchar\ncharlady\ncharwoman\nchimney sweep\nclean freak\ndaily\ndishwasher\nhome help\nhousekeeper\nkitchen porter\nneat freak\nscullion\nsqueegee man\nsweep\ntrash picker\nvalet\nwaste picker\nSee more results »\ndomestic adjective\n(OF HOME)\nAdd to word list\nAdd to word list\nrelating to the home, house, or family: I’ve never been fond of domestic chores like cooking and cleaning.\ndomestic adjective\n(OF COUNTRY)\npolitics &amp; government relating to a person’s own country: The president’s domestic policy has been more successful than his foreign policy.\ndomestic noun [C]\n(WORKER)\nsomeone paid to help with work that needs to be done in a house, such as cleaning and washing clothes\nAdd to word list\nAdd to word list\nof, relating to, or within a person's own country: Domestic retailers are facing relentless pressure from imports. Focusing on exporting can help fight off domestic and foreign competition. domestic manufacturing/production\nrelating to the home or families: Our service is aimed at domestic users. domestic chores domestically adverb\nThe company continues to search for expansion opportunities, both domestically and overseas."}