{"id":131599,"name":"dominantly","type":"adverb","us_sound":"ˈdɑː.mə.nənt.li","us_link":"../audio/d/cdo0623usdomi1079.mp3","uk_sound":"ˈdɒm.ɪ.nənt.li","uk_link":"../audio/d/cdo0623ukdomi1071.mp3","content":"Add to word list\nAdd to word list\nin a way that is more important, strong, or noticeable than anything else of the same type: She uses dominantly blue and grey tones in her paintings. The storytelling is accompanied by sound effects created by flutes, a guitar and, most dominantly, drums. Synonym\npredominantly\nbiology\n&#160; specialized (of a gene) in a way that always produces a particular characteristic in a person, plant, or animal: The condition is passed on to children dominantly. It is a dominantly inherited form of diabetes, that mostly affects young people.\nanatomy\n&#160; specialized A part of the body that is used dominantly is used more, or has more effect than a body part of the same type on the other side of the body: Handedness is defined as the hand that carries out most tasks dominantly. The people in the study seemed to be more dominantly right-brained or left-brained. Related word\ndominant\nMore examplesFewer examplesThe clergy was a dominantly male sphere.His guitar is heard dominantly in the mix.The state had always been dominantly Democratic.Often female singers were used in background vocals or a chorus, rather than singing solo or dominantly enough for their voices to be distinguished.In the dominantly inherited form of this disorder, the iron deficiency is mild.\nSMART Vocabulary: related words and phrases\nControlling and being in charge\naggrandize\nassert your authority\nassume\nassumption\nauthoritative\ncommanding\ncynical\nget the better of someone idiom\nget your hooks into someone/something idiom\ngovern\nguiding principle\nharness\npaternalistically\nperemptorily\nperemptory\nplay God idiom\nplenipotentiary\ntame\nwrangle\nwrangler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGenetics"}