{"id":131596,"name":"dominance","type":"noun","us_sound":"ˈdɑː.mə.nəns","us_link":"../audio/d/dominance.mp3","uk_sound":"ˈdɒm.ɪ.nəns","uk_link":"../audio/d/ukdolph012.mp3","content":"Add to word list\nAdd to word list\nC2 the quality of being more important, strong, or successful than anything else of the same type: The party's dominance in Scotland was being challenged for the first time. The dominance of the car makes cycling and walking increasingly difficult. the company's growing dominance of the sports shoe industry\npsychology\n&#160; specialized the action of taking control of other people or animals in a forceful way, or the quality of liking to do this: The new chairman appears to be trying to assert his dominance with a set of personnel changes. The accepted way to manage elephants in zoos was through close contact and dominance.\nbiology\n&#160; specialized the quality in a gene of always producing a particular characteristic in a person, plant, or animal: There are a small number of human genes whose dominance is contingent upon which parent contributes them. Related word\ndominant\nMore examplesFewer examplesThere have been decades of U.S. military dominance in the region.The commercial radio station announced its intentions to challenge the dominance of BBC radio, which had a 55% market share. Is the dominance of computer trading a good thing for the world financial markets?She studies the overt and subtle ways in which males attempt to maintain dominance in the workplace.\nSMART Vocabulary: related words and phrases\nPower to control\nahold\nall-powerful\nascendancy\nauthoritarianism\nbe above someone's pay grade idiom\nbig beast\ncradle\ndiscretionary\nhe who pays the piper calls the tune. idiom\nhegemonic\nhegemonism\nhegemony\nimplant\npower structure\npower struggle\npower vacuum\npredominance\npuissance\nsway\nthe hand that rocks the cradle rules the world idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSuccess and achievements\nStrength of will and determination\nGenetics\nAdd to word list\nAdd to word list\nthe situation in which one company, product, etc. has more power, influence, or success than others: The ability of a firm to set or control market prices is a sign of dominance."}