{"id":131673,"name":"donate","type":"verb","us_sound":"ˈdoʊ.neɪt","us_link":"../audio/d/donate.mp3","uk_sound":"dəʊˈneɪt","uk_link":"../audio/d/ukdolph026.mp3","content":"Add to word list\nAdd to word list\nB2 [ I or T ] to give money or goods to help a person or organization: An anonymous businesswoman donated one million dollars to the charity. Please donate generously.\nThesaurus: synonyms, antonyms, and examples\nto give something to someonegiveGive me that dirty plate.offerYour doctor should be able to offer advice.provideThis booklet provides useful information about local services.supplyThe lake supplies the whole town with water.donateFour hundred dollars has been donated to the school book fund.\nSee more results »\nC1 [ T ] to allow some of your blood or a part of your body to be used for medical purposes: The appeal for people to donate blood was very successful.\nThesaurus: synonyms, antonyms, and examples\nto give something to someonegiveGive me that dirty plate.offerYour doctor should be able to offer advice.provideThis booklet provides useful information about local services.supplyThe lake supplies the whole town with water.donateFour hundred dollars has been donated to the school book fund.\nSee more results »\nMore examplesFewer examplesThe Vatican has agreed to donate $80 000 in humanitarian/emergency aid to countries affected by the war.Ten pence is donated to charity for every bottle sold.The money was donated by an anonymous benefactor.Tons of internationally donated food was distributed to the starving peasants.She donated a sizeable portion of her riches to children's charities.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\narm someone with something\ndish\nhand off\nhand something in\nhand something out\nhand something over\nhand something round\ninvest\noutfit\nreassignment\nrebid\nregift\nregive\nregrant\nspare\nSee more results »\nAdd to word list\nAdd to word list\nto give something, esp. to an organization, without wanting anything in exchange: [ T ] Over $12 million was donated to the building fund. [ T ] Some businesses have agreed to donate computers to schools. donation noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/doʊˈneɪ·ʃən/\n[ C ] Donations of food and clothing are gratefully accepted.\nAdd to word list\nAdd to word list\nSOCIAL RESPONSIBILITY to give something of value such as money or goods to help a person or organization such as a charity: The bank donates 25 cents for every $100 spent using the card.donate sth to sb/sth The commission also wants to make it easier for attorneys to donate time to help poor clients. To encourage people to donate to charity, they provide a list of charities on their website."}