{"id":131756,"name":"donor","type":"noun","us_sound":"ˈdoʊ.nɚ","us_link":"../audio/d/donor.mp3","uk_sound":"ˈdəʊ.nər","uk_link":"../audio/d/ukdonke003.mp3","content":"Add to word list\nAdd to word list\nC2 a person who gives some of their blood or a part of their body to help someone who is ill: a blood donor a kidney donor\nThesaurus: synonyms, antonyms, and examples\nsomeone who gives somethinggiverWomen are the primary gift givers in households.donorOne anonymous donor contributed $1 million.benefactorPip is told he has a mysterious benefactor and is going to be very well off.philanthropistThe philanthropist has given a large chunk of his fortune to good causes.sponsorLondon Fashion Week is funded by corporate sponsors.backerThey were lucky to find two wealthy backers.\nSee more results »\nC2 a person who gives money or goods to an organization: Thanks to a large gift from an anonymous donor, the charity was able to continue its work.\nMore examplesFewer examplesAn attempt to implant an embryo using an egg from an anonymous woman donor was unsuccessful.The charity will go under unless a generous donor can be found within the next few months.The money for the new hospital was put up by an anonymous donor.In Britain, AIDS tests are now performed on all people who offer to become blood donors.Transplantation of organs from living donors raises ethical issues.\nSMART Vocabulary: related words and phrases\nMedical treatment: people who receive medical treatment\nasthmatic\ncase\ncasualty\nconvalescent\nday patient\nepileptic\ngeriatric\nhealth tourist\ninjured\ninvalid\nmedical tourist\nnon-responder\norgan donor\noutpatient\npatient\nsick\nsufferer\nunder\nwounded\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGenerous & charitable\nAdd to word list\nAdd to word list\na person who gives money or something else of value to an organization: A large gift from an anonymous donor will allow us to continue our work.\nA donor is also someone who gives blood or who agrees to give an organ or body part to help someone else.\nAdd to word list\nAdd to word list\nSOCIAL RESPONSIBILITY a person or organization that gives something of value such as money or goods to another person or organization: He was a generous donor to AIDS charities. About half of the funding for the new lab came from corporate donors."}