{"id":131829,"name":"door","type":"noun","us_sound":"dɔːr","us_link":"../audio/d/door.mp3","uk_sound":"dɔːr","uk_link":"../audio/d/ukdonke014.mp3","content":"Add to word list\nAdd to word list\nA1 a flat object that is used to close the entrance of something such as a room or building, or the entrance itself: the front door the back door a car door a sliding door The door to his bedroom was locked. We could hear someone knocking at/on the door. Could you open/close/shut the door, please? She asked me to answer the door (= go and open it for someone).\nflyparade/iStock / Getty Images Plus/GettyImages be on the door UK (US work the door)\nto work at the entrance of a building, collecting tickets or preventing particular people from entering: Have you seen those guys on the door?\nSee more\nused to refer to a house or other building: Sam only lives a few doors (away/up/down) from us. The people next door (to us) (= living in the house next to us) aren't very friendly. out of doors\noutside in the open air: It was the first time in my life that had slept out of doors.\nSee more\nMore examplesFewer examplesI'd only gone a little way down the street when I remembered I hadn't locked the door.The sign on the toilet door said 'Engaged'.Our new sofa doesn't fit through the door.Soldiers guard the main doors of the embassy.He got his bag caught in the train doors as they were closing.\nSMART Vocabulary: related words and phrases\nParts of buildings: doors & parts of doors\narchitrave\nback door\nbell push\nbi-fold\ncat flap\ndoorway\ndraught excluder\nentryway\nfire door\nfive-bar gate\nknocker\nletterbox\npurging\nrevolving door\nsafety gate\nscreen door\nshoji\nturnstile\nup-and-over\nweatherboarding\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHouses & homes\nIdioms\nclose/shut the door on something\nleave something at the door\nshut/close the stable/barn door after the horse has bolted\nAdd to word list\nAdd to word list\na flat, usually rectangular, object that is fixed at one edge and is used to close the entrance to something such as a room, building, or vehicle, or the entrance itself: the front/back door We’d like to rent a four-door car. I’ll meet you at the main door of the library. Would you open/close/shut the door, please? The door to his bedroom was locked from the inside. Mom, there’s someone at the door (= outside the front door).\nDoor is also used to refer to a house or other building: Sam lives just a few doors away/up/down from us. They live next door to us (= in the house beside ours). Idiom\ndoor to door"}