{"id":132171,"name":"dot","type":"noun","us_sound":"dɑːt","us_link":"../audio/d/dot.mp3","uk_sound":"dɒt","uk_link":"../audio/d/ukdopie024.mp3","content":"Add to word list\nAdd to word list\nB2 [ C ] a very small round mark: The full stop at the end of this sentence is a dot. Her skirt was blue with white dots.\nB1 [ U ] the spoken form of a full stop in an internet or email address, or some computer files: \"What's the web address?\" \"www dot cambridge dot org\".\n[ C ] old-fashioned the short sounds or short flashes of light used with dashes when sending messages in Morse (code)\nMore examplesFewer examplesIf you join up the dots on the paper, you'll get a picture.\"What's your email address?\" \"It's cide at cambridge dot org.\"\nSMART Vocabulary: related words and phrases\nSpecific signs and symbols\nargent\narrow\nbadge\nbrand\nBritannia\ncheck something off\nchevron\ncoat of arms\ncrested\ncross\nhallmark\nL-plate\nMaltese cross\nMorse code\npatch\nregistered trademark\nsemaphore\nservice mark\nshield\nunderscore\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternet terminology\nInternet, email and texting conventions\nSigns, signals and symbols\nIdioms\non the dot\nthe year dot\n[ T ] to put a dot or dots on something: Your handwriting is hard to read because you don't dot your i's.\n[ T often passive ] to be spread across an area, or to spread many similar things across an area: We have offices dotted around/all over the region. The area is dotted with beautiful churches.\nSMART Vocabulary: related words and phrases\nWriting & typing\nannotate\nasemic\nbang\nbang something out\nbash something out\nborrow\nborrow something from something\nchart\nfair\ninscribe\nkeyboard\nre-registration\nreadability\nrecompose\nreformulate\nrekey\nsemiotics\nspeller\ntab\ntranscribe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSpreading and scattering\nIdiom\ndot the i's and cross the t's\nAdd to word list\nAdd to word list\na very small, round mark: The ducks were black dots in the distance.\nDot (symbol .) is also used in an Internet address to separate its parts: Go to w w w dot cambridge dot org.\nWhen an area is dotted with things, it has many of them in different places: Minnesota is dotted with lakes, especially in the north. Idiom\ndot the i’s and cross the t’s\nAdd to word list\nAdd to word list\nINTERNET a very small round mark that is used in an internet address or email address to separate its parts: Dot gov sites are reserved for governmental offices.\non the dot\nexactly at the stated or expected time\nconnect/join the dots\nto understand the relationship between different ideas, facts, or experiences: My experiment has revealed how we fail to connect the dots between the way we live today and the needs of tomorrow."}