{"id":132244,"name":"double","type":"adjective","us_sound":"ˈdʌb.əl","us_link":"../audio/d/double.mp3","uk_sound":"ˈdʌb.əl","uk_link":"../audio/d/ukdoubl001.mp3","content":"Add to word list\nAdd to word list\nA2 twice the size, amount, price, etc., or consisting of two similar things together: I ordered a double espresso (= two standard amounts in one cup). Go through the double doors and turn left. The word \"cool\" has a double \"o\" in the middle. Everything he says has a double meaning (= has two possible meanings). This painkiller is double strength (= has twice the normal amount of medicine).UK Sabiha's phone number is double three, one, five, double seven (= 331577).\nA double flower or plant is a flower with more than the usual number of petals: a double primrose\nMore examplesFewer examplesThe pockets on my jeans are reinforced with double stitching.UK At school we have double maths on Friday mornings.I get £5 pocket money a week, but my friends all get double that amount.He had a double helping of pasta.Remember always to put a double space after a full stop.\nSMART Vocabulary: related words and phrases\nNumbers: single, double & multiple\nalone\nbilateral\nbilaterally\nbipartite\nbipolar\ndeca-\ndeka-\ndouble-action\ndual\nhimself\nmultiple\nplural\nquintuple\nsolitarily\nsolitary\ntri-\ntrilateral\ntrilaterally\ntriply\nunilateral\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFlowers - general words\ndouble noun\n(PERSON)\n[ C usually singular ] a person who looks exactly the same as someone else: Hey, Tony, I met someone at a party last week who was your double.\nSMART Vocabulary: related words and phrases\nDescribing people with the same qualities\na tough/tricky, etc. customer idiom\nbe cast in the same mould idiom\nbe of like mind idiom\nbe of the same mind idiom\nbe on the same wavelength idiom\nbe the (living/spitting) image of someone idiom\ncast\nchip\ncustomer\ndead ringer\ndoppelgänger\nit takes a thief to catch a thief idiom\nkindred spirit\nmatch\nmeeting\nmind\nsoulmate\nstep\ntake after someone\nthief\nSee more results »\ndouble noun\n(TWO PLAYERS)\ndoubles [ U ]\na game of tennis or a similar sport between two teams of two people: men's/women's/mixed doubles\nSee more\ndouble noun\n(TWO WINS)\n[ usually singular ] UK an occasion when a football team wins two major competitions in a single season: Which was the first team to do the double in English football?\nSMART Vocabulary: related words and phrases\nFootball/soccer\n18-yard box\n2 3 5\n4 3 2 1\n4 4 2\n4 5 1\nfootball pools\nfooty\nformation\nfoul throw\nfour five one\nfour four two\nfour three two one\nreducer\nrelegation zone\nreserve team\nroute one football\nrow Z\nsweeper\ntreble\nwoodwork\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWinning, losing & scoring in sport\ndouble noun\n(BASEBALL)\n[ C ] US in baseball, a hit that allows the batter (= person who hits the ball) to reach second base\nSMART Vocabulary: related words and phrases\nBaseball & rounders\naround the horn idiom\nbag\nball\nballgame\nballplayer\nbase hit\nbases\nbeat\nbottom\nchopper\nflare\nfoul\nglove\nhomer\nsafe\nsecond base\nshag\nshortstop\nslider\nthe World Series\nSee more results »\nIdioms\nat/on the double\ndo the double over sb\nB2 to become twice as much or as many, or to make something twice as much or many: The government aims to double the number of students in higher education within 25 years. Company profits have doubled since the introduction of new technology.\nMore examplesFewer examplesShe's come up with some amazing scheme to double her income.Consumer spending has more than doubled in the last ten years.The amount of recycled glass used in manufacture doubled in five years.Alarmingly, the hole in the ozone layer has doubled in size this year.When the price of skiing in the mountain resorts doubled, tourists voted with their feet and just stopped going.\nSMART Vocabulary: related words and phrases\nNumbers: single, double & multiple\nalone\nbilateral\nbilaterally\nbipartite\nbipolar\ndeca-\ndeka-\ndouble-action\ndual\nhimself\nmultiple\nplural\nquintuple\nsolitarily\nsolitary\ntri-\ntrilateral\ntrilaterally\ntriply\nunilateral\nSee more results »\nPhrasal verbs\ndouble back\ndouble down\ndouble down (on sth)\ndouble up\ndouble (up) as something\ndouble (someone) up/over\nB1 something that is twice the amount, size, strength, etc. of something else: I paid double (= twice as much) for those trousers last week. Electrical goods are almost double the price they were a few years ago. \"Would you like another whisky?\" \"Yes. Make it a double (= two standard amounts in one glass).\"\nMore examplesFewer examplesThis recipe is only for four, so I usually do double the quantity if I'm cooking for my family.I'll pay you double if you get the work finished by Friday.It's a con - you get half the food for double the price!\nSMART Vocabulary: related words and phrases\nNumbers: single, double & multiple\nalone\nbilateral\nbilaterally\nbipartite\nbipolar\ndeca-\ndeka-\ndouble-action\ndual\nhimself\nmultiple\nplural\nquintuple\nsolitarily\nsolitary\ntri-\ntrilateral\ntrilaterally\ntriply\nunilateral\nSee more results »\nIdiom\ndouble or quits\nin two parts or layers: Fold the blanket double (= so that it is in two layers) and then you won't be cold. They were bent double (= their heads and shoulders were bent forward and down) from decades of work in the fields. see double\nto have a problem with your eyes so that you see two of everything, usually because you are drunk or ill: I started seeing double, then I fainted.\nSee more\nSMART Vocabulary: related words and phrases\nNumbers: single, double & multiple\nalone\nbilateral\nbilaterally\nbipartite\nbipolar\ndeca-\ndeka-\ndouble-action\ndual\nhimself\nmultiple\nplural\nquintuple\nsolitarily\nsolitary\ntri-\ntrilateral\ntrilaterally\ntriply\nunilateral\nSee more results »\ndouble adjective, adverb [not gradable]\n(TWICE)\nAdd to word list\nAdd to word list\ntwice the size, amount, price, etc., or consisting of two similar things together: The cost of going to the movies is almost double what it was a few years ago. Fold the blanket double (= so that it is in two layers) and then you won’t be cold.\nA double bed is a bed for two people.\nIf you are seeing double, you are seeing two of everything.\ndouble noun [C usually sing]\n(PERSON)\na person who looks the same as someone else: She is a double for Mary Tyler Moore.\ndouble verb [I/T]\n(TWICE)\nto become twice as much or as many, or to make something twice as much or as many: [ I ] Company profits have doubled in the last year. [ T ] For four people, just double the recipe (= make twice as much).\nIf something or someone doubles as something or someone else, that person or thing has a second use or job: [ I ] The kitchen table doubles as my desk.\nPhrasal verbs\ndouble over\ndouble up\nAdd to word list\nAdd to word list\n[ I ] to become twice as much or as many: Some share prices can double in 12 months.double in size/price/value He reckons the company can double in size over the next five years. Production more than doubled from 4 million to 8.5 million per year in three years.\n[ T ] to make something twice as much or many: She is unlikely to accept, even though the offer would double her salary. Strong car sales more than doubled the company's profits in the first quarter.\ntwice the amount, size, etc. of something else: pay/cost double He offered to pay them double to get the job done on time. The true figure is 30%, more than double the figure of 14% quoted. The group increased operating profit to $21.2 million, almost double its $11 million figure for last year. Unemployment in the region is double that of its neighbouring area.\ntwo times the size, amount, price, etc.: Taxis in the conference area were said to be charging double rates. Staff have been working double shifts, 16 hours at a time, throughout the Christmas period.\nconsisting of two similar things together: double digits/figures He warned that inflation could soon reach double digits. His extension number is 008, that's double zero eight."}