{"id":132287,"name":"doubt","type":"noun","us_sound":"daʊt","us_link":"../audio/d/doubt.mp3","uk_sound":"daʊt","uk_link":"../audio/d/ukdoubl006.mp3","content":"Add to word list\nAdd to word list\nB1 (a feeling of) not being certain about something, especially about how good or true it is: I'm having doubts about his ability to do the job. If there's any doubt about the rocket's engines, we ought to cancel the launch. The prosecution has to establish his guilt beyond reasonable doubt (US beyond a reasonable) doubt. This latest scandal has raised doubts about whether he could win the election. [ + (that) ] I never had any doubt (that) you would win. He's the most attractive man in the room, no doubt about that/it. no doubt\nC1 used to emphasize that what you are saying is true or likely to happen: We will, no doubt, discuss these issues again at the next meeting.\nSee more cast doubt on something\nC2 to make something seem uncertain: Witnesses have cast doubt on the accused's innocence.\nSee more in doubt\nB2 If the future or success of someone or something is in doubt, it is unlikely to continue or to be successful: The future of the stadium is in doubt because of a lack of money.\nSee more without (a) doubt\nB2 used to emphasize your opinion: She is without (a) doubt the best student I have ever taught.\nSee more\nMore examplesFewer examplesThere is little doubt that poor medical treatment hastened her death.There are doubts about the effectiveness of the new drug in treating the disease.The government expressed serious doubts about the legitimacy of military action .It's quite natural to experience a few doubts just before you get married.I always had some doubt about the scheme but I never expressed it.\nSMART Vocabulary: related words and phrases\nSuspecting & questioning\nask questions of someone/something idiom\ncall into question idiom\nchallenge\nchallengingly\ncynic\ncynical\ncynically\ncynicism\ndoubter\nfisking\nmisgiving\nquery\nreserve\nsceptical\nskeptic\nskeptically\nsuspect\nsuspected\nsuspiciously\nunchallengeable\nSee more results »\nGrammar\nNo doubt or without doubt?We can use no doubt when we think that what we are saying is likely to happen, or when we think it is true. It is similar to ‘I suppose’ or ‘I imagine’: …\nB2 to not feel certain or confident about something or to think that something is not probable: I doubt whether/if I can finish the work on time. [ + that ] They had begun to doubt that it could be done. He may come back tomorrow with the money, but I very much doubt it. I don't doubt his abilities. doubt someone/doubt someone's word\nC1 to not trust someone or believe what they say: He's never lied to me before, so I have no reason to doubt his word.\nSee more\nMore examplesFewer examplesI doubt whether it'll work.He gave his word that he would marry her and she had no cause to doubt him.He'd been behaving so strangely that they began to doubt his sanity.I only caught a fleeting glimpse of the driver of the getaway car, but I doubt I would recognize her if I saw her again.No one doubted that the president was a man of the highest integrity.\nSMART Vocabulary: related words and phrases\nSuspecting & questioning\nask questions of someone/something idiom\ncall into question idiom\nchallenge\nchallengingly\ncynic\ncynical\ncynically\ncynicism\ndoubter\nfisking\nmisgiving\nquery\nreserve\nsceptical\nskeptic\nskeptically\nsuspect\nsuspected\nsuspiciously\nunchallengeable\nSee more results »\nGrammar\nI doubt if, I don’t know whetherWe use if or whether to introduce clauses after verbs of doubting: …\nAdd to word list\nAdd to word list\na feeling of not knowing what to believe or what to do, or the condition of being uncertain: [ C ] If you have any doubt about her ability, don’t hire her. [ + that clause ] There’s no doubt that the show will be successful. [ U ] The future of the entire project is in some doubt. [ C ] She is without a doubt (= certainly) one of the best students I’ve ever had.\nto be uncertain about something or someone, or to have difficulty believing something: [ T ] He may come back tomorrow with the money, but I doubt it."}