{"id":132596,"name":"downshifting","type":"noun","us_sound":"ˈdaʊn.ʃɪf.tɪŋ","us_link":"../audio/d/cdo1121usdown4681.mp3","uk_sound":"ˈdaʊn.ʃɪf.tɪŋ","uk_link":"../audio/d/cuk00358.mp3","content":"Add to word list\nAdd to word list\nthe practice of leaving a job that is well paid and difficult in order to do something that gives you more time and satisfaction but less money: More people are finding that downshifting is delivering a less stressful life. This may cause an increase in downshifting where individuals sacrifice salary for a better quality of life. See\ndownshift\nMore examplesFewer examplesMore and more of us are being seduced by the idea of downshifting.That career downshifting will increasingly open management opportunities to members of generations X and Y, the demographic cohorts born between 1965 and 1998. The idea of downshifting always had the faint implication of stepping back from an active life.\nSMART Vocabulary: related words and phrases\nLifestyles & their study\nanthropogenic\nanthropological\nanthropologically\nanthropologist\nanthropology\ndemographer\ndemographics\ndemography\nethnographer\nethnographic\nintercultural\ninterculturally\ninterculture\nlifestyle\nmeme\nvegetate\nway of life idiom\nwesternization\nwesternize\nwesternized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRetiring & resigning\nleaving a job that is well paid and difficult in order to do something that gives you more time and satisfaction but less money: The company was set up in Sussex by downshifting City lawyers.\nMore examplesFewer examplesHe arrived from London 25 years ago, a downshifting television executive with a penchant for cider.The Church of England has become the latest destination for downshifting professionals in search of a quieter, more vocational lifestyle.It is a favoured destination of downshifting city dwellers with idealised expectations of rural England.\nSMART Vocabulary: related words and phrases\nLifestyles & their study\nanthropogenic\nanthropological\nanthropologically\nanthropologist\nanthropology\ndemographer\ndemographics\ndemography\nethnographer\nethnographic\nintercultural\ninterculturally\ninterculture\nlifestyle\nmeme\nvegetate\nway of life idiom\nwesternization\nwesternize\nwesternized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRetiring & resigning\nAdd to word list\nAdd to word list\nthe process of slowing down or becoming less active: The downshifting reflected the effects of higher oil prices.\nHR, WORKPLACE\n&#160; mainly UK the act of leaving a well-paid but difficult job in order to do something that gives you more time and satisfaction but less money: The trend towards downshifting, where employees swap the stress of corporate life for more quality time, tempted 6% of the UK workforce last year."}