{"id":132602,"name":"downsize","type":"verb","us_sound":"ˈdaʊn.saɪz","us_link":"../audio/d/uscld00373.mp3","uk_sound":"ˈdaʊn.saɪz","uk_link":"../audio/d/epd31702.mp3","content":"Add to word list\nAdd to word list\nto make a company or organization smaller by reducing the number of people working for it, or to become smaller in this way: to downsize your workforce/company The plight of the economy is forcing businesses to downsize.\nto move to a smaller home, usually because your home has become too large for you or as a way of saving money: Should you downsize before property prices drop? My wife and I want to downsize from a 6-bedroom home to a 2-bedroom home in a 55+ community. Many people downsize their homes at retirement age in order to free up cash.\nMore examplesFewer examplesHe had anticipated that publishers might need to downsize.During the 1980s, corporate America was downsizing and corporations suffered along with the people they laid off.As we are downsizing the company and reducing the number of employees in our corporate office, we need less space.Only if you plan to downsize can the value of your home be considered as part of your investment portfolio.We want to encourage pensioners to downsize into more suitable homes.Our market is move-up family homes and townhomes for downsizing empty nesters.People should look to restructure their debt in such a way that they can afford the repayments, although this might involve downsizing the home.\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nabridgment\nattenuate\nattenuated\nattenuating\nattenuation\nboil\ndamp\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nforeshortened\nroll back something\nrollback\nrun someone/something down\nrundown\nsag\nshave\ntelescope\ntumble\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChanging homes & moving\nRelated word\ndownsizing\nAdd to word list\nAdd to word list\n(of a company) to reduce the number of employees, usually as part of a larger change in the structure of an organization: The company was forced to downsize in order to remain competitive.\nAdd to word list\nAdd to word list\nto make a company or organization smaller by reducing the number of people working for it: The plight of the economy is forcing businesses to downsize. to downsize your workforce/company Compare\nright-size downsizing noun [ U ] /ˈdaʊnsaɪzɪŋ/\na trend for corporate downsizing Compare\nright-sizing"}