{"id":132563,"name":"downlink","type":"noun","us_sound":"ˈdaʊn.lɪŋk","us_link":"../audio/d/cdo1121usdown1449.mp3","uk_sound":"ˈdaʊn.lɪŋk","uk_link":"../audio/d/cdo1121ukdown1399.mp3","content":"Add to word list\nAdd to word list\na communications link for signals coming from a satellite, spacecraft, or aircraft: The satellite provides a high-speed downlink. The system would allow a video downlink on the aircraft. The downlink delay increases by around 20 times in congested conditions.\ninternet &amp; telecoms\n&#160; specialized a link coming from a different, or different part of a, communications or computer network: the downlink from ISP to customer It offers downlink data speeds of up to 100Mbps (megabytes per second). Compare\nuplink noun\nMore examplesFewer examplesThey had Commander Steve Kelly on a downlink talking about the day on the spacecraft.The liftoff of the lunar module was documented visually from the lunar rover, but not by film—this was done by television downlink.We could have an inexpensive one-way satellite downlink covering much or all of the region.He said the downlink system can capture video up to 10 miles away.The speed on the uplink from customer to ISP is lower than on the downlink from ISP to customer.Tracks can be downloaded wirelessly over high-speed downlink packet access (HSDPA). The modem was claimed to be capable of delivering downlink speeds of up to 7.2Mbps.\nSMART Vocabulary: related words and phrases\nCommunications - general words\nanti-satellite\napp\nautodial\nautodialler\nbar\ncybernetics\nhack\nmultimode\nmultipath\nnoise\nnon-computer\nnon-network\npatch\npatch someone through\nsilent\ntrace\nwebchat\nZoom bomb\nZoombomber\nZoombombing\nSee more results »\nto receive or send signals using a communications link from a satellite, spacecraft, or aircraft: The service allows TV channels to downlink or uplink their satellite signals over the region. For two days, the satellite downlinked images as part of its study of solar winds. The aircraft can downlink its position information on a periodic basis to air traffic controllers. This is the most popular type of satellite transmission for uplinking and downlinking.\ninternet &amp; telecoms\n&#160; specialized to send data using a link to a different, or different part of a, communications or computer network: The laptop collects data and transfers it to a central computer to downlink to mission control. Compare\nuplink verb\nMore examplesFewer examplesWe're going to downlink as much science data as possible from the deep-space probe before it passes out of contact.I do not recommend this if you wish to downlink legal TV channels.The image was then downlinked from a European satellite, which transmitted it to another satellite.Downlinked images show no degradation in image quality.\nSMART Vocabulary: related words and phrases\nCommunications - general words\nanti-satellite\napp\nautodial\nautodialler\nbar\ncybernetics\nhack\nmultimode\nmultipath\nnoise\nnon-computer\nnon-network\npatch\npatch someone through\nsilent\ntrace\nwebchat\nZoom bomb\nZoombomber\nZoombombing\nSee more results »"}