{"id":132567,"name":"download","type":"verb","us_sound":"ˈdaʊn.loʊd","us_link":"../audio/d/download.mp3","uk_sound":"ˌdaʊnˈləʊd","uk_link":"../audio/d/ukdownh003.mp3","content":"Add to word list\nAdd to word list\nA2 to copy or move programs or information into a computer's memory, especially from the internet or a larger computer Compare\nupload verb\nThesaurus: synonyms, antonyms, and examples\nto access something on a computer, tablet, or smartphoneaccessI tried to access the site, but my browser became unresponsive.downloadI downloaded the software and installed it.uploadI uploaded my changes, and the site went live.retrieveThe data can be retrieved in a fraction of a second.\nSee more results »\nExamples\nBuyers can download his latest novel to read on a mobile device.I downloaded their latest album on MP3.I downloaded a patch from their website.The user confirms their order and downloads an applet which asks them for their personal and payment details.Software updates can be downloaded from the company's website.\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntap\ntoolbar\nvectorization\nvectorize\nvirtualization\nvirtualize\nwake word\nzip file\nSee more results »\nB1 [ C ] a computer program or information that has been or can be copied into a computer's memory: a free download\n[ U ] the act or process of copying programs or information into a computer's memory: All of our products are available for download on our website. Compare\nupload noun\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nword processing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOperating computers\nAdd to word list\nAdd to word list\nto copy programs or information to a computer, usually over the Internet\nAdd to word list\nAdd to word list\nIT to copy or move programs or information into a computer's memory, especially from the internet or a larger computer, or to be moved in this way: download a copy/file/documentdownload sth from sth Software updates can be downloaded from the company's website. The file will only take a few seconds to download.\n[ C ] a computer program or information that has been or can be copied into a computer's memory: The upgrade will be available as a free download for registered customers. Subscribers get the magazine as a digital download.\n[ U ] the act or process of copying programs or information into a computer's memory: All of our products will be available for download on our website. Compare\nupload"}