{"id":132534,"name":"downgrade","type":"verb","us_sound":"ˌdaʊnˈɡreɪd","us_link":"../audio/d/downgrade.mp3","uk_sound":"ˌdaʊnˈɡreɪd","uk_link":"../audio/d/ukdoubl029.mp3","content":"Add to word list\nAdd to word list\nto reduce someone or something to a lower rank or position, or to cause something to be considered less important or valuable: My job's been downgraded to that of ordinary editor. We can't let the management downgrade the importance of safety at work. Opposites\nadvance\nelevate\npromote\nraise Compare\nupgrade verb\nSMART Vocabulary: related words and phrases\nPromoting staff\naggrandizement\nanointment\nascend\nascension\ncareer-limiting\nelevation\nfast track\nfree transfer\nglass cliff\nhand off\nhandoff\npromotion\nreinstall\nreinstallation\nrelegate\nsecondment\nsticky floor\nsubordinate\nvault\nwilderness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDeteriorating and making worse\nthe process of downgrading: A credit rating downgrade would raise their cost of borrowing.\nSMART Vocabulary: related words and phrases\nDeteriorating and making worse\nadd\nadmin\naggravate\nbackslide\nbe (all) downhill idiom\ndebase\ndeterioration\ndevaluation\ndevalue\ndisintegrate\ndog\ndownhill\nregress\nregression\nregressive\nregressively\nrelapse\nretrograde\nworse\nworsen\nSee more results »\nAdd to word list\nAdd to word list\nto reduce someone or something to a lower rank or position; to make less important or less valued: They threatened to downgrade my credit rating if I don’t pay the bill immediately.\nAdd to word list\nAdd to word list\nFINANCE to state that something such as a company is likely to produce less profit or growth, to be less able to pay back debt, etc. than was previously thought: downgrade stocks/sharesdowngrade sth's rating/status Investment bank Merrill Lynch downgraded the company's status from 'buy' to 'neutral'. The Chancellor blamed higher oil prices for the downgraded growth forecast.\nHR to make a job less senior, skilled, or important than before, or to put someone into a less senior or important job: The new contracts effectively downgraded their jobs to match their colleagues' lower pay. The agreement may lead to one in six staff being downgraded.\nFINANCE a statement that something such as a company's profit, ability to pay back debt, etc. will be less than was expected: A credit rating downgrade would raise their cost of borrowing."}