{"id":132490,"name":"down","type":"adverb","us_sound":"daʊn","us_link":"../audio/d/down.mp3","uk_sound":"daʊn","uk_link":"../audio/d/ukdoubl024.mp3","content":"down adverb\n(LOWER POSITION)\nAdd to word list\nAdd to word list\nA2 in or towards a low or lower position, from a higher one: Is this lift going down? Don't look down! You'll get dizzy. The sun's going down and it'll be dark soon. The space capsule came down in the ocean. I bent down to look under the bed.\nA1 moving from above and onto a surface: Just as I was sitting down to watch TV, the phone rang. Why don't you lie down on the sofa for a while? This box is really heavy - can we put it down (on the floor) for a minute? Get down off that table immediately! The terrorists forced everybody to lie face down (= with the front part of the body below) on the floor.\nfirmly in place or into position: I put the loose floorboard back and nailed it down. He held my arms down by my sides.\nMore examplesFewer examplesWater dripped down the wall.He lifted a fat volume down from the shelf.A hawk hovered in the sky, waiting to swoop down on its prey.A taxi driver wound down his window and gave the cyclist a mouthful.It's said that as the boat went down the band continued to play.\nSMART Vocabulary: related words and phrases\nDown and downward\ndeclivity\ndownhill\ndownstairs\ndownstream\ndownward\ndownwardly\ndownwards\nfallen\nover\nsunken\nup\ndown adverb\n(LOWER LEVEL)\nin or towards a lower level, a smaller amount, or a simpler state: The rate of inflation is finally going down. Turn the TV down - it's way too loud! The nurse bandaged my sprained ankle to keep the swelling down (= to limit the swelling). If you wait a few months, the price will come down. The Cavaliers were 20 points down (= losing by 20 points) at half-time. The number of students at this school has gone down from 500 last year to 410.\nMore examplesFewer examplesAre you comfortable or shall I turn the heat down?Could you turn your music down and show a little consideration for the neighbours!We need to work hard to keep our prices down.They melted down the gold rings and bracelets.Sophie has been moved down a grade at school.\nSMART Vocabulary: related words and phrases\nSmall in number and quantity\nbeggarly\nbelow\nbupkis\ncertain\ncould count something on (the fingers of) one hand idiom\nlimitedness\nmeasly\nmild\nmildness\nmingy\nminimal\nmodest\nonly so much/many idiom\npiffling\nremote\nscantly\nslenderly\nstrength\nsuggestion\nthin\nSee more results »\ndown adverb\n(DESTROY)\nIf you burn, cut, or knock something or someone down, you cause it, him, or her to fall to the ground, usually damaged, destroyed, or injured: The house burned down many years ago. These trees will have to be cut down to make way for the new road.UK She was knocked down by a car and killed instantly.\nMore examplesFewer examplesHe threatened to break the door down .Several trees were brought down by the storm.Throw your gun down and put your hands in the air.Our apple tree fell down in the storm.Winds gusting to 50 mph brought down power cables.\nSMART Vocabulary: related words and phrases\nDown and downward\ndeclivity\ndownhill\ndownstairs\ndownstream\ndownward\ndownwardly\ndownwards\nfallen\nover\nsunken\nup\ndown adverb\n(IN WRITING)\nB1 in writing or on paper: I'll write it down now so I won't forget. Do you have it down in writing/on paper, or was it just a verbal agreement? I've got/put you down for (= have written that you want) three tickets each. The police officers were taking down the names of witnesses.\nMore examplesFewer examplesI recommend writing your feelings down on paper.He asked me to put my objections down on paper.Did you write Jo's phone number down ?Somehow we got our wires crossed because I'd got the 23rd down in my diary and Jen had the 16th.If there are any calls for me, could you write them down next to the phone?\nSMART Vocabulary: related words and phrases\nWriting & typing\nannotate\nasemic\nbang\nbang something out\nbash something out\nborrow\nborrow something from something\nchart\ndot\ninscribe\nkeyboard\nre-registration\nreadability\nrecompose\nreformulate\nrekey\nsemiotics\nspeller\ntab\ntranscribe\nSee more results »\ndown adverb\n(FAR)\nB1 used, especially with prepositions, to emphasize that a place is at some distance from you or from somewhere considered to be central: I'll meet you down at the gym after work. He has a house down by the harbour. I'm going down to the shop to buy some milk.\nin or towards the south: It's much warmer down (in the) south. My parents live down in Florida, but they come up to Chicago every summer. We're moving down to London.\nMore examplesFewer examplesI took my two-year old nephew down to the beach with his bucket and spade.I was scared witless the last time Tina drove me down to London.We drove down to the windswept Atlantic coast of Portugal.He went down to the bookmaker's in Chesterton Road to place a bet on the race.After booking into our hotel, we went straight down to the beach.\nSMART Vocabulary: related words and phrases\nDistant in space and time\n(in) the middle of nowhere idiom\nafar\nafield\nall/the four corners of the world/earth idiom\nanywhere\nas far as the eye can/could see idiom\ndistance\neye\nfarthest\nfrom afar\nfurther\nfurthermost\nlight years away idiom\nmiddle\nremote\nremotely\nremoteness\nultra\nultra-distant\nwide\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDown and downward\ndown adverb\n(OLDER TO YOUNGER)\nfrom an older person to a younger one: The necklace has been passed/handed down through seven generations. These myths have come down to us from prehistoric times.\nSMART Vocabulary: related words and phrases\nDown and downward\ndeclivity\ndownhill\ndownstairs\ndownstream\ndownward\ndownwardly\ndownwards\nfallen\nover\nsunken\nup\ndown adverb\n(EATING)\ninside your stomach: UK You'll feel better once you've got some hot soup down you. He's getting weak because he can't keep anything down.\nSMART Vocabulary: related words and phrases\nThe digestive system\nchyme\ncoeliac\ncolonic\ncolorectal\ndefecation\ndigestive system\nentrails\ngastrointestinal\ngullet\ninnards\nintestine\njejunum\nlacteal\nmechanical digestion\nng\noesophageal\noesophagus\nperistalsis\nsmall intestine\ntummy\nSee more results »\ndown adverb\n(MONEY)\nat the time of buying: I gave him $1,000 down, and paid the rest in instalments.\nSMART Vocabulary: related words and phrases\nPaying money\n2FA\n2SV\nante up (something)\nburn a hole in someone's pocket idiom\nchargeable\ncost-cutting\ndiscretionary\nfund\nlash out (something)\nreimburse\nrepay\nsettle an account idiom\nshell (something) out\nshortchange\nsink into something\nspend\nspend money like water idiom\nspent\nsplurge\nsponsor\nSee more results »\nGrammar\nDown, downwards or downward?We use down mostly as a preposition or adverb. It means ‘in or moving to a low or lower position or level’: …\nDownWe use down mostly as a preposition or adverb. It means ‘in or moving to a low or lower position or level’: …\nDownwards, downwardDownwards is an adverb. It means ‘movement towards a lower position’: …\nIdioms\nbe down on someone\nbe down to someone\ncome/go down in the world\ndown someone's way\ndown under\n(right) down to\ndown with...!\none, two, etc. down, one, two etc. to go.\ndown preposition\n(LOWER POSITION)\nA2 in or towards a low or lower position, from a higher one: I slid down the hill. Aikiko fell down some stairs and broke her wrist.\nMore examplesFewer examplesHe ironed a crease down the front of each trouser leg.Sam only lives a few doors down from us.I can't go down that street - there's a 'No entry' sign.She ran excitedly down the hall to greet her cousins.She jumped on her motorbike and raced off down the road.\nSMART Vocabulary: related words and phrases\nDown and downward\ndeclivity\ndownhill\ndownstairs\ndownstream\ndownward\ndownwardly\ndownwards\nfallen\nover\nsunken\nup\ndown preposition\n(ALONG)\nA2 along: We drove down the highway as far as Atlanta. Her office is down the corridor on the right. They sailed the boat down the river (= towards the sea).\nSMART Vocabulary: related words and phrases\nDown and downward\ndeclivity\ndownhill\ndownstairs\ndownstream\ndownward\ndownwardly\ndownwards\nfallen\nover\nsunken\nup\ndown preposition\n(TO)\nUK not standard to: I went down the pub with my mates. Compare\nup preposition (TO) UK not standard\nMore examplesFewer examplesHe's gone down the shop to get some milk.Are you coming down the pub for a bevvy?Can you nip down the shop for me?A few of us went down the pub after work.I won't be long - I'm just going down the chemist to collect a prescription.\nSMART Vocabulary: related words and phrases\nDown and downward\ndeclivity\ndownhill\ndownstairs\ndownstream\ndownward\ndownwardly\ndownwards\nfallen\nover\nsunken\nup\nGrammar\nDown, downwards or downward?We use down mostly as a preposition or adverb. It means ‘in or moving to a low or lower position or level’: …\nDownWe use down mostly as a preposition or adverb. It means ‘in or moving to a low or lower position or level’: …\nDownwards, downwardDownwards is an adverb. It means ‘movement towards a lower position’: …\nIdioms\ndown the drain\ndown the toilet\ndown the road/line/track\ndown verb [T]\n(LOWER POSITION)\nto cause something or someone to fall to the ground: We downed three enemy planes with our missiles. The ice storm has downed trees and power lines all over the region.\nSMART Vocabulary: related words and phrases\nDown and downward\ndeclivity\ndownhill\ndownstairs\ndownstream\ndownward\ndownwardly\ndownwards\nfallen\nover\nsunken\nup\ndown verb [T]\n(EAT)\nto eat or drink something quickly: He'd downed four beers before I'd finished one.\nSMART Vocabulary: related words and phrases\nDrinking\nconsume\ndrink\ndrink (something) up\ndrinker\ndrinking\ndrinking fountain\ndrinking water\ndrunk\nmainline\nnon-consumption\noverindulge\noverindulgence\noverindulgent\npartake\nquench\nslurp\nsup\nswig\nswill\ntasting\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEating\ndown verb [T]\n(DEFEAT)\nUS to defeat someone, especially in sport: The Yankees downed the Red Sox 7–0.\nSMART Vocabulary: related words and phrases\nWinning, losing & scoring in sport\naet\nagainst the run of play idiom\nblow someone away\nboss\nbreak your duck idiom\nclose-run\nconcede\ndraw\nequalizer\npromedios\npull\npull back\nreel something off\nrelegation zone\nromp\nscore\nshutout\nstraight\nstrike\ntreble\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWinning and defeating\nIdiom\ndown tools\ndown adjective\n(UNHAPPY)\nB2 unhappy; unable to feel excited or energetic about anything: She's been really down since her husband left. I've been (feeling) a little bit down this week. Synonyms\nblue (SAD) informal\ndejected\ndepressed\ndespondent\ndispirited\ndoleful\ndolorous literary\ndowncast\ndownhearted\n(down) in the dumps\ngloomy\nglum informal\nlow\nlow-spirited\nmelancholy\nmiserable (UNHAPPY)\nmournful\nplaintive\nsad (NOT HAPPY)\nsorrowful literary\nthe doldrums informal\nunhappy\nThesaurus: synonyms, antonyms, and examples\nfeeling sadsadShe's been sad ever since her cat died.unhappyShe'd had a very unhappy childhood.miserableI just woke up feeling miserable.upsetThey'd had an argument and he was still upset about it.broken-heartedShe was broken-hearted when her partner left.\nSee more results »\nMore examplesFewer examplesShe's been a bit down since she found out she's got to take her exams again.He seemed a bit down about his work situation.He's been feeling a bit down ever since he got his exam results.He's been really down ever since he got divorced.I could tell that you were feeling a bit down.\nSMART Vocabulary: related words and phrases\nFeeling sad and unhappy\na dog's life idiom\na long face idiom\nabjection\nangsty\nbe cut up idiom\nbe down in the mouth idiom\nbe in a funk idiom\ndistraught\ndistressed\ndog\ndoleful\nlovelorn\nlovesick\nlow-spirited\nlugubrious\nwistful\nwistfully\nwoe\nwoe is me idiom\nwoebegone\nSee more results »\ndown adjective\n(NOT IN OPERATION)\nC1 [ after verb ] (of a system or machine, especially a computer) not in operation or not working, usually only for a limited period of time: The network will be down for an hour for routine maintenance. The whole system's gone down. See also\ndowntime\nMore examplesFewer examplesI tried to update my details online but the system was down.Our website was down all morning due to a power failure.The bank's network was down so they were unable to approve our loan that day.The firm's losing money for every minute their website is down.The network was down so we were unable to do any work all morning.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nword processing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMachines - not functioning\ndown adjective\n(ON THE GROUND)\nin American football, a player is down when he is brought to the ground by an opponent while holding the ball, before having reached the goal: The referee ruled that the running back was down at the 44-yard line. The replay showed that the player was never down, so the play should have continued.\nSMART Vocabulary: related words and phrases\nAmerican football\nattempt\nblitz\nblocker\nblocking\ncarry\ncarry the ball idiom\nconversion\nfullback\nguard\nhuddle\nlinebacker\nnonconference\noffence\noutgain\noutkick\npick\nrush\nscrimmage\nSuper Bowl\ntouchdown\nSee more results »\nIdiom\nkick/hit someone when he/she is down\ndown noun\n(FEATHERS)\n[ U ] small soft feathers, especially those from a young bird: goose/duck down a down jacket/pillow/sleeping bag (= a jacket/pillow/sleeping bag filled with down)\n[ S or U ] very soft thin hair\nSMART Vocabulary: related words and phrases\nThe skin, hair & bone of non-human animals\nbaleen\nbristly\nbushy\ncoated\ndander\ndowny\neiderdown\nfleece\nfurry\ngoatskin\nhackles\nhorsehair\nlambswool\nmane\nmother-of-pearl\nsable\nsealskin\nseashell\nspine\nwishbone\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHair\ndown noun\n(AMERICAN FOOTBALL)\n[ C ] in American football, one of four chances that a team is given to advance the ball ten yards towards the goal: They needed to gain three more yards to get a first down. On fourth down, the coach had to decide whether to punt, attempt a field goal, or try for a touchdown. See also\nfirst down\nSMART Vocabulary: related words and phrases\nAmerican football\nattempt\nblitz\nblocker\nblocking\ncarry\ncarry the ball idiom\nconversion\nfullback\nguard\nhuddle\nlinebacker\nnonconference\noffence\noutgain\noutkick\npick\nrush\nscrimmage\nSuper Bowl\ntouchdown\nSee more results »\ndown noun\n(DISLIKE)\nhave a down on someone UK informal\nto dislike someone, often unfairly: Why do you have a down on him? I think he seems really nice.\nSee more\nat or towards the end or the lower or worse part: downhill downriver down-market the downside\nSMART Vocabulary: related words and phrases\nDown and downward\ndeclivity\ndownhill\ndownstairs\ndownstream\ndownward\ndownwardly\ndownwards\nfallen\nover\nsunken\nup\na county (= an area with its own local government) in the southeast of Northern Ireland: Tommy visited Peter in Newry, County Down, just a few weeks ago. He married a girl from the Co Down town where he grew up.\nMore examplesFewer examplesGreer Garson was born in County Down, Ireland.South-east of Belfast lies rural County Down.He is from Newry, in Down.\nSMART Vocabulary: related words and phrases\nTowns & regions: named regions of countries\nAberdeen City\nAberdeenshire\nAffrilachian\nAK\nAL\nEnglish Canadian\nEssex\nfife\nfl.\nMississippian\nMissouri\nMissourian\nMN\nMonmouthshire\nStaffordshire\nStirling\nStirlingshire\nStrathclyde\nSuffolk\nthe Fertile Crescent\nSee more results »\ndown preposition, adverb [not gradable]\n(IN A LOWER POSITION)\nAdd to word list\nAdd to word list\nin or toward a low or lower position, from a higher one: There’s a bathroom down the stairs and to the right. He poured the rest of the coffee down the drain. The cat jumped down from the chair. Please sit down (= stop standing and come to a sitting position). If you feel ill, why don’t you lie down (= stop standing and come to a lying position) for a while?\nDown also means to the ground, esp. as a result of an action that causes something to fall: We’re going to have to cut down this tree.\nDown also means firmly, in a fixed position, esp. as a result of an action: Workers in the convention center taped down the edges of the carpets. fig. We hope to nail down the agreement at tomorrow’s meeting. Idioms\ndown the drain\ndown to the wire\nshove something down someone’s throat\ndown adjective, adverb [not gradable]\n(AT A LOWER LEVEL)\nin or toward a lower place or level, a smaller amount, or a simpler state: Unemployment went down last month, dropping to under 6%. Lots of stores are having sales, and prices are coming down. He was down to his last $5 (= that was all he had left).\nDown is used with a lot of verbs to show that something is becoming smaller, weaker, slower, or less: The fire burned down. She’s slimmed down a lot in the past few months. Would you please turn down the music – it’s too loud.\ndown adjective, adverb [not gradable]\n(WORSE)\ninto a worse position or state: Michigan, down (by) (= losing by) ten points at the half, came back to win the football game.\nIdiom\ndown on someone/something\ndown adverb [not gradable]\n(FAR AWAY)\nused, esp. with prepositions, to emphasize that a place is far from the speaker or in or toward the south: I’ll meet you down at the health club after work. My parents moved down to Florida after they retired.\ndown adverb [not gradable]\n(IN WRITING)\nin writing or on paper: He agreed to the deal, but until we get it down on paper, we don’t have a legal contract.\ndown adverb [not gradable]\n(WHEN BUYING)\nat the time of buying: She paid $100 down and the rest in installments.\ndown preposition\n(ALONG)\nalong: Her office is down the hall on the right. Idiom\ndown the road\ndown adjective\n(UNHAPPY)\nunhappy: I’m feeling a little down, I guess because most people have gone home for the holidays and I’m still here.\ndown adjective\n(NOT IN OPERATION)\n[ not gradable ] (of a system or machine, esp. a computer) not in operation or not working, usually only for a limited period of time: The network will be down until noon today. Idiom\ndown in the dumps\ndown noun [U]\n(HAIR)\nsmall, soft feathers or hair, esp. those of a young bird\ndown verb [T]\n(EAT)\nto eat or drink something quickly: She quickly downed her tea and left to catch the bus.\nAdd to word list\nAdd to word list\nat or towards a lower level or a smaller amount: The stock market is down for the fifth week in a row.go/come down Consumers may be waiting for prices to come down before they buy. The number of workers here has gone down from 500 last year to 410. Production is down by almost a fifth.down 10p/10%/10 points, etc. Operating profits were down 50%.10p/10%/10 points, etc. down Lead closed three dollars down at $611 per tonne. Sales were way down on the same quarter last year. Most currencies in the region ended the week slightly down against the US dollar.\nin writing or on paper: write/note/jot sth downdown in writing/on paper Do you have it down in writing, or was it just a verbal agreement?have sb down for sth On next month's order I've got you down for three cases of supplies.\nif you pay money down on something, you pay part of the price and will pay the rest later: pay 10%/$100, etc. down We paid 10% down on the house and took out a mortgage for the rest.money/cash down The sign advertised easy mortgages and houses with no money down.\nhaving less money than before: The deal left him almost $500 down.\n[ after verb ]\n&#160; IT if a computer or system is down, it is not working, usually for a limited period: The network will be down for an hour for routine maintenance. The whole system's gone down.\ndown tools UK\nto refuse to continue working, especially because you are not satisfied with your pay or working conditions: The printers are threatening to down tools if the pay offer is not increased to 8%."}