{"id":132615,"name":"downstairs","type":"adverb","us_sound":"ˌdaʊnˈsterz","us_link":"../audio/d/downstairs.mp3","uk_sound":"ˌdaʊnˈsteəz","uk_link":"../audio/d/ukdownh015.mp3","content":"Add to word list\nAdd to word list\nA2 to or on a lower floor of a building, especially the ground floor: I went downstairs to answer the phone. Compare\nupstairs adverb adjective\nMore examplesFewer examplesI'll see you downstairs in the foyer in half an hour.I jumped out of bed and ran downstairs.I pulled on my jeans and ran downstairs.Did you put the lights out downstairs?She came downstairs after her shower, wrapped in a towel.\nSMART Vocabulary: related words and phrases\nParts of buildings: floors & parts of floors\nbasement\ncatwalk\nceiling\ndais\ndecking\nground level\nlanding\nloft\nlow slung\nmachicolation\nmezzanine\nmulti-levelled\nrostrum\nrunway\nsoapbox\nsplit-level\nstorey\nthe ground floor\nthe second floor\nwoodblock\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDown and downward\non a lower floor of a building, especially the ground floor of a house: a downstairs bathroom\nMore examplesFewer examplesA gloomy light burned in a downstairs window . One of the two kitchens is downstairs. In the downstairs loo, she has a picture of herself as a bridesmaid.Our downstairs neighbours are heavy smokers, and the smell seeps up through the floorboards into our flat.The second door, she explained, leads to the downstairs television room.The downstairs rooms of her two-story concrete house are filled with toddlers and preschool children.\nSMART Vocabulary: related words and phrases\nParts of buildings: floors & parts of floors\nbasement\ncatwalk\nceiling\ndais\ndecking\nground level\nlanding\nloft\nlow slung\nmachicolation\nmezzanine\nmulti-levelled\nrostrum\nrunway\nsoapbox\nsplit-level\nstorey\nthe ground floor\nthe second floor\nwoodblock\nSee more results »\nthe part of a building, especially a house, that is on the ground floor: We finished painting upstairs yesterday, but the downstairs still needs some work.\nMore examplesFewer examplesThe downstairs was so smoky that we could not see.The couple spent GBP70,000 making the downstairs open-plan and adding two extra bedrooms.The downstairs of the theater was just about full and there were plenty of people upstairs, too.When renovating, school officials decided to paint the downstairs a warm orange, so students would think warm thoughts on cold days.\nSMART Vocabulary: related words and phrases\nParts of buildings: floors & parts of floors\nbasement\ncatwalk\nceiling\ndais\ndecking\nground level\nlanding\nloft\nlow slung\nmachicolation\nmezzanine\nmulti-levelled\nrostrum\nrunway\nsoapbox\nsplit-level\nstorey\nthe ground floor\nthe second floor\nwoodblock\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParts of buildings in general\nthe lower floor of a building, especially the ground floor: We finished painting upstairs yesterday, but the downstairs still needs some work. The downstairs was a mess.\nMore examplesFewer examplesI worked my way around the downstairs, cleaning all the windows.The new design opened up the downstairs and achieved both airiness and intimacy.The kitchen is divided from the rest of the downstairs by a row of cupboards.\nSMART Vocabulary: related words and phrases\nParts of buildings: floors & parts of floors\nbasement\ncatwalk\nceiling\ndais\ndecking\nground level\nlanding\nloft\nlow slung\nmachicolation\nmezzanine\nmulti-levelled\nrostrum\nrunway\nsoapbox\nsplit-level\nstorey\nthe ground floor\nthe second floor\nwoodblock\nSee more results »\nAdd to word list\nAdd to word list\non or to a lower floor of a building, esp. the ground floor, or down the stairs: a downstairs bathroom I hear someone downstairs."}