{"id":132812,"name":"drag","type":"verb","us_sound":"dræɡ","us_link":"../audio/d/drag.mp3","uk_sound":"dræɡ","uk_link":"../audio/d/ukdozen019.mp3","content":"drag verb\n(PULL)\nAdd to word list\nAdd to word list\nB2 [ T ] to move something by pulling it along a surface, usually the ground: Pick the chair up instead of dragging it behind you! She dragged the canoe down to the water. Synonyms\ncarry (TRANSPORT)\ncart\nferry\nlug informal\ntote informal\ntransport (GOODS/PEOPLE)\nThesaurus: synonyms, antonyms, and examples\nto pull somethingpullPull your chair over here so you can see the screen. dragShe dragged the canoe down to the water.haulThey hauled the boat out of the water.towYou shouldn't drive fast when your car is towing a trailer.yankShe marched to the door and yanked it open.wrenchThe phone had been wrenched from the wall.\nSee more results »\nC2 [ T + adv/prep ] to make someone go somewhere they do not want to go: She had to drag her kids away from the toys. I really had to drag myself out of bed this morning.\nB1 [ T ] to move something on a computer screen using a mouse\n[ T ] If you drag a subject into a conversation, etc., you begin to talk about it even if it is not connected with what you are talking about: She's always dragging sex into the conversation.\n[ T ] to pull nets or hooks (= curved wires) along the bottom of a river or lake in order to find something: They found the man's body after dragging the canal. drag and drop\nB1 If you drag and drop something on a computer screen, you move it from one area to another using the mouse: Drag and drop files as required.\nSee more\nMore examplesFewer examplesThousands of turtles drag themselves onto the beach and lay their eggs in the sand.The dog managed to drag the box into the room by itself.She dragged the canoe down to the water.The youths were dragged from their car and searched for weapons.She dragged her bulging suitcase up the stairs.\nSMART Vocabulary: related words and phrases\nPulling\ndraft\ndraught\ndraw something up\nhaul\nheave\nheave-ho\nheft\nhitch something up\npluck\nreel\nreel something in/out\nretract\nretractable\nsuck\ntow\ntow-away\ntraction\ntrail\nwrest\nyank\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTaking someone somewhere or telling them the way\nOperating computers\nQuoting & making references\nSearching\ndrag verb\n(BASEBALL)\n[ T ] in baseball, to hit the ball slowly and at an angle: He dragged a bunt towards first base.\nSMART Vocabulary: related words and phrases\nBaseball & rounders\naround the horn idiom\nbag\nball\nballgame\nballplayer\nbase hit\nbases\nbottom\nchopper\nfarm\nflare\nfoul\nglove\nhomer\nsafe\nsecond base\nshag\nshortstop\nslider\nthe World Series\nSee more results »\ndrag verb\n(BORING)\nC2 [ I ] If something such as a film or performance drags, it seems to go slowly because it is boring: The first half of the movie was interesting but the second half dragged (on).\nSMART Vocabulary: related words and phrases\nSpending time & time passing\nall the time in the world idiom\nAnno Domini\ncourse\nelapse\nemploy\nfall\nfall away\nmisspend\npass\nroll\nroll by\nrun\nrun out\nslip\nslip away\nthe sands of time idiom\ntick\ntimekeeper\nwear on\nwhile something away\nSee more results »\nIdioms\ndrag your heels/feet\ndrag someone's name through the mire/mudPhrasal verbs\ndrag someone away\ndrag someone down\ndrag someone into something\ndrag something out\ndrag something out of someone\ndrag noun\n(BORING THING)\n[ S ] informal something that is not convenient and is boring or unpleasant: Filling in forms is such a drag! I've got to go to the dentist again - what a drag!\nThesaurus: synonyms, antonyms, and examples\na person or thing that is not exciting or interestingboreHe just goes on and on - what a bore.crashing boreTheir candidate is a crashing bore and won't garner any attention.snoozeThe stories in the magazine are all a snooze, but the photos are fab.snoozefestThe game was a total snoozefest.a yawnEven though it's a classic, I thought the book was a bit of a yawn.a wet weekendUK You're about as fun as a wet weekend.\nSee more results »\nSMART Vocabulary: related words and phrases\nInconvenience\naggravation\naggro\nawkward\nbore\nbother\nbulky\ndisturbance\nfag\nhave fun and games idiom\nimposition\ninconvenience\ninconvenient\ninconveniently\npalaver\npinprick\npisser\nput something out\nrigamarole\nrigmarole\ntempest\nSee more results »\ndrag noun\n(PULL)\n[ S or U ]\n&#160; physics, engineering\n&#160; specialized the force that acts against the forward movement of something that is passing through a gas or a liquid: Engineers are always looking for ways to minimize drag when they design new aircraft.\nSMART Vocabulary: related words and phrases\nPulling\ndraft\ndraught\ndraw something up\nhaul\nheave\nheave-ho\nheft\nhitch something up\npluck\nreel\nreel something in/out\nretract\nretractable\nsuck\ntow\ntow-away\ntraction\ntrail\nwrest\nyank\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysics: energy, force & power\ndrag noun\n(SUCK)\n[ C ] slang the action of taking in air through a cigarette: Taking a deep drag of/on his cigarette he closed his eyes and sighed.\nSMART Vocabulary: related words and phrases\nTobacco & smoking\nanti-tobacco\nbig tobacco\nbong\nbriar\nchain-smoker\ncigarette\ncigarette butt\ncigarette holder\nfag\nfilter tip\nnicotine patch\npuff\npuffer\nroll up! idiom\nroll-your-own\nsecond-hand smoke\nshisha\nsmokeless\ntobacco\ntobacconist\nSee more results »\ndrag noun\n(CLOTHES)\n[ U ] informal the activity of dressing in clothes of a different gender and acting in an exaggerated way like a person of that gender, especially of a man wearing highly decorated women's clothes, wigs (= artificial hair), jewellery, make-up, etc. as a costume and performing for entertainment: So much of drag is about putting on a character. The show has been a pioneer in bringing drag culture to mainstream America. For some people, drag is about putting on a dress and looking pretty; for others, it's a tool for cultural critique. Related words\ndrag artist\ndrag king\ndrag queen\n[ U ] informal clothes, wigs (= artificial hair), jewellery, make-up, etc. that are usually worn by a person of a different gender, especially highly decorated women's clothes that are worn as a costume by a man performing for entertainment: a man in drag His social media pages show photos of himself both in and out of drag. At times she wore drag.\nMore examplesFewer examplesMore people are realising that drag can be a career.None of us had been to a drag show before.He uses performance methods such as drag and mime in fresh, bold ways.He tried out various jobs, including performing in a drag act.He took off his drag makeup and lamé gown.\nIdiom\nbe a drag on someone/something\ndrag verb [I/T]\n(PULL)\nAdd to word list\nAdd to word list\nto move something heavy by pulling it along the ground: [ T ] If the box is too heavy to lift, just drag it over here.\nfig. To drag someone away/out is to persuade someone to leave or do something when the person does not want to do it: [ T ] I hate to drag you away from the party, but we really have to go.\nIf you drag out an event, you cause it to continue for longer than is necessary or convenient: [ M ] They should make a decision now instead of dragging out the discussion.\nIf an event drags, it seems to happen very slowly: [ I ] The play dragged in the second act. Idiom\ndrag your feet\ndrag noun\n(PULL)\n[ C ] something or someone that slows progress or development, or that makes success less likely: Keeping a large staff is a drag on our income.\ndrag noun\n(BORING EVENT)\n[ U ] infml someone or something that is unpleasant and boring: Waiting in a doctor’s office is such a drag!\ndrag noun\n(CLOTHES)\n[ U ] slang women’s clothes worn by a man\nAdd to word list\nAdd to word list\n[ I or T ] to become lower or less, or to make something do this: Sales have been dragging this month. Jewellery exports will be dragged by weak consumer confidence caused by world economic turmoil.\n[ I ] to take a long time, or progress very slowly: The planned one-hour session dragged into its third hour. Negotiations have dragged on longer than expected.\n[ T ]\n&#160; IT to move something on a computer screen using the mouse: Select the text you want to move and drag it where you want it to be.drag sth to/over/into etc. sth Click and hold on any button to drag it off the toolbar.\ndrag and drop\nIT to move something from one area of a computer screen to another using the mouse: The software allows you to drag and drop elements for the page - images, text, etc. - anywhere you want. Phrasal verb\ndrag sth down\nsomething that slows down or limits development: Ailing drug shares were another drag on the market. High energy prices will continue to be a drag on the economy."}