{"id":132909,"name":"drain","type":"verb","us_sound":"dreɪn","us_link":"../audio/d/drain.mp3","uk_sound":"dreɪn","uk_link":"../audio/d/ukdozen025.mp3","content":"drain verb\n(REMOVE LIQUID)\nAdd to word list\nAdd to word list\nC2 [ I or T ] If you drain something, you remove the liquid from it, usually by pouring it away or allowing it to flow away, and if something drains, liquid flows away or out of it: Drain the pasta thoroughly. We drained the pond and filled it with fresh water. Drain (off) any liquid that is left in the rice. Don't bother drying the pans - just leave them to drain.\nThesaurus: synonyms, antonyms, and examples\nto remove liquid from somethingdryCan you dry the dishes for me?dry something upCan you dry up the plates for me?dry (someone/something) offLet me dry the chairs off before you sit down. blotI blotted the spilled wine with a cloth.towelShe stepped out of the pool and towelled her hair.\nSee more results »\n[ T ] If you drain a glass or cup, you drink all the liquid in it.\nMore examplesFewer examplesThey dug deep channels to drain the water from the fields.That's just the sound of the water draining out of the sink.You don't need to drain the rice, you see. It has absorbed all the water.This entire region is drained by the Danube delta.If there isn't a hole in the bottom of the plant pot, the water can't drain out.\nSMART Vocabulary: related words and phrases\nTaking things away from someone or somewhere\nappropriate\nbear away\nconfiscate\nconfiscation\ncream something/someone off\ndebug\nexpropriate\nexpropriation\nextract\nextractive\nget off\nimpound\nrelieve\nroot something/someone out\nrout someone out\nseize\nshelf\nstripping\nsuck\nsweep\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRemoving and extracting\nEmptying\ndrain verb\n(MAKE TIRED)\nC2 [ T ] to make someone very tired: The long journey completely drained me.\nSMART Vocabulary: related words and phrases\nTired and making tired\nall in\nanti-fatigue\nat your worst idiom\nbe dead on your feet idiom\nbe fit/ready to drop idiom\nfinish something off\nfit to drop idiom\nfragile\ngassed\nhaggard\nshattered\nsleep deprivation\nsleep-deprived\nsleepily\nsleepiness\nstrung out\nworst\nwrecked\nyawningly\nzonked\nSee more results »\ndrain verb\n(REDUCE)\nC2 [ I or T ] to reduce or cause something to reduce: The long war had drained the resources of both countries. War drains a nation of its youth and its wealth (= uses them until they are gone).\n[ I ] If the blood/colour drains from your face, or if your face drains (of blood/colour), you turn very pale, often because you are shocked or ill: The colour drained from his face/cheeks when they told him the results.\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nabridgment\nattenuate\nattenuated\nattenuating\nattenuation\nboil\ncontraction\ndamp\nfall off\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nrightsizing\nroll back something\nrollback\nrun someone/something down\nrundown\ntelescope\ntumble\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe skin, & skin colour\nPhrasal verb\ndrain (something) away\ndrain noun\n(PIPE)\nC2 [ C ] a pipe or channel that is used to carry away waste matter and water from a building, or an opening in the road that rain water can flow down: I think the kitchen drain is blocked. She accidentally dropped her ring down a drain in the road. drains [ plural ] UK\nthe system of pipes, openings in the ground, or other devices that are used for carrying away waste matter and water: There was an unpleasant smell coming from the drains.\nSee more\n[ C ] US (UK plughole) a hole in a bath, sink, etc. through which water flows away and into which you can put a plug\nphanasitti/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesLeaves are clogging up the drain.Two kids were poking a stick into the drain.\nSMART Vocabulary: related words and phrases\nBuilding: plumbing, pipes & sewage\nballcock\ncaulking\ncesspit\ncistern\nconduit\nhydrant\ninfluent\nisolator\nmixer tap\noutfall\nplumb\nplunger\nsewage\nsewage works\nsewer\nsiphon\nspigot\nstandpipe\nsyphon\nwaterworks\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBathroom fixtures & fittings\ndrain noun\n(MAKE TIRED)\n[ S ] something that makes you feel very tired: I think taking care of her elderly mother is a big drain on her energy.\nSMART Vocabulary: related words and phrases\nTired and making tired\nall in\nanti-fatigue\nat your worst idiom\nbe dead on your feet idiom\nbe fit/ready to drop idiom\nfinish something off\nfit to drop idiom\nfragile\ngassed\nhaggard\nshattered\nsleep deprivation\nsleep-deprived\nsleepily\nsleepiness\nstrung out\nworst\nwrecked\nyawningly\nzonked\nSee more results »\ndrain noun\n(REDUCE)\nC2 [ S ] something that uses more of your energy, money, or time than you want to give: Having a big mortgage is a real drain on your earnings.\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nabridgment\nattenuate\nattenuated\nattenuating\nattenuation\nboil\ncontraction\ndamp\nfall off\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nrightsizing\nroll back something\nrollback\nrun someone/something down\nrundown\ntelescope\ntumble\nSee more results »\nAdd to word list\nAdd to word list\nto allow or cause liquid to flow away from something: [ I ] Wash the lettuce in the sink and let it drain. [ T ] Drain the lettuce and then pat it dry with paper towels.\nIf something drains you, it makes you very tired: [ T ] It drains you to work with a class of 20 four-year-olds, let me tell you.\na pipe or channel that carries away waste water or other liquids: She spilled some sugar in the sink and washed it down the drain.\nSomething that is a drain on you takes away a lot of your energy and makes you tired: Taking care of his sick mother was quite a drain on him.\nIf something is a drain on your money or something else, it uses a lot of it or makes it weaker: Having two mortgages was a tremendous drain on their resources.\nAdd to word list\nAdd to word list\nsomething that uses too much of your energy, money, or time: Having a big mortgage is a real drain on your earnings. Unexpected repairs to the building have been a huge drain on our financial resources. The company's pension liability has become a cash drain.\ndown the drain informal\ncompletely wasted or spoiled: When the project was scrapped, all our efforts went down the drain. People feel that renting property is money down the drain. See also\nbrain drain\n[ T ] to reduce or remove a large amount of something: drain sth from sth The government is enforcing a deal that allows it to drain billions from miners' pension schemes.drain reserves/resources They took on work that was not profitable, draining cash resources.\n[ I ] to disappear gradually: How can we make sure business does not drain out of the country? The riches lured in too much competition and profits are now beginning to drain away."}