{"id":132917,"name":"drainer","type":"noun","us_sound":"ˈdreɪ.nɚ","us_link":"../audio/d/cus00617.mp3","uk_sound":"ˈdreɪ.nər","uk_link":"../audio/d/cuk00360.mp3","content":"drainer noun [C]\n(RELEASING LIQUID)\nAdd to word list\nAdd to word list\na frame made of plastic, metal, or wood, placed on the surface next to a sink to hold things while they dry: Jim washed up his cup carefully and placed it in the plastic drainer.\nNicholas Free/E+/GettyImages\nUK (US drainboard) a surface next to a sink where plates, knives, forks, etc. are left to dry after they have been washed: The sink is stainless steel with an integral stainless steel drainer.\na container with holes for letting liquid run out of something: This is a very clever vegetable drainer which clips on to pans so you do not need a colander.\na person whose job is to drain water (= allow it to flow away) from an area: He was working as a drainer on a building site.\nMore examplesFewer examplesIt's a beautiful kitchen but I don't like the cheap plastic dish drainer on the worktop.Just leave the clean plates on the drainer.The unit consists of a sink and drainer with cupboards beneath.The bottles are washed and put into drainers, which are just a big piece of wood with holes cut in, and dried over the heat. Put the cooked spinach into a drainer and squeeze to remove as much water as possible. You can buy yogurt drainers, which look like a coffee filter with an extremely fine mesh fabric inside.The locals were suspicious of the drainers who came to drain the marshes.\nSMART Vocabulary: related words and phrases\nWashing the dishes\ndish\ndish soap\ndishcloth\ndishrag\ndishtowel\ndrainboard\ndraining board\ndraining rack\nhandwash\npan scourer\nroller towel\nscouring pad\nscrubber\nsink\nsink unit\ntea cloth\ntea towel\nwashing-up\nwashing-up liquid\nwaste disposal\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral and miscellaneous containers\nBuilding: construction work & workers\ndrainer noun [C]\n(TAKING ENERGY)\nsomething that takes a lot of power from a battery (= a device that produces electricity to provide power for phones, cars, etc.), so that in the end it uses it all up: Just be aware that having some apps permanently connected on your phone can be a battery drainer.\ninformal something or someone that uses a person's energy so that they feel very tired or less powerful: Constantly having to prove yourself is an emotional drainer. In her book she advises you how to deal with \"drainers\" at work, people who suck your energy and slow you down.\nSMART Vocabulary: related words and phrases\nPhysics: energy, force & power\nanimal magnetism\nanti-gravity\natmospheric pressure\nattract\nattraction\nballistic\nexcited\nfrictional\nfrictionless\nfundamental force\nG-force\ngeothermal\ninertia\nself-propulsion\nsine curve\nsinusoid\nsolarize\nspecific heat\nthe sound barrier\nthermodynamics\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTired and making tired"}