{"id":132945,"name":"dramatic","type":"adjective","us_sound":"drəˈmæt̬.ɪk","us_link":"../audio/d/dramatic.mp3","uk_sound":"drəˈmæt.ɪk","uk_link":"../audio/d/ukdram_003.mp3","content":"dramatic adjective\n(EXCITING)\nAdd to word list\nAdd to word list\nB2 very sudden or noticeable, or full of action and excitement: a dramatic change/improvement We watched scenes of the dramatic rescue on the news. Synonyms\nelectrifying\nexciting\nexhilarating\ngripping\nthrilling\ntalking or behaving in a way that makes something seem much worse, more serious, more frightening, etc. than it really is: \"I'll never find another job!\" \"Don't be so dramatic! Of course you will!\" It may sound dramatic, but I felt like my life was over. She burst into dramatic floods of tears.\nMore examplesFewer examplesWhat accounts for the dramatic turnabout in Britain's international trading performance?There has been a dramatic shift in public opinion towards peaceful negotiations.In 1986 he made a very public and dramatic political volte-face from Left to Right.The increase in the number of young people leaving to work in the cities has had a dramatic impact on the demography of the villages.He secured a dramatic victory for England by netting the ball half a minute before the end of the game.\"She has abandoned me,\" he said, which was a little dramatic.It was rather a dramatic reaction to such a small comment.\nSMART Vocabulary: related words and phrases\nExciting and interesting\nabsorbing\nabsorbingly\naction-packed\nadventurous\nalley\neye-catchingly\nfancifully\nfascinating\nfascinatingly\nfascinator\nprovocatively\npulsating\npunchy\nracy\nriveting\nwatchable\nwith bells on idiom\nzhuzh\nzing\nzingy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExaggerating & playing down\ndramatic adjective\n(THEATRE)\nrelating to plays and acting: She bought me the complete dramatic works (= texts to be performed) of Brecht for my birthday. the American Academy of Dramatic Arts the Royal Academy of Dramatic Arts\nSMART Vocabulary: related words and phrases\nTheatre - general words\naudio described\naudio description\nbreak\nbreak a leg idiom\ncommunity theatre\ndiegetic\ndouble bill\ndramatize\nhold\nkabuki\nmusical\nnon-theatrical\nnondramatic\npremiere\npreview\npuppetry\nscenography\nslapstick\nthespian\nvaudeville\nSee more results »\ndramatic adjective\n(RELATING TO THEATER)\nAdd to word list\nAdd to word list\nrelating to plays and acting: He’s as good in comedies as he is in dramatic roles.\ndramatic adjective\n(EXCITING)\n(of an event or situation) producing excitement and strong interest because unexpected, surprising, or dangerous: In a dramatic rescue, 10 crewmen were lifted to a helicopter just minutes before their ship sank.\nDramatic also means sudden and showing a big change: There has been a dramatic reduction in crime in New York City."}