{"id":132941,"name":"drama","type":"noun","us_sound":"ˈdræm.ə","us_link":"../audio/d/drama.mp3","uk_sound":"ˈdrɑː.mə","uk_link":"../audio/d/ukdram_002.mp3","content":"drama noun\n(THEATRE)\nAdd to word list\nAdd to word list\nB1 [ C or U ] a play in a theatre or on television or radio, or plays and acting generally: She's starred in several TV dramas. He's the drama critic for the Times. She studied English and drama at college.\nused in expressions that refer to the type of play or film: a courtroom drama a historical drama\nMore examplesFewer examplesHis new play is a raw drama about family life.The local drama group is staging a production of the musical 'Grease'.Next up on Channel 4 is the first episode of a new medical drama set in Chicago.English drama has enjoyed a rebirth since the 1950s with writers like John Osborne, Harold Pinter and Tom Stoppard.The show was a wonderful amalgam of dance, music and drama.\nSMART Vocabulary: related words and phrases\nLiterature\naccentual\naction hero\nalliterative\nalternative history\nanapest\nfemslash\nfiction\nfictionality\nfictionally\nfictive\nnon-canonical\nnon-character\nnon-literary\nnon-metrical\nnon-poetic\nsuperheroine\nswashbuckler\nsympathetically\ntanka\ntartan noir\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTheatre - general words\nTypes of film, play, book etc.\ndrama noun\n(EXCITEMENT)\nB1 [ C ] an event or situation, especially an unexpected one, in which there is worry or excitement and usually a lot of action: We had a little drama last night when the oil in the pan caught fire.\n[ U ] the excitement and energy that is created by a lot of action and arguments: As a lawyer, he enjoyed the drama of the courtroom.\nMore examplesFewer examplesSally always makes a drama out of the smallest of events.Everybody stopped to watch as the drama of the hostage crisis unfolded on live television.There was a moment of great drama in Parliament today as two protestors ran into the debating chamber.The two teams produced 90 minutes of enjoyable football in a seven-goal drama.Her latest collection of photographs prove that no-one is better at capturing moments of high drama and deep emotion.\nSMART Vocabulary: related words and phrases\nExcitement, interest, energy and enthusiasm\nalacrity\nanimation\nardour\navidity\nboosterism\ncommotion\nflirtation\nfrenzy\nfriskiness\nfrisson\nget-up-and-go\nhubbub\npep\nperkiness\nphysicality\npiquancy\npizzazz\nwoot\nzeal\nzealousness\nSee more results »\ndrama noun\n(THEATER)\nAdd to word list\nAdd to word list\n[ C/U ] a play, esp. a serious one, written to be performed by actors, the writing of plays, or the art of showing plays: [ C ] She’s been in several television dramas. [ U ] Arthur Miller, a master of drama, wrote “Death of a Salesman.”\ndrama noun\n(EXCITEMENT)\n[ U ] excitement and strong interest produced by an unexpected or surprising event or situation: Watching on television was not the same as experiencing the drama of the event in person."}