{"id":133046,"name":"draw","type":"verb","us_sound":"drɑː","us_link":"../audio/d/eus71388.mp3","uk_sound":"drɔː","uk_link":"../audio/d/ukdram_020.mp3","content":"draw verb\n(PICTURE)\nAdd to word list\nAdd to word list\nA1 [ I or T ] to make a picture of something or someone with a pencil or pen: Jonathan can draw very well. The children drew pictures of their families. Draw a line at the bottom of the page.\nMore examplesFewer examplesI'll draw you a quick map if you're worried about finding the hotel.She drew the outline of the boat and then coloured it in.Rosie drew an elephant and coloured it in.Squared paper is better for drawing graphs on.If you draw or write in pencil you can always rub out your mistakes with an eraser.\nSMART Vocabulary: related words and phrases\nPainting, drawing & printing\nairbrush\naxonometric\nbrushstroke\nbrushwork\nchiaroscuro\ndescribe\ndrawn\nengraving\netching\nface painting\nforeshorten\nillustrate\npainterly\npainting\npainting by numbers idiom\npentimento\npicturize\nshade\nsketch\nvanishing point\nSee more results »\ndraw verb\n(ATTRACT)\nB2 [ T ] to attract attention or interest: He's an excellent speaker who always draws a crowd. Could I draw your attention to item number three on the agenda?UK Does he wear those ridiculous clothes to draw attention to himself?\nThesaurus: synonyms, antonyms, and examples\nto draw your attention and interest youattractWe were attracted to the high street, with its variety of shops and cafés.drawThe game drew a crowd of 30,000.enticeThe smell of coffee enticed people to enter the shop.lureI was lured into the store by the smell of fresh bread.temptI was tempted by the offer of a free phone.seduceI wouldn't normally have bought this but I was seduced by the low price.\nSee more results »\ndraw someone's eye(s)\nto attract someone's attention: Her eyes were immediately drawn to the tall blond man standing at the bar.\nSee more\nMore examplesFewer examplesThey're organizing a campaign to draw people's attention to the environmentally harmful effects of using their cars.He may be old hat among the trendy younger generation, but his shows draw more viewers than any other comedian.Science museums have tried to shake off their somewhat starchy image by mounting exhibitions designed to draw in the crowds.He drew attention to the absence of concrete evidence against the defendant.He was drawn to the metropolitan glamour and excitement of Paris.\nSMART Vocabulary: related words and phrases\nAttracting and tempting\naffinity\nallure\nalluringly\narrest\nattract\ncatnip\ncharisma\ncharm offensive\ncharm the pants off someone idiom\nchum\nglamorousness\nglamour\nhoney trap\nincentive\njump out at someone\ntantalizing\ntantalizingly\ntempt\ntemptation\ntemptingly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking people excited and interested\ndraw verb\n(MAKE)\nC2 [ T ] formal to make or show a comparison between things: You can't really draw a comparison between the two cases - they're completely different. It's sometimes very difficult to draw a clear distinction between the meanings of different words. draw a/the conclusion\nB2 to consider the facts of a situation and make a decision about what is true, correct, likely to happen, etc.: I'd seen them together so often, I drew the logical conclusion that they were husband and wife.\nSee more\nMore examplesFewer examplesShe drew a comparison between life in the army and life in prison.He drew an analogy between the brain and a vast computer.Did you draw any conclusions at the meeting this morning?It would be easy to draw a parallel between the town's history and that of its football club.The report focuses on the particular rather than the general and so doesn't draw any overall conclusions.\nSMART Vocabulary: related words and phrases\nConcluding and deducing\nanalysis\ndeduce\ndeducible\ndeduction\ndeductive\ndeductively\ndiagnosis\ngather\nhypothetico-deductive\nimply\nimpute something to someone\nin the last/final analysis idiom\ninconclusively\ninduction\ninferential\nmaths\nnon-deductive\nperceive\nput something down to something\nput two and two together idiom\nSee more results »\ndraw verb\n(MOVE)\nB2 [ I + adv/prep ] to move in a particular direction, especially in a vehicle: The train slowly drew into the station/drew in. As we drew alongside (= reached) the black car, I suddenly recognized my ex-boyfriend at the wheel.UK Montgomery drew level with Greene in the 100 metres final, but never passed him. draw near, close, etc.\nB2 to become nearer in space or time: As Christmas draws nearer, the big stores start to get unbearably crowded.\nSee more draw to a close/an end\nC2 to gradually finish: As the evening drew to a close, people started reaching for their coats.\nSee more\nMore examplesFewer examplesA limousine drew up outside the hotel.As the date of his operation drew near, he became more and more anxious.A car drew up outside and a few moments later the doorbell rang.\"Let's draw this meeting to a close, gentlemen, \" said the chairman.The shadows deepened as the evening drew on.\nSMART Vocabulary: related words and phrases\nGeneral words for movement\nbetake\nbudge\nbudge up\ncirculate\ndad dancing\ngangway\ngone\nkinetic\nkinetic energy\nkinetically\nlibration\nlocomotion\nmotion\nmove\npass\nround\nscoot\nseethe\nshove\nslip\nSee more results »\ndraw verb\n(CAUSE)\n[ T ] If something draws a reaction, people react in the stated way: Her speech last night in the Senate drew an angry response.\nMore examplesFewer examplesThe minister's speech drew loud snorts of derisive laughter.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nspark\nspell\nSee more results »\ndraw verb\n(PULL)\nC2 [ T + adv/prep ] to pull or direct something in a particular direction: She drew her coat tightly around her shoulders. The crowd watched as the referee drew the player aside/to one side and spoke to him. draw the curtains\nto pull curtains so that they are either together or apart: Could you draw the curtains, please?\nSee more\nSMART Vocabulary: related words and phrases\nPulling\ndraft\ndrag\ndraught\ndraw something up\nhaul\nheave\nheave-ho\nheft\nhitch something up\npluck\nreel\nreel something in/out\nretract\nretractable\nsuck\ntow\ntow-away\ntraction\nwrest\nyank\nSee more results »\ndraw verb\n(CHOOSE)\n[ I or T ] to choose a number, card, etc. from several numbers, cards, etc. without first seeing it, in a competition or a game: I was dealt two aces, and I drew a third.\nSMART Vocabulary: related words and phrases\nTaking and choosing\nadopt\nadopted\nadoption\nappoint\nbags I... idiom\nbe your best bet idiom\ncull\nempanel\nfaute de mieux\nfavoured\nfilterable\ngo for someone\npicker\nRobin Hood\nselect\nselection\nselective\nselectively\nskim\nyou pays your money and you takes your choice/chance idiom\nSee more results »\ndraw verb\n(TAKE OUT)\n[ T ] to take something out of a container or your pocket, especially a weapon: Suddenly he drew a gun/knife and held it to my throat.\n[ T ] to cause a substance, especially blood, to come out of a body: He bit me so hard that it drew blood.\nSMART Vocabulary: related words and phrases\nTaking and choosing\nadopt\nadopted\nadoption\nappoint\nbags I... idiom\nbe your best bet idiom\ncull\nempanel\nfaute de mieux\nfavoured\nfilterable\ngo for someone\npicker\nRobin Hood\nselect\nselection\nselective\nselectively\nskim\nyou pays your money and you takes your choice/chance idiom\nSee more results »\ndraw verb\n(GET)\n[ T ] to get a feeling, idea, etc. from something or someone: She drew comfort from the fact that he died peacefully.\nSMART Vocabulary: related words and phrases\nUsing and misusing\nadopt\nadoption\navail\navail yourself of something\nbe/go heavy on something idiom\nexhaust\ngo through\ngobble something up\nmake capital out of something idiom\nmax\nmax out\nspare\nspent\nswallow\ntap\nturn over\nturn to someone/something\nturn/use something to good account idiom\nunblock\nunderuse\nSee more results »\ndraw verb\n(BREATHE)\n[ I or T ] to take air or smoke into your lungs: She drew a deep breath and plunged into the water.\nSMART Vocabulary: related words and phrases\nAnimal physiology: breathing & stopping breathing\naerobic\nasphyxia\nasphyxiation\nbreathable\nbreathlessly\ndraw breath phrase\nexpire\nheave\npuff\nshallow\nshort of breath\nshortness\nsleep apnoea\nsmother\nsnuffly\nstrangle\nstrangulate\nsuffocating\nthrottle\nwinded\nSee more results »\ndraw verb\n(EQUAL)\nC1 [ I ] UK to finish a game with the same number of points as the other person or team: Coventry drew 1–1 with United in the semifinal.\nSMART Vocabulary: related words and phrases\nWinning, losing & scoring in sport\naet\nagainst the run of play idiom\nbag\nblow someone away\nboss\nbreak your duck idiom\nclose-run\nconcede\nequalizer\npromedios\npull\npull back\nreel something off\nrelegation zone\nromp\nscore\nshutout\nstraight\nstrike\ntreble\nSee more results »\ndraw verb\n(MONEY)\n[ T + prep ] to get money from a bank, account, etc. so that you can use it: I drew some money out of my account to pay for our trip.\n[ T ] to receive money regularly, especially as an employee or from the government: He's been drawing a pension for ten years.\nSMART Vocabulary: related words and phrases\nWithdrawing money\natm\nautomated teller machine\nautomatic teller machine\ncash machine\ncashback\ncashpoint\nclear\nclearance\ndip\ndip into something\ndraw something down\ndrawdown\ndrawn\nhole in the wall\nlay\noverdraw\noverdrawn\ntake something out\nwithdraw\nwithdrawal\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGetting, receiving and accepting\nEarning money\nIdioms\ndraw a blank\ndraw a veil over something\ndraw breath\ndraw the linePhrasal verbs\ndraw back\ndraw something down\ndraw in\ndraw someone into something\ndraw something off\ndraw on something\ndraw something out\ndraw someone out\ndraw something up\ndraw yourself up\ndraw noun\n(ATTRACTION)\n[ C usually singular ] someone or something that a lot of people are interested in: We need someone at the event who'll be a big draw and attract the paying public.\nSMART Vocabulary: related words and phrases\nAttracting and tempting\naffinity\nallure\nalluringly\narrest\nattract\ncatnip\ncharisma\ncharm offensive\ncharm the pants off someone idiom\nchum\nglamorousness\nglamour\nhoney trap\nincentive\njump out at someone\ntantalizing\ntantalizingly\ntempt\ntemptation\ntemptingly\nSee more results »\ndraw noun\n(EQUAL SCORE)\n[ C ] UK a situation in which each team in a game has equal points and neither side wins: The result was a draw.\nSMART Vocabulary: related words and phrases\nWinning, losing & scoring in sport\naet\nagainst the run of play idiom\nbag\nblow someone away\nboss\nbreak your duck idiom\nclose-run\nconcede\nequalizer\npromedios\npull\npull back\nreel something off\nrelegation zone\nromp\nscore\nshutout\nstraight\nstrike\ntreble\nSee more results »\ndraw noun\n(COMPETITION)\n[ C ] UK (US also drawing) a competition that is decided by choosing a particular ticket or number by chance\n[ C ] UK (US also drawing) a way of deciding who will play against whom in a competition by choosing numbers by chance: The draw for the first round will take place on Monday night. They could reach the final if they get a favourable draw.\nSMART Vocabulary: related words and phrases\nMiscellaneous games & activities\nair hockey\nbeer pong\nbelly dancing\nboomerang\nbran tub\nbuildering\nChinese puzzle\njigsaw\njuggling\njump rope\nkeepy-uppy\nkorfball\nLARP\norigami\npinball\nstory mode\nsubworld\nsudoku\ntable football\ntabletop\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGambling & bookmaking\nParts & stages of competitions\ndraw verb\n(PICTURE)\nAdd to word list\nAdd to word list\n[ I/T ] to make a picture of something or someone with a pencil, pen, etc.: [ T ] The child drew a picture of a dog.\ndraw verb\n(MOVE)\n[ I always + adv/prep ] to move in a particular direction: As we drew near, a dog started to bark.\ndraw verb\n(PULL/PULL IN)\n[ I/T ] to pull or direct something or someone in a particular direction, or attract someone toward a particular place: [ T ] The Grand Canyon draws millions of tourists each year. [ T ] I would like to thank Professor Reynolds for drawing my attention to this article.\n[ I/T ] To draw is also to pull together or close something covering a window, so that no one can see you: [ T ] She drew the blinds and sat down to read.\n[ I/T ] To draw is also to suck in: [ I ] He sharply drew in his breath.\ndraw verb\n(TAKE OUT)\n[ T ] to remove something: It was my turn to draw a card.\ndraw verb\n(DECIDE ON)\n[ T ] to decide on something as a result of thinking about it: We can draw some conclusions about the causes of this disease.\ndraw verb\n(CAUSE)\n[ T ] to cause a reaction from someone: The criticism drew an angry response from the mayor.\nIdioms\ndraw a blank\ndraw the linePhrasal verbs\ndraw yourself up\ndraw out something\ndraw out someone\ndraw up something\ndraw noun [C]\n(ATTRACTION)\ninfml someone or something that attracts a lot of interest, esp. of paying customers: Every team needs a superstar who will be a big draw.\ndraw noun [C]\n(GAME RESULT)\n(in sports and games) a situation in which each side or team has equal points or is in an equal position and neither side wins: The hockey game ended in a draw, 2 to 2.\nAdd to word list\nAdd to word list\nBANKING\n&#160; (also withdraw) to get money from a bank or an account so that you can use it: draw money/cash from sth Customers will be charged each time they draw cash from the cash dispensers. The company is now able to draw money from the £10m loan it has negotiated with Royal Bank of Scotland.\nFINANCE to receive money regularly, especially as an employee or from the government: The chief executive drew £1million last year in salary and bonuses. draw a salary/pension\nBANKING to write out a cheque and receive money for it: draw a cheque on an account/a bank Consumers nowadays routinely pay for goods not with cash or cheques drawn on their bank accounts but with credit cards. US Dollar cheques can be accepted if they are drawn on a bank with clearing facilities in the UK.\nFINANCE, COMMERCE to write a bill of exchange (= document used in trade that orders payment for goods or services): draw a bill of exchange on sb Bills of exchange are drawn on buyers and accepted when the seller hands over the bill of lading covering the goods. Phrasal verbs\ndraw sth down\ndraw sth from sth\ndraw on/upon sth\ndraw sth out\ndraw sth up\nsomeone or something that attracts a lot of people: With an ice rink and indoor turf field, the complex has been popular and a draw for out-of-town visitors.a big/huge draw As in China, the big draw is India's massive and lucrative domestic market potential.\n[ usually singular ] an act of using some of the supply of something, especially oil or gas, or the amount that is used: Oil prices continued to rise yesterday amid fears that figures from America will show another big draw on stocks.\nsomething that uses up part of a supply of something: The training program is a draw on all our resources."}