{"id":133072,"name":"drawer","type":"noun","us_sound":"drɔːr","us_link":"../audio/d/eus71390.mp3","uk_sound":"drɔːr","uk_link":"../audio/d/epd31709.mp3","content":"drawer noun\n(FURNITURE)\nAdd to word list\nAdd to word list\nA2 [ C ] a box-shaped container, without a top, that is part of a piece of furniture. It slides in and out to open and close and is used for keeping things in: I keep my socks in the bottom drawer. He rummaged through his desk drawer trying to find a pen.\nSerg_Velusceac/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesYou'll find the knives and forks in the left-hand drawer.She pulled out the drawer.He came across some of his old love letters in his wife's drawer.We searched all morning for the missing papers and finally discovered them in a drawer.They discovered a stash of money hidden at the back of a drawer.\nSMART Vocabulary: related words and phrases\nFurniture for storage\nairing cupboard\nalmirah\nbookcase\nbookshelf\nbroom closet\ncredenza\ncubby\ncubbyhole\ncupboard\ncwtch\nhot press\nhutch\nlocker\nottoman\nshelf\nshelves\ntrophy cabinet\nwalk-in\nwardrobe\nWelsh dresser\nSee more results »\ndrawer noun\n(CLOTHES)\ndrawers [ plural ] old-fashioned\n→\nunderpants : I saw a pair of drawers on the bed.\nSee more\nAdd to word list\nAdd to word list\na wide but not very deep container, open at the top, that is part of a piece of furniture and that a person can pull partly out from its front to put things in and then push back to make it even with the front of the furniture: I keep my socks in the bottom drawer of my dresser.\nAdd to word list\nAdd to word list\nBANKING the person who writes a cheque telling their bank to pay an amount of money to someone: Where a cheque was dishonoured, the payee had an immediate right of recourse against the drawer of the cheque.\nFINANCE, COMMERCE the person who writes a bill of exchange telling someone to pay an amount of money at a stated time: You must state the name of the drawer of the bill - the exporter - followed by the amount in words specifying clearly the currency of the bill. Compare\npayeeSee also\nrefer to drawer"}