{"id":133145,"name":"dream","type":"noun","us_sound":"driːm","us_link":"../audio/d/dream.mp3","uk_sound":"driːm","uk_link":"../audio/d/ukdread006.mp3","content":"dream noun [C]\n(SLEEP)\nAdd to word list\nAdd to word list\nA2 a series of events or images that happen in your mind when you are sleeping: a good/bad dream a recurring dream I had a very strange dream about you last night. [ + that ] Paul had a dream that he won the lottery.\nMore examplesFewer examplesJane's hand on my shoulder woke me from a bad dream.I was in the middle of an amazing dream when the alarm went off.Some people believe that dreams reveal important things about your subconscious thoughts.I had a weird dream about you last night.If I eat a lot of cheese in the evening, I have amazing dreams.\nSMART Vocabulary: related words and phrases\nDreaming\nbe hearing/imagining/seeing things idiom\nbe miles away idiom\ndaydream\ndaydreamer\ndaydreaming\ndreamful\ndreamfully\ndreamless\ndreamlessly\ndreamscape\nhallucination\nhallucinatory\nimagination\nin a dream idiom\nnightmare\nphantasmagoria\nphantasmagorical\nredream\nreverie\nWalter Mitty\nSee more results »\ndream noun [C]\n(HOPE)\nB1 something that you want to happen very much but that is not very likely: It's always been my dream to have flying lessons. Winning all that money was a dream come true. Synonyms\naim (INTENTION)\nambition\naspiration (HOPE)\ngoal (AIM)\nhope\nintent formal or specialized\nintention\nobject (PURPOSE)\nobjective\ntarget (AIM)\nThesaurus: synonyms, antonyms, and examples\nsomething you want to do or achieveaimOur aim in protesting is to raise awareness of the unfairness of the system.goalMy goal in life has always been to be financially independent.objectiveOne of my objectives for this year is to increase sales.targetIf you meet your sales targets you will receive a generous bonus.dreamWhen I was growing up my dream was to perform in front of millions of people.hopeMy hope is that there will be some kind of positive outcome to this process.\nSee more results »\nof your dreams\nthe best that you can imagine: Win the house of your dreams in our fantastic competition!\nSee more\nMore examplesFewer examplesTheir dream to bring computers and ordinary people together was nothing less than revolutionary.To win the Olympic gold medal was the realization of his life's dream.Ever since she was a child her dream has been to teach school.It was his boyhood dream to become a film director.After all the problems I'd had getting pregnant, Oliver's birth was a dream come true.\nSMART Vocabulary: related words and phrases\nHoping and hopefulness\nappealingly\nboosterish\nboosterism\ncautious\ncautiously\nfancy\nglass\nhopeful\nhopefully\nhopefulness\nill\nit's an ill wind (that blows nobody any good) idiom\nla-la land\npin your hopes on something/someone idiom\npipe dream\nplease God idiom\nPollyanna\npositiveness\ntrust\nwing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFeelings of desire\nIdioms\nbe (living) in a dream world\nbeyond your wildest dreams\nin a dream\nin your dreams!\nnot/never in your wildest dreams\nwork/go like a dream\nwouldn't dream of something/doing something\ndream house, job, etc.\nthe perfect house, job, etc., that you want more than any other: It had always been their intention to build their dream house.\nSee more\ndream verb\n(SLEEP)\nA2 [ I or T ] to experience events and images in your mind while you are sleeping: What did you dream about last night? I often dream about/of flying. [ + that ] I dreamed that I was having a baby.\n[ I or T ] mainly UK to imagine that you have heard, done, or seen something when you have not: Did you say that you were going tonight or did I dream it? I thought I'd bought some polish and it seems I haven't - I must have been dreaming.\nMore examplesFewer examplesShe dreamed she saw someone standing at the foot of her bed.There's an old superstition that young girls going to bed on this night dream of their future husbands.Last night I dreamed that you were living in my kitchen - it was weird!I couldn't believe what I was seeing - I thought I must be dreaming.If you're dreaming that you're about to die, you always wake up, don't you?\nSMART Vocabulary: related words and phrases\nDreaming\nbe hearing/imagining/seeing things idiom\nbe miles away idiom\ndaydream\ndaydreamer\ndaydreaming\ndreamful\ndreamfully\ndreamless\ndreamlessly\ndreamscape\nhallucination\nhallucinatory\nimagination\nin a dream idiom\nnightmare\nphantasmagoria\nphantasmagorical\nredream\nreverie\nWalter Mitty\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nImagining and conceiving\ndream verb\n(HOPE)\nB1 [ I ] to imagine something that you would like to happen: I dream of living on a tropical island. [ + that ] He never dreamed that one day he would become president. dream on informal\nused to tell someone that what they are hoping for is not likely to happen or to be true: \"Watch. All I have to do is wink at her, and she'll come over here.\" \"Dream on, Dave!\"\nSee more\nSMART Vocabulary: related words and phrases\nImagining and conceiving\nassume\nbeyond your wildest dreams idiom\nblue-sky\nconceivable\nconceivably\nguess\nimagine\nin your mind's eye idiom\ninconceivably\nlay the foundation(s) of/for idiom\nlook on/upon someone/something as something\nmanifest\nreach\nregard\nretheorize\nrevisualization\nriot\nrun riot idiom\ntheorize\nthrow\nSee more results »\nPhrasal verbs\ndream about/of something\ndream something up\ndream noun [C]\n(SLEEP)\nAdd to word list\nAdd to word list\nthe activities, images, and feelings experienced by the mind during sleep: In the dream I had last night, someone was chasing me, but I didn’t know who it was.\ndream noun [C]\n(HOPE)\nan event or condition that you hope for very much, although it is not likely to happen: It was his dream to be a dancer.\nDream is sometimes used before a noun when you want to say that something is almost perfect: If there were one more bedroom, it would be my dream house. Idiom\ndream come true\ndream verb\n(SEE IMAGES)\nto experience activities, images, and feelings in your mind during sleep: [ I ] What did you dream about last night? [ + that clause ] I dreamed that I was in a boat on a big lake, and I was trying to get back to land.\ndream verb\n(HOPE)\n[ I ] to desire something very much and hope that it happens: Ever since that defeat, he had dreamed of revenge. Idiom\nsomeone would not dream of doing somethingPhrasal verb\ndream up something"}