{"id":133125,"name":"dread","type":"verb","us_sound":"dred","us_link":"../audio/d/dread.mp3","uk_sound":"dred","uk_link":"../audio/d/ukdread001.mp3","content":"Add to word list\nAdd to word list\nC2 to feel extremely worried or frightened about something that is going to happen or that might happen: He's dreading the exam - he's sure he's going to fail. [ + -ing verb ] I'm dreading having to meet his parents. dread to think\nC2 used to say that you do not want to think about something because it is too worrying: I dread to think what would happen if he was left to cope on his own.\nSee more\nMore examplesFewer examplesWe are dreading the idea of having my son's friends to stay.I dread to think what they say about me behind my back.That night as he dreamed, the warrior was confronted by the enemy he dreaded most.Although I was absolutely dreading telling Dad, he was actually very understanding when I told him.What is now happening in the country is what I dreaded most - it is descending into anarchy and civil war.\nSMART Vocabulary: related words and phrases\nAfraid\nafraid\nafraid for someone/something\nafraid of someone/something\nbe in fear of your life phrase\nbe like a deer/rabbit caught in the headlights idiom\nbottle\nfrit\ngoosey\ngun-shy\nhave a horror of something idiom\nhorror-struck\nleaf\npanic\nshake\nshake like a leaf idiom\nshit a brick idiom\nsquirrelly\nterrified\nterror\nterror-stricken\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing anxiety and worry\nRelated word\ndreaded\ndread noun\n(FEAR)\n[ U ] a strong feeling of fear or worry: The prospect of working full-time fills me with dread. I live in dread of bumping into her in the street. A feeling of dread crept over me as I approached the door. Synonym\napprehension\nThesaurus: synonyms, antonyms, and examples\nfearfearI have a dreadful fear of heights.terrorShe fled from the attacker in terror.dreadThe thought of giving a speech filled me with dread.alarmI don't want to cause you any alarm, but there's a rattlesnake in the path ahead of you.frightThe family ran from their home in fright when the earthquake struck.panicPanic spread through the crowd when someone shouted \"Fire!\"\nSee more results »\nMore examplesFewer examplesHis team has the power to instil dread in their opponents.They had a superstitious dread of this new technology.I was engulfed by a dread of what might happen.\nSMART Vocabulary: related words and phrases\nFear & phobias\nacrophobia\naerophobia\nagoraphobic\naquaphobia\narachnophobia\nbogie\ncatastrophize\nchill\ncold sweat\nhomophobia\nhomophobic\nhydrophobia\nhydrophobic\nIslamophobia\nmisophonia\nmortal\nscare\nwillie\nxenophobe\nxenophobically\nSee more results »\ndread noun\n(HAIR)\ndreads [ plural ] informal\nshort for\ndreadlocks : a hairstyle in which the hair hangs in long, thick, twisted pieces: They wore their hair in dreads.\nSee more\ncausing fear or worry: The dread spectre of civil war looms over the country. Every business person fears the dread moment when the laptop fails as they stand up to give a presentation.\nhumorous used to refer to something that you do not like or want: Conversation returned to that dread word, fashion.\nMore examplesFewer examples He developed a virus to battle the dread disease polio. When the dread news finally came, staff began to weep.At least nobody uttered the dread words: \"Do you know who I am?\" It would be waved aside by that dread phrase, \"political correctness\".\nSMART Vocabulary: related words and phrases\nDescribing things that cause fear\nawesome\nawesomely\nawesomeness\nbloodcurdling\nchilling\nfearsome\nfearsomely\nfrightening\nfrighteningly\ngreasily\nintimidating\nintimidatingly\nscarifying\nscarifyingly\nscarily\nspooky\nterrifying\nterrifyingly\ntraumatic\ntraumatically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInspiring dislike\nAdd to word list\nAdd to word list\nextreme fear or anxiety about something that is going to happen or might happen: a dread of drowning dread verb [ T ] us\nYour browser doesn't support HTML5 audio\n/dred/\nWe dreaded hearing the results of the blood tests."}