{"id":133353,"name":"drift","type":"verb","us_sound":"drɪft","us_link":"../audio/d/drift.mp3","uk_sound":"drɪft","uk_link":"../audio/d/ukdress013.mp3","content":"Add to word list\nAdd to word list\nC2 to move slowly, especially as a result of outside forces, with no control over direction: No one noticed that the boat had begun to drift out to sea. A mist drifted in from the marshes. After the band stopped playing, people drifted away in twos and threes.figurative The talk drifted aimlessly from one subject to another.\nThesaurus: synonyms, antonyms, and examples\nto move slowlycrawlThere'd been a bad accident on the motorway and traffic was crawling.trundleLorries trundle through the narrow lanes.creepHe crept downstairs, hardly making any noise.trudgeThey trudged wearily through the snow.strollWe spent the afternoon strolling around Budapest.ambleHe ambled over to the window.\nSee more results »\nMore examplesFewer examplesWhen toxic fumes began to drift toward our homes, we were told to evacuate.The smoke drifted downwind.The boat drifted westwards in the prevailing winds.The damaged boat drifted for days before it was finally taken in tow.The country seems to be drifting towards war.\nSMART Vocabulary: related words and phrases\nSlow and moving slowly\n(as) slow as molasses idiom\nat a snail's pace idiom\nby and by idiom\nby degrees idiom\nclaw your way (somewhere) idiom\ncrawl\nfloat\nhang around\nin ones and twos idiom\ninch by inch idiom\ninfiltrate\ninfiltration\njog\nsluggardly\nsluggish\nsluggishly\nsluggishness\nsnail\nwander\nworm\nSee more results »\nIdiom\ndrift with the tidePhrasal verbs\ndrift apart\ndrift off\ndrift noun\n(MEANING)\n[ S ] the general meaning without the details: The general drift of the article was that society doesn't value older people. catch/get someone's drift informal\nto understand the general meaning of what someone is saying: She could see from his expression that he caught her drift immediately.\nSee more if you catch/get my drift informal\nused to say that you have left out information or your opinion from what you have just said, but that you expect the person listening still to understand it: She's married, but she doesn't act as if she is, if you get my drift.\nSee more\nSMART Vocabulary: related words and phrases\nMeaning & significance\nacceptation\nadd\nadd up to something\nbackspin\nbe a badge of something idiom\ni.e.\ninterpretable\nlocution\nlocutionary\nmeaning\nmeaningfully\nmeaningfulness\npurport\nsense\nsignificant\nspeak\nsubtext\nsubtextually\nuse\nwhat's with something? idiom\nSee more results »\ndrift noun\n(MOVEMENT)\n[ C ] a pile of snow or something similar, formed by the wind: The snow lay in deep drifts.\nNicola Simeoni/EyeEm/GettyImages\n[ S or U ] a general development or change in a situation: The downward drift in copper prices looks like it will continue.\nSMART Vocabulary: related words and phrases\nPrecipitation: snow & ice\nanti-icing\navalanche\nbe snowed in idiom\nbe snowed up idiom\ndrifting\nglacially\nglacier\nhail\nhailstorm\niceberg\nicicle\nicy\npermafrost\nsleet\nslushy\nsnow line\nsnowfall\nsnowflake generation\nsnowpack\nspindrift\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChange and changes\ndrift verb [I]\n(MOVE)\nAdd to word list\nAdd to word list\nto move slowly, esp. as a result of outside forces, with no control over direction: He stopped rowing and let the boat drift.\nSomeone or something that drifts changes in a gradual way that seems to be controlled by outside forces: I finally drifted off to sleep.\ndrift noun\n(MEANING)\n[ U ] the general meaning or message of something said or written: After a minute I caught his drift and grinned back.\ndrift noun\n(MOVE)\n[ C ] a gradual change that seems to be controlled by outside forces: Many people experience a drift toward more conservative politics as they get older.\n[ C ] A drift is also a pile of something that is made larger by the force of the wind: The state police closed the highway because of deep snow drifts.\nAdd to word list\nAdd to word list\nFINANCE to slowly go up or down in value with no particular control over direction: drift lower/down/downwards The airline's shares drifted down 15 cents at $5.80. drift higher/up\nFINANCE a slow change in value, with no particular control over direction: an upward/downward drift in sth The downward drift in copper prices looks set to continue.\na slow development or change from one situation to another: drift away from sth The company is not seeing evidence of any drift away from its premium brands.drift to/toward sth There has been general unease about the drift toward a culture of selling, marketing, and consumerism.\na slow movement from one place to another: a drift from sth to sth The population drift from the cities to the suburbs adds significantly to car use. See also\nwage drift"}