{"id":133412,"name":"drink","type":"noun","us_sound":"drɪŋk","us_link":"../audio/d/drink.mp3","uk_sound":"drɪŋk","uk_link":"../audio/d/ukdress019.mp3","content":"drink noun [C or U]\n(LIQUID)\nAdd to word list\nAdd to word list\nA1 (an amount of) liquid that is taken into the body through the mouth: Would you like a drink of water/tea/juice? They'd had no food or drink for two days.\nMore examplesFewer examplesI like to have a hot drink at bedtime.In hot weather, shops do a brisk trade in cold drinks and ice creams.I don't let the children have sweet fizzy drinks.I think apple juice is your favourite drink, isn't it?The table tipped and all our drinks fell on the floor.\nSMART Vocabulary: related words and phrases\nDrinks - general words\nbeverage\nblender\ncaffeinated\ncarbonated\nchaser\ncraft\nflat\nflight\nglass\nhospitality\nhospitality tray\nice cube\niced\nJägerbomb\nshaved ice\nstraw\nsundowner\nthirst-quenching\ntop something up\nweak\nSee more results »\ndrink noun [C or U]\n(ALCOHOL)\nA2 alcoholic liquid: Do we have time for a quick drink? Whose turn is it to buy the drinks?UK We ran out of drink at the party. drinks [ plural ]\na party at which you have drinks, especially alcoholic drinks: Come over for drinks on Saturday.\nSee more\nMore examplesFewer examplesUK \"I've bought you a drink.\" \"Cheers, mate.\"We can't get a drink! It's after (pub) closing time.I won't have another drink, thanks. I need to have a clear head for my meeting in the morning.We could go for a drink after work tomorrow, if you like.He has some information I want, so I'm going to try to coax it out of him over a drink.\nSMART Vocabulary: related words and phrases\nAlcohol - general words\nalcoholic\nalcopop\nAngostura\naperitif\nbevvy\nbooze\nintoxicant\nlibation\nliquid lunch\nliquor\nlong drink\nlow-alcohol\nnip\npregaming\npreload\npreloading\nquick one\nquickie\nslug\nstiff\nSee more results »\nIdiom\ntake to drink\ndrink verb\n(LIQUID)\nA1 [ I or T ] to take liquid into the body through the mouth: He drank three glasses of water. The animals came down to the waterhole to drink.\nThesaurus: synonyms, antonyms, and examples\nto drinkdrinkWhat would you like to drink?haveI don't let the children have sweet fizzy drinks.sipShe sipped the tea carefully because it was hot.swigHe was swigging milk from the bottle.gulp (down)Stop gulping your water!slurpThe children were eating pizza and slurping lemonade.\nSee more results »\nMore examplesFewer examplesIf I drink too much coffee, I can't sleep.You'll dehydrate very quickly in this heat, if you don't drink lots of water.It's strange how drinking a lot of water can often make you feel thirsty.She drank two whole glassfuls of orange juice.I love milk - I drink gallons of the stuff.\nSMART Vocabulary: related words and phrases\nDrinking\nconsume\ndrink (something) up\ndrinker\ndrinking\ndrinking fountain\ndrinking water\ndrunk\nglug\nmainline\noverindulge\noverindulgence\noverindulgent\npartake\npreload\nsup\nswig\nswill\ntasting\ntea ceremony\nwash\nSee more results »\ndrink verb\n(ALCOHOL)\nA2 [ I ] to drink alcohol: \"Would you like a glass of wine?\" \"No thanks, I don't drink.\" I didn't drink at all while I was pregnant.\nMore examplesFewer examplesIt's a classic case of the bored-housewife syndrome - she's got nothing to do all day except drink and go shopping.I'm a social drinker - I only drink when I'm with other people.You look a bit rough - how much did you have to drink last night?He drank himself to death.He drank, womanized and wasted money.\nSMART Vocabulary: related words and phrases\nDrinking alcohol\nabstinence\nabstinence-only\nafter hours idiom\nbar-hop\nbarhopping\ndrinker\ndrinking\ndrinking game\ndrinking-up time\ndrown your sorrows idiom\nhangover\nhatch\nout of hours idiom\noutdrink\noverdrink\npaint\npaint the town red idiom\nply\npoison\nspike\nSee more results »\nIdioms\ndrink like a fish\ndrink someone under the tablePhrasal verbs\ndrink something in\ndrink to something\ndrink (something) up\ndrink verb\n(TAKE LIQUID)\nAdd to word list\nAdd to word list\n[ I/T ] to take in and swallow an amount of liquid through the mouth: [ T ] She drinks a glass of orange juice every morning.\ndrink verb\n(TAKE ALCOHOL)\n[ I ] to take in an alcoholic liquid: He used to drink heavily. Phrasal verb\ndrink to something/someone\ndrink noun\n(LIQUID)\n[ C/U ] liquid which is taken into the body through the mouth: [ C ] May I have a drink of water?\ndrink noun\n(ALCOHOL)\n[ C ] a liquid containing alcohol: Who's buying the drinks?"}