{"id":133472,"name":"drive","type":"verb","us_sound":"draɪv","us_link":"../audio/d/drive.mp3","uk_sound":"draɪv","uk_link":"../audio/d/ukdress028.mp3","content":"drive verb\n(USE VEHICLE)\nAdd to word list\nAdd to word list\nA1 [ I or T ] to move or travel on land in a motor vehicle, especially as the person controlling the vehicle's movement: I'm learning to drive. \"Are you going by train?\" \"No, I'm driving.\" She drives a red sports car. They're driving to Chicago on Tuesday. We saw their car outside the house and drove on/past/away. I drove my daughter to school. Compare\nride verbSee also\ndriving under the influence\nThesaurus: synonyms, antonyms, and examples\nto take someone somewheretakeI have to take my mother to the doctor today.go withI offered to go with him to the police station.come withCan you come to the hospital with me?accompanyChildren under 12 must be accompanied by an adult.driveMy husband usually drives the kids to school.give someone a liftCan you give me a lift into town?\nSee more results »\nMore examplesFewer examplesI asked him to drive more slowly, but he didn't take any notice.The police fined her for driving through a red light.The police spotted him driving a stolen car.We drove along a narrow, bumpy road.She drives the kids to school every morning.\nSMART Vocabulary: related words and phrases\nOn the road: driving & operating road vehicles\naquaplaning\nback someone up\nbiting point\nboxed in\nbranch off\nchauffeur\ngun\nhandle\nlock\nplatooning\npull\npull someone up\npush start\nrange anxiety\nreverse\nroad rage\nskid\nspeeding\nthe RAC\nton\nSee more results »\ndrive verb\n(FORCE)\nC1 [ T ] to force someone or something to go somewhere or do something: They used dogs to drive the sheep into a pen. A post had been driven (= hit hard) into the ground near the tree. By the end of the year, most of the occupying troops had been driven from the city. [ + to infinitive ] In the end, it was his violent behaviour that drove her to leave home.\nC1 [ T ] to force someone or something into a particular state, often an unpleasant one: In the course of history, love has driven men and women to strange extremes. Recent events have driven the stock market to lows not seen in ten years. drive someone mad, crazy, etc. B2 informal\nto make someone extremely annoyed: My mother-in-law has been staying with us this past week and she's driving me crazy.\nSee more drive someone wild informal\nto make you very excited, especially sexually: When he runs his fingers through my hair, it drives me wild!\nSee more\nMore examplesFewer examplesExtreme stress had driven him to the brink of a nervous breakdown.His family could not understand how this quiet, well-adjusted man could have been driven to this terrible deed.Self-hatred apparently drove her to mutilate her own face.Her husband's violent and abusive behaviour drove her to the verge of despair.She had her demons and, later in life, they drove her to drink.\nSMART Vocabulary: related words and phrases\nCausing somebody to act\narm-twisting\nbludgeon\nbounce someone into something\nbulldoze\nbully\ncoercion\nforcible\nforcibly\nhold someone to ransom idiom\nimpel\nimpose\nput/tighten the screws on someone idiom\nram something down someone's throat idiom\nram something into someone\nransom\nreduce\nreduce someone to something\nslap\nsqueeze\nwring\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPushing and shoving\ndrive verb\n(PROVIDE POWER)\nC2 [ T ] to provide the power to keep a machine working, or to make something happen: The engine drives the wheels. Water drives the turbines that produce electricity.\n[ T ] If you drive a ball, especially in golf or baseball, you hit it hard so that it travels a long way: Slater drove the ball down the fairway.\nSMART Vocabulary: related words and phrases\nMachines - general words\n3-D printer\nanimatronic\nautomated\nautomation\nbackhoe\nchuck\ncoffee machine\nconvenience\ncrankshaft\nflywheel\nHeath Robinson\nhumanoid\nmill\nshredder\nstump grinder\nsupersensitivity\nsynchrotron\ntabulator\nteleprompter\nwater cooler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHitting and beating\nIdioms\nbe in the driving seat\ndrive your message/point home\ndrive someone to drink\ndrive a coach and horses through something\ndrive a hard bargain\ndrive a wedge between someonePhrasal verbs\ndrive at something\ndrive off\ndrive noun\n(ROAD)\n[ C ] used in the names of some roads, especially roads containing houses: 12 Maple Drive\n[ C ] mainly UK (also driveway) a private area in front of a house or other building onto which you can drive and park your car : I parked in/on the drive.\nMint Images/Mint Images RF/GettyImages\nSMART Vocabulary: related words and phrases\nRoads: urban & residential streets\naccess road\nadopt\nadopted\nalley\narterial\nboulevard\ncrossing guard\ncul-de-sac\ngrove\nhigh street\nlane\nlollipop lady\nparade\nplaza\nRd\nrow\nrunnel\nst\nstreet\nunadopted\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOn the road: parking\ndrive noun\n(PLANNED EFFORT)\n[ C ] a planned effort to achieve something: The latest promotional material is all part of a recruitment drive.UK I'm meant to be on an economy drive at the moment, so I'm trying not to spend too much.\nSMART Vocabulary: related words and phrases\nTrying and making an effort\nA game\nassault\nattempt\nattempted\nbackwards\nbid\ncommitment\ncrack\ngo for it idiom\ngo out of your way idiom\ngo the extra mile idiom\ngo to great lengths idiom\nGod helps those who help themselves idiom\nnose\nseek\nsquare the circle idiom\nstep on the gas idiom\nstick at something\nstick to something\nstick-to-itiveness\nSee more results »\ndrive noun\n(COMPUTING)\nB1 [ C ] a device for storing computer information: a hard drive a DVD drive a CD drive\nSMART Vocabulary: related words and phrases\nComputer hardware\n3-D printer\nassociative memory\nblackberry\nbrick\nbubblejet\nconsole\ndata projector\nelectronic organizer\nflat screen\nhard drive\nmainframe\nmicrochip\nmicroprocessor\nnumber pad\noptical character reader\noptical reader\noptically\npalmtop\npatch\nplug and play\nSee more results »\ndrive noun\n(VEHICLE)\nB1 [ C ] a journey by car: It's a long drive from Auckland to Wellington. Shall we go for a drive this afternoon?\n[ U ] the system used to power a vehicle: a car with left-hand/right-hand drive (= in which the driver sits in the seat on the left/right). a four-wheel drive vehicle\nSMART Vocabulary: related words and phrases\nJourneys\nadventure\nbreak-journey\ncarpool\ncarpooling\ncircumnavigation\ncommuting\nexpedition\nfield trip\ngrand tour\nhaul\njaunt\njourney\njunket\nlayover\nodyssey\nride\nsail\nseafaring\ntrip\nwanderings\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe engine & engine parts\ndrive noun\n(POWER)\nC1 [ U ] energy and determination to achieve things: We are looking for someone with drive and ambition. [ + to infinitive ] He has the drive to succeed. Later on in life the sex drive tends to diminish.\n[ C ] (in sport, especially golf or baseball) a powerful hit that sends a ball a long way\nSMART Vocabulary: related words and phrases\nMotives and reasons\nautotelic\ncauseless\nfirst principles\nfrom a place of idiom\nhidden agenda\nimpulse\ninclination\njustification\nmainspring\nmotivation\nmotive\nname\nobject\npeg\nplace\nreason\nshould\nwherefores\nwhy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFeelings of desire\nGolf\nCricket\ndrive verb\n(USE VEHICLE)\nAdd to word list\nAdd to word list\n[ I/T ] to travel in a motor vehicle, esp. as the person who operates it: [ T ] We drove 40 miles to visit my aunt. [ I ] She drove through Pennsylvania to Ohio. [ I ] She never learned how to drive (= operate a car). [ T ] I’ll drive you to the station (= take you there in my car).\ndrive verb\n(FORCE)\n[ T ] to force someone or something to go somewhere or do something: He drove a nail into the wall. He was driven (= His actions were caused) by greed.\ndrive verb\n(PROVIDE POWER)\n[ T ] to provide the power to make a machine operate: The water pump is driven by a windmill.\nIdioms\ndrive a hard bargain\ndrive someone crazyPhrasal verb\ndrive at something\ndrive noun\n(TRIP)\n[ C ] a trip in a motor vehicle: We have a 200-mile drive ahead of us.\n[ C ] A drive is also a road for cars and is sometimes used as part of a name: Riverside Drive\ndrive noun\n(PLANNED EFFORT)\n[ C ] a planned, usually long-lasting, effort to achieve something: The university sponsored a blood drive (= effort to collect blood) for the Red Cross.\ndrive noun\n(FORCE)\n[ C/U ] strong determination to do or achieve something: [ U ] Intelligence isn’t enough – you’ve got to have the drive to succeed.\nAdd to word list\nAdd to word list\nto cause or influence something: be driven by sth The country needs to shift from export-led growth to growth driven by domestic demand. This company is driven by customers and by the markets in which we do our business.\nto cause something to progress, develop, or grow stronger: The firm said it would drive sales by switching into larger premises while closing smaller stores. The company yesterday reported record iron ore production for the year to June, driven by a construction and manufacturing boom in China.\nto force something to happen or someone to do something: drive sb/sth into/out of/to sth Analysts say these policies will drive the economy into recession. The prospect of a consumer boom helped drive the stock market to new peaks yesterday.\nbe in the driving seat UK (also be in the driver's seat)\nto be in control of a situation: With employers fighting among themselves for staff, IT workers are in the driving seat. He believes there will be consolidation in the airline industry and wants his company to be in the driver's seat of any merger.\ndrive a hard bargain\nto expect a lot in exchange for what you pay or agree to: The unions are driving a hard bargain on pay. Phrasal verbs\ndrive sth down\ndrive sb/sth out (of sth)\ndrive sth up\n[ C ] an effort to achieve something: drive for sth The supermarket continues in its relentless drive for expansion. drive to do sth They are expanding their telephone banking service for small businesses in a key part of their drive to cut costs and boost efficiency. a recruitment/marketing/cost-cutting drive\n[ C ]\n&#160; IT a piece of equipment for reading and storing computer information: a CD-ROM/DVD drive\n[ U ] energy and determination to achieve things: We're looking for someone with drive and ambition to fill this important post.drive to do sth She has the drive to succeed. See also\ndisk drive\neconomy drive\nflash drive\nhard drive\nsales drive\ntape drive\ntest drive"}