{"id":133631,"name":"drop","type":"verb","us_sound":"drɑːp","us_link":"../audio/d/drop.mp3","uk_sound":"drɒp","uk_link":"../audio/d/ukdrive016.mp3","content":"drop verb\n(FALL)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to fall or to allow something to fall: She dropped her keys. I'm always dropping things. Amanda dropped her sunglasses in/into the fountain. The book dropped from/off the shelf. Don't drop it!/Don't let it drop!\nThesaurus: synonyms, antonyms, and examples\nto go down onto the ground suddenlyfallShe slipped and fell.dropSeveral apples dropped from the tree.collapseSeveral buildings collapsed in the earthquake.crumpleHe fainted and crumpled into a heap on the floor.tumbleA huge rock tumbled down the mountain.plungeFour of the mountaineers plunged to their deaths when their ropes broke.\nSee more results »\ndrop dead\nC2 to die suddenly and unexpectedly: He dropped dead on the squash court at the age of 43.\nSee more drop someone a line informal\nto write someone a letter, especially a short informal one: Just drop me a line when you decide on a date.\nSee more drop (someone) a hint informal\nto tell someone something in a way that is not direct: She dropped a hint that she'd like to come to the party.\nSee more drop your aitches/h's UK\nto not pronounce the letter h at the beginning of words in which it should be pronounced: He drops his aitches and it really annoys my parents.\nSee more\nMore examplesFewer examplesA man rushed past and jogged her elbow, making her drop the bag.She dropped her cup and it smashed to pieces on the stone floor.Helicopters dropped leaflets over the city.She accidentally dropped her ring down a drain in the road.Witnesses say that there was an explosion and then the plane dropped like a stone to earth.\nSMART Vocabulary: related words and phrases\nFalling and dropping\nass\ncollapse/fall in a heap idiom\ncropper\ncrumple\ndrop like flies idiom\ndrop off\nfaceplant\nfall away\nfly\nlet go idiom\nmic drop\nnosedive\noverbalance\nparachutist\nplunge\npratfall\nshower\nthump\ntrip\nwayside\nSee more results »\ndrop verb\n(LOWER)\nB2 [ I or T ] to move to a lower level, or cause something to move to a lower level: The water level in the flooded region has finally begun to drop. The land drops (away) (= slopes down) sharply behind the barrier. We had to drop our prices because of the recession.\nThesaurus: synonyms, antonyms, and examples\nto become smaller or lessdecreaseThe tests show that the tumour has decreased in size since we started treatment. lessenA healthy diet lessens your risk for cardiovascular disease.lowerThey've just lowered the age at which you can join.reduceThey've just reduced the price.bring downThey are bringing down their prices.dropStock prices dropped today after the company's announcement.\nSee more results »\nMore examplesFewer examplesTemperatures can drop well below freezing in midwinter.Let's cut our losses and sell the business before prices drop even further.The hurricane was downgraded to a tropical storm when its speed dropped to 70mph.He thinks we should sell the business before prices drop even further.Fish struggle for survival when the water level drops in the lake.\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nabridgment\nattenuate\nattenuated\nattenuating\nattenuation\nboil\ncontraction\ndamp\nfall off\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nrightsizing\nroll back something\nrollback\nrun someone/something down\nrundown\ntelescope\ntumble\nSee more results »\ndrop verb\n(STOP)\nB2 [ T ] to stop doing or planning something, especially an activity: I'm going to drop yoga and do aerobics instead. Can you drop what you're doing and help me with this report?\n[ T ] to stop including someone in a group or team: He's been dropped from the team because of injury.\nMore examplesFewer examplesThe police have had to drop charges against her because they couldn't find any evidence.She walked free after the charges against her were dropped.He was dropped from the team after failing to turn up for a drugs test.You can't just show up at my work and expect me to drop everything.The band was dropped by their record label because of creative differences.\nSMART Vocabulary: related words and phrases\nStop having or doing something\nabdicate\nabdication\nbail out\nbandh\nbomb\nbomb out\nbreak with something\nforfeit\nforfeitable\nforgo\nforsake\nforswear\ngive up the ghost idiom\nlay\nrelinquishment\nself-denying\nself-denyingly\nself-sacrifice\nself-sacrificing\nthrow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRemoving and getting rid of things\ndrop verb\n(TAKE)\nC1 [ T + adv/prep ] to take someone to a particular place, usually in a car, and leave them there: They dropped me off at the main entrance. I dropped him at the library and went shopping.\nSMART Vocabulary: related words and phrases\nTransferring and transporting objects\nbear\nbearer\nbike\nborne\nbring\nbudge\ncall for someone\ncarry\nchauffeur\nconvey\nhump\nimport\npayload\npickup\nportable\nportage\npost-delivery\nput something/someone down\ntransplant\ntruck\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTaking someone somewhere or telling them the way\ndrop verb\n(BE/MAKE AVAILABLE)\n[ I or T ] informal to become available for people to buy, listen to, or watch, especially using the internet; to make something available like this: It's an exciting time for her, with the tour starting and the record about to drop. We heard that rapper Dave was about to drop a new album.\nMore examplesFewer examplesGwen's got a solo album dropping soon.A new video is about to drop - stay tuned.Keep an eye out for the new skateboards dropping soon. The 28-year-old dropped his debut album this winter. He regularly sells more than 100,000 copies every time he drops a new CD via the independent label he co-owns.During a recently taped performance for MTV's \"Unplugged\" series, she dropped a two-hour set of all-new material.\nSMART Vocabulary: related words and phrases\nAvailable and accessible\naccessibility\naccessible\naccessibly\nat your command idiom\navailability\nnon-restricted\nnothing\nobtainable\noffer\non call idiom\non demand idiom\non/about your person idiom\nrelease\nseason\nstream\nunfreeze\nunfrozen\nunlock\nunobtainable\nup for grabs idiom\nSee more results »\nIdioms\nbe fit/ready to drop\ndrop someone/something like a hot potato\ndrop a brick/clanger\ndrop dead!\ndrop everything\ndrop it/the subject\ndrop the ballPhrasal verbs\ndrop back\ndrop behind\ndrop by/in\ndrop off\ndrop someone/something off\ndrop out\ndrop noun\n(SMALL AMOUNT)\nB1 [ C ] a small round-shaped amount of liquid: I thought I felt a drop of rain. There were little drops of paint on the kitchen floor.\n[ S ] a small amount of liquid you can drink: I'll have a drop more juice, please. \"Would you like some milk?\" \"Just a drop, please.\" drops [ plural ]\nliquid medicine given in very small amounts: eye/nose/ear drops\nSee more\n[ C ] mainly UK a small piece of sweet food made of sugar: fruit/pear drops chocolate drops\nMore examplesFewer examplesI noticed drops of water plopping onto the carpet.We placed saucepans on the floor to catch the drops of water coming through the roof.The drop of red dye diffused slowly in the water.Could I have a drop more water, please?Would you like a drop more vino?\nSMART Vocabulary: related words and phrases\nWords meaning small pieces and amounts\nby a nose idiom\nclipping\ncrumb\ndab\ndash\ndollop\ngrain\nhint\nort\nparing\npeewee\npinch\npotsherd\nskinny\nspark\nswatch\ntad\nthimbleful\ntidbit\ntiddler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDrinks - general words\nSweets\ndrop noun\n(LOWER)\nC1 [ C usually singular ] the distance from one thing to something lower: There's a drop of two metres from the window to the ground.\nB2 [ C usually singular ] a reduction in the amount or level of something: The recent drop in magazine subscriptions is causing some concern.\nThesaurus: synonyms, antonyms, and examples\nthe fact of getting smaller or becoming lessdecreaseThere has been a steady decrease in the number of visitors.fallA fall in the price of petrol is unlikely.fall-offThere's been a sharp fall-off in demand for the product since the company's scandal broke.falling-offThere has been a slight falling-off in public sector employment growth.riseThere has been a sharp rise in home sales this month.\nSee more results »\nMore examplesFewer examplesThey forecast a large drop in unemployment over the next two years.In an emergency you could get out through a window, but it would be a nasty drop.He took a drop in salary when he changed jobs.Tour operators have reported a drop in bookings.She looked over the cliff and found she was standing at the edge of a vertical drop.\nSMART Vocabulary: related words and phrases\nMeasurements in general\naltitude\nbathymetric\nbathymetrically\nbathymetry\nbe running at something idiom\ncalibrate\ndistance\nelevation\nfactor\nknee-length\nmetric\nmetrication\nmicro\nmilli-\nscale\nsetting\ntera-\nuncalibrated\nunmeasurable\nunsized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeometry: describing angles, lines & orientations\ndrop noun\n(FALL)\n[ C ] the act of delivering things such as supplies, medicine, etc., often by dropping them from an aircraft: a food drop The helicopter made a drop of much-needed supplies to the stranded hikers.\n[ C ] the situation in which something is left in a place and later collected by someone else, usually a spy\nSMART Vocabulary: related words and phrases\nDelivering and despatching\nair bridge\nair corridor\nair-dash\nbox scheme\nconsign\ncourier\ndispatch\ndrop off\nmisaddress\nmisdirect\nmisdirection\nmisroute\nnon-delivery\nsend something out\nship\nshipment\nshipper\nshoot\nshoot something off\ntruck\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEmergency services in general\nTransferring and transporting objects\nInternational relations: spying and espionage\nIdioms\na drop in the ocean\na drop too much (to drink)\nat the drop of a hat\ndrop verb\n(FALL)\nAdd to word list\nAdd to word list\n[ I/T ] to fall intentionally or unintentionally, or to let something fall: [ T ] She dropped her keys on a table beside the door. [ I ] The book dropped to the floor. [ I ] fig. I was so exhausted that I was ready to drop (= to fall down).\ndrop verb\n(LOWER)\n[ I/T ] to move or change to a lower level, or to make something lower or less: [ I ] The temperature dropped nearly 50 degrees in 24 hours. [ T ] We are going to have to drop our prices.\ndrop verb\n(STOP)\n[ T ] to stop something you were doing or planning to do: After winning a pay raise, the union dropped its other demands. He was dropped from (= taken off) the team because of his grades.\nIdioms\ndrop a hint\ndrop dead\ndrop everything\ndrop the ballPhrasal verbs\ndrop by (somewhere)\ndrop in\ndrop off\ndrop off something/someone\ndrop out\ndrop noun\n(SMALL AMOUNT)\n[ C ] a very small amount of a liquid: I just felt a drop of rain.\ndrop noun\n(FALL)\n[ C ] the act of falling: the airplane's sudden drop\ndrop noun\n(REDUCTION)\n[ U ] a reduction in the amount or level of something: a drop in prices\n[ U ] A drop is also the distance from one thing to something lower: It’s a drop of over 150 feet from the top of the Niagara Falls.\nIdioms\na drop in the bucket\nat the drop of a hat\nAdd to word list\nAdd to word list\n[ I or T ] to become lower in level, value, price, etc.: In November, prices continued to drop while property sale times lengthened. drop dramatically/sharply/significantlydrop 10%/10 points/10p, etc. Like-for-like sales dropped 8%.drop by sth The cost of the technology is still high but has dropped by half in the last 6 months.drop to sth The total volume of the country's crude exports dropped to 10.3 million barrels.drop below sth Unemployment may drop below the symbolic 1 million mark before long.\n[ T ] to reduce something such as a price: Many companies will drop prices in order to get your business.drop sth by £10/10%, etc. The supermarket is dropping the price of its milk by 1p per pint.drop sth to sth After the house had been on the market for six months, the asking price was dropped to £750,000.\n[ T ] to stop doing or planning something: drop a case/lawsuit/charge drop a plan/idea\n[ T ] to stop using, making, or providing something: A spokesperson for the airline said that it will drop its flights from Denver to Detroit. The manufacturer recently dropped its distributors in order to sell direct.\n[ T ] informal to lose a sum of money in a business or game: One medium-sized investment bank is known to have dropped $10 million on a single over-the-counter derivative trade.\n[ T ]\n&#160; IT to put text, a file, a picture, etc. in a particular place on a computer screen using your mouse: Just drag and drop the images into your presentation.\ndrop the ball informal\nto make a mistake, especially by doing something in a careless or stupid way: The staffer responsible for finding the right location had dropped the ball. Phrasal verbs\ndrop back\ndrop off\ndrop out\na reduction in the level, value, price, etc. of something: a drop in sth Major supermarket chains experienced a drop in sales.a dramatic/major/sharp drop He warned that stocks could take a sharp drop today. a 10%/10 point/10p, etc. drop"}