{"id":133790,"name":"drug","type":"noun","us_sound":"drʌɡ","us_link":"../audio/d/drug.mp3","uk_sound":"drʌɡ","uk_link":"../audio/d/ukdrubb004.mp3","content":"drug noun [C]\n(MEDICINE)\nAdd to word list\nAdd to word list\nB2 any natural or artificially made chemical that is used as a medicine: anti-cancer/fertility/pain-killing drugs a prescription drug drug therapy He takes several drugs for his condition.\nMore examplesFewer examplesThe new drug could be an important step in the fight against cancer.There are doubts about the effectiveness of the new drug in treating the disease.For patients who do not respond to drug treatment, surgery is a possible option.The doctors gave him more powerful drugs in the vain hope that he might recover.I can give you stronger pain-killing drugs if these aren't strong enough.\nSMART Vocabulary: related words and phrases\nMedicine in different forms\nblister pack\nbolus\nbooster\nCaplet\nchemotherapy\ndosage\nelixir\nenema\ninjectable\ninjection\njab\njag\nknockout drops\nmedication\nmixture\npatent medicine\npharmaceutical\nphial\nprescription\nwonder drug\nSee more results »\ndrug noun [C]\n(ILLEGAL SUBSTANCE)\nB2 any natural or artificially made chemical that is taken for pleasure, to improve someone's performance of an activity, or because a person cannot stop using it: illegal drugs a drug addict drug addiction/abuse She began to suspect that her son was on/taking/doing drugs. She was suspected of being a drug dealer. His son died of a drug overdose.\nany activity that you cannot stop doing: Work is a drug for him.\nMore examplesFewer examplesThe government are to step up their attempt to wage war on drugs.\"I'm arresting you on suspicion of illegally possessing drugs, \" said the police officer.The athlete was given a stiff punishment for using drugs.Police found a small quantity of drugs in his possession.Desperate measures are needed to deal with the growing drug problem.\nSMART Vocabulary: related words and phrases\nDrugs - general words\nabstinence\nabstinence-only\nbindle\nbiosimilar\nchase\nmultidrug\nnon-intoxicant\nnon-intoxicating\nnondrug\npeddler\nperformance-enhancing\npill-popping\nsolvent abuse\nspike\nspliff\nsubstance\nsubstance abuse\nwasted\nwhacked\nwiped out\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPassionate or passing interests\nAddiction\nto give a person or animal a chemical that causes him, her, or it to lose feeling or become unconscious: The killer confessed that he often drugged his victims before he killed them. She was heavily drugged to ease the pain.UK informal We visited her in hospital but she was drugged to the eyeballs (= had been given a lot of drugs) and I don't think she even knew we were there.\nSMART Vocabulary: related words and phrases\nDrugs - general words\nabstinence\nabstinence-only\nbindle\nbiosimilar\nchase\nmultidrug\nnon-intoxicant\nnon-intoxicating\nnondrug\npeddler\nperformance-enhancing\npill-popping\nsolvent abuse\nspike\nspliff\nsubstance\nsubstance abuse\nwasted\nwhacked\nwiped out\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedicines & drugs: administering drugs & medicines\ndrug noun\n(MEDICINE)\nAdd to word list\nAdd to word list\n[ C ] any chemical that is used as a medicine: over-the-counter/prescription drugs\ndrug noun\n(ILLEGAL SUBSTANCE)\n[ C/U ] a chemical or other substance that is illegally used, sometimes to improve performance in an activity or because a person cannot stop using it\ndrug verb [T]\n(GIVE MEDICINE)\nto give a person or animal a chemical that causes a loss of feeling or the condition of being unconscious: He couldn’t talk to us because he had been drugged.\nAdd to word list\nAdd to word list\na natural or artificially made substance that is used as a medicine: an anti-cancer drug The state is grappling for ways to curb rising drug costs in its $1 billion Medicaid drug budget.\na natural or artificially made substance, especially one that is illegal, which is taken for pleasure, to improve performance in an activity, or because someone is addicted (= cannot stop taking it): a banned/illegal drugtake/abuse drugs He admitted abusing drugs and alcohol his entire adult life before ending up in jail. See also\nprescription drug"}