{"id":133841,"name":"drumhead","type":"noun","us_sound":"ˈdrʌm.hed","us_link":"../audio/d/cdo0623usdrum1119.mp3","uk_sound":"ˈdrʌm.hed","uk_link":"../audio/d/cdo0623ukdrum1111.mp3","content":"drumhead noun\n(ON DRUM)\nAdd to word list\nAdd to word list\n[ C ]\n&#160; music\n&#160; specialized the piece of thin material that is stretched across a drum and hit to make a sound: The bongos are traditionally played by striking the drumheads with the fingers and palms. He had the band's name printed across his bass drumhead.\nMore examplesFewer examplesShe brought some goat-hide drumheads back from Haiti.The cloth was stretched as tight as a drumhead.\nSMART Vocabulary: related words and phrases\nMusical instruments\naccordion\nacoustically\naerophone\nalphorn\nalto\ndrum kit\ndrum machine\ndrumbeat\ndrumroll\ndrumstick\npedal steel\npenny whistle\npercussion\npercussionist\npercussive\ntuning peg\nukulele\nunpitched\nunplugged\nuntuned\nSee more results »\ndrumhead noun\n(VEGETABLE)\n[ C or U ] (also drumhead cabbage) a type of bright green or dark red cabbage (= a large, round vegetable) that has a round, solid shape with many leaves growing very close together: Red drumhead is a very reliable red cabbage that can be grown as a summer or autumn/winter cabbage. They grow big Dutch drumheads. Drumhead cabbage heads are rounded in shape and composed of tightly packed, bright green leaves with a refreshing, peppery flavour.\nMore examplesFewer examplesHe grows purple carrots, drumhead and Savoy cabbages, and purple-sprouting broccoli.\nSMART Vocabulary: related words and phrases\nTypes of vegetable\nalfalfa\nallium\nAnaheim\nartichoke\narugula\ncress\ncrisphead\ncrookneck\ncruciferous\ncucumber\nmooli\nnapa cabbage\nneep\nnew potatoes\nnopalito\nserrano\nshallot\nshiitake mushroom\nshishito\nshiso\nSee more results »\nhistory\n&#160; specialized used for referring to a trial, especially a military trial, that is carried out quickly and often not fairly or correctly: He was handed over to the British and shot after a drumhead court martial that lasted less than two hours. Internment, torture, and drumhead tribunals were all given specious justifications.\nMore examplesFewer examplesMany militia officers were murdered, and many militiamen were executed by drumhead court martial.An officers' drumhead court condemned him to death.It seemed very unfair to have proved my innocence, and now to face a kind of drumhead court martial as though I were guilty.\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\ndiminished responsibility\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\nflight risk\npower of attorney\nprecedent\npretrial\nprobate\nprovide\nthe Webster ruling\nwitness to something\nwobbler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMilitary training & ceremonies\nUnfairness and favouring someone unfairly"}