{"id":133299,"name":"dry","type":"adjective","us_sound":"draɪ","us_link":"../audio/d/dry.mp3","uk_sound":"draɪ","uk_link":"../audio/d/ukdrubb019.mp3","content":"dry adjective\n(NOT WET)\nAdd to word list\nAdd to word list\nA2 used to describe something that has no water or other liquid in, on, or around it: I hung his wet trousers on the radiator, but they're not dry yet. These plants grow well in dry soil/a dry climate. This cake's a bit dry - I think I left it in the oven for too long.\nThesaurus: synonyms, antonyms, and examples\nhaving the liquid removeddryIs the washing dry yet, or should we leave it in the tumble dryer a bit longer?bone-dryThe dog's water dish was bone dry.as dry as a boneThe houseplant's soil was dry as a bone.driedI love snacking on dried apples and apricots. desiccatedAdd 100g of desiccated unsweetened coconut to the mixture.\nSee more results »\nused to describe weather or periods of time when no rain falls: If it's dry tomorrow I'll cut the grass. It should be a nice, sunny, dry day.\nThesaurus: synonyms, antonyms, and examples\nnot getting much or any raindryI love living in a dry climate.bone-dryBone-dry conditions have increased wildfire risks in the region dramatically.aridThese lizards thrive in an arid climate.semi-aridIn these semi-arid states, water is scarce and water rights for irrigation are quite expensive.subaridThe subarid, high-altitude grasslands cannot support too many grazing animals.\nSee more results »\nrun dry\nIf a river or other area of water runs dry, the water gradually disappears from it: By this time all the wells had run dry.\nSee more\nC1 Dry hair or skin does not have enough of the natural oils that make it soft and smooth: a shampoo for dry hair\nUK Dry bread is plain, without butter, jam, etc.: All I was offered was a piece of dry bread and an apple!\nMore examplesFewer examplesCracks had appeared in the dry ground.The weather forecast said it would be fine and dry today.You mix all the dry ingredients together before you add the milk.We collected dry twigs to start the fire.This moisturizing cream is excellent for dry, flaky skin.\nSMART Vocabulary: related words and phrases\nDry weather, arid conditions & dryness\naridity\nas dry as a bone idiom\nbone\nbone dry idiom\ndehydrate\ndesertification\ndesiccate\ndesiccation\ndried\ndrought\ndry something up\ndryness\nfrazzled\nfrizzled\nhigh and dry\nhyper-arid\noverdry\nparch\nparched\nsun-baked\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDescribing good weather\nSkin complaints & blemishes\nHair care\nVarious qualities of food\ndry adjective\n(BORING)\nC2 disapproving If a book, talk, subject, etc. is dry, it is not interesting. Synonyms\nboring\ndrab disapproving\ndreary disapproving\ndull\nho-hum\nmonotonous\ntedious\nuninteresting\nwearisome formal\nThesaurus: synonyms, antonyms, and examples\nnot interesting or excitingboringThat was such a boring film I nearly fell asleep during it.excruciatingShe went over the plot of the book in excruciating detail.deadlyHis latest film was just deadly. I left after the first hour!mind-numbingThe incident was described in a mind-numbing, 400-page report so dense that no one read it.\nSee more results »\nSMART Vocabulary: related words and phrases\nTedious and uninspiring\nanonymous\nbanal\nbanally\nbasic\nbe (as) dull as ditchwater idiom\nmarginal\nmarmoreal\nmeh\nmenial\nmenially\nspinach\nstaid\nstaidly\nstale\nstaleness\nwatch paint dry idiom\nwatch the clock idiom\nwearisome\nwearisomely\nwell worn\nSee more results »\ndry adjective\n(NO ALCOHOL)\nwithout alcoholic drinks: a dry wedding a dry bar a dry state (= a place that does not allow alcohol)\nSMART Vocabulary: related words and phrases\nDrunkenness & sobriety\nalky\nbattered\nbeer goggles\nbinge drinker\nbinge drinking\nblasted\ndipsomania\nhave a few (too many) idiom\ninebriate\ninebriated\ninebriating\ninebriation\nmuzzy\nripped\nroaring drunk idiom\nshit-faced\nslaughtered\nslewed\nsmashed\nwhacked\nSee more results »\ndry adjective\n(NOT SWEET)\nC1 If wine or other alcoholic drinks are dry, they do not taste sweet: dry cider/martini/sherry/wine On the whole, I like dry wine better than sweet.\nSMART Vocabulary: related words and phrases\nWines & winemaking\n-bodied\nageworthy\namontillado\nblender\nblush\nclaret\nfruitiness\nfull-bodied\ngrape\njeroboam\nLambrusco\nplummy\nspritzig\nspumante\nsuper-smooth\ntable wine\nterroir\nwinery\nwiney\nzinfandel\nSee more results »\ndry adjective\n(HUMOUR)\napproving Dry humour is very funny in a way that is clever and not obvious: a dry sense of humour a dry wit\nSMART Vocabulary: related words and phrases\nHumour & humorous\namusingly\nbitingly\nblackly\nbone dry idiom\nbring\ndrily\ngag\ngeddit?\nGSOH\njocose\nlightly\nmordancy\nnon-serious\npawky\nphotobomb\nphotobombing\nrib\nstanding joke\nwag\nwisecrack\nSee more results »\nRelated word\ndrynessIdioms\nas dry as a bone\nnot a dry eye in the house\nthe dry UK\na place where the conditions are not wet, especially when compared to somewhere where the conditions are wet: You're soaked - come into the dry.\nSMART Vocabulary: related words and phrases\nSafe & enclosed spaces\nawning\nbolthole\nbooth\nbunker\nbus shelter\ncarrel\nchildproof\nchildproofing\ncocoon\nhaven\nhideaway\nhideout\nhidey-hole\nhiding place\nrefuge\nretreat\nsafe haven\nsafe house\nsanctuary\nsanctuary city\nSee more results »\nA2 to become dry, or to make something become dry: Will this paint dry by tomorrow? Hang the clothes up to dry. The fruit is dried in the sun.\nThesaurus: synonyms, antonyms, and examples\nto lose moisture and become drydryIt will take three hours for the paint to dry.dehydrateToo much coffee will dehydrate you.desiccatePlant pests will desiccate in dry air.dry (something) outIf you don't put the cake back in the cake tin, it will dry out.dry upThe lake dried up during the drought.parchThey will turn off the irrigation and parch the crops right before harvest.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto remove liquid from somethingdryCan you dry the dishes for me?dry something upCan you dry up the plates for me?dry (someone/something) offLet me dry the chairs off before you sit down. blotI blotted the spilled wine with a cloth.towelShe stepped out of the pool and towelled her hair.\nSee more results »\ndry the dishes (UK also dry up (the dishes)); (UK do the drying (up))\nto dry plates, knives, forks, etc. after they have been washed: Could you dry the dishes, Sam?\nSee more\nMore examplesFewer examplesYou're sopping wet - go and dry yourself and get changed.The school provides paper towels for the children to dry their hands on.If she leaves her hair to dry on its own, it just waves naturally.We'll have to wait another couple of hours for the paint to dry.He was humming a tune as he dried the dishes.\nSMART Vocabulary: related words and phrases\nDry weather, arid conditions & dryness\naridity\nas dry as a bone idiom\nbone\nbone dry idiom\ndehydrate\ndesertification\ndesiccate\ndesiccation\ndried\ndrought\ndry something up\ndryness\nfrazzled\nfrizzled\nhigh and dry\nhyper-arid\noverdry\nparch\nparched\nsun-baked\nSee more results »\nIdiom\ndry your eyesPhrasal verbs\ndry (someone/something) off\ndry (something) out\ndry out\ndry something up\ndry up\ndry adjective\n(NOT WET)\nAdd to word list\nAdd to word list\n[ -er/-est only ] without water or liquid in, on, or around something: Are the clothes dry yet?\n[ -er/-est only ] If hair or skin is dry, it lacks natural oils: Do you have a shampoo for dry hair?\n[ -er/-est only ] If the weather is dry, there is very little water in the air and no chance of rain.\ndry adjective\n(NO ALCOHOL)\n[ not gradable ] (of a place) not permitting alcoholic drinks to be sold\ndry adjective\n(NOT INTERESTING)\n[ -er/-est only ] not interesting or exciting: The book is packed with information but it is a little dry.\ndry adjective\n(AMUSING)\n[ -er/-est only ] amusing in a way that is not obvious: a dry wit\ndry verb [I/T]\n(REMOVE WATER)\nto become dry, or to remove water from something : [ I ] I can’t go out until my hair dries. [ T ] The woman dried her hands on a towel and returned to the table. [ I ] If you don’t keep food covered, it dries out."}