{"id":133409,"name":"dryness","type":"noun","us_sound":"ˈdraɪ.nəs","us_link":"../audio/d/eus71399.mp3","uk_sound":"ˈdraɪ.nəs","uk_link":"../audio/d/ukdrubb022.mp3","content":"dryness noun [U]\n(NOT BEING WET)\nAdd to word list\nAdd to word list\nthe state of having little water or other liquid : The amount you sweat can be affected by the dryness of the atmosphere. The meat was juicy with no hint of dryness.\nthe fact or result of not having much rain: Southern Florida experienced unusual April dryness this year. Healthy plants can better withstand stress from pests, heat and dryness.\n(of a part of the body) the state of not having enough of the natural oils or liquid that make it soft, smooth, and healthy: Regular application of the lotion will help prevent dryness of the skin.\nMore examplesFewer examplesAir conditioning helps reduce excessive humidity. As for dryness, room humidifiers can help.The pellets were still largely intact. This apparently arose because of the dryness of the site. Even cactuses are thirsty and fish can't spawn as severe dryness hits the US.The symptoms of dry eye include dryness, blurred vision, itching, sensitivity to light and irritation.These products also relieve other symptoms of vaginal dryness, like itching and irritation.\nSMART Vocabulary: related words and phrases\nDry weather, arid conditions & dryness\naridity\nbone\nbone dry idiom\ndehydrate\ndesertification\ndesiccate\ndried\ndrought\ndry (something) out\ndry something up\ndust devil\nfrazzled\nhigh and dry\nhyper-arid\noverdry\nparch\nparched\nsandstorm\nsemi-dry\nsun-baked\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSkin complaints & blemishes\nHair care\ndryness noun [U]\n(BEING BORING)\nthe fact of not being interesting : I myself enjoy the dryness of statistics. The dryness of the speech had caused Joseph's attention to wander.\nMore examplesFewer examplesLawyers tend to be overly technical, dry, and dull, and I hope that I can avoid over-technicality, dryness, and dullness.Artists often express antipathy towards the supposed dryness of the scientific world view.\nSMART Vocabulary: related words and phrases\nTedious and uninspiring\nanonymous\nbanal\nbanally\nbasic\nbe (as) dull as ditchwater idiom\nmarmoreal\nmeh\nmenial\nmenially\nmiddle-aged\nstaid\nstaidly\nstale\nstaleness\nstodgily\nwatch the clock idiom\nwearisome\nwearisomely\nwell worn\nworthy\nSee more results »\ndryness noun [U]\n(HUMOUR)\nthe fact of humour being funny in a way that is clever and not obvious: He is a politician who is noted for the dryness of his wit. Once I understood the dryness of her humour, we had many laughs together.\nMore examplesFewer examples I always enjoy the sheer cleverness of his observations and the dryness of his wit.It's intelligent work from the star, who plays everything with his customary dryness.His incredible sarcasm is matched only by the extreme dryness of his humour.\nSMART Vocabulary: related words and phrases\nHumour & humorous\namusingly\nbitingly\nblackly\nbone dry idiom\nbring\ndrily\ngag\ngeddit?\nGSOH\nlightly\nnon-serious\npawky\nphotobomb\nphotobombing\nplayfully\nridiculous\nsatirize\nstanding joke\nwag\nwisecrack\nSee more results »\ndryness noun [U]\n(NOT BEING SWEET)\nthe fact of wine or other alcoholic drinks not tasting sweet: The wine has just enough dryness to balance its fruitiness. This chart shows the scale of sweetness (or dryness) of red and white wines. See\ndry\nMore examplesFewer examplesThe dryness was still there, but the beer's other characteristics also shone through.The taste/style or level of dryness of a wine depends on the cellar master and is determined in the cellar by the winemaker.\nSMART Vocabulary: related words and phrases\nWines & winemaking\n-bodied\nageworthy\namontillado\nblender\nblush\nclaret\nfull-bodied\ngrape\njeroboam\nLambrusco\nlay something down\nplonk\nplummy\nspumante\nsuper-smooth\ntable wine\nterroir\nultra-dry\nwiney\nzinfandel\nSee more results »\nAdd to word list\nAdd to word list\nthe quality of having very little or no water or natural oils: the meat's dryness"}