{"id":133935,"name":"dual","type":"adjective","us_sound":"ˈduː.əl","us_link":"../audio/d/dual.mp3","uk_sound":"ˈdʒuː.əl","uk_link":"../audio/d/ukdrubb026.mp3","content":"Add to word list\nAdd to word list\nC1 with two parts, or combining two things: This room has a dual purpose, serving as both a study and a dining room. the dual role of chairman and chief executive dual controls\ntwo sets of controls in a vehicle, one for the person who is learning to operate the vehicle and one for the teacher: The aircraft was equipped with dual controls.\nSee more dual nationality/citizenship\nthe nationality or citizenship of two countries at the same time: She has dual British and American nationality.\nSee more\nMore examplesFewer examplesEverything he says has a dual meaning.Although she had the dual advantages of wealth and beauty, she did not have a happy life.These painkillers have the dual strength of ibuprofen and codeine, for fast and effective relief.A product with dual action - that kills bacteria and removes stains - is really the best.The community hall was designed for dual use, by the school during school hours and by the public at other times.\nSMART Vocabulary: related words and phrases\nNumbers: single, double & multiple\nalone\nbilateral\nbilaterally\nbipartite\nbipolar\ndeca-\ndeka-\ndouble-action\nhimself\nmultiple\nplural\nquintuple\nsolitarily\nsolitary\ntri-\ntrilateral\ntrilaterally\ntriply\nunilateral\nunit\nSee more results »\nAdd to word list\nAdd to word list\nhaving two parts, or combining two things: This room serves a dual purpose – it’s both a study and a guest room.\nSomeone with dual citizenship is a citizen of two countries at the same time.\nAdd to word list\nAdd to word list\nhaving two parts, features, etc.: In June, he bowed to shareholder pressure and split his dual role as chief executive and chairman. With more families requiring dual incomes, people have less time to shop and run errands. All cars manufactured after 1998 are required to have dual airbags."}