{"id":134029,"name":"duck","type":"noun","us_sound":"dʌk","us_link":"../audio/d/duck.mp3","uk_sound":"dʌk","uk_link":"../audio/d/ukdubio005.mp3","content":"duck noun\n(BIRD)\nAdd to word list\nAdd to word list\nA2 [ C ] a bird that lives by water and has webbed feet (= feet with skin between the toes), a short neck, and a large beak: The ducks started quacking loudly when we threw them some bread. a duck pond\njuliedeshaies/iStock/Getty Images Plus/GettyImages\n[ U ] the meat of this bird: We had roast duck.\nMore examplesFewer examplesSome poultry farmers keep turkeys and ducks as well as chickens.The cat sat in the tree ready to pounce on the ducks below.The horn sounded like a duck quacking.\nSMART Vocabulary: related words and phrases\nDucks, geese & game birds\ncapercaillie\ndrake\nduckling\nducky\ngame\ngander\ngeese\ngoosey\ngosling\ngrouse\nguinea fowl\nguinea hen\nmallard\npartridge\npheasant\nquail\nturkey\nwildfowl\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nKinds of meat\nduck noun\n(PERSON)\n[ C ] UK old-fashioned informal (also ducks) a friendly way of talking to someone you like: [ as form of address ] Come and sit beside me, duck.\nduck noun\n(IN CRICKET)\n[ C ] informal a score of 0: for a duck I was out for a duck. He's had a bad run of form, with three ducks in five innings.\nSMART Vocabulary: related words and phrases\nCricket\n12th man\nbails phrase\nball-tampering\nbatsman\nbatswoman\nbatting average\nbowl someone out\nbowling\nbreak\ncut\ndeclare\ndeep\nglance\nlength\nmaiden\nsix\ntest match\nuppishly\nwalk\nwicketkeeper\nSee more results »\nIdioms\nget/have your ducks in a row\ntake to something like a duck to water\n[ I or T ] to move your head or the top part of your body quickly down, especially to avoid being hit: duck (down) I saw the ball hurtling towards me and ducked (down). Duck your head or you'll bang it on the doorframe.\n[ T ] to push someone underwater for a short time: The boys were splashing around and ducking each other in the pool.\n[ I + adv/prep ] to move quickly to a place, especially in order not to be seen: duck into When he saw them coming, he ducked into a doorway.\n[ T ] informal to avoid answering a question or dealing with a situation: He has ducked questions about whether he intends to continue in office. She became known as an executive who didn't duck hard decisions. The press accused the prime minister of ducking the issue. They have a legal duty not to duck their responsibilities.\nSMART Vocabulary: related words and phrases\nMoving in order to avoid contact\navoid\navoid something like the plague idiom\navoidance\nbypass\ncircumnavigate\nclear\ndodge\nduck and weave idiom\nevasive\nevasively\nevasiveness\nfall\nfall back\njump\nmoving target\nsidestep\nskirt\nsteer clear of someone/something idiom\nweave\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAvoiding action\nSly & devious\nSee also\nduck and weave mainly UKIdioms\nduck and cover\nduck and dive\nduck and dodge (something)Phrasal verb\nduck out of something\nduck noun [C/U]\n(BIRD)\nAdd to word list\nAdd to word list\na bird that lives by water and has short legs with webbed feet (= feet with toes joined by skin), or the meat of this bird\nduck verb [I/T]\n(MOVE)\nto move your head or the top part of your body quickly down, esp. to avoid being hit: [ T ] Duck your head or you’ll bang it on the door frame. [ I ] She ducked below the surface of the rippling water.\nTo duck is also to move quickly to a place, esp. in order not to be seen: [ I ] When he saw them coming, he ducked into a store.\nTo duck a subject or question is to avoid it: [ T ] He accused the president of ducking the issue of campaign finance reform."}