{"id":134101,"name":"dud","type":"noun","us_sound":"dʌd","us_link":"../audio/d/dud.mp3","uk_sound":"dʌd","uk_link":"../audio/d/ukdubio015.mp3","content":"Add to word list\nAdd to word list\nsomething that has no value or that does not work: Are there any more batteries? This one's a dud. He's made eleven movies in the last 20 years and not one has been a dud.\nThesaurus: synonyms, antonyms, and examples\nsomeone or something that is not successfulfailureThe shuttle launch was a complete failure.successThe operation was a success.turkeyI really wanted to like it, but that show ended up being a real turkey.clunkerUS That pitch was a real clunker. bombUS His website was one of the biggest dotcom bombs in the history of the internet.dudMy charger doesn't work - I think I've got a dud.\nSee more results »\nSMART Vocabulary: related words and phrases\nFailures\nanother/the final nail in the coffin idiom\nbloodbath\nbrain freeze\nbreakdown\nbusted flush\ncar crash\nfoul (something) up\nfreefall\ngame over idiom\nhash\nlemon\nlost cause\nlulu\nmess\nparody\nreversal\nslim pickings\nslush pile\ntrack record\ntrain wreck\nSee more results »\nnot working or not having any value: A customer had tried to pay with a dud cheque (= one for which a bank will not give money).\nSMART Vocabulary: related words and phrases\nUseless and futile\na mug's game idiom\nadrift\naimless\naimlessly\naimlessness\nairy-fairy\nfruitlessly\nfruitlessness\nfutile\nfutilely\nfutility\nnegate\nnegation\nno good idiom\nnon-viable\nunseriousness\nuntil you are blue in the face idiom\nunviability\nunviable\nunwieldily\nSee more results »\nAdd to word list\nAdd to word list\nsomething that is not successful or is of little value: The movie turned out to be a dud.\nAdd to word list\nAdd to word list\nsomething that is of no value or that does not work: So what makes a good investment and what makes a dud? Five years ago I bought a dishwasher that proved to be a dud from the start.\nof no use or value: The bank accepted 62 cents on the dollar to get the dud loans off its books."}