{"id":134128,"name":"due","type":"adjective","us_sound":"duː","us_link":"../audio/d/dew.mp3","uk_sound":"dʒuː","uk_link":"../audio/d/ukdevil024.mp3","content":"due adjective\n(EXPECTED)\nAdd to word list\nAdd to word list\nB1 expected to happen, arrive, etc. at a particular time: What time is the next bus due? The next meeting is due to be held in three months' time. Their first baby is due in January. in due course B2 formal\nat a suitable time in the future: You will receive notification of the results in due course.\nSee more\nMore examplesFewer examplesThe present chairman is due to retire next month.They backed out of the deal the day before they were due to sign the contract.When is the first payment due?The parliamentary session is due to end on May 27.He's due to appear in court again on Monday.\nSMART Vocabulary: related words and phrases\nPlanning, expecting and arranging\naccidentally\naccidentally on purpose idiom\nadvertent\nadvisedly\naim at something\nbargain\nhave something up your sleeve idiom\nhorizon scanning\nhow are you fixed for something? idiom\nI might have known idiom\nI'll/we'll cross that bridge when I/we come/get to it idiom\npencil\nprovidently\nprovision\npurpose\npurposefully\npurposely\nput their heads together idiom\nsettle\nsleeve\nSee more results »\ndue adjective\n(RESULTING)\ndue to\nB1 because of: A lot of her unhappiness is due to boredom.\nSee more\ndue adjective\n(OWED)\nC2 owed as a debt or as a right: The rent is due (= should be paid) at the end of the month. £50 is due to me (US due me) from the people I worked for last month. Our thanks are due to everyone.UK law He was found to have been driving without due (= the necessary) care and attention. be due for something\nC1 If you are due for something, you expect to receive it, because you deserve it: I'm due for a promotion soon.\nSee more\nSMART Vocabulary: related words and phrases\nBorrowing & lending\namortizable\namortization\nbonded\nborrow\nborrow something from something\nbridging loan\ncredit limit\nforeclose\nhole\nliquidator\nloan\nnon-prime\nnonaccrual\non the slate idiom\noutstanding\nover-borrowed\noverpay\noverpayment\npay someone/something back\nreceivership\nSee more results »\nGrammar\nBe due toBe due to is used to talk about things that are expected or planned to happen at a certain time. We often use it with a time expression: …\ngive someone their due\nsaid when you are praising someone for something good they have done, although you dislike other things about them: He failed again, but to give him his due, he did try hard.\nSee more dues [ plural ]\nthe official payments that you make to an organization you belong to: Members of the society pay £1,000 in annual dues.\nSee more\nin a direction that is straight towards the north, south, east, or west: From here, you go due east until you get to the Interstate.\nSMART Vocabulary: related words and phrases\nPoints of the compass\ncardinal point\ncompass reading\ncompass rose\nE, e\neasterly\neastern\neasternmost\ngeomagnetic pole\nmagnetic north\nmagnetic pole\nnortheastern\nnortheastward\nnortherly\nnorthern\nnorthernmost\nsouthern\nsouthwestern\nSW\nwestern\nwesternmost\nSee more results »\ndue adjective\n(OWED)\nAdd to word list\nAdd to word list\n[ not gradable ] owed as a debt or as a right: I’m due a refund for the sweater I returned. Our thanks are due to everyone who gave so generously. The rent is now due (= should be paid).\ndue adjective\n(EXPECTED)\n[ not gradable ] expected (to happen, arrive, etc.) at a particular time: What time is the next train due? [ + to infinitive ] The meeting is now due to take place next week.\ndue adjective\n(RESULTING)\ndue to\nDue to can mean because of: Due to computer problems, the checks will be late. The flight was canceled due to bad weather.\ndue adjective\n(USUAL/CORRECT)\n[ not gradable ] according to the usual custom or the correct process: Phillips took due note of the key statistics. In due course the business became a real money maker.\ndue adverb [not gradable]\n(STRAIGHT)\n(of north, south, east, or west) exactly, straight: They headed due north.\nAdd to word list\nAdd to word list\nFINANCE, ACCOUNTING an amount that is due on a particular date has to be paid on that date: become/come/fall due A £110m interest payment to bondholders falls due on March 25.due on/by sth More than $2.15 billion of its outstanding loans are due by the end of this year. The loan carries an interest rate of 7.625% per annum and is due and payable on January 31.\nif you are due something, it is owed to you as a right: After 3 years employment, I'll be due 3 weeks vacation.\nif someone is due to do something, they are expected to do it or going to do it: He had been due to become technical director, but the company was taken over.\nexpected to happen, arrive, etc. at a particular time: due on/by sth Applications are due by noon next Wednesday.be due to do sth The tribunal is due to meet this week."}