{"id":134145,"name":"duelling","type":"noun","us_sound":"ˈduː.ə.lɪŋ","us_link":"","uk_sound":"ˈdjuː.ə.lɪŋ","uk_link":"","content":"Add to word list\nAdd to word list\nthe activity of taking part in duels (= formal fights between two people, using weapons, usually because one person has insulted the other): Fencing is a sport derived from duelling.\nthe activity of fighting, competing, or arguing between two people or teams: The game of chess requires intense concentration and sustained mental duelling. Their partnership is full of vitality, kept alive with intellectual duelling.\nMore examplesFewer examplesEvery authority, whether monarch or government, tried to outlaw duelling.The duel has been romantically celebrated as the last refuge of honour but in reality, duelling was often closer to common brawling.Thackeray's Barry Lyndon is the story of an 18th century Irish lad making his way in the world through duelling, gambling and loving. Thomas Paine wrote articles against slavery and against duelling.\nSMART Vocabulary: related words and phrases\nFighting\narray\nbellicosity\nblood diamond\nbloodlessly\nblow\nboots on the ground idiom\ncall to arms\ncombat\ncome close to blows idiom\nfracas\nknock-down-drag-out\nlock horns idiom\nshadowbox\nshadowboxing\nshoot it out\nshootout\nskirmish\nsquare up\ntoe\nturf war\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCompeting and contending (non-sporting)\nCompeting in sport\ntaking part in or relating to the activity of duelling: duelling pistols a duelling scar\nfighting, competing, or arguing with another person or team: The judge asked the duelling attorneys to approach the bench.\nMore examplesFewer examplesEach man carried a duelling rapier.On their weekly show, the duelling critics would debate, often passionately, the merits of that week's crop of new films.The film tells a tale of rivalry between duelling air-traffic controllers. It is not uncommon for duelling relatives to make false accusations.Eric Weissberg is the folk musician responsible for the \"Duelling Banjos\" hit from the soundtrack to the film Deliverance.\nSMART Vocabulary: related words and phrases\nFighting\narray\nbellicosity\nblood diamond\nbloodlessly\nblow\nboots on the ground idiom\ncall to arms\ncombat\ncome close to blows idiom\nfracas\nknock-down-drag-out\nlock horns idiom\nshadowbox\nshadowboxing\nshoot it out\nshootout\nskirmish\nsquare up\ntoe\nturf war\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCompeting and contending (non-sporting)\nCompeting in sport"}