{"id":134300,"name":"dullness","type":"noun","us_sound":"ˈdʌl.nəs","us_link":"../audio/d/usduckw013.mp3","uk_sound":"ˈdʌl.nəs","uk_link":"../audio/d/ukdull_003.mp3","content":"dullness noun [U]\n(LACK OF INTEREST)\nAdd to word list\nAdd to word list\nthe fact of not being interesting or exciting, or of not being interested in anything: She managed to get exquisite material out of the dullness of her home town. Symptoms are shivers and chills, headache, double vision, dullness and apathy.\nThesaurus: synonyms, antonyms, and examples\nthe state of being unhappy and uninterestedboredomThere's nothing to do at the cabin - I might die of boredom.tediumFilming a televison show involves a fair bit of waiting and tedium behind the scenes. tediousnessI can't imagine the tediousness of cataloguing every single piece of writing in the archive. wearinessShe listened to his complaining with a growing sense of weariness.ennuiHis latest book was about suburban ennui and the middle-aged desire for something new. drearinessShe wanted to go to the big city and escape the dreariness of her rural, small-town life.\nSee more results »\nMore examplesFewer examplesReconciling the alleged dullness of marriage with the thrill of romance is a challenge to many couples.Her performance was tasteful and restrained to the point of dullness.Without him some of the magic had gone from her life, and the dullness encroached into her work.\nSMART Vocabulary: related words and phrases\nBoredom, tedium and boring things\nbanality\nblandness\nboredom\nbromide\ncabin fever\ncommonplace\nennui\nflatness\nfrustration\ninsipidness\njejune\nrestlessness\nsame\nscreed\nsnooze\nsnoozefest\nsterility\nthe same old thing idiom\ntorpor\nturgid\nSee more results »\ndullness noun [U]\n(NOT BRIGHT)\nthe fact of not being bright or shiny: The dullness of the cloudy sky and the increasing wind made us decide to turn back. Skin affected by dehydration can fall victim to dullness, flakiness, and even fine lines and wrinkles. See\ndull\nMore examplesFewer examplesHer cheeks began to fill out and the hollows by her collar bone were less noticeable, but the dullness in her blue eyes persisted.Lack of these nutrients can stunt hair growth and lead to dullness or even hair loss.Dullness of the skin is one of the signs of ageing.\nSMART Vocabulary: related words and phrases\nThe qualities of light\naglow\nbacklit\nbrightly\nbrilliantly\ncoruscating\ndazzlingly\nflickering\nflickeringly\nfloodlit\nglittering\nlambent\nluminosity\nluminous\nlustrously\nnon-fluorescent\nnon-solar\nopalescent\noptically\novercast\nspangly\nSee more results »"}