{"id":134293,"name":"dully","type":"adverb","us_sound":"ˈdʌl.li","us_link":"../audio/d/dully.mp3","uk_sound":"ˈdʌl.li","uk_link":"../audio/d/ukdull_004.mp3","content":"dully adverb\n(LACKING INTEREST)\nAdd to word list\nAdd to word list\nin a way that is boring and not exciting: Most of the work consisted of dully repetitive tasks. The play starts well but has a dully conventional ending.\nin a way that shows no interest or feeling: \"Well, I suppose I'd better get some work done,\" said Jean, dully. He gazed at the newspapers dully, convincing himself he must be ill.\nMore examplesFewer examplesHis girlfriend Mary Jane is a dull role, dully played by Kate Dent.The monologues are dully written, and the sentiments expressed too often banal.Outside there were more bored young men, sitting in groups, dully watching the cars go by.\nSMART Vocabulary: related words and phrases\nTedious and uninspiring\nanonymous\nbanal\nbanally\nbasic\nbe (as) dull as ditchwater idiom\nmarmoreal\nmeh\nmenial\nmenially\nmiddle-aged\nstaid\nstaidly\nstale\nstaleness\nstodgily\nwatch the clock idiom\nwearisome\nwearisomely\nwell worn\nworthy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLacking interest and enthusiasm\ndully adverb\n(NOT BRIGHTLY)\nin a way that is does not appear clear, bright, or shiny: The car lights glowed dully through the mist. The stairs have no rails and are dully lit. She gazed into the dully glowing ashes of the dying fire.\nMore examplesFewer examplesThe old gold and silver jewelry gleamed dully as the light played over it. The knife blade gleamed dully in the shadows.He turned to see the waiter at the top of the stairs at the far end of the dully lit corridor.\nSMART Vocabulary: related words and phrases\nDarkness & becoming dark\nblackness\ndarken\ndarkened\ndarkly\ndarkness\ndim\ndimly\ndimness\ndingily\ndraw\ninky\nmatt\nsemi-darkness\nshaded\nshadily\nshadow\nshadowily\nshadowy\nsombreness\ntwilight\nSee more results »\ndully adverb\n(NOT SHARPLY)\nin a way that is does not feel or sound sharp or clear: My arm still ached dully. As they walked through the fog their footsteps echoed dully. See\ndull\nMore examplesFewer examplesHer spine, neck and shoulders ached dully.She felt sick and her head still throbbed dully.She stared at the fierce pain in his eyes, her heart thudding dully in her chest.One booming cannon echoed dully in the misty Sabbath morning.\nSMART Vocabulary: related words and phrases\nPain & painful\n-racked\naches and pains\nagonizing\nanalgesia\nbe murder on something idiom\nbrain freeze\ncluster headache\nexcruciating\ngrief\nneuralgia\npainlessly\npang\nprick\nrawness\nsciatic\nsore\nsting\nstitch\nthrob\ntingle\nSee more results »"}