{"id":134281,"name":"dull","type":"adjective","us_sound":"dʌl","us_link":"../audio/d/dull.mp3","uk_sound":"dʌl","uk_link":"../audio/d/ukdull_001.mp3","content":"dull adjective\n(BORING)\nAdd to word list\nAdd to word list\nB1 not interesting or exciting in any way: She wrote dull, respectable articles for the local newspaper. He's pleasant enough, but deadly dull. Synonyms\nboring\ndrab disapproving\ndreary disapproving\ndry (BORING) disapproving\nho-hum\nmonotonous\ntedious\nuninteresting\nwearisome formal\nThesaurus: synonyms, antonyms, and examples\nnot interesting or excitingboringThat was such a boring film I nearly fell asleep during it.excruciatingShe went over the plot of the book in excruciating detail.deadlyHis latest film was just deadly. I left after the first hour!mind-numbingThe incident was described in a mind-numbing, 400-page report so dense that no one read it.\nSee more results »\nMore examplesFewer examplesI find his art rather dull and conventional.The text was dull and formulaic.For years, he's plodded away at the same dull routine job.Those books seem rather dull beside this one.The ponderous reporting style makes the evening news dull viewing.\nSMART Vocabulary: related words and phrases\nTedious and uninspiring\nanonymous\nbanal\nbanally\nbasic\nbe (as) dull as ditchwater idiom\nmarginal\nmarmoreal\nmeh\nmenial\nmenially\nspinach\nstaid\nstaidly\nstale\nstaleness\nwatch paint dry idiom\nwatch the clock idiom\nwearisome\nwearisomely\nwell worn\nSee more results »\ndull adjective\n(NOT BRIGHT)\nC1 not clear, bright, or shiny: We could just see a dull glow given off by the fire's last embers. The first day of our holiday was dull (= cloudy).\nSMART Vocabulary: related words and phrases\nDarkness & becoming dark\nblackness\ndarken\ndarkened\ndarkness\ndim\ndimly\ndimness\ndingily\ndingy\ndraw\ninky\nmatt\npitchy\nsemi-darkness\nshaded\nshadily\nshadow\nshadowily\nshadowy\ntwilight\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nColourless or causing colour to fade\ndull adjective\n(NOT SHARP)\nA dull knife or blade is not sharp: To remove the wax, let it harden, then scrape it off with a dull knife. The blade was too dull to cut through the meat. He fought so fiercely that his sword became dull. Synonym\nblunt\nA dull sound or pain is not sharp or clear: I heard a dull thud from the kitchen and realized she must have fainted. The dull rumble of traffic woke her. She felt a dull ache at the back of her head.\nold-fashioned not intelligent\nSMART Vocabulary: related words and phrases\nSharp and blunt\nangularity\nblunt\nhone\njag\njaggy\nkeen\npointed\nprickly\nrazor-sharp\nsharp\nsharpen\nsharpness\nspike\nspiked\nspikily\nspiky\nspiny\nstrop\nultra-sharp\nwhet\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPain & painful\nStupid and silly\nRelated words\ndully\ndullnessIdiom\nbe (as) dull as ditchwater\nto make something such as a feeling less sharp and strong, or to become less sharp and strong: Many people use alcohol to dull their pain. The medication dulled her senses. There was no way to dull the noise of the bombardment. My sight may have dulled, but my other senses are sharper.\nto become or make something become less clear, bright, or shiny: Layers of resin applied to the painting had dulled its colour. Often a diamond ring has been dulled by skin oils, soap, and cosmetics. The light in his eyes dulled.\nto make a knife or blade less sharp, or to become less sharp: All he had with him was a notebook and a dulled pocket knife. He produced a rusty old blade that had dulled long ago.\nMore examplesFewer examplesMorphine is typically used to dull the extreme pain of severe injury or late-stage cancer.Is it true that junk food is dulling our taste buds?Today, the passage of time has dulled our memory. Sleep deprivation dulls the mind.\nSMART Vocabulary: related words and phrases\nBecoming and making less strong\nabate\nabatement\nadulterate\nadulterated\nadulteration\ndecline\nenervate\nenervating\nenervatingly\nenfeeble\nenfeebled\nfade\nmelt\nrelieve\nsink\nturn to jelly idiom\nundimmed\nunsubdued\nwane\nwaste away\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDarkness & becoming dark\nColourless or causing colour to fade\nSharp and blunt\ndull adjective [-er/-est only]\n(BORING)\nAdd to word list\nAdd to word list\nnot interesting or exciting; boring: Many of the courtroom events were dull and routine. The lecture was dry, dull, and full of statistics.\ndull adjective [-er/-est only]\n(NOT BRIGHT)\nnot clear, bright, or shiny: The day started off dull and overcast with a threat of showers.\ndull adjective [-er/-est only]\n(NOT SHARP)\n(esp. of sound or pain) not sharp or clear: a dull knife I heard a dull thud from the kitchen. She felt a dull ache at the back of her head.\nto make something less sharp or clear: Lack of sleep will dull your reflexes.\nAdd to word list\nAdd to word list\nused to describe a situation in which business activity is slow: Trading was dull as investors were sidelined because of a lack of good news. The earnings outlook is dull."}