{"id":134382,"name":"dump","type":"verb","us_sound":"dʌmp","us_link":"../audio/d/dump.mp3","uk_sound":"dʌmp","uk_link":"../audio/d/ukdull_015.mp3","content":"dump verb [T]\n(PUT DOWN)\nAdd to word list\nAdd to word list\nC2 to put down or drop something in a careless way: He came in with four shopping bags and dumped them on the table.\nMore examplesFewer examplesHis body had been dumped in an area of waste land just outside the city.He opposes any kind of nuclear waste being dumped at sea.The car was dumped in a stretch of wasteland in the south of the city.90 percent of American rubbish is dumped in landfill sites.\nSMART Vocabulary: related words and phrases\nRemoving and getting rid of things\nabandonment\nbanish\nbe scattered to the four winds idiom\nbin\ncast someone/something aside/away/off\ndumping\nerase\nevacuate\nevacuation\nexorcism\nexpunge\nexpurgate\nshrug\nshrug something off\nshuck\nshuck something off\nshuffle something off\nsling\ntoss\nturf\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlacing and positioning an object\ndump verb [T]\n(GET RID OF)\nC1 to get rid of something unwanted, especially by leaving it in a place where it is not allowed to be: The tax was so unpopular that the government decided to dump it. Several old cars had been dumped near the beach. Toxic chemicals continue to be dumped into the river.\nto sell unwanted goods very cheaply, usually in other countries: They accused the West of dumping out-of-date medicines on Third World countries.\ncomputing\n&#160; specialized to move information from a computer's memory to another place or device\nSMART Vocabulary: related words and phrases\nRemoving and getting rid of things\nabandonment\nbanish\nbe scattered to the four winds idiom\nbin\ncast someone/something aside/away/off\ndumping\nerase\nevacuate\nevacuation\nexorcism\nexpunge\nexpurgate\nshrug\nshrug something off\nshuck\nshuck something off\nshuffle something off\nsling\ntoss\nturf\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nKeeping and storing things\nOperating computers\ndump verb [T]\n(END RELATIONSHIP)\nC2 informal to suddenly end a romantic relationship you have been having with someone: If he's so awful, why don't you just dump him?\nSMART Vocabulary: related words and phrases\nRelationships: ending & divorce\naffiliation order\nannul\nannulment\nbreak something up\nbreak up with someone\nchild support\nchuck\nghost\ngive someone the elbow idiom\ngive someone the heave-ho idiom\ngive someone the push idiom\ngo off with someone\ngrow apart\nrebound\nrun out on someone/something\nseparate\nseparation\nsplit\nsplit up\nthrow\nSee more results »\ndump verb [T]\n(BALL SPORTS)\nin team sports, to pass the ball a short distance to another player in your team: He moved right before dumping off a short pass to the running back. He dribbled under the basket and dumped off the ball to the centre. He dumped the ball to a back or tight end.\nMore examplesFewer examplesHe dumped it off to Crawford in the inside left position.\nSMART Vocabulary: related words and phrases\nGeneral terms used in ball sports\naggregate score\nassist\nback pass\nbackspin\nball game\nballplayer\nkicker\nlay someone off\nlayoff\nlong ball\npace\npassing\npitch\nstroke\nthe long ball game idiom\nundefended\nunderhand\nunderspin\nunhittable\nuppish\nSee more results »\ndump verb [T]\n(ICE HOCKEY)\nin ice hockey, to hit the puck far into the opposing team's area: He dumps the puck in the corner and goes for a change. Teams can't simply dump the puck into the other team's zone and chase it down.\nSMART Vocabulary: related words and phrases\nWinter sports\nairboard\nairboarder\nairboarding\nAlpine skiing\naprès-ski\ngroom\nice rink\nice skater\nice skating\ninbounds\nluge\nmogul\nmush\nsled\nsnow groomer\nsnowblade\nsnowblading\nsnowboard\nsnowboarder\ntuck\nSee more results »\ndump verb [T]\n(GOLF )\nin golf, to hit the ball into some water or a bunker (= an area filled with sand): She dumped her second shot in the water at the 10th. He hit his pitch shot too casually and dumped his ball into the bunker.\nSMART Vocabulary: related words and phrases\nGolf\nbogie\ncaddy\nclip\ncrazy golf\ncut\ndriver\nfade\nfore\nfringe\ngolf\ngolf ball\noutdrive\nouthit\nround\nslice\nstiff\ntap in\ntee (something) up\ntee someone off\nwood\nSee more results »\nC1 (UK also rubbish dump); (US also garbage dump) a place where people are allowed to leave their rubbish: I'm going to clean out the basement and take everything I don't want to the dump.\nC2 informal a very unpleasant and unattractive place: This town is a complete dump!\na place where things of a particular type are stored, especially by an army: an ammunition/arms/weapons/food dump\ncomputing\n&#160; specialized an act of moving information from a computer's memory to another place or device\nSMART Vocabulary: related words and phrases\nRubbish and waste\nanti-litter\nanti-littering\ndebris\ndejunk\ndejunking\ngubbins\nhigh-level waste\ninfluent\njetsam\njumble\nlitter\nrecycle\nrubbish\nshavings\nskip diving\nslag\nspoil\ntat\ntransfer station\nwhite elephant\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnpleasant places\nKeeping and storing things\nOperating computers\nIdioms\n(down) in the dumps\nhave/take a dump\nAdd to word list\nAdd to word list\nto put down or drop something heavy without caring where it goes, or to get rid of something or someone no longer wanted: The ship was accused of dumping garbage overboard. She missed too many rehearsals and was dumped from the cast.\na place where people are allowed to leave their garbage: You have to bring household garbage to the town dump.\ninfml A dump is also any place that is messy or that you do not like because it is of low quality: Why are you staying in this dump?\nAdd to word list\nAdd to word list\n[ T ] informal to stop using or supporting something or someone: The group has dumped plans for a giant US takeover after ruling that difficult stock market conditions would prevent it raising the cash. The star was dumped by the record label after a string of failures.\n[ I or T ]\n&#160; ECONOMICS to sell goods so cheaply in another country that companies in that country cannot compete fairly: The Commerce Department announced punitive tariffs against foreign paper manufacturers accused of dumping goods in the US below cost.dump on sth The producers of the goods are claiming that foreign manufacturers are dumping on the market.\n[ T ]\n&#160; FINANCE to sell large amounts of something that you do not want to keep: As the stock rose, he dumped his shares, making $160,000.\n[ T ]\n&#160; ENVIRONMENT to throw something away in a place that is not suitable or allowed by law: Often the toxic waste is dumped in local rivers or burned, increasing health and environmental problems.\n[ T ]\n&#160; IT to move information from a computer's memory in order to store it: Dump all the data onto an external hard drive as a backup."}