{"id":134396,"name":"dumping","type":"noun","us_sound":"ˈdʌm.pɪŋ","us_link":"../audio/d/usduckw020.mp3","uk_sound":"ˈdʌm.pɪŋ","uk_link":"../audio/d/ukdull_017.mp3","content":"dumping noun [U]\n(GETTING RID OF)\nAdd to word list\nAdd to word list\nthe act of getting rid of something that is not wanted: They have promised to limit the dumping of sewage sludge in the sea. Landfill tax and higher fees charged by commercial tips have led to more illegal dumping.\nMore examplesFewer examplesThe tip did not have a licence for chemical dumping.All the dumping sites have now been decontaminated.A woman contacted detectives and told them that the brickworks was the most likely dumping spot.\nSMART Vocabulary: related words and phrases\nEnvironmental issues\nagroecology\nair pollution\nanoxia\nanoxic\nanti-conservation\ncarbon capture\ndumping ground\neco-footprint\nenvironmentalism\nenvironmentally\nESG\nfeed-in tariff\nfood insecure\nparticulate\nreduce, reuse, recycle idiom\nsequester\nsequestration\nsingle-use\nskip diving\nsmoggy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRemoving and getting rid of things\ndumping noun [U]\n(SELLING)\nbusiness, finance &amp; economics\n&#160; specialized the practice of selling products very cheaply in another country, in order to stop companies in that country from being able to compete: Dumping occurs when a product is sold at less than fair value. Investigations showed that exports of the material into the mainland market constituted dumping. Related word\nanti-dumping\nMore examplesFewer examplesDumping refers to selling a product abroad at a lower price than it would fetch in its home market.Just the threat of a dumping complaint sometimes is enough to slow a foreign country's exports.Even where there is no dumping or subsidization, any surge in exports can lead to the application of counter measures by the importing country.\nSMART Vocabulary: related words and phrases\nProducts & producers\nanti-dumping\nbadging\nbegetter\nbig pharma\nbig tobacco\ndeliverable\ndry goods\nend product\nfabricator\ngeneral-purpose\ngenerator\nhaul\nmarque\nmover\nmulti-line\nmulti-product\nnon-proprietary\nnotion\noutput\nspecialize\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBuying & selling - general words\nAdd to word list\nAdd to word list\nECONOMICS the practice of selling goods in another country so cheaply that companies in that country cannot compete fairly: They were charged with selling lumber on the U.S. market below the cost of production, a practice known as dumping.\nFINANCE the act of selling large amounts of something that you do not want to keep: If someone were to initiate the large-scale dumping of dollars, an avalanche-style collapse could begin.\nENVIRONMENT the act of throwing something away in a place that is not suitable or allowed by law: waste/radioactive/chemical dumping\nSee also\nanti-dumping"}