{"id":134608,"name":"duotone","type":"noun","us_sound":"ˈduː.oʊ.toʊn","us_link":"../audio/d/cdo0623usduot1139.mp3","uk_sound":"ˈdjuː.əʊ.təʊn","uk_link":"../audio/d/cdo0623ukduot1131.mp3","content":"Add to word list\nAdd to word list\na halftone (= a picture built up from a pattern of very small spots) made using black and another colour or two shades of the same colour, or the method of producing an image like this: You can print duotones on an inkjet or colour laser printer with excellent results. Greyscale images which have been converted to duotone sometimes look dark and unclear.\nMore examplesFewer examplesPictures with subtle gradations of tone, such as misty landscapes, sand, or snow, make good subjects for duotones.Duotones can be any colour you like and bring a sophisticated touch to a two-colour text.The use of quality printing in duotone for this type of document is unusual and impressive.\nSMART Vocabulary: related words and phrases\nPhotography\naerial photograph\nairbrush\nanalogue\naperture\nbokeh\ncamera\nexpose\nglossy\ngrainy\nhalation\nhappy slapping\nhi-res\nhigh-resolution\npap\nphotoshoot\npic\npicture\nPillCam\npin-up\nprojection\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPublishing: printing & word processing\nmade using black and another colour or two shades of the same colour: The exhibit consists of over 200 beautiful duotone photographs of legendary Hollywood stars. The book features beautifully printed duotone plates.\nMore examplesFewer examplesOne option is to convert your duotone image to CMYK prior to printing.\nSMART Vocabulary: related words and phrases\nPhotography\naerial photograph\nairbrush\nanalogue\naperture\nbokeh\ncamera\nexpose\nglossy\ngrainy\nhalation\nhappy slapping\nhi-res\nhigh-resolution\npap\nphotoshoot\npic\npicture\nPillCam\npin-up\nprojection\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPublishing: printing & word processing"}