{"id":134646,"name":"duplicate","type":"verb","us_sound":"ˈduː.plə.keɪt","us_link":"../audio/d/usad6050.mp3","uk_sound":"ˈdʒuː.plɪ.keɪt","uk_link":"../audio/d/ukdunny010.mp3","content":"Add to word list\nAdd to word list\nto make an exact copy of something: The documents had been duplicated. Parenthood is an experience nothing else can duplicate.\nSMART Vocabulary: related words and phrases\nCopying and copies\nanti-counterfeiting\nanti-piracy\nape\nbiomimicry\nblueprint\nfacsimile\nforgery\nhijack\nhijacking\nimaging\nimitable\nmail merge\nmimetic\nphotostatic\npiracy\npirate\npirated\nplagiarism\ntranscript\nXerox\nSee more results »\nbeing an exact copy of something: The thieves were equipped with duplicate keys to the safe. Keep a set of duplicate keys in a safe place, in case you lose the originals.\nSMART Vocabulary: related words and phrases\nCopying and copies\nanti-counterfeiting\nanti-piracy\nape\nbiomimicry\nblueprint\nfacsimile\nforgery\nhijack\nhijacking\nimaging\nimitable\nmail merge\nmimetic\nphotostatic\npiracy\npirate\npirated\nplagiarism\ntranscript\nXerox\nSee more results »\nsomething that is an exact copy of something else: I lost the original form so they sent me a duplicate.\nSMART Vocabulary: related words and phrases\nCopying and copies\nanti-counterfeiting\nanti-piracy\nape\nbiomimicry\nblueprint\nfacsimile\nforgery\nhijack\nhijacking\nimaging\nimitable\nmail merge\nmimetic\nphotostatic\npiracy\npirate\npirated\nplagiarism\ntranscript\nXerox\nSee more results »\nin duplicate\nIf a form is in duplicate, an exact copy has been made of it: The application has to be completed in duplicate.\nSee more\nAdd to word list\nAdd to word list\nto make an exact copy of something: Businesses should make sure important records and files are duplicated and stored in another location. duplicate adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈdu·plɪ·kət/\na duplicate key duplication noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌdu·plɪˈkeɪ·ʃən/\nsomething that is an exact copy of something else: I lost the original form so they sent me a duplicate. in duplicate\nIf a form is in duplicate, an exact copy has been made of it: The application has to be completed in duplicate. duplicate adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈdu·plɪ·kət/\na duplicate key\nAdd to word list\nAdd to word list\nto make an exact copy of something: There's a machine that can duplicate nine DVDs at a time.\nto do something again that has already been done, when this is unnecessary: Some of the proposed laws duplicate those already adopted by the federal government.\nto make something happen again in the same way as it happened before: easy/difficult/impossible to duplicate Their past success might be hard to duplicate.\nCompare\ncopy verb\nmade as an exact copy of something: duplicate copy/file/record We will not be able to return the documents, so keep a duplicate copy. duplicate invoice/statement/receipt\ndone or made for a second time, especially when this is not necessary, or in order to deceive: duplicate payment/claim Internal controls are not in place to provide for the prevention of duplicate payments. Dishonest people filed duplicate claims or received rental assistance while living in government-paid housing.\n[ C ] an exact copy of something: I have lost the document and my boss says she cannot provide a duplicate.a duplicate of sth Ask the bank to send you a duplicate of the bank statement each month. create/make/produce a duplicate Compare\ncopy noun\nin duplicate\nif a document is in duplicate, two copies of it are made: The government requires that all bank records be kept in duplicate. Compare\ntriplicate"}