{"id":134689,"name":"durable","type":"adjective","us_sound":"ˈdʊr.ə.bəl","us_link":"../audio/d/durable.mp3","uk_sound":"ˈdʒʊə.rə.bəl","uk_link":"../audio/d/ukdunny015.mp3","content":"Add to word list\nAdd to word list\nable to last and be used for a long time without becoming damaged: The machines have to be made of durable materials. The trays are made from cedar, which is light and durable.\nThesaurus: synonyms, antonyms, and examples\nnot breaking easilystrongYou will need a strong cardboard box to carry all those books.toughCeramic tiles are tougher than plastic shower screens.sturdyYou'll need sturdy boots for this weather.solidYou will need to build a good solid base for your shed.hard-wearingCotton canvas is the most hard-wearing fabric.\nSee more results »\nable to continue to exist for a long time: The resolution calls for a durable peace settlement. With these constituencies, the Democratic Party built itself a durable long-term majority.\nable to do something for a long time without getting tired or being injured: He has a reputation as the most durable player in baseball history.\nMore examplesFewer examplesThis office desk is durable, lightweight and able to sustain a load of up to 110 lbs.Less expensive, pigmented leather is more durable because it is coated with a layer of paint.There are successful, durable, multi-lingual republics such as Switzerland.We need a durable strategy that can yield long-term results.The World Cup midfielder may not be the most glamorous of the new players but could prove one of the most durable.\nSMART Vocabulary: related words and phrases\nLasting for a long time\nall-night\nancient\nbe going strong idiom\nchangeless\ndateless\nimmemorial\nimmemorially\nincorruptibility\nincorruptible\nincorruptibly\nlongevity\nman and boy idiom\nnever-ending\nnondurable\nnondurable goods\ntime-consuming\ntimeless\ntimelessly\ntimelessness\nunslaked\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysically strong and powerful\nRelated word\ndurabilitySee also\nconsumer durables\ndurable goodsSynonyms\nabiding\nenduring\nimperishable literary\nindelible\nindestructible\nineradicable formal\ningrained\nlasting\nlong-lasting\npermanent\nstubborn\nAdd to word list\nAdd to word list\nable to last a long time without being damaged durability noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌdʊər·əˈbɪl·ɪ·t̬i/\nThe fabric is the perfect blend for comfort, breathability and durability.\nAdd to word list\nAdd to word list\nable to be used for a long time without getting damaged: The plastic used in this product was stronger and more durable than earlier plastics.\nable to continue for a long time without failing: Our aim is to build a durable and profitable business."}