{"id":134751,"name":"during","type":"preposition","us_sound":"ˈdʊr.ɪŋ","us_link":"../audio/d/during.mp3","uk_sound":"ˈdʒʊə.rɪŋ","uk_link":"../audio/d/ukdunny019.mp3","content":"during preposition\n(THROUGH)\nAdd to word list\nAdd to word list\nA2 from the beginning to the end of a particular period: They work during the night and sleep by day. There were huge advances in aviation technology during the Second World War. Compare\nwhile conjunction (DURING)\nMore examplesFewer examplesThe (traffic) congestion in the city gets even worse during the summer.The work that the students do during the year will count towards their final degrees.The city centre's quite quite lively during the day, but it's totally dead at night.You're not allowed to talk during the exam.Jean was my roommate during our first year at university.\nSMART Vocabulary: related words and phrases\nSimultaneous and consecutive\naccompanied by someone/something\naccompaniment\naccompany\nall the while idiom\nalong\nheavy rotation\nin parallel idiom\nin rotation idiom\nin tandem idiom\nin the process idiom\nminute\nprocess\nsimultaneousness\nsoon\nstep\nstraight\nsuccessive\nsuccessively\nturn\nwhile\nSee more results »\nduring preposition\n(AT SOME TIME IN)\nA2 at some time between the beginning and the end of a period: I woke up several times during the night.\nMore examplesFewer examplesMany buildings were badly damaged during the war.A new manager was appointed during her absence.Rain will become more general in the southeast during the afternoon.The baby generally wakes up three times during the night.The girl went missing during a family outing to Mount Snowdon.\nSMART Vocabulary: related words and phrases\nPoints in time\nanytime\nas\nas and when idiom\ndownstream\nhour\nif\nif and when idiom\nimmediately\nlast\nlater\nmidstream\nmidway\nmoment\noccasion\none\nposterior\nthe last minute idiom\ntime\nunder the wire idiom\nwire\nSee more results »\nGrammar\nDuringWe use during before nouns and noun phrases to refer to when something happens over a period of time. During can refer to the whole time of the event: …\nDuring or for?We use during to say when something happens, if it happens in or over a period of time. We use for to talk about the length of time something lasts. …\nduring preposition\n(THROUGH)\nAdd to word list\nAdd to word list\nfrom the beginning to the end of (a particular period): They work during the night and sleep by day.\nduring preposition\n(AT SOME POINT IN)\nat some time between the beginning and the end of (a period): We hope to spend some weekends in the country during the summer."}