{"id":134878,"name":"duty","type":"noun","us_sound":"ˈduː.t̬i","us_link":"../audio/d/duty.mp3","uk_sound":"ˈdʒuː.ti","uk_link":"../audio/d/ukdusts008.mp3","content":"duty noun [C or U]\n(RESPONSIBILITY)\nAdd to word list\nAdd to word list\nB1 something that you have to do because it is part of your job, or something that you feel is the right thing to do: The duty of the agency is to act in the best interests of the child. [ + to infinitive ] I felt it was my duty to tell them the truth.duty to You have a duty to yourself to take a break once in a while.out of duty He only went to see her out of duty (= because he thought he should).report for duty You should report for duty (= arrive at work) at 8 a.m. on Monday.off/on duty What time are you off/on duty (= when do you finish/start work) tomorrow? be duty bound to do something\nto have to do something because it is your duty: We are duty bound to justify how we spend our funds.\nSee more\nMore examplesFewer examplesShe felt that it was her duty to tell the police about the incident.It is surely the duty of the stronger members in a society to help those who are weak.I'd be failing in my duty if I didn't tell you about the risks involved in the project.He has failed to fulfil his duties as a father.During the dispute, many police officers were transferred from traffic duty to the prison service.\nSMART Vocabulary: related words and phrases\nDuty, obligation and responsibility\naccountable\naccountable to someone\naccountably\nanswer for something\nbear\nbrother\nfail\nfiefdom\ngotta\nhad better/best do something idiom\nhat\nhave something on your hands idiom\nought to\nowe someone a living idiom\npass the buck idiom\npay your dues idiom\npigeon\nportfolio\nsomeone's answer to someone/something idiom\nstick\nSee more results »\nduty noun [C or U]\n(TAX)\na tax paid to the government, especially on things that you bring into a country: duty on There's a high duty on alcohol.\nSMART Vocabulary: related words and phrases\nTaxation\namortizable\nanti-dumping\nanti-progressive\nanti-tax\nat source phrase\nfiscal year\nflat tax\ngas tax\nHMRC\nincome tax\nregressively\nroad tax\nsales tax\nself-assessment\nshelter\ntaxpayer\ntithe\ntop rate\nunprogressive\nuntaxed\nSee more results »\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; LAW a responsibility to do something because it is legally or morally right to do it: Every lawyer has a strong sense of duty and responsibility.a duty to do sth They have a duty to ensure customers receive sound advice.be sb's duty It is your duty to announce any conflict of interest.do your duty I felt that I had done my duty in reporting the incident to the police. It was alleged that the company had failed in its duty to advise customers of the technical aspects of the paint system.\n[ C, usually plural ]\n&#160; HR something that you have to do because it is part of your job: His duties included photographing engineering projects such as bridges and airfields.perform/undertake/do duties People employed under similar conditions should not be paid less than others performing similar duties. teaching/cleaning/administrative duties\n[ U ]\n&#160; HR one of the periods of time that a working day is divided into during which someone works: night/day duty Daniels volunteered for night duty so he could take classes at the University of Arizona.\n[ C or U ]\n&#160; TAX, COMMERCE a tax paid on goods that are bought or imported: duty on sth He said that duty on a bottle of wine in France is equivalent to 2p compared with £1.16 here.impose/raise/increase duty The duty on house purchases of £250,000 or more was increased to 2.5%. a cut/rise/increase in duty fuel/tobacco/petrol duty\noff duty\nnot working, and not responsible for dealing with things that happen at work: He summoned his entire unit to a crisis meeting, even though many were off duty. When your Estate Manager goes off duty, the alarm system will be monitored by a remote service.\non duty\nworking, and responsible for dealing with things that happen at work: During office hours there is always a planning officer on duty who deals with enquiries. The night shift goes on duty at 10 pm.\nSee also\nbreach of duty\ncountervailing duty\ncustoms duty\ndeath duty\ndiscriminating duty\nduty-free\nestate duty\nexcise duty\nexport duty\nheavy-duty\nView all\nimport duty\nlight-duty\nmedium-duty\nspecific duty\nstamp duty\nHR used to describe the person who is on duty at a particular time: duty engineer/manager/solicitor"}