{"id":161211,"name":"gaelic","type":"noun","us_sound":"ˈɡæl.ɪk","us_link":"","uk_sound":"ˈɡæl.ɪk","uk_link":"","content":"Add to word list\nAdd to word list\nuk/ˈɡæl.ɪk/ /ˈɡeɪ.lɪk/ us/ˈɡæl.ɪk/ /ˈɡeɪ.lɪk/ (also Scots Gaelic, Scottish Gaelic) a Celtic language spoken in some parts of western Scotland and an official language of Scotland : About 60 primary schools in Scotland now teach lessons in Gaelic. The decline of Scots Gaelic will inevitably continue for a while.\nuk/ˈɡeɪ.lɪk/ us/ˈɡeɪ.lɪk/ (also Irish, Irish Gaelic) a Celtic language spoken by some people in Ireland and an official language of the Republic of Ireland, where it is taught in all schools: They all spoke Gaelic down in the west. The three Irish tenors sang more in Italian than they did in Gaelic.\nuk/ˈɡeɪ.lɪk/ us/ˈɡeɪ.lɪk/ (also Manx, Manx Gaelic) a Celtic language spoken by some people in the Isle of Man, especially in the past: In 1901 the Isle of Man had 5,000 Gaelic speakers. Manx Gaelic is an official language in the parliament of the Isle of Man.\nSMART Vocabulary: related words and phrases\nLanguage names\nAlbanian\nAmerican English\nAmharic\nAngrezi\nAramaic\nEbonics\nFijian\nFilipino\nFinno-Ugric\nGeorgian\nGreenlandic\nMarshallese\nMoldovan\nMongolian\nMontenegrin\nMonégasque\nTuvaluan\nUzbek\nVietnamese\nYiddish\nSee more results »\nuk/ˈɡæl.ɪk/ /ˈɡeɪ.lɪk/ us/ˈɡæl.ɪk/ /ˈɡeɪ.lɪk/ relating to the Celtic language spoken in some parts of western Scotland, or to its speakers or their traditional culture: The word whisky comes from the Gaelic word usquebaugh, meaning \"water of life\". Gaelic songs The TV channel serves Scotland's Gaelic community. The project is the brainchild of the Gaelic actor and writer Domhnall Ruadh. Scotland's Gaelic culture was crushed after the battle of Culloden.\nuk/ˈɡæl.ɪk/ /ˈɡeɪ.lɪk/ us/ˈɡæl.ɪk/ /ˈɡeɪ.lɪk/ used as another word for Scottish, to describe a person or group or their characteristics: If the figures for the past three years had followed the same pattern, we could have overtaken our Gaelic counterparts.\nuk/ˈɡeɪ.lɪk/ us/ˈɡeɪ.lɪk/ relating to the Celtic language of Ireland, or to its speakers or their traditional culture: The centre also hosts Gaelic language classes and readings from Irish poets. It's difficult for Americans to pronounce some Gaelic words, but O'Riordan's example inspires students to try. The children of Gaelic families were often heard speaking a mixture of Gaelic and English in the playground. Gaelic sports, such as hurling and Gaelic football the Gaelic Athletic Association\nuk/ˈɡeɪ.lɪk/ us/ˈɡeɪ.lɪk/ used as another word for Irish, to describe a person or group or their characteristics: The Gaelic bookmaker unveiled a strong set of figures. One of the instructors was an gentleman by the name of Fagan who had all the Gaelic charm of the Irish.\nSMART Vocabulary: related words and phrases\nLanguage names\nAlbanian\nAmerican English\nAmharic\nAngrezi\nAramaic\nEbonics\nFijian\nFilipino\nFinno-Ugric\nGeorgian\nGreenlandic\nMarshallese\nMoldovan\nMongolian\nMontenegrin\nMonégasque\nTuvaluan\nUzbek\nVietnamese\nYiddish\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCountries, nationalities & continents: nationalities"}