{"id":161301,"name":"gain","type":"verb","us_sound":"ɡeɪn","us_link":"../audio/g/gain.mp3","uk_sound":"ɡeɪn","uk_link":"../audio/g/ukfya__024.mp3","content":"gain verb [I or T]\n(GET)\nAdd to word list\nAdd to word list\nB1 to get something that is useful, that gives you an advantage, or that is in some way positive, especially over a period of time: The mayor has gained a lot of support from the teacher's union.gain from What do you hope to gain from the course? Alternative medicine has only just started to gain respectability in our society. [ + two objects ] It was her performances in Aida that gained her an international reputation as a soprano. After you've gained some experience teaching abroad, you can come home and get a job. From the late 19th century, European powers began to gain control of parts of the Ottoman Empire.gain in UK She's certainly gained in confidence over the last couple of years. The data exists all right - the difficulty is in gaining access to it. The thieves gained entrance through an upstairs window that was left open.\nThesaurus: synonyms, antonyms, and examples\nto receive or be given somethinggetI got a new bike for my birthday.receiveYou will receive your tickets by email.obtainAfter many years of trying, she finally obtained Brazilian citizenship.gainYou will improve at the job as you gain experience.earnEventually, you will earn the dog's trust.achieveShe achieved top marks in the physics exam.\nSee more results »\nMore examplesFewer examplesYou can't gain access to the computer system without entering your password.The whole episode was a blatant attempt to gain publicity.He gained a reputation as being a staunch defender of civil rights.The pacifist movement is gaining increasing support among young people.This policy may appeal to the party faithful, but will it gain the support of uncommitted voters?\nSMART Vocabulary: related words and phrases\nGetting, receiving and accepting\nacquirable\nacquire\nacquisition\nawardee\ncarve\ndraw\nearn\nfill\nget out of something\nget/lay/put your hands on someone idiom\nglom onto something/someone\ngo to someone\ngrantsmanship\nscore\nscrew something out of someone\nsecure\nseize\nseize on/upon something\nsnap something up\nsnatch\nSee more results »\ngain verb [I or T]\n(INCREASE)\nB1 to increase in weight, speed, height, or amount: I gained a lot of weight while I was on holiday. The car gained speed going down the hill.gain by UK Good economic indicators caused the share index to gain by ten points. The campaign has been gaining momentum over the past few weeks.\nThesaurus: synonyms, antonyms, and examples\nto get fasterspeed upThe car sped up to 100 mph.pick up speedThe hurricane is picking up speed as it approaches the coast.gain speedAccidents often happen when a driver gains speed going downhill. gather speedThe economic recovery was starting to gather speed.accelerateThe vehicle accelerated around the turn.\nSee more results »\nMore examplesFewer examplesThe spacecraft will fly round Earth to gain momentum for its trip to Jupiter.The rock gains speed as it rolls down the slope.The kitchen clock is gaining time.He has gained weight since giving up smoking.You have gained 20 cm since I last measured you.\nSMART Vocabulary: related words and phrases\nIncreasing and intensifying\n-ify\naccretion\naccumulate\naccumulative\naccumulatively\nadd fuel to the fire idiom\nblaze\ncrank\ngrowing\ngrowingly\nheighten\nhot up\ninflation\nmushroom\nratchet something up/down\nre-escalate\nre-escalation\nredouble\nresurge\nstake\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming bigger\ngain verb [I or T]\n(CLOCK/WATCH)\nUK If a clock or watch gains, it works too quickly and shows a time that is later than the real time: gain (by) My watch has gained (by) ten minutes over the last 24 hours.\nSMART Vocabulary: related words and phrases\nWatches & clocks\n24-hour clock\nagainst the clock idiom\nalarm\nalarm clock\nat/on the stroke of something idiom\natomic clock\nclock\nhorology\nhour hand\nhourglass\njewel\nmilitary time\nminute hand\nstroke\ntick\ntimekeeper\ntimepiece\nturn the clocks back phrase\ntwenty-four-hour clock\nunsynchronized\nSee more results »\nPhrasal verb\ngain on someone/something\ngain noun [C or U]\n(SOMETHING OBTAINED)\nC1 an occasion when you get something useful or positive: Whatever the objections to this sort of treatment, the gains in terms of the number of lives saved are substantial.personal gain The minister was sacked for abusing power for his personal gain.\nMore examplesFewer examplesMany people get caught in a vicious circle of dieting and weight gain.Electricals made big gains in this afternoon's trading on Wall Street.The collapse of its rivals brought fortuitous gains to the company.The election returns produced a confusing picture of gains and losses.The party made modest gains in the elections, but nothing like the huge gains that were predicted.\nSMART Vocabulary: related words and phrases\nGetting, receiving and accepting\nacquirable\nacquire\nacquisition\nawardee\ncarve\ndraw\nearn\nfill\nget out of something\nget/lay/put your hands on someone idiom\nglom onto something/someone\ngo to someone\ngrantsmanship\nscore\nscrew something out of someone\nsecure\nseize\nseize on/upon something\nsnap something up\nsnatch\nSee more results »\ngain noun [C or U]\n(INCREASE)\nC1 an increase in something such as size, weight, or amount: Side effects of the drugs may include tiredness, headaches, or weight gain. After deducting costs, we still made a net gain of £5,000. Oil prices rose again today after yesterday's gains.\nThesaurus: synonyms, antonyms, and examples\nan increaseincreaseThere has been an sharp increase in municipal taxes this year.riseLast month saw a rise in the rate of inflation.gainWe are not seeing the gains in productivity that we expected.boostWe are hoping for a boost in sales this year.\nSee more results »\nSMART Vocabulary: related words and phrases\nBecoming bigger\naccrete\naccrue\nanti-growth\nballoon\nbell\nbillow\nbump\nelongate\nengorged\nenlarge\nenlargement\nexpansion\noak\npile\npuff up\nput something on\nregenerate\nscalability\nscalable\nstretch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIncreasing and intensifying\nAugmenting and supplementing\ngain verb\n(OBTAIN)\nAdd to word list\nAdd to word list\n[ T ] to obtain something useful, advantageous, or positive: He gained control of the business. You’ve got nothing to lose and everything to gain. He hoped to gain an advantage by beginning his campaign early.\ngain verb\n(INCREASE)\n[ I/T ] to increase in weight, speed, height, or amount: [ T ] I’ve gained weight, and I’m going on a diet. [ T ] The campaign has been gaining momentum ever since the television ads started to run. [ I ] Step on the gas – they’re gaining on us (= getting nearer to us).\n[ I/T ] If a clock or watch gains or gains time, it works too quickly and shows a time that is later than the real time. gain noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/ɡeɪn/\n[ U ] The commissioner denied having used his office for personal gain. gain noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/ɡeɪn/\n[ C ] Stock prices rose again today after yesterday’s gains.\nAdd to word list\nAdd to word list\nan increase in size, weight, amount, etc.: Having deducted costs we still made a net gain of five thousand pounds. Stocks ended the day with a moderate gain.\nsomething useful or good that you get for yourself: He was fired for abusing his position for his own personal gain. See also\nbook gain\ncapital gain\nshort-term gain\npaper gain\nto increase in amount or value: On Wall Street today, the Dow Jones Industrials gained more than 52 points.\nto get something that is important or gives you an advantage, especially over a period of time: Most temporary employees say they gained new abilities through their assignments.\ngain access to sth\nto be allowed to use or receive something: Every day, more citizens gain access to the Web and each other.\nMARKETING to be able to sell a product in a particular place for the first time: He is willing to invest millions of dollars in cooperative ventures in China if he can gain access to the market.\ngain currency\nto become more commonly known or accepted: Two ideas for constructing a tax reduction have been gaining currency in internal debates.\ngain ground\nto become more popular or successful: gain ground on sb/sth After three decades the carmaker is actually gaining ground on the competition. Even as companies in the US are gaining ground overseas, they are also sending more American-made products abroad.\nFINANCE to increase in value: gain ground against sth The dollar has been gaining ground against the yen in overseas trading."}