{"id":161319,"name":"gaining","type":"verb","us_sound":"ɡeɪn","us_link":"../audio/g/gain.mp3","uk_sound":"ɡeɪn","uk_link":"../audio/g/ukfya__024.mp3","content":"Add to word list\nAdd to word list\npresent participle of\ngain\ngain verb [I or T]\n(GET)\nB1 to get something that is useful, that gives you an advantage, or that is in some way positive, especially over a period of time: The mayor has gained a lot of support from the teacher's union. What do you hope to gain from the course? Alternative medicine has only just started to gain respectability in our society. [ + two objects ] It was her performances in Aida that gained her an international reputation as a soprano. After you've gained some experience teaching abroad, you can come home and get a job. From the late 19th century, European powers began to gain control of parts of the Ottoman Empire. She's certainly gained (in) confidence over the last couple of years. The data exists all right - the difficulty is in gaining access to it. The thieves gained entrance through an upstairs window that was left open.\nThesaurus: synonyms, antonyms, and examples\nto receive or be given somethinggetI got a new bike for my birthday.receiveYou will receive your tickets by email.obtainAfter many years of trying, she finally obtained Brazilian citizenship.gainYou will improve at the job as you gain experience.earnEventually, you will earn the dog's trust.achieveShe achieved top marks in the physics exam.\nSee more results »\ngain ground\nC1 If a political party or an idea or belief gains ground, it becomes more popular or accepted: The Republicans are gaining ground in the southern states.\nMore examplesFewer examplesYou can't gain access to the computer system without entering your password.The whole episode was a blatant attempt to gain publicity.He gained a reputation as being a staunch defender of civil rights.The pacifist movement is gaining increasing support among young people.This policy may appeal to the party faithful, but will it gain the support of uncommitted voters?\nSMART Vocabulary: related words and phrases\nGetting, receiving and accepting\nacquirable\nacquire\nacquisition\nawardee\ncarve\ndraw\nearn\nget back\nget out of something\nget/lay/put your hands on someone idiom\nglom onto something/someone\ngo to someone\npocket\nscore\nscrew\nscrew something out of someone\nsecure\nseize\nseize on/upon something\nsnap something up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLiked, or not liked, by many people\ngain verb [I or T]\n(INCREASE)\nB1 to increase in weight, speed, height, or amount: I gained a lot of weight while I was on holiday. The car gained speed going down the hill. Good economic indicators caused the share index to gain (by) ten points. The campaign has been gaining momentum over the past few weeks.\nThesaurus: synonyms, antonyms, and examples\nto get fasterspeed upThe car sped up to 100 mph.pick up speedThe hurricane is picking up speed as it approaches the coast.gain speedAccidents often happen when a driver gains speed going downhill. gather speedThe economic recovery was starting to gather speed.accelerateThe vehicle accelerated around the turn.\nSee more results »\nMore examplesFewer examplesThe spacecraft will fly round Earth to gain momentum for its trip to Jupiter.The rock gains speed as it rolls down the slope.The kitchen clock is gaining time.He has gained weight since giving up smoking.You have gained 20 cm since I last measured you.\nSMART Vocabulary: related words and phrases\nIncreasing and intensifying\n-ify\naccretion\naccumulate\naccumulative\naccumulatively\nadd fuel to the fire idiom\nblaze\nfade\ngrowing\ngrowingly\nheighten\nhot up\ninflation\nmushroom\nre-escalate\nre-escalation\nredouble\nresurge\nrocket\nspike\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming bigger\ngain verb [I or T]\n(CLOCK/WATCH)\nUK If a clock or watch gains, it works too quickly and shows a time that is later than the real time: My watch has gained (by) ten minutes over the last 24 hours.\nSMART Vocabulary: related words and phrases\nWatches & clocks\n24-hour clock\nagainst the clock idiom\nalarm\nalarm clock\nat/on the stroke of something idiom\natomic clock\nclock\nhorology\nhour hand\nhourglass\nlose\nmilitary time\nminute hand\nmovement\nstroke\ntimepiece\nturn the clocks back phrase\ntwenty-four-hour clock\nunsynchronized\nwatchband\nSee more results »\nPhrasal verb\ngain on someone/something"}