{"id":161926,"name":"gamble","type":"verb","us_sound":"ˈɡæm.bəl","us_link":"../audio/g/gamble.mp3","uk_sound":"ˈɡæm.bəl","uk_link":"../audio/g/ukgal__030.mp3","content":"Add to word list\nAdd to word list\n[ I ] to do something that involves risks that might result in loss of money or failure, hoping to get money or achieve success: gamble on Anyone who gambles on the stock exchange has to be prepared to lose money.\nC2 [ I or T ] to risk money, for example in a game or on a horse race: I like to gamble when I play cards - it makes it more interesting.gamble on He gambles on the horses (= horse races).gamble away He gambled away all of our savings.\nSMART Vocabulary: related words and phrases\nTaking risks\nadventurer\nall in\nbe skating on thin ice idiom\nbet the farm/ranch idiom\nbroke\ndare\nexpose\nhave/put your head on the block idiom\nhazard\nhigh wire\nhigh-stakes\nimperil\nlay\nput your neck on the line idiom\nre-expose\nrisk\nrun the risk of doing something idiom\nsail\nsail close to the wind idiom\nskate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGambling & bookmaking\nPhrasal verb\ngamble on something\nC2 a risk that might result in loss of money or failure: take a gamble Her publishers knew they were taking a gamble when they agreed to publish such an unusual novel.a gamble paid off It was a gamble using such an inexperienced director, but it paid off (= was successful).\nSMART Vocabulary: related words and phrases\nDangers and threats\nbalefully\nbaneful\nbanefully\nblack spot\nhang\nhang over something\nhazard\nhazardous\nhazardously\nnon-lethal\non/under pain of death idiom\nor else idiom\nparlous\nparlously\nsomeone's bark is worse than his/her bite idiom\nthreatening\nthreateningly\ntombstoning\ntreacherously\ntriple threat\nSee more results »\nAdd to word list\nAdd to word list\nto risk losing money in the hope of winning a lot more money, esp. if the result of a future event happens as you hope: [ I ] Some people like to gamble even though the odds are against them. [ M ] He gambled away most of his money.\nTo gamble is also to do something that you think is worth doing although it might not succeed or you might lose money: [ + that clause ] We’re gambling that enough people will show up at the concert to cover our expenses. gamble noun [ C usually sing ] us\nYour browser doesn't support HTML5 audio\n/ˈɡæm·bəl/\nStarting up a new business is always a gamble. gambling noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈɡæm·blɪŋ/\nGambling in the form of state lotteries is used to raise money for education.\nAdd to word list\nAdd to word list\nan action that involves risk but that could have a good result: Homebuyers who are willing to take a gamble that interest rates will stay low can get a mortgage at less than 3%. The gamble paid off and the President's reputation as a strong leader was enhanced. a big/huge/massive gamble\nto do something that involves risk and could fail but that you hope will succeed or make money: gamble on sth He gambled his political future on the success of the project.gamble with sth The President warned Republicans not to gamble with Medicare. Investors gambled that the US interest rate rise would be the last one this year. Large numbers are gambling on the house price boom - a gamble they may regret if prices fall or interest rates rise.\nto risk money, for example in a game or on a horse race: In the 2000s casinos began to spread, providing alternative places to gamble.\nPhrasal verb\ngamble sth away"}