{"id":161959,"name":"game","type":"noun","us_sound":"ɡeɪm","us_link":"../audio/g/game.mp3","uk_sound":"ɡeɪm","uk_link":"../audio/g/ukgambl004.mp3","content":"game noun\n(FUN ACTIVITY/SPORT)\nAdd to word list\nAdd to word list\nA1 [ C ] an entertaining activity or sport, especially one played by children, or the equipment needed for such an activity: a board game indoor/computer gamesgame of The children played a game of cops and robbers. I told the children to put their toys and games away.\nA2 [ C ] a particular competition, match, or occasion when people play a game: game of He invited me to play a game of chess/tennis/baseball.\n[ C ] one part of a competition in activities such as tennis: I won the first game, and then lost the next two. games [ plural ]\nUK (also physical education, PE) organized sports activities that children do at school: the games teacher\nan organized competition consisting of several different sports events: the Olympic/Commonwealth Games\nSee more\n[ U ] the way in which a person plays a particular sport: Susan is playing golf every day to try to improve her game.\n[ S ] something that is not treated seriously: Love is just a game to him.\nMore examplesFewer examplesAfter the game, the players were tired and demoralized.We need two dice to play the game.A painful injury forced her to withdraw from the game.At the end of the game, there was a surge of fans onto the field.Your jigsaw puzzles and games are all mixed up together in that box. Shall we sort them out?\nSMART Vocabulary: related words and phrases\nPastimes - general words\nactivity\namusement\navocation\navocational\navocationally\ncaper\nfrolic\nhobby\ninterest\nleisure\nnonprofessional\nnonprofessionally\npastime\npursuit\nrec\nrecreate\nrecreation\nrecreational\nrecreationist\nrelaxation\nYou can also find related words, phrases, and synonyms in the topics:\nCompetitions, & parts of competitions\nGeneral terms used in ball sports\nParts & stages of competitions\nSports & games generally\ngame noun\n(ACTIVITY)\n[ S ] informal an illegal or secret activity\n[ S ] old-fashioned informal a type of business activity: I'm in the stocks and shares game. on the game\nUK informal working as a prostitute: go on the game She went on the game to pay for her drug habit.\nUS informal involved in illegal activities: You know his whole family's on the game - they work with the mob!\nSee more\nSMART Vocabulary: related words and phrases\nCrime - general words\nanti-crime\nanti-fraud\nanti-narcotics\narrestable\ncaper\ncarrying-on\ndelinquently\ndriving under the influence\nDUI\nfelonious\nfeloniously\nillegality\noffence\noutrage\npetty crime\nprotection racket\nrap sheet\nwhite-collar crime\nwrongdoing\nzero tolerance\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBusiness - general words\ngame noun\n(ANIMALS)\n[ U ] wild animals and birds that are hunted for food or sport: game bird Her father taught her how to hunt game birds.\nSMART Vocabulary: related words and phrases\nHunting & fishing\nangler\nangling\nanti-hunt\nanti-hunter\nanti-hunting\nbarb\nfisher\nfishhook\nfishing line\nfishing rod\nfly fishing\noutcatch\noutfish\noverfishing\npiscatory\npoach\nquarry\nravening\nwhaler\nyoicks\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDucks, geese & game birds\nMeat - general words\nGrammar\nPlay or game?Play as a noun means ‘a piece of dramatic writing for the theatre or radio or television’: …\nPlayPlay as a noun means ‘a piece of dramatic writing for the theatre or radio or television’: …\nGameGame is a noun. We use it to talk about sports or other entertaining activities: …\nIdioms\nbe ahead of the game\nbe new to this game\nbe a game of two halves\ngame on!\ngame over\nin the game\nthe game is up\nthe games (that) people play\ngive the game away\nis the game worth the candle?\nMore idioms\nwhat's your game?\nwilling to do things that are new, difficult, or that involve risks: It was a difficult challenge, but Roberta was game.game for She's game for anything.\nSMART Vocabulary: related words and phrases\nReady and willing\nagreeable\namenable\nat someone's beck and call idiom\nat your command idiom\nbe chafing at the bit idiom\nbeck\ncommand\ndisposed\neager\neagerly\nfain\nfind it in your heart to do something idiom\nfinger\nkeen\npoised\nprepared\nraring\nreadily\nreadiness\nripe\nSee more results »\ngame verb\n(USE SYSTEM)\n[ T ] usually disapproving to use the rules of a system in order to get what you want, in a way that is slightly dishonest: game the system State education officials deny that they are gaming the system by making their tests easier. The gas company has gamed the market and figured out how to undermine competition. The problem with these precise rules is that they can be gamed.\nSMART Vocabulary: related words and phrases\nUsing and misusing\nadopt\nadoption\navail\navail yourself of something\nbe/go heavy on something idiom\nexhaust\ngo through\ngobble something up\nmake capital out of something idiom\nmax\nmax out\nspare\nspent\nswallow\ntap\nturn over\nturn to someone/something\nturn/use something to good account idiom\nunblock\nunderuse\nSee more results »\ngame verb\n(PLAY)\n[ I ] to play computer games: He spends most of his free time gaming. I don't plan to game on this laptop — I'll use it mainly for watching videos. Related word\ngaming\nSMART Vocabulary: related words and phrases\nMiscellaneous games & activities\nair hockey\nbeer pong\nbelly dancing\nboomerang\nbran tub\nbuildering\nChinese puzzle\njigsaw\njuggling\njump rope\nkeepy-uppy\nkorfball\nLARP\norigami\npinball\nstory mode\nsubworld\nsudoku\ntable football\ntabletop\nSee more results »\nPhrasal verb\ngame something out\ngame noun\n(ENTERTAINMENT)\nAdd to word list\nAdd to word list\n[ C ] an entertaining activity, esp. one played by children, or a sports competition: a baseball/basketball/football/soccer game The kids are playing a computer game. I told the children to put away their toys and games (= equipment for an entertaining activity). Search dogs do an important job, but it’s just a game to the dog (= something that is done for fun). Not telling the whole truth is one of the games that people play (= one of the ways in which they behave in order to get an advantage).\n[ C ] In some activities such as tennis, a game is one part of a competition: I’m ahead, 3 games to 2.\ngame noun\n(ANIMALS)\n[ U ] wild animals and birds that are hunted for food or sport: Deer and pheasant are types of game.\ngame adjective\n(WILLING)\nwilling to do something, esp something different, new, or slightly dangerous: The ocean water’s cold but I’m going in anyway – are you game?\nAdd to word list\nAdd to word list\na particular type of business activity: I'm in the stocks and shares game.\nbe ahead of the game\nto know more about what is happening in a particular area of business than the people or companies you are competing against: Our research and development program ensures that we're ahead of the game.\nbe new to the/this game informal\nto be involved in an activity or situation that you have not experienced before: The company is new to the political advertising game.\nthe game is up\nused to tell someone that you know what their secret activities or plans are and that they cannot continue: It is a characteristic of disgraced business leaders that they can never quite accept that the game is up. See also\nbusiness game\nconfidence game"}