{"id":162225,"name":"gangway","type":"noun","us_sound":"ˈɡæŋ.weɪ","us_link":"../audio/g/gangway.mp3","uk_sound":"ˈɡæŋ.weɪ","uk_link":"../audio/g/ukgambl030.mp3","content":"Add to word list\nAdd to word list\na passage between rows of seats, for example in a cinema or bus: His suitcase was blocking the gangway. The performers enter the arena dramatically via the gangways.\nPilyong Lee/iStock/Getty Images Plus/GettyImages\na board or passage that joins a ship, aircraft, or building to the land or to another building, for people to walk along: Visitors board the ship directly from shore via a long gangway. The room looked out onto a gangway between two buildings. Compare\ngangplank\nChristian Aslund/Lonely Planet Images/GettyImages\nMore examplesFewer examplesShe pointed to an empty seat at the end of a row near the gangway.I ran up a gangway and edged along behind the seats to reach him.They were welcomed as they exited the covered gangway connecting the plane to terminal.The gangway is 150 feet above the river at its highest.Work has not completed on pier-side elevators to move people on and off the ship, so passengers will have to climb a gangway to get on board.\nSMART Vocabulary: related words and phrases\nBuses, trams & coaches\nbus\nbus captain\nbus conductor\ncharabanc\ncoach\ncombi\ndouble-decker\nHOV\njitney\nkombi\nlimousine\nlocal\nminibus\nomnibus\nschool bus\nthrough\ntram\ntramlines\ntrolley\ntrolleybus\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParts of buildings: passages & entrance areas\nPhrases telling people to go away\nsomething you shout when you want people to move out of your way: There were cries of \"Gangway!\" as someone who had fainted in the crowd was being carried out. The hill is perfect for running or sledging down. Gangway!\nSMART Vocabulary: related words and phrases\nGeneral words for movement\nbetake\nbudge\nbudge up\ncirculate\ndad dancing\ngone\nkinetic\nkinetic energy\nkinetically\nlibration\nlocomotion\nmotion\nmove\npass\nround\nrove\nscoot\nseethe\nshove\nslip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: interjections\nAdd to word list\nAdd to word list\na passage for walking, esp. on a ship, or a gangplank\nused to ask people to move so that you can go past quickly"}