{"id":162303,"name":"gap","type":"noun","us_sound":"ɡæp","us_link":"../audio/g/gap.mp3","uk_sound":"ɡæp","uk_link":"../audio/g/ukganja008.mp3","content":"gap noun\n(HOLE)\nAdd to word list\nAdd to word list\nB1 [ C ] an empty space or opening in the middle of something or between two things: gap in The children squeezed through a gap in the wall.gap between She has a small gap between her front teeth. Compare\nbreach noun (OPENING) formal\nchink noun (CRACK)\ncleft\ncrack noun (NARROW SPACE)\ncranny\ncrevice\nfissure\ninterstice formal\nopening noun (HOLE)\nslit noun\nslot noun (LONG HOLE)\ncavity\nchamber (SPACE) specialized\nhole noun (SPACE)\nhollow noun\npocket noun (GROUP/AREA)\nspace noun (EMPTY PLACE)\nnamussi/E+/GettyImages\n[ C ] US in baseball, an area of ground betwen two outfielders (= players who stand in the part of the field that is the longest distance away from the player who tries to hit the ball): He drove the ball into the gap in right centre.\nin ice hockey, the amount of space between a player who is controlling the puck and a defending player: If you are a defender, it helps to keep the gap small so as to limit the places your opponent can go. McCall used the wide gap to his advantage and set up a powerful shot. gap in the market C2 [ C ]\nan opportunity for a product or service that does not already exist: There is a gap in the magazine market that needs to be filled.\nSee more\nMore examplesFewer examplesA ray of sunshine shone through a gap in the clouds.With a wriggle, she managed to crawl through the gap.A gap in the clouds revealed the Atlantic far below.He carefully nosed his lorry into the small gap.A gap between the curtains admitted the faint glimmer of a street lamp.\nSMART Vocabulary: related words and phrases\nHoles, hollows and dips\nanti-crack\naperture\nblistered\nchink\ncranny\ncratering\nescape hatch\ngouge\nhollow\nimprint\ninterstice\nladder\nleak\nleaky\nnook\nnooks and crannies idiom\npiercing\npinprick\nshaft\nvoid\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBaseball & rounders\nHockey\ngap noun\n(DIFFERENCE)\nB2 [ S ] a difference between two things: gap between The gap between rich and poor is still widening (= becoming greater).\nThesaurus: synonyms, antonyms, and examples\na differencedifferenceWhat's the difference between the two cars?distinctionThere's a clear distinction between the two countries' cultures.contrastI like the contrast of those red shoes with your black suit.discrepancyThere is some discrepancy between the two accounts.chasmThere is a widening chasm between public health officials and popular opinion.gulfPeace talks attempted to bridge the gulf between the two warring nations.\nSee more results »\nB2 [ C usually singular ] a period of time spent doing something different: gap of After a gap of five years, Jennifer decided to go back to work full-time.\nMore examplesFewer examplesThe government's change of policy is intended to reduce the gap between the haves and have-nots in our society.We must strive to narrow the gap between rich and poor.There exists nowadays a yawning gap between fashion and style.We must bridge the gap between labour and management.The report states that the gap between the rich and the poor has increased dramatically over the past decade.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanother\nanything\ndisparity\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nnon-uniform\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nvariant\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeriods of time - general words\nIdiom\nbridge a/the gap\nAdd to word list\nAdd to word list\nan empty space or opening in the middle of something or between two things: Picking up speed, she closed the gap between them. She has a gap between her front teeth.\nA gap can be a period in which something does not happen: After a gap of five years, Juanita decided to go back to work full-time.\nA gap can also be something lacking: Some people read to fill in gaps in their education.\nA gap can also be a difference between people: He was trying to bridge the gap between elders and youth, the middle class and poor.\nAdd to word list\nAdd to word list\na difference between two numbers, amounts, or levels: Forecasters are predicting a budget gap of nearly $17 bn next year. There is a $40 million shortfall in emergency aid, and the EU is increasing its donation to close the gap.\nsomething that is missing from a situation: close/fill gaps in sth The Bill aims to close gaps in existing law on fraud.growing/widening gap New federal projections for job openings this decade show a growing gap in the training and education required for workers.\na period in which something does not happen: Most see a gap between finishing education and starting work as a positive thing.\na difference between people or their situations: gap between sth and sth The gap between rich and poor is growing all the time.close/fill/widen the gap Excessive bonuses have only served to widen the gap between executives and other staff. We have nearly closed the math and science gender gap in education for girls. See also\ntrade gap\nwage gap\na gap in the market\nan opportunity to sell a product or service because a need or demand for it exists but no one is supplying it: Spotting a gap in the market, she decided to set up a clothes storage service.\nbridge a/the gap\nto make the difference between two things smaller: Financing was slow to come in and the city took out a bond to bridge the gap.bridge the gap between sth and sth The program helps working families bridge the gap between income and rent."}