{"id":162518,"name":"garnishee","type":"noun","us_sound":"ˌɡɑːr.nɪˈʃiː","us_link":"../audio/g/cdo0123usgarn0903.mp3","uk_sound":"ˌɡɑː.nɪˈʃiː","uk_link":"../audio/g/cdo0123ukgarn1074.mp3","content":"Add to word list\nAdd to word list\nsomeone who has an amount taken from their wages (= money paid to an employee every week) or bank account through a legal process, in order to pay back money they owe: A garnishment is a legal action that is filed against the garnishee. a garnishee order\nMore examplesFewer examplesThe plaintiffs replied by denying the garnishees' claims.This motion requested that writs be issued to several garnishees.Garnishment does not involve actual seizure of property which remains in the hands of the garnishee.\nSMART Vocabulary: related words and phrases\nBorrowing & lending\namortizable\namortization\nbad debt\nbonded\nborrow\nborrow something from something\ncredit limit\nforeclose\nhole\nliquidate\nliquidator\nloan\nnonaccrual\non the slate idiom\nover-borrowed\noverpay\noverpayment\npay down something\npay someone/something back\nreceivership\nSee more results »\nto take an amount from someone's wages (= money paid to an employee every week) or bank account through a legal process, in order to pay back money they owe: He had just received the news that his wages would be garnisheed to pay a tax debt. Synonym\ngarnish\nMore examplesFewer examplesCreditors may sue to seize or garnishee a debtor's bank accounts. The government will tell you how much you pay in child support and it can even garnishee your wages.The hospital has been criticized for its debt collection tactics, which include garnisheeing wages and filing lawsuits against patients.Tennessee allows up to 25% of a person's paycheck to be garnisheed.\nSMART Vocabulary: related words and phrases\nBorrowing & lending\namortizable\namortization\nbad debt\nbonded\nborrow\nborrow something from something\ncredit limit\nforeclose\nhole\nliquidate\nliquidator\nloan\nnonaccrual\non the slate idiom\nover-borrowed\noverpay\noverpayment\npay down something\npay someone/something back\nreceivership\nSee more results »\nAdd to word list\nAdd to word list\na company, person, etc. who is ordered by a court to garnish part of someone's income or property in order to pay a debt\n→\ngarnish"}