{"id":162620,"name":"gas","type":"noun","us_sound":"ɡæs","us_link":"../audio/g/gas.mp3","uk_sound":"ɡæs","uk_link":"../audio/g/ukgarne012.mp3","content":"gas noun\n(AIR SUBSTANCE)\nAdd to word list\nAdd to word list\nB2 [ C or U ] a substance in a form like air that is neither solid nor liquid: Oxygen, hydrogen, and nitrogen are all gases. poisonous/inflammable/toxic gas\nA2 [ C or U ] a substance in a form like air that is used as a fuel for heating and cooking: Do you prefer cooking with electricity or gas?gas main UK A leak in the gas mains (= pipes) caused a major explosion.gas-fired Carbon capture is used to make coal and gas-fired power stations much less polluting.\n[ U ] informal a substance in a form like air used for medical purposes to prevent people feeling pain or being conscious during an operation: I had/was given gas when I had my wisdom teeth taken out.\n[ U ] mainly US (UK wind) air in the bowels or in a baby's stomach, especially when this makes you feel uncomfortable or makes noises: Beer gives me gas.\nMore examplesFewer examplesThe initial cloud of tear gas had hardly cleared before shots were fired.Carbon monoxide is a colourless, odourless, poisonous gas.Certain gases are highly explosive.These factories are releasing toxic gases into the atmosphere.The volcano spewed a giant cloud of ash, dust and gases into the air.\nSMART Vocabulary: related words and phrases\nPhysics: the state of matter\nabsorbency\nacidic\nallotropic\nallotropy\ncompressible\ncrystalline\ne-liquid\nfluidity\nimpervious\nmelted\npolyunsaturated\npowdered\nrarefy\nreflective\nrustily\nscaly\nself-healing\nsloppily\nsloppiness\nsloppy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFuels\nMedical treatment: surgery\nMedicine in different forms\nDigestive disorders\ngas noun\n(LIQUID FUEL)\nA2 [ U ] US (also formal gasoline); (UK petrol) a liquid obtained from petroleum, used especially as a fuel for cars, aircraft, and other vehicles: I'll stop and get some gas - we're running low. a gas tank/pump the gas [ S ] mainly US\nthe part of a car that you push with your foot to make it go faster: I remember taking my foot off the gas and gripping the steering wheel.\nMore examplesFewer examplesHe stopped the car next to the gas pump.It's 50 miles to the next gas station.I rent a subcompact when I'm travelling alone because it saves on gas.We ought to fill up with gas before we set off.My foot slipped off the gas pedal as I was trying to overtake the lorry.\nSMART Vocabulary: related words and phrases\nPetroleum products especially when used as fuel\nantiknock\nantiknocking\nderv\ndiesel\ngasohol\nhexane\nhigh-octane\njuice\nleaded\nmineral oil\nnon-leaded\noil\nparaffin\npetrochemical\npetrol\npetroleum\npetroleum jelly\npetroleum-based\npropane\nunleaded\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe interior of vehicles\ngas noun\n(ENJOYABLE SITUATION)\n[ S ] mainly US informal old-fashioned a funny or enjoyable situation: a gas Some kids put on a show for the moms and dads, - it was a gas.\nSMART Vocabulary: related words and phrases\nGeneral words for fun\namusement\ncrack\ncraic\nfling\nfun\ngiggle\nhoopla\nhorseplay\njollification\njollity\nlaugh\nlolz\nmerriment\nplay\nriot\nrough\nrough and tumble idiom\nsesh\nsport\nwhimsy\ngas noun\n(BASEBALL)\n[ U ] US informal In baseball, if a pitcher throws gas, they throw the ball very fast: throw gas Even at the age of 40, he could still throw gas.\nSMART Vocabulary: related words and phrases\nBaseball & rounders\naround the horn idiom\nbag\nball\nballgame\nballplayer\nbase hit\nbases\nbeat\nbottom\nchopper\nflare\nfoul\nglove\nhomer\nsafe\nsecond base\nshag\nshortstop\nslider\nthe World Series\nSee more results »\nIdioms\nstep on the gas\ntake your foot off the gas\ngas verb\n(POISON)\n[ T ] to kill or injure a person by making them breathe poisonous gas: Hundreds of thousands of soldiers were gassed in the First World War.\nSMART Vocabulary: related words and phrases\nMurder & attempted murder\nasphyxiation\nassassinate\nassassination\nassassination attempt\nattempt\nbutcher\ndrive-by\ngenocidal\ngenocide\ngun someone down\nholocaust\nhomicide\npolish\npolish something off\npop off\nput someone to the sword idiom\nregicide\nslaughter\nsmother\nsnuff\nSee more results »\ngas verb\n(TALK)\n[ I ] old-fashioned informal to talk for a long time about things that are not important: Susan came round and we sat gassing for hours.\nSMART Vocabulary: related words and phrases\nInformal talking & conversation\na problem shared is a problem halved idiom\nbanter\nbantering\nbanteringly\nbants\nbloviate\nbull session\nbuzz\ncatch\nconversation\nconversational\nexchange\ngambit\nintercourse\npass\nput the world to rights idiom\ntake/lead someone on/to one side idiom\ntalk some sense into sb idiom\ntête-à-tête\nultra-casual\nSee more results »\nPhrasal verb\ngas (something) up\ngas noun\n(MATTER)\nAdd to word list\nAdd to word list\n[ C/U ]\n&#160; science a form of matter that is neither solid nor liquid and can increase in size to fill any container\n[ C/U ]\n&#160; science Gas is also the usual word used to talk about natural gas.\n[ C/U ] Gas is also the feeling that you sometimes get after eating a lot and the air such eating produces in your stomach.\ngas noun\n(LIQUID FUEL)\n[ U ] (also gasoline, us/ˈɡæs·əˌlin, ˌ==ˈ=/) a liquid obtained from petroleum (= dark, thick oil), used esp. as a fuel for cars and other vehicles: We’re running low on gas.\ngas verb [T]\n(BREATHE MATTER)\nto kill or injure people or animals by making them breathe poisonous gas: Hundreds of thousands of soldiers were gassed in World War I.\nPhrasal verb\ngas up (something)\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; ENVIRONMENT a substance in a form like air that is neither solid nor liquid: Oxygen, hydrogen and nitrogen are all gases. All EU countries are required to cut their emissions of greenhouse gases.\n[ U ]\n&#160; NATURAL RESOURCES, TRANSPORT\n&#160; ( US also gasoline); ( UK petrol) a liquid obtained from petroleum, used especially as fuel for cars and other vehicles: It was getting late and we were nearly out of gas. The price of gas seems to be getting higher and higher. See also\ngreenhouse gas\nnatural gas"}