{"id":162677,"name":"gaslight","type":"noun","us_sound":"ˈɡæs.laɪt","us_link":"../audio/g/eus71979.mp3","uk_sound":"ˈɡæs.laɪt","uk_link":"../audio/g/ukgarne019.mp3","content":"Add to word list\nAdd to word list\na light that uses gas as fuel, or the light that is produced by this: He looked over the street, where the gaslights were being lighted. In my childhood, all my winter reading was done by gaslight.\nKenWiedemann/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesShe paused beneath the gaslight to catch her breath.How did they live with just three taps and no gaslight and just a toilet in the yard?Here the play of shadow and gaslight is tweaked by touches of white chalk.\nSMART Vocabulary: related words and phrases\nLighting & light fittings in the home\ncandelabra\ncandle\ncandlestick\ncandlewick\nchandelier\nhead torch\nheadlamp\nhurricane lamp\nlamp\nlampshade\nnightlight\npenlight\npillar candle\nrope light\nSAD lamp\ntaper\ntea light\ntiki torch\nunlit\nuplighter\nSee more results »\nto trick or control someone by making them believe that their memories or beliefs about something are wrong, especially by suggesting that they may be mentally ill: She had no memory of the incident and thought he was trying to gaslight her. Are you trying to tell me I've been gaslighted for the past 6 months?\nMore examplesFewer examplesI feel like I'm being gaslighted.We won't let him gaslight us into believing his version of that day.He was able to gaslight Anthony to the point where he was willing to kill James.\nSMART Vocabulary: related words and phrases\nInsults & abuse\nabusive\nabusively\nbackhanded compliment\nbrickbat\ncontumely\ncut (someone) to the quick idiom\ndenigration\ndis\njeer\nleft-handed compliment\nmouth\nneg\nnegging\npoint-scoring\nput something/someone down\nrevile\nscore points off someone idiom\nsledging\nslight\nstick\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAssertions & asserting\nRelated word\ngaslighting"}