{"id":163009,"name":"gate","type":"noun","us_sound":"ɡeɪt","us_link":"../audio/g/gait.mp3","uk_sound":"ɡeɪt","uk_link":"../audio/g/ukfya__029.mp3","content":"gate noun [C]\n(STRUCTURE)\nAdd to word list\nAdd to word list\nA2 a part of a fence or outside wall that is fixed at one side and opens and closes like a door, usually made of metal or wooden strips\nSarah Robertson; imagebearersphotography.com/Moment/GettyImages\na similar device that slides across an opening, often folding into a smaller space as it is opened: The lift won't move if the safety gate isn't shut properly.\nB1 a part of an airport where travellers are allowed to get on or off a particular aircraft: All passengers for flight LH103 please proceed to gate 16.\nItnok/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesThe paths all converge at the main gate of the park.The sign on the gate said 'Private Property - No Admittance.'Passengers for Madrid should proceed to gate 26 for boarding.Please shut the gate.An angry crowd surged through the gates of the president's palace.\nSMART Vocabulary: related words and phrases\nParts of buildings: doors & parts of doors\narchitrave\nback door\nbell push\nbi-fold\ncat flap\ndoorstop\ndoorway\ndraught excluder\nentryway\nfire door\nknocker\nlintel\npurging\nrevolving door\nsafety gate\nscreen door\ntrapdoor\nturnstile\nup-and-over\nweatherboarding\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAir travel: airports & landing strips\ngate noun [C]\n(PEOPLE)\nUK informal the number of people that go to see a sports event or other large event, or the amount of money people pay to see it: Gates at matches were lower than average last season.\nSMART Vocabulary: related words and phrases\nSpectators & commentators at sports events\ncheerleader\ncolor commentary\ncolor commentator\ncommentator\nfight song\ngroundhopper\ngroundhopping\nMexican wave\npitch invasion\npress box\nscout\nsecondary ticketing\nspectate\nspectator\nspectator sport\nsupporter\ntailgate\ntwelfth man\nwave\nused in combination with other nouns to create a name for a situation that causes public shock or disapproval: a political scandal known as \"furgate\", in which high-ranking government officials were given expensive coats\nAdd to word list\nAdd to word list\na section of a fence or outer wall that can swing open to let you through: I pushed open the gate and went into the backyard.\nA gate is also the door at an airport that you go through to get on an aircraft: All passengers for flight 103 please proceed to gate D4.\nAdd to word list\nAdd to word list\n[ C ]\n&#160; TRANSPORT a part of an airport where travellers are allowed to get on or off an aircraft: Our MD-80 left at 8:14 p.m. from Gate C33. Delays that are caused by gate agents are assigned to customer service.\n[ C or U ]\n&#160; COMMERCE the number of people that go to see a large event, or the amount of money people pay to see it: The gate for the event was a reported $2.6 million."}