{"id":163046,"name":"gather","type":"verb","us_sound":"ˈɡæð.ɚ","us_link":"../audio/g/gather.mp3","uk_sound":"ˈɡæð.ər","uk_link":"../audio/g/ukgastr013.mp3","content":"gather verb\n(COLLECT)\nAdd to word list\nAdd to word list\nB2 [ T ] to collect several things, often from different places or people: I went to several libraries to gather information about the plans. We gathered blueberries from the bushes.gather up She gathered up the newspapers that were scattered around the floor.gather something together We gathered our things together and left quickly.\n[ T + adv/prep ] to put your arms around someone and hold or carry them in a careful or loving way: gather someone in something He gathered her in his arms and kissed her. She gathered the children up and hurried into the house. gather speed, strength, momentum, etc.\nC1 to become faster, stronger, etc.: The bicycle gathered speed as it went down the hill.\nSee more gather (up) strength/courage\nto prepare to make a great effort to be strong or brave: I spent a week gathering the courage to say no.\nSee more gather yourself\nto make yourself feel calm again, or ready to do something, especially after a shock or before something difficult that you have to do: After the loud pop and the pain and the scream, he gathered himself enough to look down at his injured foot. She gathered herself and stood up, ready to face the audience.\nMore examplesFewer examplesI'll just gather my things together and then we can go.He gathered some wood to build a fire.On a clear, straight road you can gather speed.The contest for deputy leadership of the party is gathering speed.The encyclopedia sits on my shelf at home, gathering dust.\nSMART Vocabulary: related words and phrases\nCollecting and amassing\naccumulate\nagglomerate\naggregation\namass\nassemble\ncompile\ncompiler\ncompletism\ncompletist\ncompost\nconcentrate\ncumulate\nfundraise\nfundraising\nharvest\nput something together\nrake something up\nreassemble\nreconcentrate\nreconcentration\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShowing affection\nCorrecting and mending\nTrying and making an effort\ngather verb\n(COME TOGETHER)\nB2 [ I ] When people or animals gather, they come together in a group: A crowd had gathered to hear her speak.gather round Gather round, children, and I'll tell you a story.\n[ I ] literary to get thicker and closer: clouds gather Storm clouds were gathering.\nMore examplesFewer examplesProtestors gathered outside the court to await the verdict.An audience gathered to hear him speak.At 6:30, everyone gathered for drinks and appetizers in the lounge.A crowd had gathered around the scene of the accident.Hundreds gathered to await the boxer's arrival at the airport.\nSMART Vocabulary: related words and phrases\nForming groups (of people)\nalienated\nbe ranged against/with something/someone\nclass reunion\ncluster\nconvene\ncrowd\ncrowd around (someone/something)\nfederalization\nflock\nform\nget together\nrally\nrange\nregather\nregroup\nreunion\nround\nround something/someone up\nthe assembled company\nthrong\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCollecting and amassing\ngather verb\n(UNDERSTAND)\nC1 [ T ] to understand or believe something as a result of something that has been said or done: Harry loves his new job, I gather. From what I can gather, they're old school friends.\nSMART Vocabulary: related words and phrases\nConcluding and deducing\nanalysis\ndeduce\ndeducible\ndeductive\ndeductively\ndiagnosis\ndraw\nhypothetico-deductive\nimply\nimpute something to someone\nin the last/final analysis idiom\ninconclusively\ninduction\ninductive\nmaths\nnon-deductive\nperceive\nput something down to something\nput two and two together and make five idiom\nput two and two together idiom\nSee more results »\ngather verb\n(CLOTH)\n[ T ] to pull cloth into small folds by sewing a thread through it and then pulling the thread tight: a gathered skirt\n[ T ] If you gather a piece of clothing or loose cloth around yourself, you pull it close to your body: gather something around someone She shivered, and gathered the blanket around her.\nSMART Vocabulary: related words and phrases\nKnitting & sewing\nappliqué\nappliquéd\nAran\nBargello\nbaste\nbind\nhandknitted\nhank\nhem\nintarsia\nknit\nresew\nrib\nrun something up\nrunning stitch\nsampler\nseamstress\nselvedge\nsew\nstitch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnclosing, surrounding and immersing\nSee also\ngather your thoughts\ngather your witsIdiom\ngather dust\na small fold that has been sewn into cloth: a skirt with gathers at the back\nSMART Vocabulary: related words and phrases\nStyle & appearance of clothes\naesthetic\nalterable\nanti-fur\nAran\nbackless\nfloor-length\nflouncy\nfoppishly\nform-fitting\nFrench tuck\nribbed\nribby\nruche\nruched\nruck (something) up\nvoop neck\nwaisted\nwashable\nwasp waist\nwasp-waisted\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParts of clothes\ngather verb\n(COLLECT)\nAdd to word list\nAdd to word list\n[ T ] us\nYour browser doesn't support HTML5 audio\n/ˈɡæð·ər/ to collect or obtain things, esp. from different places: I went to several libraries to gather information. We gathered blackberries from the nearby fields. gathers momentum/speed\nIf something gathers momentum/speed, it gradually becomes faster or stronger: Pressure for reform of the health-care system is gathering momentum.\ngather verb\n(COME TOGETHER)\n[ I ] us\nYour browser doesn't support HTML5 audio\n/ˈɡæð·ər/ (of people or animals) to come together in a group: A crowd gathered to hear her speak.\ngather verb\n(UNDERSTAND)\nfml us\nYour browser doesn't support HTML5 audio\n/ˈɡæð·ər/ to understand or believe something as a result of something that has been said or done: [ + (that) clause ] From the look on their faces, she gathered (that) they were annoyed with her.\nIdiom\ngather dust"}