{"id":161274,"name":"gay","type":"adjective","us_sound":"ɡeɪ","us_link":"../audio/g/gay.mp3","uk_sound":"ɡeɪ","uk_link":"../audio/g/ukgavot007.mp3","content":"gay adjective\n(SEXUALITY)\nAdd to word list\nAdd to word list\nB1 sexually or romantically attracted to people of the same gender and not to people of a different gender: My aunt is gay. Mark knew he was gay by the time he was fourteen. Synonym\nhomosexual See also\nlesbian adjectiveCompare\nasexual adjective\nbisexual adjective\nstraight adjective (SEXUALITY) informal\npansexual adjective\nbelonging or relating to gay people and sometimes queer people (= people who do not fit a society's traditional ideas about gender or sexuality): the gay and lesbian community gay rights We went to a gay bar.\nused to describe activities that gay people do that in the past have been done mainly by straight people and which may not be allowed by an area's laws: The Courts have ruled that gay adoption (= adoption of a child by a gay person or a gay couple) is legal. He believes strongly in gay marriage. See also\nsame-sex\nMore examplesFewer examplesI believe that gay weddings should be legal.Her speech caused outrage among the gay community.Don't let his sister know he's gay, because he hasn't come out to his family yet.Gay rights organizations estimate that about 50,000 gay men and women live in the city.His calls for social justice have made him a gay icon and a beloved social media presence.\ngay adjective\n(HAPPY)\nold-fashioned happy: We had a gay old time down at the dance hall.\nold-fashioned If a place is gay, it is bright and attractive: The streets were gay and full of people.\nSMART Vocabulary: related words and phrases\nFeeling pleasure and happiness\n(as) pleased as Punch idiom\nASMR\nbe dancing in the streets idiom\nbe floating on air idiom\nbe full of the joys of spring idiom\nchipper\nchirpily\nchirpy\nchuffed\ncontented\nhappily\nhappy camper\nhappy place idiom\njaunty\njocund\nshining\nsunnily\nswooning\nswooningly\nswoony\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAttractive\ngay adjective\n(BAD QUALITY)\nslang offensive an offensive word to describe something that is not good, reasonable, or suitable\nRelated word\ngayness\na gay person, especially a man Compare\nhomosexual noun formal old-fashionedNote: This word is usually considered offensive when used as a noun.\ngay adjective\n(HOMOSEXUAL)\nAdd to word list\nAdd to word list\nhomosexual: gay rights Note: Sometimes gay refers only to men.\ngay adjective\n(HAPPY)\n[ -er/-est only ] dated (of a person) happy, or (of a place) bright and attractive: Her gay, lively personality made her attractive to everyone who knew her. gay noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ɡeɪ/\nThe law banned discrimination against gays."}