{"id":163282,"name":"gazette","type":"noun","us_sound":"ɡəˈzet","us_link":"../audio/g/gazette.mp3","uk_sound":"ɡəˈzet","uk_link":"../audio/g/ukgavot015.mp3","content":"Add to word list\nAdd to word list\nold-fashioned a newspaper\nused in the titles of some newspapers and magazines: the Montreal Gazette\nSMART Vocabulary: related words and phrases\nNewspapers & magazines\nabove/below the fold idiom\nannal\nanti-press\nback copy\nbroadsheet\ncomic\neditorial\nfold\nhouse journal\nhouse organ\njournal\nlad mag\nmagazine\norgan\nreader\nsentinel\nserialize\nSunday paper\nsupermarket tabloid\ntabloid\nSee more results »\nmainly UK to announce or publish something in an official list or record: The site was settled in 1863 as a livestock station, proclaimed a town in 1880, and gazetted a borough in 1885. There were campaigns to conserve the forest, wetlands and volcanic areas by gazetting them as national parks.\nUK to officially announce that someone has been given a military rank or honour: Two years later, my father was gazetted a Second Lieutenant in the King's Liverpool Regiment. In 1945 he was gazetted with the award of the Military Cross for gallantry.\nMore examplesFewer examplesAt the end of that year the park became the first in Indonesia to be gazetted, which means its boundaries were officially recognized.We intend to bring legislation to parliament that will see all tax incentives granted to investors gazetted and publicly notified.Business leaders had hoped that the prolonged delay in gazetting the legislation meant that the government had had second thoughts.He wore the white ribbon of the Polar Medal, gazetted in 1939 for his service on the British Graham Land Expedition.\nSMART Vocabulary: related words and phrases\nAnnouncing, informing & stating\nacquaint someone/yourself with something\nannunciation\napprise someone of something\navowedly\nawaken someone to something\nbreak\nbreathe/say a word idiom\ndisseminate\nimpart\nknown\non the record idiom\npass\nproclamation\npropagate\nput something out\nput something out of its misery idiom\nrapporteur\nreportable\nresensitize\nstatement\nSee more results »\nAdd to word list\nAdd to word list\n(used only in the titles of newspapers) a newspaper: the Montreal Gazette\nAdd to word list\nAdd to word list\na newspaper published by an official organization: Government sources say the list will be published in the official gazette within seven days.\nused in the titles of some newspapers and magazines: the Montreal Gazette"}