{"id":163321,"name":"gear","type":"noun","us_sound":"ɡɪr","us_link":"../audio/g/gear.mp3","uk_sound":"ɡɪər","uk_link":"../audio/g/ukgavot026.mp3","content":"gear noun\n(ENGINE PART)\nAdd to word list\nAdd to word list\nB2 [ C or U ] a device, often consisting of connecting sets of wheels with teeth (= points) around the edge, that controls how much power from an engine goes to the moving parts of a machine: Does your car have five or six gears? I couldn't find reverse gear.in gear The car should be in gear (= with its gears in position, allowing the vehicle to move). When you start a car you need to be in first (US also low) gear.figurative After a slow start, the leadership campaign suddenly shifted into top gear (= started to advance very quickly). See also\nlow gear\nMore examplesFewer examplesPush the clutch in, put the car into gear, rev the engine and then gently let the clutch out.To go backwards, you must put the car into reverse gear.The car's gears aren't meshing properly.In cars that are automatics, you don't have to bother with shifting gears.It's no good - these gears are shot.\nSMART Vocabulary: related words and phrases\nThe engine & engine parts\nair filter\nalternator\nanti-roll\nantifreeze\nbiting point\nbrake\ncam\ncarburation\ncarburettor\nchoke\ndisc brake\ndistributor\ninternal combustion engine\nmanual transmission\nmuffler\nneutral\nsuspension\ntailpipe\ntappet\nwater-cooled\nSee more results »\ngear noun\n(CLOTHES/EQUIPMENT)\nB2 [ U ] UK the equipment, clothes, etc. that you use to do a particular activity: fishing/camping gearriot gear Police in riot gear (= protective clothing) arrived to control the protesters. Synonyms\naccoutrements formal\napparatus (EQUIPMENT)\nequipment\ngadgetry\ntackle (EQUIPMENT)Compare\nappurtenance formalSee also\nheadgear\nB2 informal clothes: She wears all the latest gear. Synonyms\napparel\nattire formal\nclobber UK informal\nclothes\ndress\ngarb literary\nthreads informal old-fashioned\ntogs UK informal\nwear (CLOTHES)\nMore examplesFewer examplesPolice in riot gear were called in to quell the unrest.Everyone else was in jeans and casual gear and I had my office clothes on - I stuck out like a sore thumb.We got ourselves togged up in walking gear for the hike.A shop selling bondage gear has opened on the high street.Police in riot gear lined up at the end of the street.\nSMART Vocabulary: related words and phrases\nThings needed for a task\naccoutrements\napparatus\narmoury\ncould use something idiom\nequipment\ngadgetry\nkit\nmaterial\nmatériel\nnecessaries\nparaphernalia\nstock-in-trade\ntackle\nthing\ntool\ntool (something/someone) up\nuse\nYou can also find related words, phrases, and synonyms in the topics:\nSportswear & swimwear\nClothing - general words\ngear noun\n(DRUGS)\n[ U ] UK slang drugs: The traffickers knew that there would always be someone willing to move the gear.\nSMART Vocabulary: related words and phrases\nDrugs - general words\nabstinence\nabstinence-only\nbindle\nbiosimilar\nchase\nmultidrug\nnon-intoxicant\nnon-intoxicating\nnondrug\npeddler\nperformance-enhancing\npill-popping\nsolvent abuse\nspike\nspliff\nsubstance\nsubstance abuse\nwasted\nwhacked\nwiped out\nSee more results »\nSee also\ngrind someone's gears informalIdioms\nbe in/go into high gear\nchange/shift/switch gear\nstep/move up a gear\ngear noun\n(MACHINE PART)\nAdd to word list\nAdd to word list\n(in a machine) a wheel having pointed parts around the edge that come together with similar parts of other wheels to control how much power from an engine goes to the moving parts of a machine\nIn a vehicle, a gear is any of several limited ranges of power that are used for different speeds: [ U ] Use second gear going up a steep hill.\ngear noun\n(EQUIPMENT)\n[ U ] equipment or clothes used for a particular activity: camping gear\ngear verb [always + adv/prep]\n(MAKE READY)\nto make something ready or suitable for a particular purpose: [ T ] Our program is geared to the needs of children.\nPhrasal verb\ngear up\nAdd to word list\nAdd to word list\na system or piece of equipment: A good place to connect with other consumers is Epinions.com, which posts reviews on all sorts of gadgets and gear. computer/electronic/networking gear\nequipment or clothes that are used for a particular activity: The workers said they received no protective gear or warnings about the dangers of asbestos.\ninformal the speed at which something happens or is done: After a slow start, the leadership campaign suddenly shifted into gear. high/low/top gear\nmove/step up a gear UK informal\nto start to do something better or faster: The price war stepped up a gear yesterday when two major chains announced they were cutting the cost of petrol."}