{"id":163704,"name":"gender","type":"noun","us_sound":"ˈdʒen.dɚ","us_link":"../audio/g/gender.mp3","uk_sound":"ˈdʒen.dər","uk_link":"../audio/g/ukgecko021.mp3","content":"gender noun\n(PEOPLE)\nAdd to word list\nAdd to word list\nB2 [ C or U ] a group of people in a society who share particular qualities or ways of behaving which that society associates with being male, female, or another identity: I think all genders are able to care for children equally.gender stereotype Those old films are full of racial and gender stereotypes.gender bias Their goal is to eliminate gender bias in access to sports for children. Germany's top court has ruled that parliament must legally recognize a third gender.gender equality Our lab is committed to gender equality in the sciences and promotes men and women to senior positions in equal numbers. \"The gender that you identify with isn't always the same as your biological sex,\" he explained. There can be a lot of physical variation within one gender as well as between genders. Compare\nsex noun (MALE/FEMALE)\n[ U ] the condition of being a member of a group of people in a society who share particular qualities or ways of behaving which that society associates with being male, female, or another identity: Discrimination on the basis of race, gender, age or disability is not allowed. She felt that her destiny had been shaped by her gender. The sample of people questioned was drawn from the university's student register and grouped by age and gender. I could not fill out the form as I am non-binary and my gender was not listed among the options given. Compare\nsex noun (MALE/FEMALE)See also\ngender expression\n[ U ] used to refer to the condition of being physically male, female, or intersex (= having a body that has both male and female characteristics): Does this test show the gender of the baby? Forensic scientists can tell the gender of the victim from the skeleton. Synonym\nsex (MALE/FEMALE)Note: Some people prefer to use the word \"sex\" when talking about the physical condition of being male, female, or intersex, and prefer to use the word \"gender\" only when talking about someone's identity and the group they belong to in society.\nMore examplesFewer examplesMale actors were used to play characters of both genders.There is an even gender ratio within the company.\ngender noun\n(GRAMMAR)\nB2 [ C ]\n&#160; language\n&#160; specialized the grammatical arrangement of nouns, pronouns and adjectives into masculine, feminine, and neuter types in some languages\nExamples\nGender, of course, isn't an issue in the English language.I so often get the gender wrong when I'm trying to speak French.\nSMART Vocabulary: related words and phrases\nLinguistics: grammatical terms\nablative\napposition\nappositive\nappositively\nattributively\ncollocate\nconcord\ndative\nfeminine\ngenitive\ninflected\nnominal\npost-modifier\npostposition\npostpositional\npostpositive\npostpositively\nquantifier\nsingular\nsyntax\nSee more results »\nGrammar\nNouns and genderMost English nouns do not have grammatical gender. Nouns referring to people do not have separate forms for men (male form) and women (female form). However, some nouns traditionally had different forms. Nowadays, people usually prefer more neutral forms. …\nGenderSome languages mark words according to whether they are masculine, feminine or neuter. In English, we do not commonly mark nouns according to gender. …\nto give someone or something a particular gender, or to think of something as belonging to a particular gender: Children don't usually gender their toys until they see adults doing it. Increasing numbers of young people are choosing to gender themselves, and playing with gender can be fun. I do not see why we need to gender babies' clothes.\ngender noun [C/U]\n(SEX)\nAdd to word list\nAdd to word list\nthe male or female sex, or the state of being either male or female: [ U ] Discrimination on the basis of gender is not allowed.\ngender noun [C/U]\n(GRAMMAR)\ngrammar the divisions, usually masculine, feminine, and neuter, into which nouns are separated in some languages: [ C ] French has two genders and German has three.\nAdd to word list\nAdd to word list\nthe condition of being either male or female: Polls show that Americans are willing to elect a woman president, suggesting that gender alone may no longer be a stumbling block."}