{"id":163779,"name":"generate","type":"verb","us_sound":"ˈdʒen.ə.reɪt","us_link":"../audio/g/generate.mp3","uk_sound":"ˈdʒen.ə.reɪt","uk_link":"../audio/g/ukgener007.mp3","content":"generate verb [T]\n(CREATE)\nAdd to word list\nAdd to word list\nB2 to cause something to exist: generate interest/excitement Her latest film has generated a lot of interest/excitement. The new development will generate 1,500 new jobs.generate revenue/income Selling food will increase the club's ability to generate revenue/income.\nMore examplesFewer examplesThe proposed tidal barrage would generate enough electricity to supply between 60,000 and 80,000 homes.The ecological effects of the factory need to be balanced against the employment it generates.The publicity generated by the court case has given a welcome boost to our sales.Her latest film has generated a lot of interest.Surveyors say the fault line is capable of generating a major earthquake once in a hundred years.\nSMART Vocabulary: related words and phrases\nCreating and producing\nanti-creative\nartefact\nattribute\nattribute something to someone\nbang something out\nbash\ncrank\ngenerative\ngenerativity\ngrind something out\nhandmade\nknock\nremake\nrig\nrig something up\nroll (something) out\nrollout\nrun something up\nspin\nyield\nSee more results »\ngenerate verb [T]\n(MAKE ENERGY)\nB2 to produce energy in a particular form: generate electricity/power The wind farm may be able to generate enough electricity/power for 2,000 homes.\nSMART Vocabulary: related words and phrases\nCreating and producing\nanti-creative\nartefact\nattribute\nattribute something to someone\nbang something out\nbash\ncrank\ngenerative\ngenerativity\ngrind something out\nhandmade\nknock\nremake\nrig\nrig something up\nroll (something) out\nrollout\nrun something up\nspin\nyield\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nElectricity & electronics\nAdd to word list\nAdd to word list\nto cause to exist; produce: The new construction project will generate 500 new jobs. Her latest book has generated a lot of excitement. The power plant generates electricity for the eastern part of the state.\nAdd to word list\nAdd to word list\nto produce or create something such as a profits, sales, or jobs: The current recovery has so far generated far fewer high-paying jobs than the last boom.generate cash/income/revenue These measures will increase the firm's ability to generate income.\nNATURAL RESOURCES to produce energy: generate electricity/power The wind farm may be able to generate enough power for 2000 homes."}