{"id":163795,"name":"generic","type":"adjective","us_sound":"dʒəˈner.ɪk","us_link":"../audio/g/generic.mp3","uk_sound":"dʒəˈner.ɪk","uk_link":"../audio/g/ukgener011.mp3","content":"Add to word list\nAdd to word list\nformal shared by, typical of, or relating to a whole group of similar things, rather than to any particular thing: The new range of engines all had a generic problem with their fan blades.\ngeneric drugs or other products do not have a trademark and are sold without the name of the company that produced them\nSMART Vocabulary: related words and phrases\nTypifying, illustrating and exemplifying\nanalogy\narchetypal\narchetypically\nbe someone all over idiom\nbetoken\ninstantiate\nmirror\nMr\nMrs\non-brand\nsum\nsum (something/someone) up\nsummation\nsymbolic\nsymbolization\nsymbolize\nsymptom\nterritory\ntoken\ntranslate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProducts & producers\na product, especially a drug, that is no longer owned or legally controlled by a particular company: The biggest difference between the brand-name drugs and the generics is price.\nSMART Vocabulary: related words and phrases\nProducts & producers\nanti-dumping\nbadging\nbegetter\nbig pharma\nbig tobacco\ndeliverable\ndry goods\nend product\nfabricator\ngeneral-purpose\ngenerator\nhaul\nmarque\nmover\nmulti-product\nnon-proprietary\nnotion\noutput\noverstock\nspecialize\nSee more results »\nAdd to word list\nAdd to word list\nrelating to or shared by a whole group of similar things; not specific to any particular thing: Jazz is a generic term for a wide range of different styles of music.\nGeneric also means not having a trademark: a generic drug\na product, esp. a drug, that is no longer owned or legally controlled by a particular company: The biggest difference between the brand-name drugs and the generics is price.\nAdd to word list\nAdd to word list\nshared by, typical of, or relating to a whole group of similar things, rather than to any particular thing: The new range of engines all had a generic problem with their fan blades.\nMARKETING generic products do not have a brand name and do not legally belong to a particular company, so any company can manufacture them: The study found large variations in quality for both brand-name and generic drugs.generic equivalents/versions Generic versions of the drugs would surely be cheaper. generic goods/medications/products Compare\nproprietary"}