{"id":163772,"name":"generally","type":"adverb","us_sound":"ˈdʒen.ə r.əl.i","us_link":"../audio/g/generally.mp3","uk_sound":"ˈdʒen.ə r.əl.i","uk_link":"../audio/g/ukgener006.mp3","content":"Add to word list\nAdd to word list\nB2 considering the whole of someone or something, and not just a particular part of him, her, or it: Your health is generally good, but you do have a few minor problems. He wants more money to be given to the arts generally. I shall now develop my previous point more generally (= to say more about what it includes).\nB1 usually, or in most situations: The baby generally wakes up three times during the night.generally speaking Well, generally speaking (= in most situations), it's quicker on public transport.\nB2 by most people, or to most people: It was generally believed at the time that both men were guilty. The proposal has received a generally favourable reaction.\nMore examplesFewer examplesLack of experience will generally count against you in an interview.In my experience, people generally smile back if you smile at them.Vegetables are generally low in calories.You get the odd person who's rude to you but they're generally quite helpful.This disease doesn't generally respond to treatment.\nSMART Vocabulary: related words and phrases\nGeneral\nabstract\nabstraction\nabstractly\nacross-the-board\nall-purpose\nbroad\nby and large idiom\nchiefly\nessence\ngeneral\ngeneralist\nhelicopter view\non the whole idiom\noverall\nportmanteau\nprimarily\nprinciple\nsense\nstuff\nwhole\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHabitual and customary\nGrammar\nDegree adverbs (slightly) and focusing adverbs (generally)Degree and focusing adverbs are the most common types of modifiers of adjectives and other adverbs. Degree adverbs express degrees of qualities, properties, states, conditions and relations. Focusing adverbs point to something. …\nAdd to word list\nAdd to word list\nin a way that includes most people, things, or conditions, or most of the time: It was generally believed at the time that both men were guilty. The baby generally (= usually) wakes up twice during the night."}