{"id":163805,"name":"generous","type":"adjective","us_sound":"ˈdʒen.ər.əs","us_link":"../audio/g/generous.mp3","uk_sound":"ˈdʒen.ər.əs","uk_link":"../audio/g/ukgener013.mp3","content":"generous adjective\n(CHARACTER)\nAdd to word list\nAdd to word list\nB1 willing to give money, help, kindness, etc., especially more than is usual or expected: a very generous man [ + to infinitive ] It was generous of you to lend me the money.generous with She's been very generous with her time. There's a generous (= kinder than deserved) review of the book in today's newspaper. Opposite\nungenerous\nThesaurus: synonyms, antonyms, and examples\nfreely giving money, help, etc. to othersgenerousThey were quite generous, donating to several charities.open-handedShe is incredibly open-handed and won't hesitate to donate whenever asked.free withOur professor is quite free with his time and will often extend office hours to accommodate extra students.philanthropicThere are fewer philanthropic billionaires than one would assume.charitableOxfam is a well-known charitable organization working to end global poverty.\nSee more results »\nMore examplesFewer examplesThe public's response to the crisis appeal was generous and compassionate.His mother is one generous woman.John Herschel was an urbane, kindly and generous man.She's a really sweet person and she's generous to a fault.The charity will go under unless a generous donor can be found within the next few months.\nSMART Vocabulary: related words and phrases\nGenerous & charitable\naltruistic\naltruistically\nanti-materialism\nanti-materialist\nbeneficence\neleemosynary\ngenerosity\ngenerously\ngiver\nhandout\nmunificence\nmunificent\nmunificently\nopen-handed\nopen-handedly\nunsparing\nunsparingly\nunstinted\nunstinting\nunstintingly\nSee more results »\ngenerous adjective\n(SIZE)\nC1 larger than usual or expected: a generous slice of cake a generous pay increase\nThesaurus: synonyms, antonyms, and examples\ngreater than the average size or amountbigThey live in a big house in the country.largeA large number of people were crowded into the room.greatThe party was a great success.enormousThey bought an enormous house in the suburbs.\nSee more results »\nSMART Vocabulary: related words and phrases\nPlenty and abundant\nabound\nabound in/with something\nabundance\nabundant\nabundantly\ndrip\ngenerously\nhandsomely\nhealthily\nin abundance\nlavish\nlavishly\nluxuriant\nplenteously\nplentiful\nplentifully\nplenty\nprofuse\nrichly\nwell off\nSee more results »\nRelated word\ngenerously\nAdd to word list\nAdd to word list\n(of someone) willing to give help or support, esp. more than is usual or expected, or (of something) larger than usual or expected: a generous donor food in generous portions generously adverb us\nYour browser doesn't support HTML5 audio\n/ˈdʒen·ə·rə·sli/\nPlease give generously to those in need."}