{"id":163737,"name":"general","type":"adjective","us_sound":"ˈdʒen.ər.əl","us_link":"../audio/g/general.mp3","uk_sound":"ˈdʒen.ər.əl","uk_link":"../audio/g/ukgecko028.mp3","content":"general adjective\n(COMMON)\nAdd to word list\nAdd to word list\nB2 involving or relating to most or all people, things, or places, especially when these are considered as a unit: The general feeling is that justice was not served. There is general concern about rising crime rates. My general impression of the place was good.general interest The talk is intended to be of general interest (= of interest to most people).UK formal Rain will become more general in the southeast during the afternoon. in general\nB1 (also as a general rule) usually, or in most situations: In general, men are taller than women.\nB2 considering the whole of someone or something, and not just a particular part of him, her, or it: So, apart from the bad ankle, how are you in general?\nSee more be in the general interest formal\nto be a good thing for the public: The government will only say it is not in the general interest to reveal any more information.\nSee more\nMore examplesFewer examplesThe general consensus in the office is that he's useless at his job.There was a general air of expectancy in the crowd.These are general criticisms which should not be taken personally.The performance of the car industry is a good pointer to the general economic health of the country.It would seem to be a general truth that nothing is as straightforward as it at first seems.\nSMART Vocabulary: related words and phrases\nGeneral\nabstract\nabstraction\nabstractly\nacross-the-board\nall-purpose\nbroad\nby and large idiom\nchiefly\nessence\ngeneralist\ngenerally\nhelicopter view\non the whole idiom\noverall\nportmanteau\nprimarily\nprinciple\nsense\nstuff\nwhole\nSee more results »\ngeneral adjective\n(NOT DETAILED)\nB1 not detailed, but including the most basic or necessary information: What he said was very general. The school aims to give children a general background in a variety of subjects.in general terms I'm not an expert, so I can only speak in general terms on this matter. the general\nthings considered as a unit and without giving attention to details: His book moves from the general to the particular.\nSMART Vocabulary: related words and phrases\nGeneral\nabstract\nabstraction\nabstractly\nacross-the-board\nall-purpose\nbroad\nby and large idiom\nchiefly\nessence\ngeneralist\ngenerally\nhelicopter view\non the whole idiom\noverall\nportmanteau\nprimarily\nprinciple\nsense\nstuff\nwhole\nSee more results »\ngeneral adjective\n(NOT LIMITED)\nB2 including a lot of things or subjects and not limited to only one or a few: general knowledge\nused as part of the title of a job of someone who is in charge of a whole organization or company: general manager He hoped to become a general manager in a hotel. the General Secretary of the UN\nSMART Vocabulary: related words and phrases\nGeneral\nabstract\nabstraction\nabstractly\nacross-the-board\nall-purpose\nbroad\nby and large idiom\nchiefly\nessence\ngeneralist\ngenerally\nhelicopter view\non the whole idiom\noverall\nportmanteau\nprimarily\nprinciple\nsense\nstuff\nwhole\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople in charge of or controlling other people\nBosses & managers\n(also General) an officer of very high rank, especially in the army: He was promoted to the rank of general. General Brown/Roger Brown [ as form of address ] Thank you, General.\nMore examplesFewer examplesThe revolt in the north is believed to have been instigated by a high-ranking general.He's a competent enough officer, but I doubt he'll ever make general.The general mustered his troops.The general has ordered a partial withdrawal of troops from the area.The general made some bellicose statements about his country's military strength.\nSMART Vocabulary: related words and phrases\nRanks in the Army\nbrigadier\nbrigadier general\ncol\ncolonel\nCorp.\ncorporal\nfield marshal\ngeneralship\nlance corporal\nLieut.\nmajor\nmajor general\nprivate\nsarge\nsergeant\nsergeant major\nSgt\nstaff officer\nsubaltern\ngeneral adjective\n(COMMON)\nAdd to word list\nAdd to word list\ninvolving or relating to most people, things, or conditions, esp. when these are considered as a unit; not particular or specific: the general standard of living This book is intended for the general reader (= one who does not have special knowledge). He has only a general knowledge of anatomy (= does not have detailed information about it). In general (= In most cases), women live longer than men.\ngeneral noun [C]\n(OFFICER)\na military officer of the highest rank\nAdd to word list\nAdd to word list\nincluding a lot of things or subjects rather than being limited to only one or a few: Only a third of the general population are willing to haggle over the price of something they want to buy. Market demand for all our products remains strong, reflecting continued growth in the general economy. Let me describe the finances in general terms without being specific.\nHR, WORKPLACE used as part of the title of a job of someone who is in charge of all or part of an organization or company: Mike Black, general manager at the plant, said only a small percentage of the workforce were members of the union. the General Secretary of the UN General Director\nin general (also as a general rule)\nusually, or in most situations: In general, British management style is known for its individuality. \"Housing as a general rule follows jobs,\" Terry said. See also\nattorney general\ndirector general"}