{"id":164013,"name":"gentle","type":"adjective","us_sound":"ˈdʒen.t̬əl","us_link":"../audio/g/gentle.mp3","uk_sound":"ˈdʒen.təl","uk_link":"../audio/g/ukgenit014.mp3","content":"Add to word list\nAdd to word list\nB1 calm, kind, or soft: a gentle smile He's very gentle with his kids.\nThesaurus: synonyms, antonyms, and examples\ncalm and nice to othersgentleShe's so sweet and gentle with the children.mildHer grandmother is such a kind, mild person.mild-manneredHe's a mild-mannered diplomat known for his measured responses to crisis. genteelThey're lovely, genteel people who sent flowers when her father passed away.wouldn't hurt a flyOh, she's so nice, she wouldn't hurt a fly.\nSee more results »\nB1 not violent, severe, or strong: gentle exercise She had been advised that gentle exercise would help her recovery.gentle breeze A gentle breeze was blowing through the open windows.gentle persuasion You can actually accomplish a lot more by gentle persuasion.\nThesaurus: synonyms, antonyms, and examples\nnot strong or forcefulgentleA gentle breeze stirred the leaves.mildThe children just have a mild cold.softHer voice was so soft, I could barely hear her.lightThe temperature in London is 24 degrees, with light winds out of the west.lowKeep your voices low while the baby's sleeping.\nSee more results »\nC1 not steep or sudden: gentle slope/gradient The path has a gentle slope/gradient.\nThesaurus: synonyms, antonyms, and examples\nslowslowYou're so slow - hurry up!leisurelyWe took a leisurely drive along the quiet coast road.unhurriedI like the unhurried pace of life in the countryside.gentleStart off with a gentle jog, then gradually increase your speed.\nSee more results »\nMore examplesFewer examplesA bit of gentle coaxing is all that's required and he'll come, I'm sure.He rocked the cradle with a gentle backwards and forwards motion.The children rolled over and over down the gentle slope.She was lulled to sleep by the gentle rhythm of the boat in the water.Outside the flat, she could hear the gentle wash of the waves on the beach.\nSMART Vocabulary: related words and phrases\nTender & gentle\ncaressing\ncaressingly\nfly\ngentleness\ngently\ngreat-hearted\nmeekness\nmild\nmild-mannered\nmildness\nnon-critical\nsoft\nsoft-hearted\nsofty\ntender\ntender-hearted\ntenderly\ntenderness\nTLC\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSlanting, sloping, leaning, tilting\nRelated word\ngentleness\nAdd to word list\nAdd to word list\ncalm, kind, or soft; not violent or severe: a gentle smile a gentle breeze The path has a gentle (= gradual) slope. gentleness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈdʒen·təl·nəs/gently adverb us\nYour browser doesn't support HTML5 audio\n/ˈdʒent·li/\nHe gently lifted the baby out of the crib."}