{"id":164071,"name":"genuine","type":"adjective","us_sound":"ˈdʒen.ju.ɪn","us_link":"../audio/g/genuine.mp3","uk_sound":"ˈdʒen.ju.ɪn","uk_link":"../audio/g/ukgenit025.mp3","content":"Add to word list\nAdd to word list\nB2 If something is genuine, it is real and exactly what it appears to be: genuine leather If it is a genuine Michelangelo drawing, it will sell for millions.\nThesaurus: synonyms, antonyms, and examples\nbeing what it appears to berealThat's not his real hair, is it? I thought it was a bad wig!genuineThe painting is a genuine Picasso.authenticThe clerk certified that the documents were authentic.honest-to-goodnessMy father is an honest-to-goodness door-to-door salesman.\nSee more results »\nC1 If people or emotions are genuine, they are honest and sincere: He's a very genuine person. Machiko looked at me with genuine surprise - \"Are you really going?\" she said.\nMore examplesFewer examplesHe has demonstrated a genuine interest in the project.A number of forged works of art have been sold as genuine.In an indiscreet moment, the president let his genuine opinions be known.The police are trying to sift out the genuine warnings from all the hoax calls they have received.I'm not surprised the offer wasn't genuine, it sounded too good to be true.\nSMART Vocabulary: related words and phrases\nTrue, real, false, and unreal\nactual\nactuality\nactually\nall that glitters is not gold idiom\nanger\nfalse flag\nfalsely\nfantastical\nfever dream\nfictional\nnon-realistic\nnot so much idiom\nnothing could be further from the truth idiom\nnothing could have been further from my mind/thoughts idiom\nparallel universe\nuntrue\nuntruly\nunverifiable\nurban myth\nvalidity\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHonesty, openness & sincerity\nRelated words\ngenuinely\ngenuinenessIdiom\nthe genuine article\nAdd to word list\nAdd to word list\nbeing what something or someone appears or claims to be; real, not false: genuine leather a genuine masterpiece She showed genuine (= sincere) sorrow at the news. genuineness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈdʒen·ju·ən·nəs/\nNo one doubts the genuineness of your concern."}