{"id":164616,"name":"gerund","type":"noun","us_sound":"ˈdʒer.ənd","us_link":"../audio/g/gerund.mp3","uk_sound":"ˈdʒer.ənd","uk_link":"../audio/g/ukgerma013.mp3","content":"Add to word list\nAdd to word list\nC1 a word ending in \"-ing\" that is made from a verb and used like a noun: In the sentence \"Everyone enjoyed Tyler's singing\", the word \"singing\" is a gerund.\nMore examplesFewer examplesA gerund can be either the subject or object of a sentence in English, e.g. 'Cycling is fun' or 'I enjoy cycling'.Gerunds are verbal nouns, and I remember that they are used in a special way in Latin.\nSMART Vocabulary: related words and phrases\nLinguistics: verb forms, tenses & types of verbs\naccusative\nart\nbare infinitive\nbent\ncontinuous\ncopula\ninfinitive\nmodality\nnon-finite\nnon-progressive\npassive\npassivization\nperfective\npresent participle\nprogressive\nsubjunctive\nthe active voice\nthe future perfect\nthe past continuous\nthe past tense\nSee more results »\nGrammar\nVerb patterns: verb + infinitive or verb + -ing?Some verbs can be followed immediately by a to-infinitive: …\nVerbs followed by a to-infinitiveSome verbs can be followed immediately by a to-infinitive: …\nVerbs followed by -ingSome verbs are normally followed by the -ing form, not the to-infinitive: …\nVerbs followed by a to-infinitive or -ingHate, like, love and prefer can be followed either by -ing or a to-infinitive. The difference in meaning is often small. The -ing form emphasises the verb itself. The to-infinitive puts the emphasis more on the preference for, or the results of, the action. …\nVerbs followed by an infinitive without toLet and make are followed by an infinitive without to in active voice sentences. They always have an object (underlined) before the infinitive: …\nVerbs followed by -ing or an infinitive without toA group of verbs connected with feeling, hearing and seeing can be used with -ing or with an infinitive without to: …\nVerbs followed by a direct object and a to-infinitiveSome verbs are used with a direct object (underlined) followed by a to-infinitive. These verbs include: …\nAdd to word list\nAdd to word list\ngrammar a word ending in \"-ing\" that is made from a verb and is used like a noun: In the sentence \"Everyone enjoyed Tyler’s singing,\" the word \"singing\" is a gerund."}