{"id":164702,"name":"gesture","type":"noun","us_sound":"ˈdʒes.tʃɚ","us_link":"../audio/g/gesture.mp3","uk_sound":"ˈdʒes.tʃər","uk_link":"../audio/g/ukgerma020.mp3","content":"gesture noun [C]\n(MOVEMENT)\nAdd to word list\nAdd to word list\nC1 a movement of the hands, arms, or head, etc. to express an idea or feeling: gesture of The prisoner raised his fist in a gesture of defiance as he was led out of the courtroom.make a gesture She made a rude gesture at the other driver.\nMore examplesFewer examples\"All this is mine, \" she said with a sweeping arm gesture.Since they spoke only Swahili, we used signs and gestures to make ourselves understood.The taxi driver made a rude gesture as he overtook us.He threw his hands up in a gesture of despair.When she ruffled the boy's hair, it was meant as a playful gesture - but he was furious.\nSMART Vocabulary: related words and phrases\nGestures & gesturing\nair punch\nair quotes\nbat\nbeckon\nbird\nblow someone a kiss phrase\nflip someone off\nflourish\ngesticulate\ngesticulation\ngive someone the finger idiom\npeace sign\npump someone's hand idiom\nshake\nshrug\nsigning\nsnap your fingers idiom\nstick/put your tongue out idiom\ntongue\nwink\nSee more results »\ngesture noun [C]\n(SYMBOLIC ACT)\nC1 an action that expresses your feelings or intentions, although it might have little practical effect: gesture of The government donated £500,000 as a gesture of goodwill. Eating boiled potatoes instead of chips was his only gesture towards healthy eating.\nMore examplesFewer examplesReleasing the hostages has been seen as a goodwill gesture.Five hundred troops were sent in, more as a gesture of strength than as a real threat.The demonstration is a pointless gesture of defiance against the government.What better finale to her career than this extravagant gesture?The press release is a face-saving gesture.\nSMART Vocabulary: related words and phrases\nGestures & gesturing\nair punch\nair quotes\nbat\nbeckon\nbird\nblow someone a kiss phrase\nflip someone off\nflourish\ngesticulate\ngesticulation\ngive someone the finger idiom\npeace sign\npump someone's hand idiom\nshake\nshrug\nsigning\nsnap your fingers idiom\nstick/put your tongue out idiom\ntongue\nwink\nSee more results »\nC2 to use a gesture to express or emphasize something: When he asked where the children were, she gestured vaguely in the direction of the beach.gesture for someone to do something He made no answer but walked on, gesturing for me to follow. Synonyms\ngesticulate formal\nmotion\nSMART Vocabulary: related words and phrases\nGestures & gesturing\nair punch\nair quotes\nbat\nbeckon\nbird\nblow someone a kiss phrase\nflip someone off\nflourish\ngesticulate\ngesticulation\ngive someone the finger idiom\npeace sign\npump someone's hand idiom\nshake\nshrug\nsigning\nsnap your fingers idiom\nstick/put your tongue out idiom\ntongue\nwink\nSee more results »\ngesture noun [C]\n(MOVEMENT)\nAdd to word list\nAdd to word list\na movement of the body, hands, arms, or head to express an idea or feeling: He made a rude gesture to the crowd after his tennis match.\ngesture noun [C]\n(SYMBOLIC ACT)\nan action that expresses your feelings or intentions, although it might have little practical effect: Her warm thank-you note was a nice gesture. gesture verb [ I ] us\nYour browser doesn't support HTML5 audio\n/ˈdʒes·tʃər/\nWhen I asked where the children were, she gestured toward the beach."}