{"id":164661,"name":"gestate","type":"verb","us_sound":"dʒesˈteɪt","us_link":"../audio/g/eus72021.mp3","uk_sound":"dʒesˈteɪt","uk_link":"../audio/g/ukgerma016.mp3","content":"gestate verb [I or T]\n(BABY)\nAdd to word list\nAdd to word list\nbiology\n&#160; specialized (of a female animal) to have a baby developing inside the body or (of a child or young animal) to develop inside a mother's body: Female elephants gestate for a staggering 22 months. healthy foetuses that have gestated at least 20 weeks Those snakes are often females, soaking up the sun to help their metabolism deal with the demand of gestating a litter of young.\nMore examplesFewer examplesFemales produce more eggs than the number of embryos they are able to gestate to term.A mouse gestates in just 19 days.Do you know a female rat can gestate 21 times a year?\nSMART Vocabulary: related words and phrases\nAnimal reproduction\nandrogen\nanti-oestrogen\nasexual reproduction\nasexuality\nasexually\nbarrenness\ncalf\nfetal\nimpregnate\nincubate\noestrogen\nout-reproduce\npanmictic\npanmixia\nprocreation\nprocreative\nsemen\nspawn\nsterile\nzygote\nSee more results »\ngestate verb [I or T]\n(IDEA)\n(of an idea, thought, or plan) to develop or be developed over time: The internet had been gestating since the fifties. The subconscious mind needs time to gestate the work. See\ngestation\nMore examplesFewer examplesThis play has been gestating over a period of time.Ideas seem to gestate best in a void.The problems facing the company have been gestating for years. Other deals involving carmakers are now gestating. New lyrics began to gestate in his head.\nSMART Vocabulary: related words and phrases\nStarting and beginning\nbe in the first flush of idiom\nbe/get in on the ground floor idiom\nbecome\nbegin\nbranch out\ndevelop\ngrow\nhalf-cock\nhere\nhere goes! idiom\nhit the ground running idiom\ninaugurate\nmotion\nsail in\nstart on something\nstart out\nstart/set/get the ball rolling idiom\nstarting\nstirring\nwheel\nSee more results »"}