{"id":164656,"name":"gestaltist","type":"noun","us_sound":"ɡəˈʃtɑːl.tɪst","us_link":"../audio/g/cdo0623usgest1636.mp3","uk_sound":"ɡəˈʃtæl.tɪst","uk_link":"../audio/g/cdo0623ukgest1632.mp3","content":"Add to word list\nAdd to word list\nsomeone who supports the theory that an experience or a belief is a whole and separate thing, and more than the total of its individual parts or characteristics: Some scholars have argued that gestaltists shared this view, particularly in their account of experience as a single systemic whole. This is the \"aha!\" moment of the Gestaltists.\nMore examplesFewer examplesThis is another way of referring to what gestaltists call \"authentic action\".This is an instance of the process of awareness as presented by the gestaltists.\nSMART Vocabulary: related words and phrases\nScience of psychology & psychoanalysis\nanalyse\nanalysis\nbehavioural science\nbehaviourist\ncathartic\ncertify\ncommittal\nFreudian\nJungian\npreconscious\nprofiler\nprojective\nprojectively\npsych\npsychiatric\npsychiatry\npsychic\npsychologist\nstraitjacket\nsuperego\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMind and personality\nbased on the idea that an experience or a belief is a whole and separate thing, and more than the total of its individual parts or characteristics: This approach is clearly gestaltist. There is a distinction between the Gestaltist view and his own views of perception. Related word\ngestalt\nMore examplesFewer examplesIt was believed that the gestaltist principle could be applied in all scientific fields. The gestaltist axiom that details are governed by the whole is now accepted by many psychologists.In Gestaltist terminology, the phenomenon whereby we see human and animal forms in natural, random shapes is not \"hallucinatory\".This idea is supported to some extent by Gestaltist theory.\nSMART Vocabulary: related words and phrases\nScience of psychology & psychoanalysis\nanalyse\nanalysis\nbehavioural science\nbehaviourist\ncathartic\ncertify\ncommittal\nFreudian\nJungian\npreconscious\nprofiler\nprojective\nprojectively\npsych\npsychiatric\npsychiatry\npsychic\npsychologist\nstraitjacket\nsuperego\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMind and personality"}