{"id":164712,"name":"get","type":"verb","us_sound":"ɡet","us_link":"../audio/g/get.mp3","uk_sound":"ɡet","uk_link":"../audio/g/ukgerma022.mp3","content":"get verb\n(OBTAIN)\nAdd to word list\nAdd to word list\nA1 [ T ] to obtain, buy, or earn something: He went to the shop to get some milk.UK I think she gets about £40,000 a year. We stopped on the way to get some breakfast.get something for something I managed to get all three suitcases for under $200. How much did he get for his car? (= How much money did he sell it for?)get something from something Where did you get your shoes from? Synonyms\nacquire\nget hold of informal\nobtain (GET) formal\nThesaurus: synonyms, antonyms, and examples\nto buy somethingbuyI need to buy some new shoes.getI need to go to the supermarket and get some bread.purchaseShe purchased a new computer.pick something upCan you just pop in the shop and pick up some eggs?\nSee more results »\nA1 [ T ] to receive or be given something: UK I got quite a surprise when I saw her with short hair. When did you get the news about Sam?get something from someone I got a phone call from Phil last night. What grade did he get for the exam? I got the impression that they'd rather be alone.get something for something What did you get for your birthday? We don't get much snow (= it does not often snow) here. I managed to get a glimpse of him (= see him for a moment) through the crowds. If you get a moment (= have time available), could you help me fill in that form?get something from something She gets such pleasure from her garden.get something off If you can get some time off work, we could finish the decorating.get someone to yourself I can never get her to myself (= be alone with her) because she's always surrounded by people.\nThesaurus: synonyms, antonyms, and examples\nto receive or be given somethinggetI got a new bike for my birthday.receiveYou will receive your tickets by email.obtainAfter many years of trying, she finally obtained Brazilian citizenship.gainYou will improve at the job as you gain experience.earnEventually, you will earn the dog's trust.achieveShe achieved top marks in the physics exam.\nSee more results »\nA2 [ T ] to go somewhere and bring back someone or something: Let me go get my glasses. [ + two objects ] Can I get you a drink?\n[ T ] to take someone or something into your possession by force: Have the police got the man who did it yet? Your cat got a bird this morning!\nMore examplesFewer examplesThe advantage of booking tickets in advance is that you get better seats.What class of degree did you get?I don't know if I can get the car tonight - I'll have to clear it with Mum.She gets a 15% commission on every machine she sells.I got some shoes cheap in the sale.\nSMART Vocabulary: related words and phrases\nGetting, receiving and accepting\nacquirable\nacquire\nacquisition\nawardee\ncarve\ndraw\nearn\nget back\nget out of something\nget/lay/put your hands on someone idiom\nglom onto something/someone\ngo to someone\npocket\nscore\nscrew\nscrew something out of someone\nsecure\nseize\nseize on/upon something\nsnap something up\nSee more results »\nget verb\n(REACH)\nA1 [ I usually + adv/prep, T ] to reach or arrive at a particular place: We hadn't even got as far as London when the car broke down. What time does he normally get home (from work)?get to If you get to the restaurant before us, just wait at the bar.\nThesaurus: synonyms, antonyms, and examples\nto arrive at a placearriveAfter a long day's travel, we finally arrived.get What time did you get there?reachWe won't reach Miami until evening.makeWe made it to the airport just in time for our flight.get inThe train gets in at 6:40 p.m.turn upShe turned up at my house late one night.\nSee more results »\n[ I usually + adv/prep ] to reach a particular stage, condition, or time: get to You earn loads of money if you get to the top in that profession. It got to Thursday and she still hadn't heard any news.informal I'm getting to the stage now where I just want to give up. get far/somewhere/anywhere\nto make progress or to improve: She's taking flute lessons, but she really doesn't seem to be getting anywhere with it.\nSee more\nMore examplesFewer examplesWe enjoyed wonderful views when we got to the top of the mountain.He was exhausted by the time he got to the finish line.Your bags will be waiting for you when you get to the hotel.The aid was getting to the people who needed it most.She's been trying hard, but she doesn't feel that she's getting anywhere.\nSMART Vocabulary: related words and phrases\nArriving, entering and invading\nannex\nannexation\nbe on the scene idiom\nbeen\nbreak\nbreak someone in\nhit\ningress\ninterloper\nintrude\nintrusion\ninvade\njump\nrock up\nroll up! idiom\nscene\nset foot in somewhere idiom\nshow up\ntrespass\nturn\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStarting and beginning\nget verb\n(BECOME ILL WITH)\nB1 [ T ] to become ill with a disease, virus, etc.: I got food poisoning at that cheap little seafood restaurant. Kids get all kinds of bugs at school.\nMore examplesFewer examplesYou can get very nasty skin diseases from bathing in dirty water.I got a crick in my neck from painting the ceiling.UK I can't come in to work today - I've got a bit of a dodgy stomach.She's got a nasty dose of flu.When I've got a cold, I don't feel like eating.\nSMART Vocabulary: related words and phrases\nBeing & falling ill\nacquire\nbe a martyr to something idiom\nbe green around the gills idiom\nbe hanging idiom\nbe laid up idiom\nbe out of sorts idiom\nbring\nKO\nmartyr\nnot a hundred percent idiom\npick\npick someone/something up\npredisposed\npresent\nrelapse\nserious\nshiver\nsicken\nstrike\nsuccumb\nSee more results »\nget verb\n(START TO BE)\nB1 [ L ] to become or start to be: He gets really upset if you mention his baldness. Is your cold getting any better? Your coffee's getting cold. After a while you get used to all the noise. You're getting to be such a big boy, aren't you! [ + to infinitive ] How did you get to be a belly dancer?\nThesaurus: synonyms, antonyms, and examples\nto becomebecomeMy arm was becoming more and more painful.getIt’s getting dark now.growTempers had been growing more and more frayed during the evening.goMy hair is going white.turnThe sky turned black.\nSee more results »\nget going/moving C2 informal\nto start to go or move: We'd better get moving or we'll be late.\nSee more\nMore examplesFewer examplesHe got fed up with all the travelling he had to do.The trouble with this carpet is that it gets dirty very easily.Your essay gets a bit confused halfway through when you introduce too many ideas at once.The music just gets distorted when you play it so loud.It was getting dark now and we were tired.\nSMART Vocabulary: related words and phrases\nStarting and beginning\nbe in the first flush of idiom\nbe/get in on the ground floor idiom\nbecome\nbegin\nbranch out\ngrow\nhalf-cock\nhere\nhere goes! idiom\nhit the ground running idiom\nmotion\nsail in\nstart (something) off\nstart on something\nstart out\nstart/set/get the ball rolling idiom\nstarting\nthe ground floor\nwaste\nwheel\nSee more results »\nget verb\n(CAUSE)\nB1 [ T ] to cause something to happen, or cause someone or something to do something: [ + adj ] She had to get the kids ready for school. [ + past participle ] I'm trying to get this article finished by Thursday. We get our groceries delivered. [ + -ing verb ] Were you able to get the copy machine working? [ + to infinitive ] I can't get my computer to work!\nB2 [ T + obj + to infinitive ] to persuade someone to do something: get someone to do something Why don't you get Nicole to come to the party?\n[ T + past participle ] to do something to something or someone without intending to or by accident: He got his bag caught in the train doors as they were closing. I always get the two youngest sisters' names confused.\nMore examplesFewer examplesThese arguments always get my adrenalin going.I've been running round in circles trying to get all the reports finished before the meeting.Can you get this cork to come out of the bottle?\"Do you think you could get this parcel mailed for me, please?\" \"Consider it done.\"The law has criminalized prostitution but not got rid of it.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nspark\nspell\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing somebody to act\nUrging & persuading\nNot expected or planned\nget verb\n(BE)\nB1 [ L + past participle ] sometimes used instead of \"be\" to form the passive: I got shouted at by some idiot for walking past his house. They're getting married later this year. This window got broken.\nMore examplesFewer examplesHe converted to Catholicism when he got married.I got chucked out of the exam for cribbing from the guy in front.My dress got all crushed in my suitcase.For months I've been dining out on the story of what happened when my house got flooded.Are you getting excited about your holiday?\nSMART Vocabulary: related words and phrases\nStarting and beginning\nbe in the first flush of idiom\nbe/get in on the ground floor idiom\nbecome\nbegin\nbranch out\ngrow\nhalf-cock\nhere\nhere goes! idiom\nhit the ground running idiom\nmotion\nsail in\nstart (something) off\nstart on something\nstart out\nstart/set/get the ball rolling idiom\nstarting\nthe ground floor\nwaste\nwheel\nSee more results »\nget verb\n(MOVE)\nB1 [ I usually + adv/prep ] to move to a different place or into a different position: get into I hit my head as I was getting into the car.get out of Get out of here now or I'll call the police. The bed is too wide - we'll never get it through the door.get up Getting up the ladder was easy enough - it was coming down that was the problem.get down He got down on his knees and asked me to marry him!\nMore examplesFewer examplesJournalists had insisted on getting to the front line of the battle, heedless of the risks.Security did not prevent an interloper from getting onto the stage at the opening ceremony.You get into the building through a side door.I tried to get in the cinema last night but it was full.They got into the car and zoomed off.\nSMART Vocabulary: related words and phrases\nGeneral words for movement\nbetake\nbudge\nbudge up\ncarry\ncirculate\ndad dancing\ngangway\ngone\nkinetic\nkinetic energy\nkinetically\nlibration\nlocomotion\nmotion\npass\nround\nscoot\nseethe\nshove\nslip\nSee more results »\nget verb\n(TRAVEL)\nA1 [ T ] to travel somewhere in a train, bus, or other vehicle: Shall we get a taxi to the station?\nMore examplesFewer examplesIt was a good job I got the earlier train.You can get a bus from just outside the supermarket.It'll be more expensive if you get a taxi.It was too late to get a bus, so we had to walk home.Get the train to King's Cross and I'll meet you at the station.\nSMART Vocabulary: related words and phrases\nBoarding and alighting from modes of transport\nalight\nbestride\nboard\nclimb\ndebark\ndeplane\ndisembark\ndisembarkation\ndismount\nembark\nembarkation\nentrain\nget off\nget on\nget out\nhop\nmount\nreboard\nsettle\nstraddle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTravelling\nget verb\n(DEAL WITH)\nB1 [ T ] to deal with or answer a ringing phone, knock on the door, etc.: Hey, Ty, someone's at the door - would you get it, please?\nMore examplesFewer examplesPass me the bill. I'll get it.Will you please get the phone?That's the doorbell. You'd better get it.If the phone rings when I'm in the shower, will you get it please?If you get the drinks, I'll pay for the meal.\nSMART Vocabulary: related words and phrases\nDealing with things or people\naddressable\napproach\nattack\nattend to someone/something\nbe all over it idiom\nbeard the lion (in his/her den) idiom\nbed\ncut\ngrip\nhave it out with someone idiom\nhold\nhold on idiom\nI/I've got this idiom\nill-prepared\nsquare\ntend to someone/something\nto get a handle on something idiom\nto have a handle on something idiom\ntough\ntough something out\nSee more results »\nget verb\n(HAVE CHANCE)\nB2 [ I + to infinitive ] to have the chance to do something: I never get to see her now that she works somewhere else.\nMore examplesFewer examplesDid you get to visit your uncle when you were in Canada?We never got to test drive the car before we bought it.They got to play in the sandpit while the adults were shopping.Who gets to have the last piece of chocolate cake?We don't often get to spend the weekend together.\nSMART Vocabulary: related words and phrases\nOpportunity\nanother/a second bite at/of the cherry idiom\nbe in with a shout idiom\nbest bet idiom\nbig break\nfish\nfoot\nhave a few, several, etc. irons in the fire idiom\nhave a field day idiom\nhay\nheadroom\niron\nit's now or never idiom\npass\nplatform\nroom for manoeuvre idiom\nscope\nshop window\nsmell blood idiom\nthe American dream\nthe run of something idiom\nSee more results »\nget verb\n(UNDERSTAND/HEAR)\nB2 [ T ] to understand or hear something: I didn't get what he said because the music was so loud. I told that joke to Sophia, but she didn't get it.\nThesaurus: synonyms, antonyms, and examples\nto understand somethingunderstandI understand why he did that.comprehendHe doesn't seem to comprehend the scale of the problem.get the pictureOK. Don't say any more. I get the picture.followIt was so complicated I couldn't follow what he was saying.graspI think I grasped the main points of the lecture.digestThis chapter is so difficult to digest. I'll have to read it again later.\nSee more results »\nMore examplesFewer examplesI didn't get that joke he told - did you?Sorry, I still don't get it. You'll have to explain.I didn't get that. Could you say it again?I didn't get half of what he said because he talks so fast.Did you get that? I hadn't a clue what he said.\nSMART Vocabulary: related words and phrases\nUnderstanding and comprehending\nappreciation for something\napprehend\napprehensible\napprehension\nastutely\nbear\ncatch\ncolour\nhandle\nkeep someone up\nknow a hawk from a handsaw idiom\nknow the score idiom\nknow/see where someone is coming from idiom\nlatch\ntease something apart\nto get a handle on something idiom\nto have a handle on something idiom\ntumble to something\ntune in\nunderstanding\nSee more results »\nget verb\n(PREPARE)\n[ T ] to prepare a meal: I'll put the kids to bed while you're getting dinner ready.\nMore examplesFewer examplesI thought I could score some brownie points with my mother-in-law by offering to get dinner.I'll do the main course, if you get the salad.She was already up getting breakfast when I came downstairs.I'll cook this evening, you got dinner last night.He just sat in front of the TV while I was getting the dinner.\nSMART Vocabulary: related words and phrases\nPreparing food\nbatch cooking\nbiga\nboil\nbutter\nbuttered\ncan't boil an egg idiom\nclarify\nglaze\nglazed\ngrate\ningredient\njerk\nre-season\nrecipe\nrehydrate\nrestuff\nrice\ntailgate\ntoss\nzap\nSee more results »\nget verb\n(PAY)\n[ I or T ] to pay for something: Put your money away - I'll get these drinks.\nSMART Vocabulary: related words and phrases\nPaying money\n2FA\n2SV\nante up (something)\nburn a hole in someone's pocket idiom\nchargeable\ncost-cutting\ndiscretionary\nfund\nlash out (something)\nreimburse\nrepay\nsettle an account idiom\nshell (something) out\nshortchange\nsink into something\nspend\nspend money like water idiom\nspent\nsplurge\nsponsor\nSee more results »\nget verb\n(CONFUSE)\n[ T ] informal to confuse someone and make them completely unable to understand or explain: Give him a technical question - that'll really get him! you've got me there! informal\nsomething that you say when you do not know the answer to a question: \"How many ounces in a kilo?\" \"You've got me there.\"\nSee more\nSMART Vocabulary: related words and phrases\nPuzzle and confuse\naddle\nbaffle\nbedazzle\nbefuddle\nbemuse\nconfuse\ndiscombobulate\ndisorientate\ndo someone's head in idiom\nflummox\nfox\nloop\npuzzle\nravel\nsearch\nthrow\nthrow (someone) a curve (ball)/curveball idiom\nthrow someone off balance idiom\ntie\ntie someone (up) in knots idiom\nSee more results »\nget verb\n(ANNOY)\n[ T ] informal to annoy someone: It really gets to me the way we're expected to actually laugh at his pathetic jokes!\nSMART Vocabulary: related words and phrases\nCausing feelings of anger and displeasure\naggravate\naggrieve\nalienate\nanger\nannoy\nbend\ngive someone the shits idiom\ngo too far idiom\ngoat\ngrate\nhack someone off\nnark\nrile\nrub\nrub someone up the wrong way idiom\nruffle\nruffle someone's feathers idiom\ntit\ntooth\ntroll\nSee more results »\nget verb\n(EMOTION)\n[ T ] informal to make someone feel strongly emotional and often cry: That part in the film when he finds out that his daughter is alive - that always gets me!\nThesaurus: synonyms, antonyms, and examples\nto crycryShe skinned her knee and began to cry.weepMy lady, why do you weep?cry your eyes outOur children cried their eyes out when our dog ran way.sob your heart outShe waved goodbye to her parents, then went to the gate and sobbed her heart out.cry bucketsEvery time I watch that film, I just cry buckets at the ending.bawlI bawled when I found out I didn't win the prize.\nSee more results »\nSMART Vocabulary: related words and phrases\nMaking people sad, shocked and upset\naback\namiss\nappal\nbe laughing on the other side of your face idiom\nbite\nbum\nget to\ngnaw\nhaunt\nheartbreaker\nheartbreakingly\nnerve\nscrew (something) up\nsensitivity\nshake someone out of something\nshake someone up\nshake/rock something to its foundations idiom\nshattering\ntoxic\nwipe\nSee more results »\nget verb\n(HIT)\n[ T ] to hit someone, especially with a bullet or something thrown: The bullet got her in the leg.\nSMART Vocabulary: related words and phrases\nDetonation & bombardment\naerial bombardment\naerial photograph\nair raid\nairstrike\nblanket bombing\ndetonate\ndetonation\ndetonator\ndirect hit\ndive-bomb\ngo off\nguidance\nloose\npepper something with something\npetrol bomb\nprime\nrefire\nsaturation bombing\nshell\nshoot\nSee more results »\nGrammar\nGetGet is an irregular verb. Its three parts are get, got, got. In American English, the -ed form gotten is common. …\nGet meaning ‘fetch’, ‘receive’, ‘obtain’We commonly use get + object or get + indirect object + direct object when we mean, very generally, ‘fetch’ or ‘receive’ or ‘obtain’. In these examples the object is underlined: …\nGet meaning ‘become’We commonly use get + adjective to mean ‘become’ or to describe a change of state or situation: …\nGet describing negative eventsWe can use get + -ed form to describe things that happen to us, often things which are unfortunate and which we don’t want to happen. We call this pattern the get passive: …\nGet meaning ‘cause something to happen’When we use get + object (o) + -ed form, we say that we cause something to happen or to be done. It is a less formal way of saying have something done: …\nGet or go?Get and go have similar meanings, when talking about travel or motion. When we use get, we emphasise arrival: …\nGet passiveWe form the standard passive with be + -ed form. We form the get passive with get + -ed form: …\nIdioms\nget away with murder\nget him, her, you, etc.!\nget it on\nget it together\nget what's coming to you\nI/I've got this\nyou/you've got thisPhrasal verbs\nget something across\nget ahead\nget along\nget around\nget around (somewhere)\nget around something\nget around to something\nget at someone\nget at something\nget away\nMore phrasal verbs\nget away with something\nget back\nget someone back\nget something back\nget back to someone\nget back to something\nget behind\nget beyond something\nget by\nget someone down\nget something down\nget something down (someone)\nget down to something\nget in\nget in/get into something\nget something in\nget someone in\nget in on something\nget into someone\nget into something\nget (someone) into something\nget off\nget off (something)\nget something off\nget (someone) off\nget (someone) off (something)\nget something off (something)\nget off on something\nget off with someone\nget on\nget on (something)\nget on to/onto something\nget on with something\nget out\nget (someone/something) out\nget out of something\nget something out of something\nget something out of someone\nget over something/someone\nget something over with\nget past someone\nget past something\nget round (somewhere)\nget round someone\nget round something\nget round to something\nget through\nget through something\nget (someone) through something\nget (something) through (to someone)\nget to\nget to someone\nget together\nget up\nget (someone) up\nget something up\nget yourself/someone up\nget up to something\nget verb\n(OBTAIN)\nAdd to word list\nAdd to word list\n[ T ] to take something into your possession, or have something happen that you accept or receive: He climbed over the fence to get his ball back. Monique raised her hand to get the teacher’s attention. Can I get you a drink? Dad keeps telling me to get a job. What did you get on the test (= What mark did you receive)? I think she gets (= earns) about $10 an hour. We don’t get much snow in this part of the country (= It does not often snow).\n[ T ] To get something often means to buy or pay for it: He went to the store to get milk.\nget verb\n(BECOME)\n[ L ] to become or start to be: Your coffee is getting cold. He’s gotten so big, I hardly recognized him. They’re getting married later this year. Tom got lost in the woods. What time do you get off work? We’d better get going/moving or we’ll be late.\nget verb\n(BECOME ILL WITH)\n[ T ] to become ill with a disease: Everyone seems to be getting the flu.\nget verb\n(CAUSE)\n[ T ] to cause something to be done or persuade someone to do something: The bed is too wide – we’ll never get it through the door. I can’t get this printer to work!\nget verb\n(PREPARE)\n[ T ] to prepare a meal: Why don’t you get supper ready?\nget verb\n(MOVE)\n[ always + adv/prep ] to move in a particular direction: [ I ] Get away from that wet paint! [ I ] He got down on his hands and knees to look for his contact lens. [ T ] Her throat was so sore that she had trouble getting the medicine down (= swallowing it). [ I ] I hit my head as I was getting into the car. [ M ] Momma said we have to get these wet clothes off (= remove them). [ T ] Get your feet off the couch (= move them off it).\n[ always + adv/prep ] To get off a road when you are driving means to turn onto another road: [ I ] Get off the expressway at exit 43.\n[ always + adv/prep ] To get off a train, bus, or aircraft is to leave it: [ I ] Get off at Union Station.\nget verb\n(TRAVEL)\n[ T ] to go into a vehicle or aircraft for traveling: We could call for a taxi or get the bus.\nget verb\n(ARRIVE)\n[ I always + adv/prep ] to arrive at a place or reach a stage in a process: We only got as far as Denver when the car broke down. What time does he normally get home from work? We’re not getting very far (= not advancing) with this computer program, are we?\nget verb\n(UNDERSTAND)\n[ T ] to understand: I think I got the general idea of the chapter. The music was loud and I didn’t get what he said. I never said he was mean – you’ve got it all wrong (= you are confused about this matter).\nget verb\n(CALCULATE)\n[ T ] to calculate the answer to a mathematical problem: What do you get if you divide 20 by 4?\nget verb\n(ANSWER)\n[ T ] to answer a ringing telephone, a knock at the door, etc.: Hey, Juan, someone’s at the door – would you get it, please?\nget verb\n(HIT)\n[ T ] to hit someone, esp. with something thrown or a bullet: My first throw missed, but the second got him in the leg.\nget verb\n(ANNOY)\n[ T ] infml to cause someone to feel slightly angry: It gets me when I have to both cook dinner and clean the dishes.\nget verb\n(CAUSE EMOTIONS)\n[ T ] infml to have an emotional effect on someone: That scene in the movie, when the father and daughter are reunited, always gets me. Idioms\nget a feel for something\nget a grip on yourself\nget a jump on someone/something\nget a life\nget a move on\nget a word in edgewise\nget even\nget your feet wet\nget your goat\nget hold of someone\nMore idioms\nget hold of something\nget in your hair\nget in on the act\nget it\nget it through your thick head\nget it together\nget lost\nget your money’s worth\nget something off your chest\nget off the ground\nget on someone’s nerves\nget something out of your system\nget over something\nget results\nget rid of someone\nget rid of something\nget somewhere\nget the better of someone\nget the hang of something\nget the message\nget this show on the road\nget to the bottom of something\nget under your skin\nget underway\nget up on the wrong side of the bed\nget wind of something\nget someone's wires crossed\nget someone wrong\nnot get anywhere\nnot get to first base\nPhrasal verbs\nget across something\nget ahead\nget along/on\nget around something\nget around (somewhere)\nget around to something\nget at something\nget at something\nget away\nget away with something\nMore phrasal verbs\nget back\nget back something\nget back at someone\nget back to something\nget back to someone\nget by\nget someone down\nget down to something\nget in\nget in\nget in something\nget in something\nget in on something\nget (someone) off\nget off on something\nget on\nget on with something\nget out of something\nget out of something\nget something out of someone\nget something out of something\nget over something\nget something over with\nget (someone) through something\nget through\nget something through (something)\nget (something) through\nget to someone\nget (someone) together\nget (someone) up\nget up something\nAdd to word list\nAdd to word list\n[ T ] to obtain, buy, or earn something: I think she gets about $40,000 a year.get sth for sth How much did he get for his business when he sold it?\n[ T ] to receive or be given something: get sth from sb/sth The results we got from our market research team indicate that potential customers seem to like the new ad campaign.\n[ I, usually + adv/prep ] to reach a particular stage, condition, or time: get to sth Your earnings increase hugely if you get to the top in the legal profession.\n[ T ] informal to pay for something: I'll get the bill. Phrasal verbs\nget sth across\nget ahead\nget away with sth\nget sth back\nget back to sb\nget behind\nget behind sb/sth\nget by\nget down to sth\nget in on sth\nMore phrasal verbs\nget into sth\nget off\nget off (sth) or get sb off (sth)\nget on to/onto sb/sth\nget on with sth\nget out (of sth)\nget sth out\nget through\nget sth through (sth)\nget through sth\nget (sth) through (to sb)"}