{"id":164841,"name":"ghillie","type":"noun","us_sound":"ˈɡɪl.i","us_link":"","uk_sound":"ˈɡɪl.i","uk_link":"","content":"ghillie noun [C]\n(PERSON)\nAdd to word list\nAdd to word list\n(also gillie) in Scotland, a person who works as a helper or servant to someone who is fishing or hunting, especially in the Scottish Highlands (= the mountainous northern parts of Scotland): You can take a boat and a ghillie and fish your own wild salmon dinner out of Loch Tay. He is usually accompanied by a stalker and gillie, local men who are familiar with the quarry and their habits.\nMore examplesFewer examplesHe worked as a gamekeeper's ghillie.Until recently the hotel employed 10 full-time ghillies to guide guests on fishing trips.The son of a local tenant farmer, John Brown had advanced through the ranks of the ghillies and found himself in service to Queen Victoria.He was an angler of the old school, wearing plus fours and a deer stalker and accompanied by his gillie.The Glencanisp estate employs estate managers as well as gillies and stalkers to look after the fishing and shooting.\nghillie noun [C]\n(SHOE)\na soft shoe similar to a ballet shoe with laces (= strings) crossing across the top of the foot, worn for traditional Scottish and Irish dancing: Scottish ghillies are almost always black, although they often feature coloured stitching and eyelets. For women, Irish dancing is traditionally performed in ghillies.\n(usually ghillie brogue) a type of strong leather shoe worn with a kilt (= a skirt with many folds made from tartan cloth) as part of traditional Highland dress: The wedding was attended by men and boys resplendent in kilts and ghillie brogues.\nMore examplesFewer examplesShe wore the skirt with a white button-down shirt, black ghillies and black tights.The ghillie laces were fastened tightly around her ankles.\nSMART Vocabulary: related words and phrases\nShoes\nankle boot\nballet shoe\nBirkenstock\nbootie\nbootlace\nhigh-top\nhiking boot\nhobnail\nhobnail boot\ninsole\nsandal\nshoehorn\nshoelace\nshoemaker\nshoestring\nwedgie\nwellie\nwellington\nwelly\nwhitening\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCeremonial clothes & objects"}