{"id":165044,"name":"gif","type":"noun","us_sound":"ɡɪf","us_link":"../audio/g/cdo0318usgif2053.mp3","uk_sound":"ɡɪf","uk_link":"../audio/g/cdo0318ukgif0589.mp3","content":"Add to word list\nAdd to word list\na type of computer file that contains a still or moving image. GIF is the abbreviation for \"Graphic Interchange Format\": A GIF may contain more than one frame, so it can be animated. Animated GIFs are actually fairly easy to create.\nMore examplesFewer examplesA GIF that looks good when created on a Mac will often look too dark when displayed on a PC.The icon should be a GIF sized at 32 x 32 pixels.The drawing objects will be converted to GIFs for display in a browser.\nSMART Vocabulary: related words and phrases\nComputer programming & software\nabandonware\nad blocker\nad blocking\nadware\nanalytics\nCD-ROM\nfacial recognition software\nfactory setting\nfeature-limited\nfemtech\nfile system\nfirmware\ninstaller\nprogrammer\nspam filter\nspambot\nspeech recognition software\nspellchecker\nsplash screen\nspyware\nSee more results »\nrelating to a type of computer file that contains a still or moving image. GIF is the abbreviation for \"Graphic Interchange Format\": The GIF files are already compressed. An image editor can save files in GIF format.\nMore examplesFewer examplesAnimated icons are also referred to as gif images.How do you save a gif file and then place it in your blog?The pictures have been converted into gif format for this web page.\nSMART Vocabulary: related words and phrases\nComputer programming & software\nabandonware\nad blocker\nad blocking\nadware\nanalytics\nCD-ROM\nfacial recognition software\nfactory setting\nfeature-limited\nfemtech\nfile system\nfirmware\ninstaller\nprogrammer\nspam filter\nspambot\nspeech recognition software\nspellchecker\nsplash screen\nspyware\nSee more results »\nAdd to word list\nAdd to word list\nabbreviation for Graphic Interchange Format: a type of computer file that is often used for images on the internet: Scan the picture and email it to us in GIF format."}