{"id":165048,"name":"gift","type":"noun","us_sound":"ɡɪft","us_link":"../audio/g/gift.mp3","uk_sound":"ɡɪft","uk_link":"../audio/g/ukghast027.mp3","content":"gift noun\n(PRESENT)\nAdd to word list\nAdd to word list\nA2 [ C ] a present or something that is given: a birthday/wedding giftbear gifts The guests all arrived bearing (= bringing) gifts. Synonyms\noffering\npresent (SOMETHING GIVEN)\nThesaurus: synonyms, antonyms, and examples\nsomething that you givepresentThe coat was a birthday present from my sister.giftI have a small gift for you.donationAfter the earthquake, donations poured in from all over the world.grantStudents receive a grant equal to £250 per month.contributionShe wanted to make a financial contribution to the family.\nSee more results »\n[ C usually singular ] informal something that is surprisingly easy or cheap: That goal was a gift! £100 for a good leather coat? It's a gift!\nThesaurus: synonyms, antonyms, and examples\nsomething that is cheapbargainAnyone prepared to play a waiting game could bag a real bargain.giftAt one hundred pounds, this phone is a gift.snipUK Afternoon tea is a snip at £10 per head.good buyWoven cotton and linen are also a good buy.good dealYou may be able to get a better deal from your own bank.\nSee more results »\nMore examplesFewer examplesThanks to a large gift from an anonymous donor, the charity was able to continue its work.Please indicate which free gift you would like to receive.My husband and myself were delighted with the gift.It was easy to see the gift as a sort of bribe.She's got a secret admirer who keeps sending her gifts.\nSMART Vocabulary: related words and phrases\nPresents and gifts\nChristmas box\nChristmas stocking\ncomp\nfavour\nfree gift\nfreebie\ngiftee\ngiveaway\ngoody bag\ngrab bag\nlittle\nnovelty\noffering\nparty bag\npresent\nprezzie\nsecret Santa\nstocking\nstocking filler\ntoken\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEasiness and simplicity\ngift noun\n(ABILITY)\nC1 [ C usually singular ] a special ability to do something: gift for He has a gift for languages. Synonyms\naptitude\nflair\ntalent (NATURAL ABILITY)\nSMART Vocabulary: related words and phrases\nSkill, talent and ability\nability\naccomplishment\naccuracy\nacumen\nadroitness\nendowment\nflair\nforte\nfunctional skills\nfunctioning\ngenius\npolish\nprestidigitation\nproficiency\nprowess\npyrotechnic\nspeciality\nwheelhouse\nwizardry\nworkmanship\nSee more results »\nIdioms\na gift from the gods\nthe gift of the gab\nin sb's gift/in the gift of sb\nto give something in an official or formal way: The child's grandmother had gifted her £10,000.\nThesaurus: synonyms, antonyms, and examples\nto give something to someonegiveGive me that dirty plate.offerYour doctor should be able to offer advice.provideThis booklet provides useful information about local services.supplyThe lake supplies the whole town with water.donateFour hundred dollars has been donated to the school book fund.\nSee more results »\nto make it easy for an opponent to score, win, or be successful: She hit the ball into the net, almost gifting the set to her opponent.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\narm someone with something\ndish\nhand off\nhand something in\nhand something out\nhand something over\nhand something round\ninvest\noutfit\nreassignment\nrebid\nregift\nregive\nregrant\nspare\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing things to happen\nWinning, losing & scoring in sport\ngift noun [C]\n(PRESENT)\nAdd to word list\nAdd to word list\nsomething that is given, esp. to show your affection; a present: I have to get my sister a gift for her birthday.\ngift noun [C]\n(ABILITY)\na special or unusual ability; a talent: He has a gift for music – he plays the piano and sings beautifully.\nAdd to word list\nAdd to word list\nsomething that is given as a present: Thousands of people bought the book as a Christmas gift.\nsomething that you give without getting anything in return: You must convince the tax man that your gift is entirely for charitable purposes. See also\nbusiness gift\nfree gift\nto give something in an official or formal way: I gifted to my husband my 50 per cent share of the property."}