{"id":165063,"name":"gig","type":"noun","us_sound":"ɡɪɡ","us_link":"../audio/g/usgesta024.mp3","uk_sound":"ɡɪɡ","uk_link":"../audio/g/ukghast029.mp3","content":"gig noun [C]\n(PERFORMANCE)\nAdd to word list\nAdd to word list\ninformal a single performance by a musician or group of musicians, especially playing modern or pop music, or by a comedian (= a performer who makes people laugh, for example by telling jokes or funny stories): play a gig The band is going to Atlanta to play a gig at the Fox Theatre.do a gig The comedian did her first gig at the Comedy Store in London.\nMore examplesFewer examplesHe has been touring the globe and rocking audiences since his humble beginnings at bar gigs in Boston.We were asked to play at a benefit gig for charity.I much prefer a small intimate show to a faceless stadium gig.Kelvin loves to heckle when he goes to comedy gigs.\nSMART Vocabulary: related words and phrases\nMusical performances\nanti-musical\nbackspin\ncabaret\ncloth ears\ncloth-eared\ndate\nfog machine\nhave cloth ears phrase\nheadliner\nin concert idiom\njam session\nparty mix\npost-concert\nrecital\nset\nsetlist\nsoundscape\ntin ear\ntin-eared\nSee more results »\ngig noun [C]\n(JOB)\ninformal a job: get the gig She's well qualified, but I think it's unlikely she will get the gig.\nMore examplesFewer examplesTo get the gig at Saatchi &amp; Saatchi, she wrote a 500-word essay about where she saw herself in 2024.He had a comfortable enough gig as coach at Yale.He finally landed a steady gig as a busboy in an Italian restaurant. Her latest gig is trying to win voters on the election campaign trail.\ngig noun [C]\n(VEHICLE)\na light two-wheeled carriage pulled by one horse, used especially in the past: He had the horse and gig brought to the door.\nScience &amp; Society Picture Library/SSPL/GettyImages\na light, fast boat for rowing (= moving using long sticks called oars) or sailing: We had no sail in the gig, but the larger boat was fully equipped.\nMore examplesFewer examplesWhy does he not keep a horse and gig of his own?My good friend the Doctor treated me to a very pleasant ride in his gig.The gaudy painted gigs and steam boats greatly enlivened a very busy and interesting spectacle on the river.The captain ordered a boat to be lowered, but the gig capsized.\nSMART Vocabulary: related words and phrases\nCarriages & carts\nbrougham\nbuggy\ncarriage\ncarryall\nchaise\nchuckwagon\ncoupe\ncovered wagon\ndray\nhorse-drawn\nhorsebox\nox-drawn\npopemobile\nsedan chair\nstagecoach\nsurrey\ntrap\ntrishaw\ntuktuk\nwagon\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBoats & sailing craft\ngig noun [C]\n(UNIT)\na\ngigabyte : I don't get why people want to buy something that only has 14.5 gigs of useable memory.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\nmeg\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nSee more results »\n(of a musician or group of musicians) to perform gigs: She gigged at bars for years before becoming famous.\nSMART Vocabulary: related words and phrases\nPlaying music\naccompaniment\naccompany\nair guitar\nbeat something out\nbeatbox\nblow\npick\npick someone/something out\nplay (something) by ear idiom\nplayability\nplayable\npump\nraise\ntap\nthrow\ntickle the ivories idiom\ntranspose\ntransposition\nultra-smooth\nvibe\nSee more results »\nAdd to word list\nAdd to word list\na job, esp. one as a performer or one that lasts only a short time: Now many of his gigs as a singer-saxophonist are being put on hold.\nAdd to word list\nAdd to word list\nIT →\ngigabyte\nHR a job, often a temporary one: He landed a gig writing a new employee manual."}