{"id":165812,"name":"girl","type":"noun","us_sound":"ɡɝːl","us_link":"../audio/g/girl.mp3","uk_sound":"ɡɜːl","uk_link":"../audio/g/ukgiraf007.mp3","content":"Add to word list\nAdd to word list\nA1 [ C ] a female child or young woman, especially one still at school: Two girls showed us round the classrooms.\nThesaurus: synonyms, antonyms, and examples\na childchildWhen I was a child the summers seemed to go on for ever.boyThere's a new boy in my class. girlThe girl's name is Sally.kidI'm off to pick up the kids from school.kiddieI saw her with a little kiddie in a pushchair.little oneThe little ones must be hungry by now.\nSee more results »\nmonkeybusinessimages/iStock/Getty Images Plus/GettyImages\nA1 [ C ] a daughter: We have two girls. My little girl is five.\n[ C usually plural ] old-fashioned a woman worker, especially when seen as one of a group: shop/office girls the girls B1 [ plural ]\na group of female friends: I'm going out with the girls tonight.\nSee more\nMore examplesFewer examplesPolice are still looking for clues in their search for the missing girl.He touched the girl on the arm to get her attention.One little girl was clinging onto a cuddly toy.Both girls compete for their father's attention.He made quite an impression on the girls at the tennis club.\nSMART Vocabulary: related words and phrases\nChildren & babies\nankle-biter\narrival\nbabe\nbabe in arms\nbaby\ncomfort blanket\ncrawler\ndesigner baby\ndevil\ndiddums\nonly child\noops-a-daisy\npacifier\npapoose\nperisher\ntoddler\ntoilet-trained\ntomboy\ntot\ntyke\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEmployees & colleagues\nIdiom\na big/great girl's blouse\nAdd to word list\nAdd to word list\na female child or, more generally, a female of any age: Two little girls showed us around the kindergarten. The girls’ basketball team is undefeated.\nGirl sometimes means daughter: We have two girls, a six-year-old and an eight-year-old. Note: Many adult women consider it offensive to be called girls by other people, esp. men, although this was common in the past, and they might still call themselves or their friends girls."}