{"id":165985,"name":"give","type":"verb","us_sound":"ɡɪv","us_link":"../audio/g/give.mp3","uk_sound":"ɡɪv","uk_link":"../audio/g/ukgiraf022.mp3","content":"give verb\n(PROVIDE)\nAdd to word list\nAdd to word list\nA1 [ I or T ] to offer something to someone, or to provide someone with something: [ + two objects ] She gave us a set of saucepans as a wedding present. Can you give me a date for another appointment? They never gave me a chance/choice. Has the director given you permission to do that? [ + adv/prep ] We always try to give to charity. We're collecting for the children's home - please give generously.give (out) something to someone The police gave (out) road-safety booklets to the children (= gave them to all the children).give (up) your seat Please give (up) your seat to an elderly or disabled person if they need it.\nThesaurus: synonyms, antonyms, and examples\nto give something to someonegiveGive me that dirty plate.offerYour doctor should be able to offer advice.provideThis booklet provides useful information about local services.supplyThe lake supplies the whole town with water.donateFour hundred dollars has been donated to the school book fund.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto accommodate someoneaccommodateThere aren’t enough rooms to accommodate all the students.give accommodation toThe university gives free accommodation to nursing students.provide accommodation toWe only provide accommodation to first-year students.lodgeStudents will be lodged with host families.houseThe base can house up to 2,000 soldiers.put someone upI can put you up for a couple of nights.\nSee more results »\nB1 [ T ] to pay someone a particular amount: I gave the taxi driver £20 and told him to keep the change. give of your money, time, etc. formal\nto give your money, time, or best efforts, especially in a way that seems generous: We're very grateful to all the people who have given of their time.\nSee more give (something) your all old-fashioned (US also give (something)your best)\nto put a lot of effort into doing something: We must be finished by tonight, so I want you to give it your all.\nSee more\nA2 [ T ] to tell someone something: give something out The winner's name was given (out)/They gave the winner's name (out) on the news. [ + two objects ] Can you give Jo a message for me?\nThesaurus: synonyms, antonyms, and examples\nto tell someone somethingtellMy friend told me you were looking for me.let someone knowLet me know if you'd like to come.giveCan you give the message to Jo?communicateA 60-second TV commercial isn't always the best way to communicate a complex medical message.informThe relatives of the injured have been informed of the accident.notifyThe school has to notify parents if their children do not arrive at school.\nSee more results »\n[ T ] to punish someone by sending them to prison for a particular period: [ + two objects ] If you're found guilty, they'll give you three years.\nB1 [ T ] to allow a person or activity a particular amount of time: [ + two objects ] I'm nearly ready - just give me a couple of minutes.\n[ T ] informal to calculate that something will last a particular amount of time: [ + two objects ] Look at that old car she bought - I give it two weeks before it breaks down.\nMore examplesFewer examplesCan you give any evidence to support your claim?I'm never going to guess the answer if you don't give me a clue.The letters that people wrote after his death gave me a lot of comfort.A loving family environment gives children that sense of stability and permanence which they need.I'm a bit wary of/about giving people my address when I don't know them very well.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\nafford\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPaying money\nAnnouncing, informing & stating\nPutting people in prison\nAllowing and permitting\nPredicting things and intuition\ngive verb\n(CAUSE)\nB1 [ T ] to produce or cause something: [ + two objects ] The fresh air gave us an appetite (= made us hungry). What you said has given me an idea.give (out) The alarm gave (out) a high-pitched sound. give someone to understand (that) formal (also give someone to believe (that))\nto tell someone something or cause someone to think that something is true: I was given to understand she was staying at this hotel.\nSee more give it to be understood (that) formal old-fashioned (also give it to be believed (that))\nto tell someone something or cause someone to think that something is true: Upon quitting home, she gave it to be understood that she was about to visit her aunt in the Rue des Drômes. He even gave it to be understood that there has been some kind of massacre. I did not say, as you gave it to be believed, that the gentleman was to blame. Compare\ngive someone to understand (that) formal\nMore examplesFewer examplesThe photocopier is giving me all sorts of problems.The noise and heat of the office was giving him a headache.The success of the team gave the manager great satisfaction.The teacher's comments gave her confidence.The red carpet gave the ceremony a real sense of occasion.\nSMART Vocabulary: related words and phrases\nCreating and producing\nanti-creative\nartefact\nattribute\nattribute something to someone\nbang something out\nbash\ncrank\ngenerative\ngenerativity\ngrind something out\nhandmade\nknock\nremake\nrig\nrig something up\nroll (something) out\nrollout\nrun something up\nspin\nyield\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDefining & explaining\ngive verb\n(DO)\nA2 [ T ] to perform an action: [ + two objects ] She gave me a smile/strange look.give something a push They had to give the car a push to start it.give someone a call/ring Give me a call/ring (= phone me) when you get back from holiday. Who is giving the speech/lecture/concert?\nA2 [ T ] to organize a party, meal, etc.: They're always giving parties. The ambassador is giving a banquet for the visiting president. give something a go\nto attempt something: Only a few people are successful as professional athletes, but it's worth giving it a go.\nSee more\n[ T + two objects ] formal to say publicly that everyone present at a formal occasion, especially a meal, should drink a toast to someone (= have a drink in honour of someone): Ladies and Gentlemen, I give you the president!\nMore examplesFewer examplesTo celebrate his birthday, Tony gave a party.The producer gave a party to thank all the people who had helped in the making of the film.She gave a sigh of relief as the car came to a stop.Just give the ends a trim, please.If you don't give it a go, you'll never know what you could have achieved.\nSMART Vocabulary: related words and phrases\nActing and acts\n(your) every move idiom\n-ence\nact\nact for someone\nact/do something on your own responsibility idiom\nADL\nagency\nant\nbeat\ner\nexecution\nexploit\nmove\nput your money where your mouth is idiom\nresponsibility\nrole-play\nrot\nstep\nstuff\ntalk\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nManaging and organizing\nDrinking alcohol\ngive verb\n(STRETCH)\n[ I ] If something gives, it stretches, bends, or breaks, or becomes less firm or tight, under pressure: give under/with The rope gave under/with the weight of the load. The shoes will give a little after you've worn them once or twice.figurative You can't work so hard all the time - something will have to give (= change).give (out) figurative Suddenly her patience gave (out) and she shouted angrily at the children.\nSMART Vocabulary: related words and phrases\nBecoming bigger\naccrete\naccrue\nanti-growth\nballoon\nbell\nbillow\nbump\nelongate\nengorged\nenlarge\nenlargement\nexpansion\npile\npile on the pounds idiom\npuff\npuff up\nput something on\nregenerate\nscalability\nstretch\nSee more results »\ngive verb\n(DECIDE)\n[ T + obj + adj ] UK in some sports, to decide and state officially that a player or the ball is in a particular condition or place: The umpire gave the batsman out. The ball was clearly out, but the line judge gave it in.\nSMART Vocabulary: related words and phrases\nAnnouncing, informing & stating\nacquaint someone/yourself with something\nannunciation\napprise someone of something\navowedly\nawaken someone to something\nbreak\nbreathe/say a word idiom\ndisseminate\nimpart\non the record idiom\npass\nproclaim\npropagate\nput something before someone\nput something out\nput something out of its misery idiom\nrapporteur\nreportable\nreported\nstatement\nSee more results »\nIdioms\ndon't give me that!\ngive as good as you get\ngive or take\ngive me ... any day/every time!\ngive way\ngive someone what for\ngiven the chance/choice\nwhat I wouldn't give for something\nI would give anything/a lotPhrasal verbs\ngive something away\ngive someone away\ngive something back\ngive in\ngive something in\ngive something off\ngive onto something\ngive out\ngive something out\ngive over\nMore phrasal verbs\ngive something over to something/someone\ngive yourself over/up to something\ngive up\ngive up something\ngive up (something)\ngive (something) up\ngive something up\ngive someone up\ngive yourself up\ngive up on someone/something\nthe quality of stretching, bending, or breaking, or becoming less firm or tight, under pressure: A sweater knitted in pure cotton doesn't have much give (= will not stretch much). Compare\nbounce noun (MOVEMENT)\nspring noun (CURVED METAL)\nSMART Vocabulary: related words and phrases\nFlexible, loose and yielding\nadrift\nbendable\nbendy\nductile\nductility\nfloppiness\nflowing\njointed\nlimply\nlimpness\npliant\npliantly\nrelax\nrubbery\nsemi-flexible\nsuppleness\ntensile\nunstayed\nunstuck\nyielding\nSee more results »\ngive verb\n(OFFER)\nAdd to word list\nAdd to word list\n[ T ] to offer something of your own to another person or thing, or to allow something you own or control to be owned or used by another: We’re collecting for the Red Cross – please give what you can. We’re giving Helen a salad bowl/We’re giving a salad bowl to Helen as a wedding present. Give me back my book/Give my book back (= Return my book). Give her enough time (= Allow her to have enough time) to finish the exam.\ngive verb\n(PRODUCE)\n[ T ] to produce or cause something: He gave me a hard push. Give me a phone call when you get home. The president is giving a speech tonight. The fresh air gave us an appetite (= made us hungry). We’re giving a birthday party for Kareem. He gave me the impression (= He made me think) that the deal would go through. This car has given (= caused) me lots of trouble ever since I got it.\ngive verb\n(STRETCH)\n[ I ] to stretch or become looser: New shoes will give a little after you’ve worn them a few times. fig. The negotiations are completely deadlocked, and neither side will give an inch (= each refuses to change its position even a little).\ngive noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ɡɪv/\nA cotton sweater doesn’t have much give. Idioms\ngive someone a break\ngive someone a heads up\ngive a hoot\ngive someone a piece of your mind\ngive someone a run for his or her money\ngive something a whirl\ngive someone hell\ngive or take\ngive rise to something\ngive someone the benefit of the doubt\nMore idioms\ngive someone the cold shoulder\ngive way\ngive way to something\nnot give someone the time of day\nsomeone would give anything for something\nsomeone would give someone the shirt off his or her back\nPhrasal verbs\ngive away something\ngive away something\ngive in\ngive off something\ngive out\ngive out something\ngive up (something)\ngive up on something/someone\nAdd to word list\nAdd to word list\nto offer something to someone or provide them with it, especially without asking for any payment: give sb sth Can you give me a date for another appointment?give sth to sb We gave over 200 free copies of the software to a local educational institution.\nto pay a particular amount of money to someone for something: give sth for sth What would you give for this painting? There are people starving as a result of the disaster, so please give generously.\nto allow a person or activity a particular amount of time: You should give at least two days for writing the report. give sb a moment/minute/second I'm nearly finished - just give me a moment.\nPhrasal verbs\ngive sth away\ngive in (to sth)\ngive up"}