{"id":166067,"name":"glad","type":"adjective","us_sound":"ɡlæd","us_link":"../audio/g/glad.mp3","uk_sound":"ɡlæd","uk_link":"../audio/g/ukglaci002.mp3","content":"Add to word list\nAdd to word list\nA2 pleased and happy: glad about We were glad about her success.glad (that) I'm glad (that) you came.glad to I'm glad to know the parcel arrived safely.(only too) glad to I'd be (only too) glad to help you.glad of We'd be glad of the chance to meet her.\nThesaurus: synonyms, antonyms, and examples\nfeeling or showing pleasurehappyI'm much happier in my new job.cheerfulShe's always very cheerful.in a good moodYou're in a good mood this morning!pleasedHe was pleased that she had come back.gladI was so glad to see her.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nshowing or expressing thanks to someonegratefulI'm grateful for your kindness.appreciativeI'm really appreciative of all the help you've given me.I/we appreciateI really appreciate all the help you've given me.glad ofWe were very glad of some extra help.indebted toI'm indebted to my parents for all their love and support.\nSee more results »\nMore examplesFewer examplesI'm really glad she got the job.I'll be glad to get these exams over with.I'm so glad I don't have to give that speech.I'm so glad to see you!I'll be so glad when this project is finished.\nSMART Vocabulary: related words and phrases\nFeeling pleasure and happiness\n(as) pleased as Punch idiom\nASMR\nbe dancing in the streets idiom\nbe floating on air idiom\nbe full of the joys of spring idiom\nchipper\nchirpily\nchirpy\nchuffed\ncontented\nhappily\nhappy camper\nhappy place idiom\njaunty\njocund\nshining\nsunnily\nswooning\nswooningly\nswoony\nSee more results »\nRelated word\ngladnessIdiom\ngive someone the glad eye\nAdd to word list\nAdd to word list\npleased and happy: [ + (that) clause ] We were glad (that) she succeeded. [ + to infinitive ] You don’t have to thank us – we were glad to help. I'm glad of the opportunity to express my thanks. gladly adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈɡlæd·li/\nI’d gladly show her around, but I’ll be on vacation next week."}