{"id":166277,"name":"glassing","type":"noun","us_sound":"ˈɡlæs.ɪŋ","us_link":"../audio/g/cdo0319usglas0807.mp3","uk_sound":"ˈɡlɑː.sɪŋ","uk_link":"../audio/g/cdo0319ukglas0719.mp3","content":"glassing noun [C]\n(ATTACK)\nAdd to word list\nAdd to word list\nthe act of attacking someone with a broken bottle or glass: He was convicted of a vicious assault – a glassing where another man lost his right eye. They are looking at introducing plastic cups to deal with the growing number of glassings in pubs caused by intoxicated people.\nMore examplesFewer examplesEvery morning there is another glassing where someone is seriously injured or someone is assaulted, knifed or beaten up.I am fed up with the thug-like behaviour of some patrons and news of glassings.Posh kids dress and talk differently when they go nightclubbing so as not to run the risk of a glassing.\nSMART Vocabulary: related words and phrases\nCutting and stabbing\nabrasion\nbayonet\nbutcher\ncarve\ncarving\nchisel\nchop\nincise\njulienne\nlacerate\nlacerated\nlaceration\nsheep shearing\nslash\nslice\nsliced\nslit\nsnip\nspike\ntransect\nSee more results »\nglassing noun [C]\n(SEARCHING)\nUS the act of searching using binoculars (= a pair of tubes with glass lenses at either end that let you see things far away more clearly), for example when looking at animals in the wild: Binoculars are lightweight, portable, and great for glassing on the go. Just to see the bear was an amazing feat of glassing.\nMore examplesFewer examplesGlassing with low-quality binoculars will leave your eyes feeling sore.There's more to glassing than just randomly looking around with binoculars. Top-quality optics are essential to effective glassing and stalking.\nSMART Vocabulary: related words and phrases\nMiscellaneous games & activities\nair hockey\nbeer pong\nbelly dancing\nbran tub\nbuildering\nChinese puzzle\njigsaw\njump rope\nkeepy-uppy\nkite\nkorfball\nLARP\nLARPer\norigami\npinball\nsubworld\nsudoku\ntable football\ntabletop\ntailgating\nSee more results »"}