{"id":166349,"name":"glazed","type":"adjective","us_sound":"ɡleɪzd","us_link":"../audio/g/usgladi010.mp3","uk_sound":"ɡleɪzd","uk_link":"../audio/g/ukglass009.mp3","content":"glazed adjective\n(GLASS)\nAdd to word list\nAdd to word list\nmade of or containing glass: All the rooms have glazed doors. Use the glazed cupboards to display attractive china. Opposite\nunglazed (WITHOUT GLASS)\nMore examplesFewer examplesThis will become a glazed central atrium, with apartments leading off. The stylish rooms are open-air with no glazed windows.Some panels in the glazed canopy started to crack and fall on to the platforms below.\nSMART Vocabulary: related words and phrases\nGlass\nblow\nblower\nblowpipe\ncut glass\nfibreglass\nfrit\nfrost\nfrosted\nglaze\nglazier\nglazing\nlooking glass\nmirror\npaste\npunty\nPyrex\nreglaze\nsafety glass\nshatterproof\nvitrify\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParts of buildings: windows & parts of windows\nglazed adjective\n(LACKING EXPRESSION)\n(of your eyes) still and not showing any emotion because you are bored or tired or have stopped listening: a glazed expression/look Noticing my slightly glazed eyes, he quickly summarized his points.\nMore examplesFewer examplesHe was staring straight ahead with a glazed look in his eyes.Teenagers with glazed eyes sat in front of the videos eating chicken.I wondered why everyone was looking into space with glazed expressions.\nSMART Vocabulary: related words and phrases\nNot paying attention\nabsent\nabsent-minded\nabsent-mindedly\nabsent-mindedness\nabsently\ndreamily\ndreamy\ndrop/lower your guard idiom\nfaraway\ngnat\nlaxity\nlaxly\nlike a bull in a china shop idiom\nmerrily\nmisfocus\nunguarded\nunmindful\nunwarily\nunwary\nzone out\nSee more results »\nglazed adjective\n(SHINY)\nhaving a shiny surface, made by putting a liquid substance onto something and leaving it or heating it to dry: The feast included spring onion pancakes with glazed duck breast. Portugal is renowned for its colourful and hand-painted glazed pottery and tiles. Opposite\nunglazed (NOT SHINY) See\nglaze\nMore examplesFewer examplesA typical glazed donut has about 180 calories and 8 grams of fat. Serve with mashed potatoes and glazed carrots.Glazed ceramic is lightweight and also retains the heat so tea stays hotter longer.\nSMART Vocabulary: related words and phrases\nCeramics & pottery\namphora\nbiscuit ware\nbisque\nbisqueware\nbone china\nchina\nchinoiserie\nearthen\nearthenware\nfire\nglaze\nkiln\nporcelain\npotter\npotter's wheel\npottery\nterracotta\nthrow\nware\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPreparing food"}