{"id":166724,"name":"glitch","type":"noun","us_sound":"ɡlɪtʃ","us_link":"../audio/g/glitch.mp3","uk_sound":"ɡlɪtʃ","uk_link":"../audio/g/ukglitc001.mp3","content":"Add to word list\nAdd to word list\na small problem or fault that prevents something from being successful or working as well as it should: We'd expected a few glitches, but everything's gone remarkably smoothly. The system has been plagued with glitches ever since its launch.\nThesaurus: synonyms, antonyms, and examples\na problemproblemWhat's the problem here?difficultyThe company is having some financial difficulties at the moment.troubleWe've had a lot of trouble with the new computer system.hitchThe ceremony went without a hitch.glitchWe've had a few technical glitches, but I'm confident we'll be ready on time.hurdleGetting a work permit is only the first hurdle.\nSee more results »\nelectronics\n&#160; specialized a sudden unexpected increase in electrical power, especially one that causes a fault in an electronic system: The computer failure was due to a glitch caused by lightning.\nSMART Vocabulary: related words and phrases\nDifficult things and people\na (heavy) cross to bear idiom\nalbatross\nball and chain\nbane\nbe dead meat idiom\nbe in the clear idiom\nbump\nequation\nhindrance\nhot potato\nimpediment\nincubus\nmarathon\nnut\nstumbling block\nteaser\nteething troubles\nthorn in your flesh/side idiom\ntie someone up\ntwist\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nElectricity & electronics\nto experience a small fault or problem, especially one that stops something from working: The mail system has glitched a couple of times recently. At that moment the videophone glitched.\nMore examplesFewer examplesSometimes, the app will glitch and I can't connect to the server.The equipment glitches at every key frame.I think my listening skills glitched for a minute.\nSMART Vocabulary: related words and phrases\nExperiencing difficulties\nbe\nbe (caught) between a rock and a hard place idiom\nbe climbing the walls idiom\nbe for the high jump idiom\nbe/come up against a brick wall idiom\nembattled\nfall into something\nflounder\nfrying pan\nfumble\njungle\nleg\nnot have a leg to stand on idiom\non a razor edge idiom\nout of the frying pan into the fire idiom\npickle\npressed\nrocky\nsticky\nweed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nElectricity & electronics\nAdd to word list\nAdd to word list\na problem or fault: a technical glitch a minor glitch\nAdd to word list\nAdd to word list\na small problem or mistake that prevents something from being successful or working as well as it should: The system has been plagued with glitches ever since its launch."}