{"id":166771,"name":"globetrotting","type":"noun","us_sound":"ˈɡloʊbˌtrɑː.t̬ɪŋ","us_link":"../audio/g/usgladi030.mp3","uk_sound":"ˈɡləʊbˌtrɒt.ɪŋ","uk_link":"../audio/g/ukglitc020.mp3","content":"Add to word list\nAdd to word list\nthe act of travelling to a lot of different countries: The prime minister's globetrotting has led to accusations that he is ignoring domestic problems. Arnold has certainly done his fair share of globetrotting. See\nglobetrotter\nMore examplesFewer examplesAfter a lifetime of globetrotting , she decided to settle down with her Scots husband.He's busy globetrotting from China to Africa to the US.He spent his entire career globetrotting with the marines.\nSMART Vocabulary: related words and phrases\nTravellers & visitors\nbird of passage\ncaravan\ncarpool\ndaily passenger\nday-tripper\ndrifter\nemmet\nexpedition\nflashpacker\nhouseguest\nitinerant\npassenger\npioneer\nsightseer\nstayer\nsuper-commuter\nswagman\ntouristic\ntouristically\ntripper\nSee more results »\ntravelling or involving travel to a lot of different countries: a globetrotting lifestyle She has an exciting, globetrotting career accompanying him to meetings with the leaders of other countries. See\nglobetrotter\nMore examplesFewer examplesI might have left it too late for a career as a globetrotting professional surfer.the stresses and strains of being a globetrotting rock starHe has a track record as a globetrotting policy adviser.\nSMART Vocabulary: related words and phrases\nTravellers & visitors\nbird of passage\ncaravan\ncarpool\ndaily passenger\nday-tripper\ndrifter\nemmet\nexpedition\nflashpacker\nhouseguest\nitinerant\npassenger\npioneer\nsightseer\nstayer\nsuper-commuter\nswagman\ntouristic\ntouristically\ntripper\nSee more results »\nAdd to word list\nAdd to word list\ntravelling regularly to different parts of the world: a globetrotting executive/journalist/diplomat a globetrotting career/schedule\nregular travel to different parts of the world: She wants less work and a lot more globetrotting."}