{"id":166880,"name":"gloomy","type":"adjective","us_sound":"ˈɡluː.mi","us_link":"../audio/g/gloomy.mp3","uk_sound":"ˈɡluː.mi","uk_link":"../audio/g/ukglitc027.mp3","content":"gloomy adjective\n(WITHOUT HOPE)\nAdd to word list\nAdd to word list\nunhappy and without hope: a gloomy person/expression The cemetery is a gloomy place.\nnot expecting or believing anything good in a situation: a gloomy economic forecastUK The vet is rather gloomy about my cat's chances of recovery.\nSMART Vocabulary: related words and phrases\nNot hopeful\nbe in a funk idiom\nbe on a hiding to nothing idiom\nbleakly\nbleakness\ndispiritedly\ndispiritedness\ndispiritingly\ndoomed\ndoomster\ndowncast\nhiding\nhope\nhopeless\nhopelessly\nhopelessness\npessimistically\nprophet of doom idiom\nsomeone can't win idiom\nundone\nwhat are you going to do? idiom\nSee more results »\ngloomy adjective\n(DARK)\ndark in a way that is unpleasant and makes it difficult to see: What gloomy weather we're having! We waited in a gloomy waiting room.\nThesaurus: synonyms, antonyms, and examples\nwith little or no lightdarkShe peered down the dark hallway.darkenedWe arrived late and had to make our way to our seats in a darkened theatre.dimHe sat in a dim corner of the waiting room.shadowyI was afraid to walk down the dim, shadowy corridor.pitch blackIt was pitch black on our street after the power outage.\nSee more results »\nSMART Vocabulary: related words and phrases\nDarkness & becoming dark\nblackness\ndarken\ndarkened\ndarkness\ndim\ndimly\ndimness\ndingily\ndingy\ndraw\ninky\nmatt\npitchy\nsemi-darkness\nshaded\nshadily\nshadow\nshadowily\nshadowy\ntwilight\nSee more results »\nRelated words\ngloomily\ngloominess\nAdd to word list\nAdd to word list\nhaving or showing a lack of hope: Despite gloomy predictions, the stock market remains strong.\ndark or nearly dark: It was another gray, gloomy day. gloomily adverb us\nYour browser doesn't support HTML5 audio\n/ˈɡlu·mə·li/\nHe watched gloomily as the bus drove off. The day began gloomily when the power went out.\nAdd to word list\nAdd to word list\nnot giving much hope for the future: The stock market is sinking on the back of gloomy economic news. Despite the gloomy outlook for personal computer sales in the United States, sales in Japan are strong."}