{"id":166898,"name":"glory","type":"noun","us_sound":"ˈɡlɔːr.i","us_link":"../audio/g/glory.mp3","uk_sound":"ˈɡlɔː.ri","uk_link":"","content":"glory noun\n(ADMIRATION/PRAISE)\nAdd to word list\nAdd to word list\n[ U ] praise and thanks, especially as given to God: Glory be to God! He dedicated his poetry to the glory of God.\nC1 [ U ] great admiration, honour, and praise that you earn by doing something successfully: glory of He revelled in the glory of scoring three goals in the final eight minutes.a blaze of glory This was her final professional match, and she wanted to end her career in a blaze of glory.\nThesaurus: synonyms, antonyms, and examples\nfamefameHis daring fashions brought him fame in the 1950s.celebrityThose who court celebrity must be prepared to pay the price.stardomHe achieved stardom late in life.superstardomThe band rose to superstardom in the 1990s.renownShe is a violinist of international renown.\nSee more results »\n[ C ] an important achievement that earns someone great admiration, honour, and praise: The reunion is an opportunity for the soldiers to remember their past glories.\nMore examplesFewer examplesHe basked in his moment of glory, holding the trophy up to the crowd.He ascended into Heaven, where He reigns in everlasting glory.He knew that to win this battle would bring him true glory.Despite their early promise, neither of these fine players achieved true glory.These athletes push their bodies to the limit for the ultimate glory of breaking the world record.\nSMART Vocabulary: related words and phrases\nWorshipping a god\nadoration\nadore\nchurchgoing\ndeification\ndeify\ndevotional\ndevotionally\ndevout\ndevoutly\ndevoutness\ngodliness\ngodly\nPharisee\npiety\npious\npiously\npraise\nworship\nworshipper\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShowing respect and admiration\nglory noun\n(BEAUTY)\nC1 [ C or U ] great beauty, or something special or extremely beautiful, that gives great pleasure: They want to restore the castle to its former glory.in all its glory The garden in all its glory is now open to the public.\nSMART Vocabulary: related words and phrases\nBeauty and attractiveness\naesthetic\nattractiveness\nbeauty\nchic\ncrowning glory idiom\ngood looks\ngorgeousness\ngrace\ngracefulness\ngrandeur\nlustre\nlustrously\nmagnificence\nmajestically\nmajesty\nshapeliness\nsplendour\nstateliness\nsublimity\nsultriness\nSee more results »\nIdioms\nbask/bathe in reflected glory\ncover yourself in/with glory\ncrowning glory\nan expression of praise and thanks to God: \"Glory, Hallelujah!\" There were shouts of \"Glory be!\" and \"Hallelujah!\"\nold-fashioned used to express any strong emotion, especially surprise or enjoyment : \"Glory!\" he said. Glory be! Who would have expected that? Glory be - what a wonderful view!\nSMART Vocabulary: related words and phrases\nLinguistics: interjections\naiyo\nattaboy\nattagirl\nauf Wiedersehen\naw shucks\ndoctor\neat your heart out idiom\nfigure\nmazel tov\nmore\nmore power to your elbow! idiom\nneed\nneed I say more? idiom\nperiod\nsmall wonder idiom\nthe rest is history idiom\nyou should have seen/heard something/someone idiom\nyou the man! idiom\nyuk\nyum yum\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExpressions of surprise\nglory noun\n(ADMIRATION)\nAdd to word list\nAdd to word list\n[ U ] great admiration, honor, and praise that you earn by achieving something, or something which deserves admiration or honor: He basked in the glory of his victory. Winning the championship was the crowning glory of her career (= it was her highest achievement).\nglory noun\n(BEAUTY)\n[ C/U ] great beauty, or something that is very beautiful or excellent: [ U ] They are restoring the building to its former glory. [ C usually pl ] the glories of ancient Egypt"}