{"id":167184,"name":"glug","type":"verb","us_sound":"ɡlʌɡ","us_link":"../audio/g/cdo0318usglug2080.mp3","uk_sound":"ɡlʌɡ","uk_link":"../audio/g/cdo0318ukglug0599.mp3","content":"glug verb\n(DRINK)\nAdd to word list\nAdd to word list\n[ T or I ] to drink something in large mouthfuls: He glugs the milk straight from the bottle. She is glugging from a huge container of orange juice.\nMore examplesFewer examplesShe took a small sip, then glugged the rest of the water. He is glugging coffee, typing a last-minute report into his computer.He grabbed a bottle of beer and glugged thirstily.\nSMART Vocabulary: related words and phrases\nSounds made by humans with their mouths\ncatcall\ncaterwauling\ncheer\ncrow\ncrunch\nembouchure\ngroan\ngrowl\nhiss\nlaugh, shout, scream, etc. your head off idiom\nmewl\nparosmia\nsquall\nunsounded\nvocalization\nwhistle\nwhoop\nwolf whistle\nyelp\nyowl\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDrinking\nglug verb\n(MAKE SOUND)\n[ I ] (of a liquid) to make a sound when poured or drunk: The dirty water glugged away. You can hear the water glugging into a glass.\nMore examplesFewer examplesHe found two cans, two handfuls of ice, and had the soda glugging into a pair of glasses.The diesel fluid glugged down a rubber pipe into a tank hidden in the back of a van.You could confuse the gin with cologne as it glugs out of the bottle.There is an art to making a bottle glug.\nSMART Vocabulary: related words and phrases\nSounds made by objects, movement or impact\nbang around\nbong\nburble\nchoo-choo\nchuff\nclick away\nclicker\nclinking\ncrunch\nplop\nresonance\nsplat\nsplutter\nsputter\nsqueak\ntintinnabulation\ntoot\nunsounded\nwhirr\nwhite noise\nSee more results »\nglug noun [C]\n(SOUND)\nthe sound that a liquid makes when it is poured or drunk: You could almost hear the glug of another celebratory whisky pouring into the glass. I emptied the can of oil into the engine - glug, glug, glug.\nMore examplesFewer examplesYou could hear the glug of more wine being poured. All you could hear was the glug of the water cooler.The pipework under the sink makes a loud glug sound every few minutes.\nSMART Vocabulary: related words and phrases\nSounds made by objects, movement or impact\nbang around\nbong\nburble\nchoo-choo\nchuff\nclick away\nclicker\nclinking\ncrunch\nplop\nresonance\nsplat\nsplutter\nsputter\nsqueak\ntintinnabulation\ntoot\nunsounded\nwhirr\nwhite noise\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSounds made by humans with their mouths\nglug noun [C]\n(AMOUNT)\nan amount of a liquid that is poured: Add a good glug of olive oil. I usually add a glug or two of balsamic vinegar to the dressing.\nMore examplesFewer examplesThen pour in a spoonful of grainy mustard and a glug or two of cream.Add a glug of water if the mixture looks like it's becoming a little dry.You can lose three grams of fat by brushing a tiny bit of oil in the pan instead of using the usual generous glug.\nSMART Vocabulary: related words and phrases\nWords meaning small pieces and amounts\nby a nose idiom\nclipping\ncrumb\ndab\ndash\ndollop\ngrain\nparing\npeewee\npinch\npotsherd\nray\nskinny\nspark\ntad\nthimbleful\ntidbit\ntiddler\ntitbit\ntrace\nSee more results »"}