{"id":167231,"name":"glut","type":"noun","us_sound":"ɡlʌt","us_link":"../audio/g/glut.mp3","uk_sound":"ɡlʌt","uk_link":"../audio/g/ukglori028.mp3","content":"Add to word list\nAdd to word list\na supply of something that is much greater than can be sold or is needed or wanted: glut on/in the market The fall in demand for coffee could cause a glut on/in the market.glut of The current glut of graduates means that many of them will not be able to find jobs. Synonym\noversupplyCompare\nsurfeit formal\nSMART Vocabulary: related words and phrases\nToo much and unnecessary\nado\nbe up to your neck (in something) idiom\nbellyful\nbinge\ncarry/take coals to Newcastle idiom\ndrown\ngush\nhyper\nimmoderate\nimmoderately\ninappeasable\ninessential\noverdose\nplenty\npleonasm\npleonastic\nplethora\nproliferation\nunwarranted\nweigh someone/something down\nSee more results »\nto provide more of something than is needed or wanted, or more of something than can be sold: Higher mortgage rates and over-building left some markets glutted with unsold houses.\nMore examplesFewer examplesIf Middle Eastern oil continues to flow, Russia's new pipelines might serve only to glut the market and drive the price of oil further downward.This country is glutted with tasty, inexpensive high-calorie foods.In recent months, an enormous supply of ethanol has glutted the market, sinking its price.It bears no resemblance to the crime procedurals that glut the network schedules.Unlike the winking, self-referential spate of teen horror films that have glutted multiplexes since Scream, this film is actually scary.\nSMART Vocabulary: related words and phrases\nToo much and unnecessary\nado\nbe up to your neck (in something) idiom\nbellyful\nbinge\ncarry/take coals to Newcastle idiom\ndrown\ngush\nhyper\nimmoderate\nimmoderately\ninappeasable\ninessential\noverdose\nplenty\npleonasm\npleonastic\nplethora\nproliferation\nunwarranted\nweigh someone/something down\nSee more results »\nAdd to word list\nAdd to word list\na supply or amount that is much greater than necessary: a glut of new housing a glut of information\nAdd to word list\nAdd to word list\na supply of something that is much more than can be sold or is needed or wanted: a glut on/in the market The fall in demand for coffee could cause a glut in the market.a glut of sth The current glut of graduates means that many of them will not be able to find jobs.\nto supply something in much greater quantities than can be sold or is needed or wanted: glutted with sth Higher mortgage rates and over-building left some markets glutted with unsold houses."}