{"id":167454,"name":"go","type":"verb","us_sound":"ɡoʊ","us_link":"../audio/g/go.mp3","uk_sound":"ɡəʊ","uk_link":"../audio/g/ukglutt024.mp3","content":"go verb\n(MOVE/TRAVEL)\nAdd to word list\nAdd to word list\nA1 [ I usually + adv/prep ] to travel or move to another place: We went into the house.go to I went to Paris last summer. Have you ever been there? We don't go to the cinema very often these days.go by Wouldn't it be quicker to go by train? Does this train go to Newcastle? Where do you think you're going? Shouldn't you be at school?\nThesaurus: synonyms, antonyms, and examples\nto take someone somewheretakeI have to take my mother to the doctor today.go withI offered to go with him to the police station.come withCan you come to the hospital with me?accompanyChildren under 12 must be accompanied by an adult.driveMy husband usually drives the kids to school.give someone a liftCan you give me a lift into town?\nSee more results »\nA1 [ I usually + adv/prep ] to be in the process of moving: Can't we go any faster?go along We were going along at about 50 miles an hour.go down Go down the road for about a mile, and then turn right at the junction.go upstairs/downstairs He went upstairs/downstairs to his office.go over Go over the bridge and take the first right.go through When you go through a tunnel, your phone will lose signal.go around/round UK figurative I've got a tune going around/round in my head (= I am continually hearing it) and I just can't remember the name of it.\nA1 [ I ] to move or travel somewhere in order to do something: [ + -ing verb ] We go shopping every Friday night. I've never gone skiing.go for They've gone for a walk, but they should be back soon. [ + to infinitive ] She went to meet Blake at the station. There's a good film on at the Odeon. Shall we go? where has/have something gone?\nsaid when you cannot find something: Where have my keys gone?\nSee more\nMore examplesFewer examplesYou won't be able to go swimming tomorrow if your cold hasn't cleared up.You should change trains at Peterborough if you're going to Newcastle.We went dancing at a nightclub.I was thinking we might go on a shopping trip on Saturday.Simon and Jo have gone to visit their grandmother this weekend.\nSMART Vocabulary: related words and phrases\nGeneral words for movement\nbetake\nbudge\nbudge up\ncarry\ncirculate\ndad dancing\ngangway\ngone\nkinetic\nkinetic energy\nkinetically\nlibration\nlocomotion\nmotion\npass\nround\nscoot\nseethe\nshove\nslip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTravelling\ngo verb\n(LEAVE)\nB1 [ I ] to leave a place, especially in order to travel to somewhere else: Is it midnight already? I really must go/must be going.go home She wasn't feeling well, so she went home early.mainly UK What time does the last train to Bath go? I'm afraid he'll have to go (= be dismissed from his job) - he's far too inefficient to continue working for us. This carpet's terribly old and worn out - it really will have to go (= be got rid of). to go US\nIf you ask for some food to go at a restaurant, you want it wrapped up so that you can take it away with you instead of eating it in the restaurant: I'd like a cheeseburger and strawberry milkshake to go, please.\nSee more\n[ I ] polite word for to die: She went peacefully in her sleep.\nMore examplesFewer examplesYou can stay if you want, but I'm going to go.The next train for Manchester goes in ten minutes.Get your coat, we're going.He was here a minute ago, but he must have just gone.He was disappointed to find they'd already gone.\nSMART Vocabulary: related words and phrases\nDeparting\nabandon\nabandon ship\nabandonment\nabsquatulate\nbackward\ngone\nmove\np.o.q.\npeel away/off\npiss off\npull\npull something off\npush along\nsea\nstrike\nturf something out\nvacate\nvamoose\nwalk\nwalk off (somewhere)\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDeath and dying\ngo verb\n(LEAD)\nB1 [ I + adv/prep ] If a road, path, etc. goes in a particular direction, it leads there: go to This road goes to Birmingham.go from something to something A huge crack went from the top to the bottom of the wall.\n[ I usually + adv/prep ] to continue for a particular length: go down The tree's roots go down three metres.\nMore examplesFewer examplesTheir friendship goes back to when they were at school together.The M4 goes from London to Bristol.The tunnel goes right underneath the city.The cable went from the video into the back of the TV.The scratch goes along the entire length of the vehicle.\nSMART Vocabulary: related words and phrases\nTaking someone somewhere or telling them the way\naccompanied by someone/something\naccompany\naccompany someone to something\nbring\nbring someone/something along\nchaperone\nconvoy\ndirect\ndrop\nlead\nrefer to someone/something\nride\nsee someone off\nshepherd\nshow someone around (something)\nshow someone over something\nstick\nusher\nusherette\nwalk\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDirection of motion\nContinue & last\ngo verb\n(FUTURE TIME)\nbe going to do/be something\nA2 to intend to do or be something in the future: Are you going to go to Claire's party?\nA2 to be certain or expected to happen in the future: They're going to have a baby in the spring.\nSee more\ngo verb\n(BECOME)\nB1 [ L only + adj ] to become: The idea of going grey doesn't bother me, but I'd hate to go bald. Her father's going senile/blind/deaf.go wrong If anything goes wrong, you can call our emergency hotline free of charge. After twelve years of Republican presidents, the US went Democratic in 1992.\nThesaurus: synonyms, antonyms, and examples\nto becomebecomeMy arm was becoming more and more painful.getIt’s getting dark now.growTempers had been growing more and more frayed during the evening.goMy hair is going white.turnThe sky turned black.\nSee more results »\nMore examplesFewer examplesPaul will go mad when he finds out you've broken his watch.Because the book's so old, the pages are going yellow.The cars pull away when the lights go green.Many small businesses went broke during the recession.He goes all misty-eyed whenever he hears that song.\nSMART Vocabulary: related words and phrases\nStarting and beginning\nbe in the first flush of idiom\nbe/get in on the ground floor idiom\nbecome\nbegin\nbranch out\ngrow\nhalf-cock\nhere\nhere goes! idiom\nhit the ground running idiom\nmotion\nsail in\nstart (something) off\nstart on something\nstart out\nstart/set/get the ball rolling idiom\nstarting\nthe ground floor\nwaste\nwheel\nSee more results »\ngo verb\n(MOVE BODY)\nC2 [ I usually + adv/prep ] to move a part of the body in a particular way or the way that is shown: go like this with Go like this with your hand to show that you're turning left.\nMore examplesFewer examplesCan you go like this with your tongue?The player went like this to show that his wasn't hurt.His face went like this when he tasted the soup.Go like this with your arm to stretch the muscle.\nSMART Vocabulary: related words and phrases\nGeneral words for movement\nbetake\nbudge\nbudge up\ncarry\ncirculate\ndad dancing\ngangway\ngone\nkinetic\nkinetic energy\nkinetically\nlibration\nlocomotion\nmotion\npass\nround\nscoot\nseethe\nshove\nslip\nSee more results »\ngo verb\n(OPERATE)\nC2 [ I ] to operate (in the right way): Have you any idea why this watch won't go? Can you help me get my car going? Our company has been going (= has been in business) for 20 years.\nMore examplesFewer examplesMy watch stopped going after I dropped it.That radio has been going all morning.She received a grant to get her business going.I can't get the vacuum cleaner to go.The driver of the getaway car kept the engine going.\nSMART Vocabulary: related words and phrases\nMachines - Functioning\naction\nactuator\ndeactivation\nengaged\nfaultily\nfaulty\nfire someone up\nfunction as something/someone\nlight\noperative\npeg\npeg out\nplay something up\npower\npower (something) up\nrefire\nreset\nroad\ntick\nworking\nSee more results »\ngo verb\n(TIME)\nB2 [ I ] If a period of time goes, it passes: I had a wonderful weekend but it went very quickly. Time seems to go faster as you get older.to go There's only a week to go before (= until) I get my exam results.\nMore examplesFewer examplesThe final hour of the exam went very quickly.There are only ten days to go before Christmas.Two hours went by before they reported the child missing.Time goes quickly when you're having fun.The afternoon was going very slowly.\nSMART Vocabulary: related words and phrases\nSpending time & time passing\nall the time in the world idiom\nAnno Domini\ncourse\nelapse\nemploy\nfall\nfall away\ngone\nmisspend\npass\nroll\nroll by\nrun out\nslip\nslip away\nthe sands of time idiom\ntick\ntimekeeper\nwear on\nwhile something away\nSee more results »\ngo verb\n(BE)\n[ L only + adj ] to be or stay in a particular condition, especially an unpleasant one : In spite of the relief effort, thousands of people continue to go hungry. Why do so many rapes go unreported? as...go\nin comparison with most other things of a particular type, especially when you do not think that type of thing is very good: It was quite a good film, as horror films go.\nSee more go to prove/show\nto prove that something is true: Your daughter's attitude only goes to prove how much society has changed over the last 30 years.\nSee more\nSMART Vocabulary: related words and phrases\nKeeping and staying the same\nanti-progressive\ncalcification\ncalcify\nconsistency\nconsistent\ncontinuum\ninvariant\ninveteracy\nkept\nleave well alone idiom\nleft\nstability\nstabilization\nstabilize\nstably\nstay\nunreformed\nwallow\nwallow in something\nwouldn't have it any other way idiom\nSee more results »\ngo verb\n(START)\n[ I ] to start doing or using something: I'll just connect the printer to the computer and then we'll be ready to go.\nSMART Vocabulary: related words and phrases\nStarting and beginning\nbe in the first flush of idiom\nbe/get in on the ground floor idiom\nbecome\nbegin\nbranch out\ngrow\nhalf-cock\nhere\nhere goes! idiom\nhit the ground running idiom\nmotion\nsail in\nstart (something) off\nstart on something\nstart out\nstart/set/get the ball rolling idiom\nstarting\nthe ground floor\nwaste\nwheel\nSee more results »\ngo verb\n(PLAY GAME)\n[ I ] to use your opportunity to play in a game: It's your turn to go now.\nSMART Vocabulary: related words and phrases\nMiscellaneous games & activities\nair hockey\nbeer pong\nbelly dancing\nboomerang\nbran tub\nbuildering\nChinese puzzle\njigsaw\njuggling\njump rope\nkeepy-uppy\nkorfball\nLARP\norigami\npinball\nstory mode\nsubworld\nsudoku\ntable football\ntabletop\nSee more results »\ngo verb\n(DIVIDE)\n[ I not continuous ] (of a number) to fit into another number especially resulting in a whole number: go into 5 into 11 won't go. 3 goes into 15 fives times.\nSMART Vocabulary: related words and phrases\nAddition, subtraction, multiplication & division\nadd\nadd (something) up\naddition sign\nadditive\narithmetical\ndeduction\nhalf\nhalve\nhighest common factor\nlong division\npower\nquadruply\nquintuple\nquotient\nrecursion\nround something down\nsquare\nsubtraction sign\ntable\ntreble\nSee more results »\ngo verb\n(SAY)\n[ + speech ] informal to say, especially when a story is being told: \"I never want to see you ever again,\" he goes, and storms out the house.\nSMART Vocabulary: related words and phrases\nSaying & uttering\n(your) every word idiom\nadd\ncome out with something\nfall from something\nfind your voice idiom\nget in\nin your own words idiom\nintone\nloud\nobserve\nphrase\nquoth\nsaid\nsay\nspoken\nstring\ntalk sense idiom\nthink\nverbalize\nvolunteer\nSee more results »\ngo verb\n(WEAKEN)\n[ I ] to become weak or damaged, especially from being used (too much), or to stop working: After a gruelling six months singing on a world tour, it is hardly surprising that her voice is starting to go. I really must get a new jacket - this one's starting to go at the elbows. Her hearing is going, but otherwise she's remarkably fit for a 95-year-old.\nSMART Vocabulary: related words and phrases\nDeteriorating and making worse\nadd\nadmin\naggravate\nbackslide\nbe (all) downhill idiom\ndebase\ndeterioration\ndevaluation\ndevalue\ndisintegrate\ndog\ndowngrade\none step forward, two steps back idiom\nregress\nregression\nregressive\nregressively\nwear thin idiom\nworse\nworsen\nSee more results »\ngo verb\n(NOISE)\nC2 [ I or T ] to produce a noise: I think I heard the doorbell go (= ring) just now. I wish my computer would stop going \"beep\" whenever I do something wrong.\nSMART Vocabulary: related words and phrases\nSounds made by objects, movement or impact\nbang around\nbong\nburble\nchoo-choo\nchuff\nclick away\nclicker\nclinking\ncrunch\nplop\nresonance\nspit\nsplat\nsputter\nsqueak\nswoosh\ntinkly\ntintinnabulation\nunsounded\nwhirr\nSee more results »\ngo verb\n(BE EXPRESSED)\nB2 [ I not continuous ] to be expressed, sung, or played: how something goes I can never remember how that song goes.go like \"Doesn't it go something like this?\" said Joan, and played the first couple of bars on her guitar. [ + (that) ] The story goes (= people say) (that) he was fireds after he was caught stealing company property.so something goes A headless ghost walks the castle at night - or so the story goes (= so people say).\nSMART Vocabulary: related words and phrases\nPlaying music\naccompaniment\naccompany\nair guitar\nbeat something out\nbeatbox\nblow\npick\npick someone/something out\npitch\nplay (something) by ear idiom\nplayability\nplayable\npump\ntap\nthrow\ntickle the ivories idiom\ntranspose\ntransposition\nultra-smooth\nvibe\nSee more results »\ngo verb\n(HAPPEN)\n[ I usually + adv/prep ] to happen or be found regularly or typically with each other or another: go together Wisdom and maturity don't necessarily go together.go with She knows all about the health problems that go with smoking.go hand in hand with Great wealth often goes hand in hand with meanness.\nSMART Vocabulary: related words and phrases\nOccurring and happening\nafoot\nasynchronous\nasynchronously\nattend\nattendant\nbe at work idiom\neventuate\nfall into place idiom\nfollow on\ngo hand in hand with something idiom\ngo off\ngo on\ngone\npass\nresynchronize\nroll\nroll around\nshake out\nsucceed\nsupervene\nSee more results »\ngo verb\n(BE SITUATED)\n[ I usually + adv/prep, not continuous ] to be put in a particular place, especially as the usual place: go against The sofa went against that wall before we had the radiator put in.where something goes I'll put it all away if you tell me where everything goes.\nSMART Vocabulary: related words and phrases\nPlacing and positioning an object\n-based\nappose\naround\nchange something around\ncircle\nconsign\ngone\ninstall\nlie\npile (something) up\nplant\nredeposit\nreinstall\nreinstallation\nrelocate\nreorientate\nstick\nsuperimpose\ntranspose\ntransposition\nSee more results »\ngo verb\n(BE SOLD)\n[ I ] to be sold or be available: The shop is having a closing-down sale - everything must go.go to The painting will go to the highest bidder.go cheap I bought some flowers that were going cheap. \"Going... going... gone! (= Sold!)\" said the auctioneer, banging down the hammer.\nSMART Vocabulary: related words and phrases\nAvailable and accessible\naccessibility\naccessible\naccessibly\nat your command idiom\navailability\ndrop\nnon-restricted\nnothing\nobtainable\non call idiom\non demand idiom\non/about your person idiom\nrelease\nseason\nstream\nunfreeze\nunfrozen\nunlock\nunobtainable\nup for grabs idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBuying & selling - general words\ngo verb\n(BE ACCEPTABLE)\nB1 [ I not continuous ] to look or be acceptable or suitable: go well That picture would go well on the wall in the living room.go in The TV would go nicely in that corner, wouldn't it? If I wear the orange hat with the blue dress, do you think it will go? Just remember that I'm the boss and what I say goes (= you have to accept what I say).anything goes My parents don't worry too much about what I am up to, and most of the time anything goes (= I can do what I want).\nSMART Vocabulary: related words and phrases\nMatching and co-ordinating\n-matched\ncoordinate\ncoordinated\ncoordination\ngo with something\ngone\nincongruence\nmarry\nmarry up (something)\nmatch\nmatch up\nmatchy-matchy\ntone\ntone in\nYou can also find related words, phrases, and synonyms in the topics:\nBeing suitable or unsuitable\ngo verb\n(BE KNOWN)\n[ I usually + adv/prep ] to be known (by a particular name): go by the name of He had a scruffy old teddy bear that went by the name of Augustus.go under the name of In Britain, this flour usually goes under the name of maize meal.\nSMART Vocabulary: related words and phrases\nNames and titles\nA.N. Other\nage\naka\nalias\nappellation\nform of address\ngiven name\ngood name\nidentity\nilk\npet name\nplace name\npseudonym\npseudonymity\npseudonymous\ntrademark\nunchristened\nunder the name of idiom\nunidentified\nunnamed\nSee more results »\ngo verb\n(DEVELOP)\nB1 [ I usually + adv/prep ] to develop or happen: how something goes \"How did the interview go?\" \"It went very well, thanks.\"go for Things have gone badly for him since his business collapsed.\nMore examplesFewer examplesEverything was going smoothly until suddenly disaster struck.\"I hear things aren't going too well at work.\" \"You don't know the half of it!\"Everything went swimmingly until Peter started talking about money.The party went like clockwork.Did it all go according to plan?\nSMART Vocabulary: related words and phrases\nOccurring and happening\nafoot\nasynchronous\nasynchronously\nattend\nattendant\nbe at work idiom\neventuate\nfall into place idiom\nfollow on\ngo hand in hand with something idiom\ngo off\ngo on\ngone\npass\nresynchronize\nroll\nroll around\nshake out\nsucceed\nsupervene\nSee more results »\nGrammar\nBeen or gone?We often use been to, instead of gone to, when we refer to completed visits to a place: …\nCome or go?We use come to describe movement between the speaker and listener, and movement from another place to the place where the speaker or listener is. We usually use go to talk about movement from where the speaker or listener is to another place. …\nGoWe use go to refer to movement, most commonly away from the speaker or listener to another place. We normally use go without an object: …\nGo + -ingWe use go + -ing form when we speak about general activities that involve movement: …\nGo + complementWe use go + an adjective (complement) to describe changes to the state of things: …\nGo and, come and …In speaking, we often use and after go and come before the base form of verbs like ask, buy, check, collect, do, find, get: …\nGoing toWe use the present continuous form of the verb go + preposition to + noun phrase to talk about movement in relation to a place or a person in the present: …\nGoing to: present continuousWe use the present continuous form of the verb go + preposition to + noun phrase to talk about movement in relation to a place or a person in the present: …\nGoing to: futureWe can use a present form of be + going to + the base form of a main verb to talk about the future. We use it for plans and intentions, predictions and commands: …\nWas going toWe use a past form of be + going to when we talk about a plan we had that may have changed. …\nGet or go?Get and go have similar meanings, when talking about travel or motion. When we use get, we emphasise arrival: …\nFuture: be going to (I am going to work)We use be going to + the base form of the verb: …\nBe going to: formWe use be going to + the base form of the verb: …\nBe going to: usesBe going to is commonly used in informal styles. …\nGonna (informal contexts)We use gonna /gənə/ instead of going to in informal contexts, especially in speaking and in song lyrics. We write gonna to show how to pronounce it: …\nBe going to or will?Will is often used in a similar way to be going to. Will is used when we are talking about something with absolute certainty. Be going to is used when we want to emphasise our decision or the evidence in the present: …\nIdioms\ngo about your business\ngo and...\ngo down swinging/fighting\ngo for it\ngo it alone\nhave something going for you\nnot go there\nthe same/that goes for someone/something\nwhat are you going to do?Phrasal verbs\ngo about something\ngo after someone\ngo after something\ngo against someone\ngo against something/someone\ngo ahead\ngo along\ngo along with something/someone\ngo around\ngo around (somewhere)\nMore phrasal verbs\ngo around something\ngo at someone\ngo at something\ngo away\ngo back\ngo back on something\ngo back to someone\ngo back to something\ngo by\ngo by something\ngo down\ngo down\ngo down on someone\ngo down with something\ngo for someone\ngo for something\ngo in\ngo in for something\ngo in on something\ngo into something\ngo off\ngo off someone/something\ngo off with someone\ngo off with something\ngo on\ngo on something\ngo out\ngo out for something\ngo out to someone\ngo over\ngo over something\ngo over to something\ngo round\ngo round (somewhere)\ngo round something\ngo through\ngo through something\ngo through with something\ngo to someone\ngo together\ngo under\ngo up\ngo up to something\ngo with something\ngo with someone\ngo with someone/something\ngo without (something)\ngo noun\n(ATTEMPT)\nB2 [ C ] (US also try) an attempt to do something: I've never done this before but I'll give it a go.have a go \"This jar is impossible to open.\" \"Here, let me have a go.\"have a go at I want to have a go at finishing my essay tonight.all in one go We can't do the work all in one go (= all at the same time). make a go of something mainly UK\nC2 to try to make something succeed, usually by working hard: She's really making a go of her new antique shop.\nSee more\nMore examplesFewer examplesI can't do the crossword. Do you want to have a go?After several goes at the puzzle, she eventually gave up.They each had a go at lifting the box, but neither of them could move it.If you fail the test this time, you can have another go at it in August.I don't know if I can fix the taps but I'll have a go.\nSMART Vocabulary: related words and phrases\nTrying and making an effort\nA game\nassault\nattempt\nattempted\nbackwards\nbid\ncommitment\ncrack\ngo for it idiom\ngo out of your way idiom\ngo the extra mile idiom\ngo to great lengths idiom\nGod helps those who help themselves idiom\nnose\nseek\nsquare the circle idiom\nstep on the gas idiom\nstick at something\nstick to something\nstick-to-itiveness\nSee more results »\ngo noun\n(OPPORTUNITY)\nB1 [ C ] (US usually turn) an opportunity to play in a game, or to do or use something: Hey, it's Ken's go now! You've just had your go.have a go Please can I have a go (= can I ride) on your bike?have a go at I'll have a go at driving for a while if you're tired.\nMore examplesFewer examplesIs it my go yet?May I have a go on your computer?We can have two goes each.You have to miss a go if you land on that square.Whose go is it?\nSMART Vocabulary: related words and phrases\nMiscellaneous games & activities\nair hockey\nbeer pong\nbelly dancing\nboomerang\nbran tub\nbuildering\nChinese puzzle\njigsaw\njuggling\njump rope\nkeepy-uppy\nkorfball\nLARP\norigami\npinball\nstory mode\nsubworld\nsudoku\ntable football\ntabletop\nSee more results »\ngo noun\n(CRITICIZE)\nhave a go at someone UK\nto criticize someone: My Dad's always having a go at me about getting a proper job.\nSee more\ngo noun\n(ENERGY)\n[ U ] UK the condition of being energetic and active: You're full of go this morning. He doesn't have much go about him, does he? See also\nget-up-and-go informal\nSMART Vocabulary: related words and phrases\nExcitement, interest, energy and enthusiasm\nalacrity\nanimation\nardour\navidity\nboosterism\ncommotion\nflirtation\nfrenzy\nfriskiness\nfrisson\nget-up-and-go\nhubbub\npep\nperkiness\nphysicality\npiquancy\npizzazz\nwoot\nzeal\nzealousness\nSee more results »\ngo noun\n(GAME)\n[ U ] (also Go) a Chinese game played on a square board in which two players try to surround each others' stones (= pieces): Around 50m people in east Asia play go. Go was all the rage in Japanese courtly circles by the 11th century.\nGannet77/E+/GettyImages\nSMART Vocabulary: related words and phrases\nBoard games\nbackgammon\nbishop\nblitz\nboard game\ncastle\nChinese chequers\nChutes and Ladders\ncounterplay\ndefence\ndraught\nendgame\nforfeit\ngambit\npawn\npin\nqueen\nqueenside\nre-roll\nresign\nsquare\nSee more results »\nIdioms\nbe (a) no go\non the go\ngo verb\n(TRAVEL)\nAdd to word list\nAdd to word list\n[ I ] to move or travel to another place: Let’s go home now. Are you going away for your vacation? He’s going to his country house for the weekend. We don’t go to the movies much. You go on (ahead) and I’ll be along in a minute. Are you planning to go by car or are you flying? The payroll checks went out (= were sent) a week later than usual. I’m just going over (= making a visit) to Pete’s for half an hour. My son is planning to go into (= get a job in) journalism. Where did my keys go (= I can’t find them)? A considerable amount of money and effort has gone into (= been used in preparing) this exhibition. go back\nTo go back is to return: When do you go back to school? go back\nTo go back is also to have existed since some time in the past: Their friendship goes back to when they were in college together. go up (also go down)\nTo go up or go down is to increase or be reduced: My rent is going up 6% this year. go for\nTo be going or to go for a particular activity is to move to the place of the activity or to begin to do it: to go for a walk/swim Why don’t we go for a drive (= have a ride in a car)? We’re going shopping at the mall.\n[ I ] To have gone to do a particular activity is to have left to do it and not yet returned: They’ve gone sailing on the lake.\ngo verb\n(MOVE TOWARD)\n[ I ] to be or continue moving, esp. in a particular way or direction: We were going (at) about 65 miles an hour. I had a wonderful weekend but it went awfully quickly. If you take the bus, you go over the bridge, but the train goes through the tunnel. There’s still three months to go before he has surgery, but he’s already nervous about it. The flu is going around right now (= It’s moving from person to person). I was going up/down the stairs when the phone rang. He went up to her (= approached her) and asked for her autograph. On summer evenings we often sat on the porch and watched the sun go down. go by\nTo go by is to move past or beyond: We sat on the shore and watched the sailboats go by. Several months went by, and still he had no word from her.\ngo verb\n(LEAVE)\n[ I ] to leave a place, esp. in order to travel to somewhere else: It’s time to go. Please close the door when you go. She wasn’t feeling well, so she went home early (= left early to go home). She’s gone off with my umbrella (= She took it by accident). I always go out (= leave my home and travel to another place, esp. for entertainment) on Saturday night.\n[ I ] If something is gone, none of it is left: I can’t believe the milk is gone already.\ngo verb\n(LEAD)\n[ I always + adv/prep ] (of a road, path, etc.) to lead in a particular direction: Does I-70 go to Denver?\n[ I always + adv/prep ] If something goes a particular length, it is that long: The well goes down at least 30 feet.\ngo verb\n(BECOME)\nto become or be in a certain condition: [ L ] Her father is going blind. [ L ] If anything goes wrong, you can call our emergency hotline. [ L ] Because of lack of evidence, the police were forced to let him go free. [ I ] If you keep applying ice, the swelling will go down (= become smaller). [ I ] The computer went down (= stopped operating) twice last week. [ I ] The electricity suddenly went off (= stopped operating). [ I ] One of these days I’ll have to go on a diet (= start to be on one). [ I ] I was so exhausted I went to sleep (= started sleeping) immediately. [ I ] It was feared for a while that the two countries would go to war (= start to fight a war) over this dispute. [ I ] It wasn’t a bad hospital, as hospitals go (= compared with the usual standard of hospitals), but I still hated being there.\ngo verb\n(CHANGE)\n[ I always + adv/prep ] to do something to cause a change or create a new condition: I’d love to come to dinner, but I don’t want you to go to any trouble (= do a lot of work).\ngo verb\n(WEAKEN)\n[ I ] to become weak or damaged, esp. from use, or to stop working: Her hearing is starting to go, but otherwise she’s in good shape.\ngo verb\n(START)\n[ I ] to start doing or using something: I’ll just connect the printer to the computer and we’ll be ready to go.\ngo verb\n(OPERATE)\n[ I ] to operate: My watch was going fine up until a few minutes ago, but then it stopped running.\ngo verb\n(MAKE SOUND)\n[ I/T ] to produce a noise: [ I ] Somebody’s car alarm went off at 3 in the morning and woke me up.\ngo verb\n(MOVE BODY)\n[ I always + adv/prep ] to move a part of the body in a particular way or in the way that is shown: Try making your foot go backwards and forwards.\ngo verb\n(DIVIDE)\n[ I ] (of a number) to fit into another number, esp. resulting in a whole number: Three goes into 12 four times.\ngo verb\n(BE SITUATED)\n[ I always + adv/prep ] to belong in a particular place, esp. as the usual place: Tell the moving men that the sofa goes against that wall.\ngo verb\n(HAPPEN)\n[ I always + adv/prep ] to happen or develop: The doctor said the operation went well. What’s going on here (= Explain what is happening)?\n[ I always + adv/prep ] If people have something going for them, that thing causes them to have a lot of advantages and to be successful: They’ve got a happy marriage, great careers, and wonderful children – in fact they’ve got everything going for them.\ngo verb\n(BE SOLD)\n[ I ] to be sold or be available: The painting is expected to go for at least a million dollars.\ngo verb\n(BE EXPRESSED)\n[ I ] to be expressed, sung, or played: I can never remember how that song goes.\ngo verb\n(BE SUITABLE)\n[ I ] to be acceptable or suitable: Do you think my new brown scarf goes with my black coat?\ngo verb\n(BE KNOWN)\n[ I always + adv/prep ] to be known by a particular name: He went under the name of Platt, but that was not his real name.\ngo verb\n(DEPEND ON)\n[ I always + adv/prep ] to have an opinion, decision, or judgment depend on something: There were no witnesses to the crime, and so far the police don’t have much to go on.\ngo verb\n(BE FINAL)\n[ I ] to be final; not to be questioned: In my parents’ day, nobody ever argued with their father – whatever he said went.\ngo verb\n(PLAY)\n[ I ] to do something at a particular time or in a particular order, before or after other people; have a turn: Who goes next? going noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈɡoʊ·ɪŋ/\nIt was slow going because of ice on the roads. going noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈɡoʊ·ɪŋ/\nThere were a lot of comings and goings at the apartment next door. Idioms\ngo easy on someone\ngo easy on something\ngo from bad to worse\ngo for it\ngo haywire\ngo in one ear and out the other\ngo it alone\ngo out of your way\ngo overboard\ngo public\nMore idioms\ngo public (with something)\ngo through the motions\ngo to bat for someone\ngo to great lengths\ngo to someone’s head\ngo to pot\ngo to the bathroom\ngo to the dogs\ngo to town (on something)\ngo up in smoke\ngo with the flow\ngo wrong\nsomething goes for someone/something else\nsomething goes without saying\n(still) going strong\non the go\nsomeone is going places\n(something) to go\nPhrasal verbs\ngo about something\ngo against something/someone\ngo ahead\ngo along\ngo around\ngo at someone/something\ngo back on something\ngo by something/someone\ngo down as/in something\ngo for something/someone\nMore phrasal verbs\ngo for something/someone\ngo for something\ngo in for something\ngo in on something\ngo into something\ngo off\ngo on\ngo out\ngo out\ngo out for something\ngo over\ngo over something\ngo over something\ngo through\ngo through something\ngo through something\ngo through something\ngo through something\ngo through with something\ngo together\ngo under\ngo up\ngo without (something)\ngo noun [U]\n(ENERGY)\nthe condition of being energetic and active\nAdd to word list\nAdd to word list\n[ I ] to be sold: The shop is having a closing-down sale - everything must go.\n[ I ] to develop or happen in a particular way: Things have gone badly for him since his business collapsed.\n[ I ] to disappear: 650 jobs will go at the shipyard.\n[ I ] if money goes on something, it is spent on that thing: go on sth Most of that money goes on the purchase of equipment.\ngo for it\ninformal to do anything you have to in order to get something: If we want something, then we go for it in the best possible way we know.\ngo it alone\nto do something without other people: Questions are being asked whether the record label has the stamina to go it alone.\nhave sth going for you\nto have a quality that gives you a lot of advantages or makes it likely you will be successful: It has everything going for it: a prime city centre site, a successful funding strategy, and a charismatic leader. Phrasal verbs\ngo after sth\ngo ahead\ngo along with sth/sb\ngo back on sth\ngo down\ngo for sth\ngo into sth\ngo over sth\ngo over to sth\ngo through\nMore phrasal verbs\ngo through with sth\ngo to sb/sth\ngo under\ngo up\ngo with sb/sth"}