{"id":167465,"name":"goal","type":"noun","us_sound":"ɡoʊl","us_link":"../audio/g/goal.mp3","uk_sound":"ɡəʊl","uk_link":"../audio/g/ukglutt028.mp3","content":"goal noun [C]\n(SPORT)\nAdd to word list\nAdd to word list\nA2 an area on a playing field, that usually has two posts with a net fixed behind them, where players try to send the ball in order to score in sports such as football and hockey: into/towards the goal Black kicked/headed the ball into/towards the goal.\nJohner Images/GettyImages\nA2 a point scored in some sports, such as football and hockey, when a player gets the ball into this area: Brazil won by three goals to one.score a goal Only one goal was scored in the entire match. be/play in goal UK\nto be the player who tries to prevent the other team from scoring goals: Who is playing in goal for Milan this evening?\nSee more an open goal\na goal area that has been left without any defenders: Young rolled the ball across the six-yard box for Rooney to tap the ball into the open goal.\nSee more\nMore examplesFewer examplesWhenever their team scored a goal, they leaped up and down clanking their beer cans together.It was Johansson who scored the all-important goal shortly before half-time.Coventry had a goal disallowed for offside.He scored a spectacular goal in the second half.He scored three goals in quick succession.\nSMART Vocabulary: related words and phrases\nGeneral terms used in ball sports\naggregate score\nassist\nback pass\nbackspin\nballplayer\ndump\nkicker\nlay someone off\nlayoff\nlong ball\npace\npassing\npitch\nstroke\nthe long ball game idiom\nundefended\nunderhand\nunderspin\nunhittable\nuppish\nSee more results »\ngoal noun [C]\n(AIM)\nB1 an aim or purpose: Our goal is for the country to be fully independent within two years. They have set themselves a series of goals to achieve by the end of the month.achieve a goal of Do you think I'll be able to achieve my goal of losing five kilos before the summer? Synonyms\naim (INTENTION)\nambition\naspiration (HOPE)\ndream (HOPE)\nhope\nintent formal or specialized\nintention\nobject (PURPOSE)\nobjective\ntarget (AIM)\nThesaurus: synonyms, antonyms, and examples\nsomething you want to do or achieveaimOur aim in protesting is to raise awareness of the unfairness of the system.goalMy goal in life has always been to be financially independent.objectiveOne of my objectives for this year is to increase sales.targetIf you meet your sales targets you will receive a generous bonus.dreamWhen I was growing up my dream was to perform in front of millions of people.hopeMy hope is that there will be some kind of positive outcome to this process.\nSee more results »\nMore examplesFewer examplesWe must ensure that we do not set ourselves goals that are not attainable.They have set themselves a series of goals to achieve by the end of the month.The protection of the Antarctic from commercial exploitation is an important goal of environmentalists.Our goal is for the country to be fully independent within two years.Some economists think that full employment in Europe is an unattainable goal.\nSMART Vocabulary: related words and phrases\nGoals and purposes\naffordance\nambition\navail\ncause\ndedicated\ndeflect\ndream\neye\nit's the thought that counts idiom\nkey performance indicator\nKPI\nmoonshot\nobjective\npoint\ntarget\ntarget setting\nthought\ntowards\nundedicated\nundirected\nSee more results »\ngoal noun [C]\n(GAME)\nAdd to word list\nAdd to word list\n(in many sports) a point scored when a player sends a ball or other object into a particular area of play or into a netted structure that is defended by the opposing team: Lanzo missed scoring a goal by inches.\nIn some sports, a goal is also the area or netted structure into which a player sends a ball or other object in order to score a point.\ngoal noun [C]\n(AIM)\nan aim or purpose: My goal is to lose ten pounds before the summer.\nAdd to word list\nAdd to word list\na purpose, or something that you want to achieve: set (sb) a goal The sales team have set themselves a series of goals to achieve by the end of the month.reach/achieve a goal Are the changes helping the organization achieve its goals or hindering progress? the main/primary/ultimate goal an achievable goal"}