{"id":167492,"name":"goat","type":"noun","us_sound":"ɡoʊt","us_link":"../audio/g/goat.mp3","uk_sound":"ɡəʊt","uk_link":"../audio/g/ukgoall009.mp3","content":"goat noun [C]\n(ANIMAL)\nAdd to word list\nAdd to word list\nB1 an animal related to sheep that usually has horns and a beard. Goats live wild on mountains or are kept on farms to provide milk, meat, wool, etc.: goat's milk/cheese\nGlobalP/iStock / Getty Images Plus/GettyImages\nMore examplesFewer examplesA old woman was herding the goats up the mountainside.Her zodiac birth sign is Capricorn, the goat.\nSMART Vocabulary: related words and phrases\nSheep & goats\nbezoar\nbilly goat\newe\nibex\nkid\nlamb\nmerino\nmountain goat\nnanny goat\novine\nram\nshearling\nsheep\nwether\ngoat noun [C]\n(MAN)\ninformal disapproving a man who is very active sexually, or would like to be and makes it obvious: an old goat Idioms\nact/play the goat\nget someone's goat\nabbreviation for Greatest Of All Time: used to refer to or describe the person who has performed better than anyone else ever, especially in a sport: Mohammad Ali boxed his way into our hearts and will forever be known as GOAT, Greatest Of All Time. Hamilton may end up being the GOAT as far as I can see.\nMore examplesFewer examplesThe Olympic champion had GOAT (Greatest of All Time) tattooed on his right biceps.Is Federer GOAT or not?When you are the GOAT then you can say what you want and not have to worry about it.He has 20 grand slams but he is still not the GOAT because Steffi Graf has 22.\nSMART Vocabulary: related words and phrases\nWinners & losers\nbe a slam dunk idiom\nchamp\nco-champion\nco-leader\nco-winner\ncup holder\ndark horse\ndead man walking idiom\nelevator club\nleader\nloser\nmatch\nrunner-up\nslam dunk\nsuperstar\ntitle race\ntitleholder\ntitlist\nwinner\nyo-yo club\nSee more results »\ngoat noun [C]\n(ANIMAL)\nAdd to word list\nAdd to word list\na horned animal related to the sheep, which is kept to provide milk, meat, or wool\ngoat noun [C]\n(PERSON BLAMED)\ninfml disapproving a person who is blamed for causing a failure or defeat, esp. in a team sports competition: Jefferson’s three errors made him the goat of last night’s game."}