{"id":167597,"name":"god","type":"noun","us_sound":"ɡɑːd","us_link":"../audio/g/god.mp3","uk_sound":"ɡɒd","uk_link":"../audio/g/ukgoall021.mp3","content":"god noun [C]\n(SPIRIT)\nAdd to word list\nAdd to word list\nB2 a spirit or being believed to control some part of the universe or life and often worshipped for doing so, or something that represents this spirit or being: the ancient Greek gods and goddesses\nMore examplesFewer examplesThe site was named after a Norse god.Their sacred dance is performed to invoke ancient gods.The children enjoyed the stories about the gods and goddesses of Greek and Roman myth.The gods smiled on us and we had brilliant sunshine throughout the day.In the various regions of India, Hindus worship different gods and observe different religious festivals.\nSMART Vocabulary: related words and phrases\nGod & gods\nAphrodite\nApollo\napotheosis\nArtemis\nAthena\nBacchus\ndemigod\nfate\nfather\ngoddess\ngodlike\nHoly Spirit\nJehovah\nJesus Christ\nKrishna\nlamb\nlord\nmuse\nthe Redeemer\ntrinity\nSee more results »\ngod noun [C]\n(ADMIRED PERSON)\nsomeone who is very important to you, who you admire very much, and who strongly influences you: His most devoted fans think of him as a sort of god.\nSMART Vocabulary: related words and phrases\nGod & gods\nAphrodite\nApollo\napotheosis\nArtemis\nAthena\nBacchus\ndemigod\nfate\nfather\ngoddess\ngodlike\nHoly Spirit\nJehovah\nJesus Christ\nKrishna\nlamb\nlord\nmuse\nthe Redeemer\ntrinity\nSee more results »\ngod noun [C]\n(THEATRE)\nthe gods [ plural ] UK informal\nthe seats in a theatre that are at the highest level and the furthest distance from the stage: We managed to get tickets but they were up in the gods, which wasn't ideal.\nSee more\nIdiom\nthose whom the gods love die young\nA2 (in some religions) the being who made the universe and is believed to have an effect on all things: Do you believe in God?\nMore examplesFewer examplesDo you believe in an all-powerful god ?As an agnostic he believed that nothing can be known of the existence or nature of God.God knows how we're going to be ready on time.She believed that God doesn't exist.Thank God you're here. I've been looking everywhere for you.\nSMART Vocabulary: related words and phrases\nGod & gods\nAphrodite\nApollo\napotheosis\nArtemis\nAthena\nBacchus\ndemigod\nfate\nfather\ngoddess\ngodlike\nHoly Spirit\nJehovah\nJesus Christ\nKrishna\nlamb\nlord\nmuse\nthe Redeemer\ntrinity\nSee more results »\nIdioms\n(oh my) God!\nGod bless (you)!\nGod helps those who help themselves\nGod knows\nGod only knows\nGod willing\nhope/wish/swear to God\nthank God\nthere is a God!\nAdd to word list\nAdd to word list\na spirit or being believed to control some part of the universe or life and often worshiped for doing so, or a representation of this being: the god of war\nA god can also be someone who is admired a lot or too much: Dr. Tay is a god to me.\n(esp. in Christian, Jewish, and Muslim belief) the being that created and rules the universe, the earth, and its people: Do you believe in God? Idioms\nGod bless (you)\nGod only knows"}