{"id":168162,"name":"good","type":"adjective","us_sound":"ɡʊd","us_link":"../audio/g/good.mp3","uk_sound":"ɡʊd","uk_link":"../audio/g/ukgonad011.mp3","content":"good adjective\n(PLEASANT/SATISFACTORY)\nAdd to word list\nAdd to word list\nA1 very satisfactory, enjoyable, pleasant, or interesting: a good book Did you have a good time at the party? The weather has been really good for the time of year. I've just had some very good news.it is good to It's so good to see you after all this time!\nThesaurus: synonyms, antonyms, and examples\ngiving pleasure and holding your attention goodIt's a good film overall.enjoyableWe had an enjoyable time with Bob and Helen.pleasant The weather is pleasant but not too hot.interestingThe history of the place was really interesting.niceHave a nice day!\nSee more results »\nused in greetings: good morning/afternoon/evening\nMore examplesFewer examplesYou'll like Rosie - she's good company.Such a noisy environment was not conducive to a good night's sleep.The empty roads make this area good cycling country.The good thing about the bike is that it dismantles if you want to put it in the back of the car.I was having such a good time I was reluctant to leave.\nSMART Vocabulary: related words and phrases\nGood, better and best\nall is well idiom\nat the best of times idiom\nbe the last word in something idiom\nbetter\nbetter still phrase\nburnished\ngold standard\nhigh-quality\nknock something into a cocked hat idiom\nleave someone/something in the dust idiom\nmiles idiom\nnext-best\nsecond\nsound\nsuper good\ntopper\nunsurpassed\nup your game idiom\nuplift\nwell\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWelcoming, greeting & greetings\ngood adjective\n(HEALTHY)\nA1 healthy or well: I didn't go into work because I wasn't feeling too good. \"How's your mother?\" \"She's good, thanks.\" I'm good informal\nused as a general reply when someone greets you: \"How are you doing?\" \"I'm good, thanks.\"\nSee more\nSMART Vocabulary: related words and phrases\nAnimal physiology: fit & healthy\nacrobatically\nagility\nagree with something\namazonian\nathleticism\nbe (as) fit as a fiddle idiom\nglow\nhard/tough as nails idiom\nin the pink idiom\nlimber\nmatch fit\nmatch fitness\nmuscled\nnon-disabled\non top form phrase\nrobust\nrude\nthe able-bodied\ntrim\nvirility\nSee more results »\ngood adjective\n(HIGH QUALITY)\nA1 of a high quality or level: She speaks very good French. I've heard it's a very good school.as good as The apple pie was as good as the one my grandmother used to make.good reputation This restaurant has a good reputation.\nThesaurus: synonyms, antonyms, and examples\nof high qualitygoodBuy a really good foundation and cultivate a healthy glow.good/high qualityWe have a real commitment to high-quality ingredients.qualityWe are working hard to produce a quality product.fineThey have a well-stocked cellar full of fine wines.superiorThe food and service here are superior to any other restaurant in the city.\nSee more results »\nused to express praise: Good man! Splendid catch.\nMore examplesFewer examplesHer work is sometimes good, but the problem is she's not consistent.We need someone who can write good copy for our publicity department.With a good telescope, you can see craters on the moon.It's important for children to get a good education.The design is so good it's sure to set the pattern for many others.\nSMART Vocabulary: related words and phrases\nGood, better and best\nall is well idiom\nat the best of times idiom\nbe the last word in something idiom\nbetter\nbetter still phrase\nburnished\ngold standard\nhigh-quality\nknock something into a cocked hat idiom\nleave someone/something in the dust idiom\nmiles idiom\nnext-best\nsecond\nsound\nsuper good\ntopper\nunsurpassed\nup your game idiom\nuplift\nwell\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPraising and applauding\ngood adjective\n(SUCCESSFUL)\nA1 successful, or able to do something well: Kate's a good cook.good at She's very good at geography. They have a good relationship.good with She's very good with children.\nThesaurus: synonyms, antonyms, and examples\ngood at doing something because of practiceskilfulShe's a skilful driver.skilledHe's a skilled mechanic.good atShe's very good at dealing with people.ableShe's a very able student.giftedShe's a gifted musician.talentedHe's a very talented actor.\nSee more results »\nbe no good (also be not any/much good)\nB2 to be of low quality or not useful: Shoes are no good if they let in water.\nSee more get off to a good start\nto begin an activity successfully: I didn't get off to a very good start this morning - I'd been at work five minutes and my computer stopped working!\nSee more\nMore examplesFewer examplesA good teacher has an easy authority over a class.The design certainly looks good on paper.A good architect takes into account the building's surroundings.Do you know a good recipe for wholemeal bread?Painting steel is a good way to rustproof it.\nSMART Vocabulary: related words and phrases\nSuccessful (things or people)\na head of steam idiom\nachiever\nalive\nalpha male\narrive\nascendant\nballer\nhave something in your pocket idiom\nhave the world at your feet idiom\nhealthily\nheavy hitter idiom\nhigh-flyer\nrail\nrepresent\nsmash\nstorming\nsuccessful\nsuccessfully\nsuperachiever\nsuperhit\nSee more results »\ngood adjective\n(KIND)\nA1 kind or helpful: a good friendit is good of It's good of you to offer to help.good to He's very good to his mother.\nThesaurus: synonyms, antonyms, and examples\nmorally rightgoodShe is a good woman who goes out of her way to help others.virtuousI believe that humans are, despite their flaws, capable of virtuous conduct.righteousHe refused to stray from the righteous path.honestHe was a hardworking, honest family man who was only trying to do his duty.upstandingI’m sure most of them are honest, upstanding members of society.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\na kind personkindYou'll never meet a kinder person.niceHe's such a nice guy.sweetShe's the sweetest little girl in the whole class.good toJay's mother has been very good to us.good-heartedHe's a good-hearted kid who loves to help out.\nSee more results »\nbe so good as to formal (also be good enough to)\nused to make a polite request: Be so good as to close the door when you leave.\nSee more do (someone) a good turn old-fashioned\nto do something kind that helps someone else: I was only trying to do her a good turn.\nSee more\nMore examplesFewer examplesI think she takes advantage of his good nature.It was very good of you to come round at such short notice.My main aim in life is to be a good husband and father.Be a good boy and eat up your vegetables.She's a good warm-hearted woman.\nSMART Vocabulary: related words and phrases\nKind & thoughtful\naccommodating\naccommodatingly\nattentive\nattentively\nattentiveness\ncooperative\ncooperatively\ndiplomacy\ndiplomatic\ndiplomatically\nmean well idiom\nmotherly\nneighbourliness\nneighbourly\ntactfully\nthe milk of human kindness idiom\nthoughtful\nthoughtfully\nthoughtfulness\nunmalicious\nSee more results »\ngood adjective\n(MORALLY RIGHT)\nB1 morally right or based on religious principles: She led a good life. Try to set a good example to the children.\nMore examplesFewer examplesYou should be setting a good example to your younger brother.He was a good, honest man.She came from a good family.The preacher believed that he was spreading the good word.The vicar often quoted from the Good Book.\nSMART Vocabulary: related words and phrases\nVirtue and moral good\naltruism\nangel\nangelic\nangelically\nbe as pure as the driven snow idiom\njustifiable\njustifiably\njustified\nloftiness\nlofty\nrightfully\nrightly\nrightness\nsaintly\nthe road to hell is paved with good intentions idiom\nupliftment\nuprightly\nuprightness\nupstanding\nvirtuous\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReligious concepts: holiness\ngood adjective\n(POSITIVE)\nA1 having a positive or useful effect, especially on the health: Make sure you eat plenty of good fresh food.good for Too much sugar in your diet isn't good for you.it is good for someone to do something It's good for old people to stay active if they can.\nMore examplesFewer examplesCheers! Your good health.Fresh fruit is very good for you.This shampoo is very good for your hair.Staring at the computer screen is not good for your eyes.What's good for a sore throat?\nSMART Vocabulary: related words and phrases\nUseful or advantageous\na place in the sun idiom\nadvantageous\nadvantageously\nall-singing\namiss\nasset\nfodder\nfoil\nfruitfully\nfruitfulness\ngainfully\npracticality\npreferential\nproductive\nproductively\nwholesome\nwholesomely\nwholesomeness\nwin-win\nworthwhile\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal physiology: fit & healthy\ngood adjective\n(BEHAVIOUR)\nA2 A good child or animal behaves well: If you're a good boy at the doctor's, I'll take you swimming afterwards.\nThesaurus: synonyms, antonyms, and examples\nwell behavedwell behavedOur kids are normally well behaved.goodBe a good girl and sit quietly.as good as goldThe babysitter said Arlo had been as good as gold.angelTeddy is a little angel.obedientHe always tried his best to be an obedient son.\nSee more results »\nable to be trusted: Her credit is good (= she can be trusted to pay her debts).\nMore examplesFewer examplesI'll just have to take you home if you can't be good, children.Settle down now, that's a good dog.You've been such a good girl this morning - I'm very proud of you.You are Year 5 now - surely you can be good for just a few minutes while your teacher is called away!He was always a good child and never any trouble.\nSMART Vocabulary: related words and phrases\nBehaving well\nangelically\nbe (as) good as gold idiom\nbe on your best behaviour idiom\nbehave\nbreeding\nchild\ndemure\ndemurely\ndemureness\nexample\ngracious\nkeep your nose clean idiom\nnose\npolite\nrail\nset an example idiom\nstay on the rails idiom\nsuper good\nwell behaved\nwell spoken\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLoyal, faithful & dependable\ngood adjective\n(SUITABLE)\nA2 suitable, convenient, or satisfactory: When would be a good time to phone?\nSMART Vocabulary: related words and phrases\nSuitable and acceptable\nable\nacceptability\nacceptable\nacceptably\naccepted\nconvenience\nconveniently\ncorrectly\ncorrectness\ndecent\ndecently\nfelicity\njust what the doctor ordered idiom\nlegitimate\npractical\nre-eligibility\nre-eligible\nrelevance\nrelevant\nrelevantly\nSee more results »\ngood adjective\n(LARGE)\nC1 [ before noun ] used to emphasize the large number, amount, or level of something: We've walked a good distance today. There was a good-sized crowd at the airport waiting for the plane to land.a good few Not all of his movies have been successful - there were a good few (= several) failures in the early years. You'll need a good length of rope to secure this properly. You have a good cry and you'll feel better after. There's a good chance the operation will be successful.\nThesaurus: synonyms, antonyms, and examples\ngreater than the average size or amountbigThey live in a big house in the country.largeA large number of people were crowded into the room.greatThe party was a great success.enormousThey bought an enormous house in the suburbs.\nSee more results »\na good deal of\nB2 much: The new law met with a good deal of opposition at the local level.\nSee more a good ... C2 (also a good ...'s)\nmore than: It's a good half hour's walk to the station from here.\nSee more\nSMART Vocabulary: related words and phrases\nBig and quite big\nappreciable\nbaronial\nbigly\nbloated\nboxcar\nbulky\nfullness\ngrandly\ngrowthy\nheaping\nhearty\nheftily\nhefty\npalatially\npumped\nrambling\nroomy\nroyal\nroyally\nthe bigger the better idiom\nSee more results »\ngood adjective\n(SATISFACTION)\nA1 said when you are satisfied or pleased about something, or to show agreement with a decision: Oh good, he's arrived at last. Good, I'll tell her it's all arranged, then. I'm good\nused to tell someone that you have everything that you need: \"More coffee?\" \"No, I'm good, thanks.\"\nSee more\nSMART Vocabulary: related words and phrases\nWords & phrases expressing agreement & acceptance\naccha\nachha\namen\namen to that idiom\nbeggar\ncouldn't agree more/less idiom\nfair\nhear\nI don't mind if I do idiom\nI know idiom\nmind\nquite\nshould\nsize\nvery\nwilco\nwill do idiom\nyou can say that again! idiom\nyou can't say fairer than that idiom\nyou do you idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPleasure and happiness\nGrammar\nGood at, bad atWe use adjective + at to talk about things that we do well or badly: …\nIdioms\nbe a good\nall in good time\nas good as\nbe (as) good as gold\nbe (as) good as new\nbe as good as your word\nbe good for something\nbe good to go\nbe good, and if you can't be good, be careful\nfor good measure\nMore idioms\ngood and ...\ngood and proper\ngood for you!\ngood heavens/grief/gracious!\nthe good old days\ngood show\nhave a good innings\nhave a good war\nin good faith\nin good time\nmake good\nmake good on something\nmake good time\ngood noun\n(THINGS)\ngoods [ plural ]\nB1 things for sale, or the things that you own: There is a 25 percent discount on all electrical goods until the end of the week.\nUK things, but not people, that are transported by railway or road: a goods train\nSee more\ngood noun\n(HELP)\nB2 [ U ] something that is an advantage or help to a person or situation: a lot of good Even a small donation can do a lot of good.for your own good I'm telling you for your own good.\nMore examplesFewer examplesHuge projects designed to aid poorer countries can sometimes do more harm than good.The captain resigned for the good of the team.He tried tightening the cable, but it didn't do any good.\nSMART Vocabulary: related words and phrases\nGood and excellent things\nbadass\nbe the best thing since sliced bread idiom\nbeatification\nbeaut\nbeauty\nbunch\nflagship\ngem\nhumdinger\njewel\njim-dandy\nking\nlulu\npeach\nscreamer\nsleeping beauty\nstandout\nthe jewel in the crown idiom\nthe real deal\nthe Rolls-Royce of something idiom\nSee more results »\ngood noun\n(HEALTH)\n[ U ] the state of being healthy or in a satisfactory condition: for your own good You should stop smoking for your own good (= for your health). He goes running every day for the good of his health.do more harm than good Modernizing historic buildings can often do more harm than good.for the good of The decision has been postponed for the good of all concerned. Synonym\nbenefit (ADVANTAGE) do someone good\nB2 to improve someone's health or life: You can't work all the time - it does you good to go out and enjoy yourself sometimes.\nSee more\nSMART Vocabulary: related words and phrases\nUseful or advantageous\na place in the sun idiom\nadvantageous\nadvantageously\nall-singing\namiss\nasset\nfodder\nfoil\nfruitfully\nfruitfulness\ngainfully\npracticality\npreferential\nproductive\nproductively\nwholesome\nwholesomely\nwholesomeness\nwin-win\nworthwhile\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal physiology: fit & healthy\ngood noun\n(MORALLY RIGHT)\nC2 [ U ] that which is morally right: There is an eternal struggle between good (= the force that produces morally right action) and evil.for good Ambition can sometimes be a force for good. the good [ plural ]\nall the people who are morally good\nSMART Vocabulary: related words and phrases\nVirtue and moral good\naltruism\nangel\nangelic\nangelically\nbe as pure as the driven snow idiom\njustifiable\njustifiably\njustified\nloftiness\nlofty\nrightfully\nrightly\nrightness\nsaintly\nthe road to hell is paved with good intentions idiom\nupliftment\nuprightly\nuprightness\nupstanding\nvirtuous\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople having good qualities\ngood noun\n(TIME)\nfor good\nC1 for ever: She's gone and this time it's for good.\nSee more Grammar\nNoun phrases: premodifiers (big, good, red)Premodifiers consist of single adjectives, adjective phrases, single nouns and noun phrases which are used before the head in a noun phrase. …\nAlways: meaningAlways can mean ‘on every occasion’, ‘forever’ or ‘very frequently’. In these meanings we use it with simple tense forms: …\nAlways with continuous verb formsWe can use always with continuous verb forms to refer to regular events or states, especially ones which are problematic or which we do not like or want: …\nAlways: positionWe most commonly use always in mid position, between the subject and main verb, after the modal verb or first auxiliary verb, or after main verb be: …\nAlways with can and couldWe often use always with can and could to talk about possible solutions to problems: …\nAs alwaysWe use as always to talk about one event which is seen as typical: …\nAlways, for good or for ever?When we talk about things which will be permanent, we normally use for good, or, more formally, for ever (sometimes written as forever). We do not normally say for always: …\nIdioms\nbe up to no good\ncome up with the goods\nno good\nto the good\nwhat good is ...\ngood adjective\n(SATISFACTORY)\nAdd to word list\nAdd to word list\ncomparative better us/ˈbet̬·ər/ | superlative best us/best/ of a kind that is pleasing or enjoyable, or of high quality: Let’s go on a picnic tomorrow if the weather’s good. That was a really good meal. Dogs have a very good sense of smell. Now would be a good time (= a suitable time) to talk to Andy about the promotion. He’s a good (= able and skillful) swimmer. Did they have a good time on their vacation? She makes good money (= earns a high income) in her new job.\ngood adjective\n(MORALLY RIGHT)\ncomparative better us/ˈbet̬·ər/ | superlative best us/best/ morally right or admirable: José is a genuinely good person. If you’re a good boy (= if you behave well) at the dentist, I’ll buy you some ice cream later. He’s always been good to his mother.\ncomparative better us/ˈbet̬·ər/ | superlative best us/best/ Good can be used as part of an exclamation: Good heavens! You mean they still haven’t arrived?\ngood adjective\n(WITH GREETING)\n[ not gradable ] used in greetings\ngood adjective\n(FOR HEALTH)\ncomparative better us/ˈbet̬·ər/ | superlative best us/best/ useful for health, or in a satisfactory condition: Make sure you eat plenty of good, fresh vegetables.\ngood adjective\n(LARGE)\n[ not gradable ] large in number or amount: We had to walk a good way in the airport to reach our gate. There was a good-sized crowd on hand. There was a good deal of (= a lot of) discussion about how much the car was worth. good noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ɡʊd/\nEven a small donation can do a lot of good. Idioms\na good\na good many\ngood and\n(as) good as new\ngood for someone\ngood riddance\n(it’s a) good thing\nno good\nAdd to word list\nAdd to word list\na product that is made to be sold: The demand for a good influences its price. See also\neconomic good\ngoodsCompare\ncommodity"}