{"id":168213,"name":"goodwill","type":"noun","us_sound":"ɡʊdˈwɪl","us_link":"../audio/g/goodwill.mp3","uk_sound":"ɡʊdˈwɪl","uk_link":"../audio/g/ukgonad018.mp3","content":"goodwill noun\n(FRIENDSHIP)\nAdd to word list\nAdd to word list\n[ U ] friendly and helpful feelings: The school has to rely on the goodwill of the parents to help it raise money.gesture of goodwill/goodwill gesture Releasing the hostages has been seen as a gesture of goodwill/a goodwill gesture.\n[ U ] part of a company's value that includes things that cannot be directly measured, for example, its good reputation or its customers' loyalty: The company's assets are worth £200 million, plus goodwill.\nSMART Vocabulary: related words and phrases\nFriendly\naffability\naffable\naffably\naffiliative\nagreeableness\nconversable\nconvivial\nconviviality\nconvivially\ncordial\nhospitably\nhospitality\ninseparable\nintimacy\nsugar and spice idiom\nsweet-natured\nsweet-tempered\nsweetness\nthe human touch\ntogetherness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nKind & thoughtful\nEstimating value\ngoodwill noun\n(CHARITY)\nGoodwill\n(also informal the Goodwill) abbreviation for Goodwill Industries: a US-based organization that collects old clothes and other unwanted things and sells them at low prices in special shops. The money is used to provide jobs, training, and services for people who are poor and cannot find work: My aunt gave me some towels, and I gave them to the Goodwill.\nSMART Vocabulary: related words and phrases\nOrganizations - charities\naid\nalms\nbenevolence\nbenevolent\nbenevolent society\nbutton day\ncharity\ncharity begins at home idiom\ncharity box\nfood pantry\nfoundation\nnon-profit\nnon-profit-making\nnot-for-profit\nOxfam\npearly king\nthe Peace Corps\nthe Red Crescent\nthe Red Cross\nvolunteer\nSee more results »\nAdd to word list\nAdd to word list\na friendly attitude in which you wish that good things happen to people: We hope the negotiations will take place in an atmosphere of openness and goodwill.\nAdd to word list\nAdd to word list\nCOMMERCE the value to a company or organization of things that cannot be directly measured, for example, its good reputation or its customers' loyalty: Charitable endeavours are important to us in terms of goodwill.\nACCOUNTING the difference between the value of a company's assets and what profit it is expected to make in the future, which is included in the price paid when it is bought or sold: We expect the business to raise at least $100,000 in goodwill."}