{"id":168521,"name":"gossip","type":"noun","us_sound":"ˈɡɑː.səp","us_link":"../audio/g/eus75777.mp3","uk_sound":"ˈɡɒs.ɪp","uk_link":"../audio/g/ukgoose021.mp3","content":"Add to word list\nAdd to word list\nB2 [ S or U ] conversation or reports about other people's private lives that might be unkind, disapproving, or not true: Her letter was full of gossip.idle gossip I don't like all this idle gossip.juicy gossip I've got some juicy gossip for you.the (latest) gossip Have you heard the (latest) gossip?have a gossip about UK Jane and Lyn sat in the kitchen having a good gossip about their friends.\n[ C ] disapproving (also gossipmonger, uk/ˈɡɒs.ɪpˌmʌŋ.ɡər/ us/ˈɡɑː.səpˌmʌŋ.ɡɚ/) someone who enjoys talking about other people and their private lives: She's a terrible gossip.\nMore examplesFewer examplesI've just been talking to the girls downstairs and I've got some delicious gossip.Some magazines contain nothing but scandal and gossip.She always keeps me up to date with the latest gossip.There's a lot of gossip about me going around. What have you been saying?Let's go for a coffee - I need to catch up on all the gossip.\nSMART Vocabulary: related words and phrases\nGossip and rumour\na fishing expedition idiom\na little bird told me idiom\nanecdotal\nbird\nbush telegraph\ndirt\near\nexposure\nhearsay\nlip\nlittle\non everyone's lips idiom\npeddle\nreportedly\nsay-so\nscandal\nscaremongering\nsnippety\nswirl\nyour ears must be burning idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSpeakers & talkers\nRelated word\ngossipy\nB2 to talk about other people's private lives: Stop gossiping and do your work.gossip about People have started to gossip about us. Compare\nnatter verb UK informal\nMore examplesFewer examplesShe's been gossiping and hasn't done a stroke of work all morning.Janet spends hours gossiping on the phone.I wouldn't tell her your secrets - you know how she likes to gossip.It's not only the women around here who like to gossip, you know!The old folk sit gossiping in the village square for most of the morning.\nSMART Vocabulary: related words and phrases\nRevealing secrets & becoming known\nanti-secrecy\nbackchannel\nbare\nbare your heart/soul idiom\nblow someone's cover idiom\nblow/take the lid off something idiom\nbreak\ndeclassify\nhold\nhuddle\nkiss\nrat\nrat on someone/something\nreintroduce\nrevealingly\nrevelatory\nstate's evidence\ntip\ntranspire\nunravel\nSee more results »\nAdd to word list\nAdd to word list\ntalk about other people’s private lives: [ U ] Have you heard the latest gossip (= what is being said about someone)?\nA gossip is also someone who enjoys talking about other people’s private lives: [ C ] Charlie is a real gossip. gossip verb [ I ] us\nYour browser doesn't support HTML5 audio\n/ˈɡɑs·əp/\nDon’t mind us – we’re just gossiping!"}