{"id":168666,"name":"govern","type":"verb","us_sound":"ˈɡʌv.ɚn","us_link":"../audio/g/govern.mp3","uk_sound":"ˈɡʌv.ən","uk_link":"../audio/g/ukgourd007.mp3","content":"govern verb\n(RULE)\nAdd to word list\nAdd to word list\nB2 [ I or T ] to control and direct the public business of a country, city, group of people, etc.: The country has been governed by military regimes. A president needs popular support in order to govern effectively.\nMore examplesFewer examplesWe are governed, in Lord Hailsham's famous phrase, by an 'elective dictatorship'.The country's being governed by a bunch of incompetents.He was chosen to govern the colony by the British government.He has been governing the country since taking power in a military coup.Another defeat in parliament would seriously weaken the president's ability to govern.\nSMART Vocabulary: related words and phrases\nRuling & governing\nadministration\naffairs of state\nascend\nascend the throne idiom\nbipartisanship\ngovernmental\ngovernmentally\ngovernorate\nhard Brexit idiom\nHolyrood\noppression\noppressively\noppressiveness\novergovern\nsubjection\nsubjugate\nsubjugation\nsuper-government\nthe politburo\ntinpot\nSee more results »\ngovern verb\n(INFLUENCE)\n[ T ] to have a controlling influence on something: Prices of goods are governed by the cost of the raw materials, as well as by the cost of production and distribution.\nSMART Vocabulary: related words and phrases\nControlling and being in charge\naggrandize\nassert your authority\nassume\nassumption\nauthoritative\ncommanding\ncynical\nget the better of someone idiom\nget your hooks into someone/something idiom\nget/fall into the wrong hands idiom\nguiding principle\nharness\npaternalistically\nperemptorily\nperemptory\nplay God idiom\nplenipotentiary\ntame\nwrangle\nwrangler\nSee more results »\ngovern verb\n(RULE)\nAdd to word list\nAdd to word list\n[ I/T ] to control and be responsible for the public business of a country, state, city, or other organized group: [ T ] The newly elected president will govern the country for four years.\ngovern verb\n(INFLUENCE)\n[ T ] to have a direct effect or controlling influence on something: Prices of manufactured goods are governed largely by the cost of raw materials and labor.\nAdd to word list\nAdd to word list\n[ I or T ]\n&#160; GOVERNMENT to control and manage a country, city, group of people, etc.: The party was accused of being unfit to govern. Today, he governs a state where Hispanics make up nearly half the population.\n[ T ] to have a controlling influence on the way something happens or is done: There are calls among politicians for tighter rules governing the operation of large hedge funds.be governed by sth Prices of goods are governed by the cost of raw materials, as well as the cost of production and distribution."}