{"id":168684,"name":"government","type":"noun","us_sound":"ˈɡʌv.ɚn.mənt","us_link":"../audio/g/government.mp3","uk_sound":"ˈɡʌv.ən.mənt","uk_link":"../audio/g/ukgourd010.mp3","content":"government noun\n(GROUP)\nAdd to word list\nAdd to word list\nB1 [ C, + sing/pl verb ] (written abbreviation govt) the group of people who officially control a country: the government of Israel The government is/are expected to announce its/their tax proposals today. The minister has announced that there will be no change in government policy. Senior government officials will be attending a meeting tomorrow. Theatre companies are very concerned about cuts in government grants to the arts. A government enquiry has been launched.\nMore examplesFewer examplesThe government is spending millions of dollars in its attempt to combat drug abuse.Unlike the present government, we believe in serving the community.The opposition party have been in such disorder for so long that they pose no real threat to the present government.The people rebelled against the harsh new government.The government has said that it will not be intimidated by terrorist threats.\nSMART Vocabulary: related words and phrases\nRuling & governing\nadministration\naffairs of state\nascend\nascend the throne idiom\nbipartisanship\ngovernmental\ngovernmentally\ngovernorate\nhard Brexit idiom\nHolyrood\noppression\noppressively\noppressiveness\novergovern\nsubjection\nsubjugate\nsubjugation\nsuper-government\nthe politburo\ntinpot\nSee more results »\ngovernment noun\n(SYSTEM)\nB2 [ U ] the system used for controlling a country, city, or group of people: The 1990s saw a shift to democratic government in Eastern Europe. What this state needs is really strong government.\nB2 [ U ] the activities involved in controlling a country, city, group of people, etc.: The party that was elected to power has no experience of government.in government UK The party was in government (= controlled the country) for four years in the 1960s. Her/His Majesty's Government\nthe government of the UK: This is the decision of Her Majesty's Government.\nSee more\nSMART Vocabulary: related words and phrases\nSystems of government\nabsolutism\nancien régime\nanti-apartheid\nanti-communism\nanti-federalist\ndemocratically\ndemocratization\ndemocratize\ndespotic\ndespotically\nmajority rule\nmartial law\nmatriarchal\nmatriarchy\nmeritocracy\npost-apartheid\npre-fascist\npure democracy\nregime\nreign\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRuling & governing\nAdd to word list\nAdd to word list\npolitics &amp; government the offices, departments, and groups of people that control a country, state, city, or other political unit: [ U ] She works for the government. [ C ] The new tax law affects the budgets of both state and local governments.\nGovernment is also a particular system of managing a country, state, city, etc.: [ U ] democratic government governmental adjective us\nYour browser doesn't support HTML5 audio\n/ˌɡʌv·ərnˈment·əl, -ərˈment·əl/\nThe country has weak governmental institutions and no experience of democracy.\nAdd to word list\nAdd to word list\n[ C ] an organization that officially manages and controls a country or region, creating laws, collecting taxes, providing public services, etc.: The two governments have signed an agreement. This fiscal year would mark the third government surplus in a row for the first time in over 50 years. a federal/central/local/governmentgovernment official/regulator/employee Global business leaders and government officials gathered in Spain Friday for a meeting aimed at breaking down remaining trade barriers.government agency/department Some government agencies have worked well together to combat terrorist financing. government policy/program/services the Chinese/Italian/British government The Chinese government has implemented economic reforms.\n[ U ] the people, systems, etc. that manage or control a country or region: The goal is to identify opportunities to reduce the cost of government. a democratic form of government. The President spoke of restoring confidence in government.\nform a government\nto bring political parties together to make a government when none of them has received a large enough number of votes in an election to control the government: The former prime minister was seeking support from smaller parties to help form a government.\nthe government [ S ]\nthe government of a particular country, especially the country you are in or the one you have already referred to: The government is proposing changes to subsidies for renewable energy sources. The figures are based on the government's survey of the labor force."}