{"id":168692,"name":"governor","type":"noun","us_sound":"ˈɡʌv.ɚ.nɚ","us_link":"../audio/g/governor.mp3","uk_sound":"ˈɡʌv.ən.ər","uk_link":"../audio/g/ukgourd012.mp3","content":"Add to word list\nAdd to word list\na person in charge of a particular political unit: the governor of Texas See also\ngubernatorial\nguvnor\nmainly UK a person in charge of or responsible for a particular organization: a prison/school governor\nMore examplesFewer examplesThe governor exhorted the prisoners not to riot.The governor was looking for a fall guy to take the blame for the corruption scandal.The governor has denied making improper use of state money.The new state governor has promised to purge the police force of corruption.The headmistress agreed to recommend the teachers' proposals to the school governors.\nSMART Vocabulary: related words and phrases\nLeaders of national & regional governments\nchancellor\nchancellorship\nchief executive\nco-ruler\ncollector\nFM\ngeneralissimo\ngovernorship\ngubernatorial\nhead of state\npremier\npremiership\nPres.\npresidency\npresident\nTaoiseach\nTánaiste\nveep\nvice president\nvice-presidential\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBosses & managers\nAdd to word list\nAdd to word list\na person in charge of an organization or of a particular political unit, esp. a US state: Governors from most of the 50 states will meet in Omaha this weekend. The board of governors of the hospital meets every month.\nAdd to word list\nAdd to word list\nBANKING, ECONOMICS, COMMERCE the title of the official leader of some organizations, or member of a group that is in charge of some organizations: There will be changes to the way the BBC trains its new governors.governor of sth His latest role was as governor of the Open Market Committee. Dolan is also on the board of governors of the Boys &amp; Girls Clubs of America.\nGOVERNMENT an elected official in charge of a particular region or state: The governor will sign the finance bill into law tomorrow.governor of sth Mr Fox was previously the governor of the state of Guanajuato.\nGovernor ( abbreviation Gov)\nthe title of an elected official in charge of a particular region or state: Governor Patrick is seeking re-election in November. Gov Jim Doyle of Wisconsin an interview with Govs Granholm and McDonell"}