{"id":168754,"name":"grabby","type":"adjective","us_sound":"ˈɡræb.i","us_link":"../audio/g/usgossa014.mp3","uk_sound":"ˈɡræb.i","uk_link":"../audio/g/ukgourd020.mp3","content":"grabby adjective\n(GREEDY)\nAdd to word list\nAdd to word list\ntrying to take things for yourself: Don't be so grabby, Shirley. Let the others have their share. a comedy about a pair of grabby opportunists on the French Riviera\nThesaurus: synonyms, antonyms, and examples\nwanting more of something than you needgreedyI've never met anyone so greedy for power.avariciousHe acquired his wealth by being an avaricious, unscrupulous businessman.rapaciousHe's a rapacious lawyer who will stop at nothing to win a case.acquisitiveShe was ruthlessly acquisitive and often bought expensive items just to keep others from owning them. graspingShe's a selfish, grasping old woman.\nSee more results »\nMore examplesFewer examplesThere are those who like to describe her as a grabby social climber.The book charts her rise from grabby Las Vegas showgirl to bride-to-be of one of the richest men in America.It's really just greedy, grabby selfishness.\nSMART Vocabulary: related words and phrases\nGreedy\navarice\navaricious\navariciously\nconsumerism\ngrasping\ngreed\ngreedily\ngreediness\ngreedy\nMammon\nmaterialism\nmaterialist\nmaterialistic\nmaterialistically\nrapacious\nrapaciously\nrapaciousness\nrapacity\nravenous\nsomeone's eyes are bigger than their belly/stomach idiom\nSee more results »\ngrabby adjective\n(ATTRACTING ATTENTION)\nwanting to or designed to attract attention: They exist to sell ads by writing articles with grabby headlines and little substance. The film's got a great idea to go with that grabby title. See\ngrab\nMore examplesFewer examples\"They try to get stories that are catchy, grabby,\" he says.The album was packed with satisfying, grabby tunes.\nSMART Vocabulary: related words and phrases\nAttention-seeking, distracting and showing off\nchichi\nconspicuous consumption\ndressed\ndressed (up) to the nines idiom\nexhibitionistic\nexhibitionistically\nflamboyance\nflamboyancy\nflamboyant\nflaunt\ngimmick\nhotdog\nostentation\nostentatiously\npeacock\npeacocking\nposture\nrazzle-dazzle\nself-conscious\nshowboating\nSee more results »"}