{"id":168749,"name":"grab","type":"verb","us_sound":"ɡræb","us_link":"../audio/g/grab.mp3","uk_sound":"ɡræb","uk_link":"../audio/g/ukgourd019.mp3","content":"grab verb\n(TAKE WITH HAND)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to take hold of something or someone suddenly and roughly: A mugger grabbed her handbag as she was walking across the park.grab (hold of) He grabbed (hold of) his child's arm to stop her from running into the road.\nThesaurus: synonyms, antonyms, and examples\nto hold someone or somethingholdCan you hold this for a moment?claspHe reached out to clasp her hand.gripThe baby gripped my finger with her tiny hand.clutchSilent and pale, she clutched her mother's hand.clingOne little girl was clinging onto a cuddly toy.hang onThe child was hanging on to her mother's skirt.\nSee more results »\nMore examplesFewer examplesI just managed to grab hold of Lucy before she fell in the pool.I grabbed the dog by the collar and dragged it out of the room.Someone jumped out of the shadows and grabbed my handbag.Grab your coat and follow me.Stop grabbing my arm. You're hurting me.\nSMART Vocabulary: related words and phrases\nCapturing or taking possession of things\n-grabbing\napprehend\napprehension\narrogate\nat bay idiom\ncage\ncapture\ncatch\nclutch\ncollar\ncorner\nget/lay/put your hands on someone idiom\ngrabber\ngrasp at something\nintercept\nsequester\nsequestration\nsnag\nsnatch\nsnatch at something\nSee more results »\ngrab verb\n(TAKE OPPORTUNITY)\nB2 [ T ] informal to take the opportunity to get, use, or enjoy something quickly: If you don't grab this opportunity, you might not get another one. We'd better get there early, or someone else will grab the best seats. Let's just grab a quick bite. grab someone's attention\nC1 to attract someone's attention: You must grab the reader's attention from the first sentence.\nSee more\nMore examplesFewer examplesThe visiting team grabbed an equaliser just before half time.One young fan managed to grab an autograph as the player was getting on to the coach.You won't get many opportunities, so you need to grab any chances that you get.We can grab a bite to eat before the film starts.She grabbed the chance to play the title role when the leading actor was taken ill.\nSMART Vocabulary: related words and phrases\nHaving in your hands\nahold\narm\nchokehold\nclasp\nclench\ncling\ncup\ndandle\ngrasp\nhand in hand idiom\nhandle\nhang\nhang on\nhang/hold on like grim death idiom\nhold\nhold on idiom\nonto\npinion\nseize\ntaken\nSee more results »\nIdiom\nhow does... grab you?Phrasal verb\ngrab at something/someone\na sudden attempt to hold, get, or take something: make a grab for The two children both made a grab for the same cake.\nSMART Vocabulary: related words and phrases\nCapturing or taking possession of things\n-grabbing\napprehend\napprehension\narrogate\nat bay idiom\ncage\ncapture\ncatch\nclutch\ncollar\ncorner\nget/lay/put your hands on someone idiom\ngrabber\ngrasp at something\nintercept\nsequester\nsequestration\nsnag\nsnatch\nsnatch at something\nSee more results »\nRelated word\ngrabbyIdiom\nup for grabs\nAdd to word list\nAdd to word list\nto take or take hold of something or someone suddenly: I grabbed the rope and pulled myself out of the water. We’d better get there early, or someone else will grab the best seats (= take them first). infml Let’s grab a sandwich (= get it and eat it quickly) before we leave."}