{"id":168779,"name":"graceless","type":"adjective","us_sound":"ˈɡreɪs.ləs","us_link":"../audio/g/usgossa016.mp3","uk_sound":"ˈɡreɪs.ləs","uk_link":"../audio/g/ukgourd025.mp3","content":"graceless adjective\n(NOT ATTRACTIVE)\nAdd to word list\nAdd to word list\nnot attractive in appearance: He described the house as ugly and graceless. Her outwardly graceless appearance camouflages her inner radiance.\nMore examplesFewer examplesThe central shopping streets are brash and graceless. What you have is a functional, if visually graceless, design.People will pay $1 million for a graceless, boxy house on a soulless street because it represents a social goal.\nSMART Vocabulary: related words and phrases\nNot attractive to look at\nback end\nbe no oil painting idiom\nbe not much to look at idiom\nbleakly\nbleakness\nexcrescence\ngopping\ngracelessly\nhave a face like the back end of a bus idiom\nhideous\nhideousness\npretty\npretty-pretty\nputridly\nreptilian\nscrappily\nunshapely\nunsightly\nvulgarity\nvulgarly\nSee more results »\ngraceless adjective\n(NOT POLITE)\nnot polite or showing respect or sympathy towards others : a graceless manner It was the most graceless acceptance speech I have ever heard. He is generally disliked, seen by his fellow players as selfish, mean, graceless and arrogant.\nMore examplesFewer examplesSpecter's comment was characteristically graceless.His self-belief and desire to win combine to make him both stubborn and, at times, graceless.When luck is something you inherit or buy, grumbling at the complaints of the less fortunate is graceless.\nSMART Vocabulary: related words and phrases\nRude and cheeky\ncheekily\ncheekiness\nchurlishly\nchurlishness\ncoarse\ncoarsely\nfruity\ngall\nincivility\nindelicate\nobnoxiously\nobnoxiousness\noffensively\noffensiveness\npertly\npresume\nscatological\nunpleasant\nunprintable\nunrepeatable\nSee more results »\ngraceless adjective\n(NOT SMOOTH OR RELAXED )\nmoving in a way that is not natural, relaxed, or attractive: Eloise always managed to make her feel like a graceless child. the awkward, graceless gyrations of his dancing graceless movements\nMore examplesFewer examplesIn one graceless motion, he picked up the telephone and dropped it on the floor.I slid the three meters to the ground in a series of graceless jerks. When did their seductive swagger cease to be sexy, and begin to seem graceless?\nSMART Vocabulary: related words and phrases\nMoving unsteadily or with difficulty\nblunder\nbumble\ndodder\ndodderer\ndoddery\nfavour\nhobble\ninflexibly\nlimp\nlollop\nlumber\nlumpily\nreel\nsqueeze\nstumblingly\nteeter\ntoddle\ntoil\ntotter\ntumble\nSee more results »\nRelated words\ngracelessly\ngracelessness"}