{"id":168862,"name":"graduate","type":"noun","us_sound":"ˈɡrædʒ.u.ət","us_link":"../audio/g/graduate_01_00.mp3","uk_sound":"ˈɡrædʒ.u.ət","uk_link":"../audio/g/ukgraci012.mp3","content":"Add to word list\nAdd to word list\nB2 UK a person who has a first degree from a university or college: a Cambridge graduate Chris is a physics graduate. See also\npostgraduate noun\nundergraduate\nA2 US (informal grad) a person who has finished their school, college, or university education: high-school graduatesgraduate of She's a recent graduate of Yale.\nMore examplesFewer examplesWe would prefer to fill the post with a recent graduate.A graduate of law and economics from Moscow State University, he had spent his life in academia.At present the organization has to rely on young, inexperienced graduates.Geography graduates are literate and numerate and have very good IT skills.There are numerous opportunities for young graduates.\nSMART Vocabulary: related words and phrases\nUniversity & college education\nacademe\nacademia\nanti-university\nbeadle\nbusiness school\ngrad\nhall\nhall of residence\nhonor society\nOxon\nPanhellenic\npass degree\npoly\npolytechnic\nthe groves of academe idiom\nuniversity\nunselective\nvice chancellor\nwarden\nwardenship\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStudents & pupils\ngraduate verb\n(EDUCATION)\nB2 [ I ] UK to complete a first university degree successfully: graduate from Lorna graduated from Freiburg University.graduate with honours in Tom has just graduated with first-class honours in psychology.\nB2 [ I or T ] US to complete school, college, or university successfully: graduate from After he graduated from high school, he joined the Army.\nMore examplesFewer examplesHis heart swelled with pride as he stood watching his son graduate.He graduated with a second-class honours degree in physics.Greg and Jody met in their freshman year at college and married soon after they graduated.Both their children graduated with degrees in economics.She graduates in July.\nSMART Vocabulary: related words and phrases\nUniversity & college education\nacademe\nacademia\nanti-university\nbeadle\nbusiness school\ngrad\nhall\nhall of residence\nhonor society\nOxon\nPanhellenic\npass degree\npoly\npolytechnic\nthe groves of academe idiom\nuniversity\nunselective\nvice chancellor\nwarden\nwardenship\nSee more results »\ngraduate verb\n(PROGRESS)\n[ I ] to move forward or improve: graduate from something to something She graduated from being a secretary to running her own department.\nSMART Vocabulary: related words and phrases\nMaking progress and advancing\nadvance the cause\nadvancement\nage\nahead\nahead of\ncarry\nevolve\nevolved\nflourish\nflower\nformatively\nfrom A to B idiom\njourney\nmature\npunctuated equilibrium\nrebuild\nregenerate\nripen\nripeness\nspread\nSee more results »\nAdd to word list\nAdd to word list\na person who has successfully completed studies at a school or received a degree from a college or university: a Yale graduate/a graduate of Yale graduate verb [ I/T ] us\nYour browser doesn't support HTML5 audio\n/ˈɡrædʒ·uˌeɪt/\n[ I ] Although he never graduated from high school, he became a successful businessman.\nrelating to or working toward a university degree beyond the one you receive after four years of study: graduate school/student/studies\nAdd to word list\nAdd to word list\na student who has completed a university or college degree: a 2010 college graduatea graduate of sth Li is a graduate of Beijing University. an Oxford/Harvard/Columbia graduate a psychology/journalism/engineering graduate\nUS a student who has completed high school: The boys were graduates of Winthrop High School. a high school graduate\n[ I ] to complete a degree at a college or university: The pharmacy college will hold classes for 12 months a year so that its students can graduate in three years .graduate from sth In India, roughly two million English speakers graduate from university each year.\n[ I ] US to complete high school: The program continues until the students graduate from high school.\n[ T ] US if a university, college, or school graduates students, it gives them an official document that proves they have completed their education there: The business community has been frustrated that our city schools were graduating people who were illiterate."}