{"id":168823,"name":"grade","type":"noun","us_sound":"ɡreɪd","us_link":"../audio/g/grade.mp3","uk_sound":"ɡreɪd","uk_link":"../audio/g/ukgraci006.mp3","content":"grade noun [C]\n(LEVEL)\nAdd to word list\nAdd to word list\nB2 a level of quality, size, importance, etc.: low-grade He's suffering from some kind of low-grade (= slight) infection, which he can't seem to get rid of.high-grade There's some really high-grade (= high quality) musicianship on this recording.on a grade Bill has been on the same grade (= his job has been of the same level of importance, or he has had the same level of pay) for several years now.\nB1 a number or letter that shows how good someone's work or performance is: Steve never studies, but he always gets good grades.UK Carla got a grade A in German. Synonym\nmark (FOR SCHOOL WORK) mainly UK\nMore examplesFewer examplesSally's a grade above me.She's got nine GCSEs, all at grade A.He has attained the highest grade in his music exams.Jonathon Hill achieved grade A passes at A-level.Whether I go to university or not is dependent on what exam grades I get.\nSMART Vocabulary: related words and phrases\nQuality and standard\nbar\nbenchmark\ncachet\ncalibre\nconform\nconform to/with something\nideal\nlevel\nmark\nmulti-levelled\nmultilevel\nnotch\nqualitative\nstar\nstarred\nstatus\nstyle\ntake first/second place idiom\nunranked\nupscale\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMarks & results\ngrade noun [C]\n(SCHOOL)\nA2 US a school class or group of classes in which all the children are of a similar age or ability: Jackie is in the sixth grade.\nMore examplesFewer examplesShe starts in the third grade this September.Pupils take exams in the fourth and sixth grades.They were in the same grade at school.Students in the eighth grade have the chance to go on an exchange visit to France.He teaches maths to the third grade.\nSMART Vocabulary: related words and phrases\nClasses & courses\nacademic year\naccess course\nadvanced\nAdvanced Placement\nasynchronous\nfield trip\ngrind\nhomework\nHyFlex\nimmersion course\ninterdisciplinarity\ninterdisciplinary\nnon-class\nnon-degree\nopen admissions\nopen classroom\nplacement\nprep\nwork placement\nworkshop\nSee more results »\ngrade noun [C]\n(SLOPE)\nUS a\ngradient : steep grade The next hill has a really steep grade.\nSMART Vocabulary: related words and phrases\nGeometry: describing angles, lines & orientations\nangle of incidence\nangularity\nantinode\nasymptote\nasymptotic\ndiagonal\ngradient\ninterior angle\nmultiaxial\nnon-coplanar\nnon-intersecting\nnon-planar\nreflex\nscalene triangle\nshallow\nsupplementary\ntransversal\ntriangulate\nvanishing point\nvertically\nSee more results »\nIdiom\nmake the grade\nC1 to separate people or things into different levels of quality, size, importance, etc.: be graded by The fruit is washed and then graded by size. The books are graded according to the difficulty of the language.\nC1 US (UK mark) to give a score to a student's piece of work: to grade work/papers\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nconcordance\ndescribe\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nset something up\nshake someone down\nshort-list\nshortlist\nsort\ntick\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnalysing and evaluating\ngrade noun [C]\n(MEASURE/MARK)\nAdd to word list\nAdd to word list\na measure of the quality of a student’s performance, usually represented by the letters A (the best) through F (the worst): She always gets good grades.\nA grade is also a measure or mark of quality, amount, or degree: high-grade musicianship He’s suffering from a low-grade infection.\ngrade noun [C]\n(SCHOOL)\na school class or group of classes in which all the children are of a similar age or ability: James is in the seventh grade this year.\ngrade noun [C]\n(SLOPE)\nthe degree of slope of land or of a road or path: In hilly San Francisco, many streets have a steep grade.\ngrade verb [T]\n(MEASURE/MARK)\nto judge and give a mark to a student, exam, etc.: The essays were graded on clarity of expression.\nTo grade is also to separate things according to quality or size: Eggs are usually graded by size.\nAdd to word list\nAdd to word list\nBANKING a letter or combination of letters used by ratings agencies to show how certain they are that a loan will be paid back by the person or organization that borrowed the money: Bonds which are rated A are considered as upper-medium grade obligations. See also\ninvestment-grade\nPRODUCTION one of the levels of quality given to a particular product or substance : March futures on commercial grade coffee closed at $1.04 per pound Friday.high/low grade Technicians carefully loaded new fuel rods of high grade uranium into the cooling water.aircraft/human/weapons, etc. grade The scooters are made from aircraft grade aluminium alloy and weigh just 2.76kg.\nHR a level or division within an organization or system: The administrative grade, recruited from top-quality university graduates, prepares policy advice for ministers. a pay/salary grade\nmake the grade\nto be as good as expected or as good as is necessary: Many of the online shops simply failed to make the grade.\nto judge the quality of a product, substance, or organization, or the performance of an employee: The fibre is graded and packed into bales for transport to factories for spinning, dying, and milling.be graded on sth He said that principals and superintendents would be graded on leadership and school performance.be graded for sth Inside the world's largest covered building, the flowers are graded for quality and catalogued by computer."}