{"id":168890,"name":"graffiti","type":"noun","us_sound":"ɡrəˈfiː.t̬i","us_link":"../audio/g/eus72070.mp3","uk_sound":"ɡrəˈfiː.ti","uk_link":"../audio/g/ukgraci015.mp3","content":"Add to word list\nAdd to word list\nwords or drawings, especially humorous, rude, or political, on walls, doors, etc. in public places: The subway walls are covered with graffiti. A man was jet-washing grafitti off his front door.\nv96joel/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesIf you asked him he'd say grafitti are much less considered than the marks he makes.Graffiti was daubed on the walls.The memorial to dead soldiers had been defaced by grafitti.That graffiti is usually comissioned by the owner of the premises in an attempt to prevent their shopfronts being \"tagged\" with something they are not happy with.\nSMART Vocabulary: related words and phrases\nWriting & typing\nannotate\nasemic\nbang something out\nbash something out\nborrow\nborrow something from something\nchart\ndot\nfair\ninscribe\nkeyboard\nre-registration\nreadability\nrecompose\nreformulate\nrekey\nsemiotics\nspeller\ntab\ntranscribe\nSee more results »\nto write or draw graffiti on walls, doors, etc. in public places : They wanted to go out and graffiti the neighbourhood. She posed for a photo against a heavily graffitied wall.\nMore examplesFewer examplesHe didn't graffiti the local bus stop. He killed a defenceless man in cold blood.Later she compliments Randy for graffitiing his name on the side of the truck.On the graffitied streets, the prevailing mood is one of a community carrying on its daily business.\nSMART Vocabulary: related words and phrases\nWriting & typing\nannotate\nasemic\nbang something out\nbash something out\nborrow\nborrow something from something\nchart\ndot\nfair\ninscribe\nkeyboard\nre-registration\nreadability\nrecompose\nreformulate\nrekey\nsemiotics\nspeller\ntab\ntranscribe\nSee more results »\nAdd to word list\nAdd to word list\nwritings or drawings made on surfaces in public places: Someone had painted graffiti on the entire wall."}