{"id":169287,"name":"granulate","type":"verb","us_sound":"ˈɡræn.jə.leɪt","us_link":"../audio/g/cdo1121usgran1912.mp3","uk_sound":"ˈɡræn.jə.leɪt","uk_link":"../audio/g/cdo0123ukgran1119.mp3","content":"Add to word list\nAdd to word list\nto turn or to make something turn into granules (= small pieces like grains): Fondant is made of sugar and water boiled together, with a small quantity of cream of tartar to prevent the sugar from granulating. Tablets can be made by granulating the components then compressing them into a tablet form. See also\ngranulated sugar\nmedical\n&#160; specialized (of injured skin or tissue) to form many small lumps as part of the healing process (= the process of becoming healthy again): A healing wound is red, clean, and granulating. During follow up at our outpatient department we found that the larger wound was granulating well.\nMore examplesFewer examplesThe paint tends to separate and granulate in a very attractive way.The liquid is boiled until it granulates.They were able to grow and granulate sugar cane for sale commercially in Louisiana.Dr Johnson talked about the proportions of charcoal and salt-petre in making and granulating gunpowder. The fluid consists of resin dissolved in spirits, a solution which, when dried out, leaves a granulated surface.\nSMART Vocabulary: related words and phrases\nPhysical & chemical processes\nabsorbable\nabsorptive\nabsorptive capacity\nabsorptivity\nacidification\ncorrode\ndegradable\nexcitability\nexcitation\nexcite\nexergonic\nexothermic\nexothermic reaction\nimpregnate\nre-emit\nreabsorb\nreact\nreboil\nrecondense\nscald\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInjuring and injuries\nRecovering from illness\na substance consisting of granules (= small pieces like grains): Old trainers are transformed into a rubber granulate that is incorporated into playground surfacing.\nMore examplesFewer examplesThis absorbent material is a special granulate that combines with liquid to form a solid gel.They developed a granulate from biomaterials.\nSMART Vocabulary: related words and phrases\nPhysics: the state of matter\nabsorbency\nacidic\nallotropic\nallotropy\ncompressible\ncrystalline\ne-liquid\nfluidity\ngranulated\nimpervious\nmelted\npolyunsaturated\nreflective\nrustily\nrusty\nself-healing\nsloppily\nsloppiness\nsloppy\nspectrally\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBuilding materials"}