{"id":169292,"name":"granulation","type":"noun","us_sound":"ˌɡræn.jəˈleɪ.ʃən","us_link":"../audio/g/cdo1121usgran1913.mp3","uk_sound":"ˌɡræn.jəˈleɪ.ʃən","uk_link":"../audio/g/cdo0123ukgran1120.mp3","content":"granulation noun\n(SMALL PIECES)\nAdd to word list\nAdd to word list\n[ U ] the quality of being made up of granules (= small pieces like grains), or the process of forming granules: When viewed at very high resolution, the surface of the sun has a mottled appearance (called granulation). Granulation in honey is a natural process, and can be reversed by gentle heat.\n[ C or U ] the size of the granules (= small pieces like grains) that make up a substance: This is a southern-style corn meal that has a finer granulation. Gunpowder mixtures have a range of properties, depending on formulation and granulation.\nMore examplesFewer examplesGranulation is an artistic effect that can be achieved when using colours with heavy pigment particles. The type and source of sugars, as well as their granulation, will affect their use. The beans are processed into soy flours with different granulations (such as flakes, grits, powders).Use medium granulation buckwheat.\nSMART Vocabulary: related words and phrases\nPhysical & chemical processes\nabsorbable\nabsorptive\nabsorptive capacity\nabsorptivity\nacidification\ncorrode\ndegradable\nexcitability\nexcitation\nexcite\nexergonic\nexothermic\nexothermic reaction\nimpregnate\nre-emit\nreabsorb\nreact\nreboil\nrecondense\nscald\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWords meaning small pieces and amounts\nRough, irregular and uneven\ngranulation noun\n(IN BODY)\n[ U ]\n&#160; medical\n&#160; specialized the process of many small lumps forming in injured skin or tissue as part of the healing process (= the process of becoming healthy again): The lesion is left open to heal by granulation. Avoid iodine dressings because they damage healthy tissue and slow granulation.\n[ C ]\n&#160; medical\n&#160; specialized one of many small lumps that have formed in a wound or in part of the body: Ear examination revealed a perforation filled with keratin and surrounded by granulations.\nMore examplesFewer examplesDead skin had to be removed from the wound before granulation and healing could begin.The wound sites showed increased granulation, decreased drainage, and a reduced bacterial burden after having the device in place.The conjunctiva may be striated, or studded with granulations but not inflamed.\nSMART Vocabulary: related words and phrases\nRough, irregular and uneven\nabrasion\nabrasive\nabrasiveness\nbumpy\ncoarsely\njaggedly\njaggy\njerky\nknobbly\nleathery\npockmarked\nraggedly\nraggedness\nraggedy\nroughness\nrugged\nunsteadily\nunsteady\nwonkiness\nwonky\nSee more results »"}