{"id":169262,"name":"grant","type":"noun","us_sound":"ɡrænt","us_link":"../audio/g/grant.mp3","uk_sound":"ɡrɑːnt","uk_link":"../audio/g/ukgrand029.mp3","content":"Add to word list\nAdd to word list\nB1 an amount of money given especially by the government to a person or organization for a special purpose: a student/research grant a local authority/government grant [ + to infinitive ] They gave/awarded her a grant to study abroad for one year.\nThesaurus: synonyms, antonyms, and examples\nsomething that you givepresentThe coat was a birthday present from my sister.giftI have a small gift for you.donationAfter the earthquake, donations poured in from all over the world.grantStudents receive a grant equal to £250 per month.contributionShe wanted to make a financial contribution to the family.\nSee more results »\nMore examplesFewer examplesWe got a government grant for setting up our business, but they clawed it all back again in taxes.You might be eligible for a grant.Please state why you wish to apply for this grant.Students are able to take out loans to top up their grants.The government is awarding small grants to single mothers who are starting their own businesses.\nSMART Vocabulary: related words and phrases\nGrants & allowances\nanti-subsidy\nbenefit\nbenny\ncost-of-living allowance\ndearness allowance\nexpense\nfellowship\nfringe benefit\nold age pension\nparachute payments\npension\npin money\nredundancy payment\nscholarship\nscrappage\nstipend\nsubsidized\nsubsidizer\nunemployment benefit\nweighting\nSee more results »\ngrant verb\n(GIVE)\nB2 [ T ] to give or allow someone something, usually in an official way: [ + two objects ] They granted her an entry visa. He was granted asylum.formal She granted their request/wish.\nThesaurus: synonyms, antonyms, and examples\nto give something to someonegiveGive me that dirty plate.offerYour doctor should be able to offer advice.provideThis booklet provides useful information about local services.supplyThe lake supplies the whole town with water.donateFour hundred dollars has been donated to the school book fund.\nSee more results »\nMore examplesFewer examplesJudges only grant marriage annulments in exceptional circumstances.The new government is to grant a free pardon to all political prisoners.Because of a previous conviction, the judge refused to grant bail.Management have granted a 10% pay rise in response to union pressure.Planners are committed to developing the city's brownfield sites before granting permission to build on the rural outskirts.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nspare\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccepting & agreeing\ngrant verb\n(ACCEPT)\n[ T + (that) ] to accept that something is true, often before expressing an opposite opinion: grant that I grant that it must have been upsetting but even so I think she overreacted.I grant you I grant you (= it is true that), it's a difficult situation but I feel sure he could have handled it more sensitively. take something for granted\nB2 to believe something to be the truth without even thinking about it: I didn't realize that Melanie hadn't been to college - I suppose I just took it for granted.\nSee more take something or someone for granted\nB2 If you take situations or people for granted, you do not realize or show that you are grateful for how much you get from them: One of the problems with relationships is that after a while you just take each other for granted.\nSee more\nMore examplesFewer examplesHe refused to grant that miracles occur.Many scientists are willing to grant that apes are able to develop linguistic skills.She refuses to grant the possibility that she might be wrong.He granted that there would be no way of ever knowing the full facts.The article grants that not all of its claims can be verified.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nrule\nsign on the dotted line idiom\nSee more results »\nRelated word\ngranted\ngrant verb [T]\n(GIVE)\nAdd to word list\nAdd to word list\nto give, agree to give, or do something that another person has asked for, esp. as an official or formal act: She was granted American citizenship.\ngrant verb [T]\n(ACCEPT)\nto accept that something is true, often before expressing an opposite or disapproving opinion: [ + (that) clause ] I grant you (that) it must have been upsetting, but even so I think he made too big a deal of it.\ngrant noun [C]\n(MONEY)\na sum of money given by the government, a university, or a private organization to another organization or person for a special purpose: a research/study grant\nAdd to word list\nAdd to word list\nGOVERNMENT, FINANCE an amount of money that is given to a person or an organization for a special purpose, especially by a government: a grant from sb/sth The research laboratory was set up with a grant from the Department of Health.a grant for sth The company received a $10,000 grant for software development.award/give sb a grant They were awarded a grant for stem cell research. get/be given/receive a grant be eligible for/qualify for a grant You can apply for a grant to upgrade your IT systems. a research/study grant a government/federal/state grant a grant application See also\nblock grant\ncapital grant\ndeath grant\ndevelopment grant\ninvestment grant\nLAW, FINANCE to legally or officially give or allow something: grant permission to do sth Only the city council can grant permisssion to build on that site.grant sth to sb/grant sb sth The authorities have granted special licenses to companies who are pioneering communications technology.grant sb access/rights The draft agreement will grant the airline several other new rights within Europe. grant sb a loan/mortgage grant a licence/patent grant an injunction/an extension/compensation grant sb citizenship/a visa/asylum"}