{"id":169354,"name":"graph","type":"noun","us_sound":"ɡræf","us_link":"../audio/g/graph.mp3","uk_sound":"ɡrɑːf","uk_link":"../audio/g/ukgranu009.mp3","content":"Add to word list\nAdd to word list\nB2 a picture that shows how two sets of information or variables (= amounts that can change) are related, usually by lines or curves: This graph shows how crime has varied in relationship to unemployment over the last 20 years.\nadamkaz/E+/GettyImages graph of an equation mathematics\n&#160; specialized\nthe group of all points on a line or plane that are solutions of an equation (= statement that two amounts are equal): Learn how to draw a graph of the equation.\nSee more\nMore examplesFewer examplesWe need some sort of graph on which we can chart our progress.Squared paper is better for drawing graphs on.\nSMART Vocabulary: related words and phrases\nTables, graphs & diagrams\nabscissa\nasymptote\nasymptotic\nbar chart\nbar graph\nblock graph\ncoordinate\ndiagram\nfig\nflowchart\ngraph paper\nMind Map\nnormal distribution\norganigram\npictogram\nreplot\nscatter diagram\ntabular\nvertical axis\ny-axis\nSee more results »\nAdd to word list\nAdd to word list\nmathematics a drawing that shows lines or curves formed with two sets of measurements or amounts, or a such a drawing produced by the set of points (= positions) that solve an equation (= mathematical statement): a bar/line graph A graph would show this information more clearly.\nmathematics Graph paper is paper with small squares printed on it that can be used for drawing some types of graphs. graph of an equation\nThe graph of an equation is the group of all points on a number line or the coordinate plane that are solutions of an equation (= statement that two amounts are equal).\nto show information in the form of a graph: The global warming data will be graphed and the students will interpret it.\nAdd to word list\nAdd to word list\na drawing that shows how different types of information are related, usually using two axes (= fixed lines) and a line or curve which shows how one thing changes as another thing changes: He drew a graph on the whiteboard. The graph shows quite clearly the impact of the recession on sales figures. Compare\nchart noun See also\nbroken-line graph\nline graph\nbar graph\nto create a graph to show how different pieces of information are related: graph sth against sth Use the software to graph the dollar's performance against the euro over the last year. To graph the stock of any of the companies mentioned, click the company name. Compare\nchart verb"}