{"id":169364,"name":"graphic","type":"adjective","us_sound":"ˈɡræf.ɪk","us_link":"../audio/g/graphic.mp3","uk_sound":"ˈɡræf.ɪk","uk_link":"../audio/g/ukgranu010.mp3","content":"graphic adjective\n(CLEAR)\nAdd to word list\nAdd to word list\nvery clear and powerful: a graphic description/accountin graphic detail He insisted on describing his operation in graphic detail while we were eating lunch.\nSMART Vocabulary: related words and phrases\nEasy to understand\n(as) clear as day idiom\nabundantly clear\naccessible\naccessibly\nassimilable\ndigestible\nexplicitly\nexplicitness\nexpressly\nfathomable\nhang\nin words of one syllable idiom\nlimpid\npellucidly\nperspicuity\nperspicuous\nperspicuously\npikestaff\ntaut\nwell defined\nSee more results »\ngraphic adjective\n(DRAWING)\n[ before noun ] related to drawing or printing: a graphic artist\nSMART Vocabulary: related words and phrases\nPublishing: printing & word processing\n3-D printing\nbackspace\nbed\nboldface\nboldfaced\nbolding\nimpression\nimprint\nindent\nindentation\ninline\nprint on demand\nprint run\nprint something out\nprinted\nprinting\ntypographical\ntypography\nunpublished\nxerography\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe visual arts in general\ngraphic adjective\n(GRAPH)\nmainly US (UK usually graphical, uk/ˈɡræf.ɪ.kəl/ us/ˈɡræf.ɪ.kəl/) relating to, using, or consisting of a graph or graphs\nSMART Vocabulary: related words and phrases\nTables, graphs & diagrams\nabscissa\nasymptote\nasymptotic\nbar chart\nbar graph\nblock graph\ncoordinate\ndiagram\nflowchart\ngraph\ngraph paper\nMind Map\nnormal distribution\norganigram\npictogram\nreplot\nscatter diagram\ntabular\nvertical axis\ny-axis\nSee more results »\na picture or diagram that gives information, especially one produced on a computer: This graphic shows the different stages of the water cycle. He showed them a computer graphic of the Antarctic ozone hole. graphics\nB1 [ plural ] images and designs used in books, magazines, websites, etc., especially ones produced on a computer: Can the text and graphics be moved around once they have been placed on the page? Overuse of graphics is one reason for slow download times. Synonym\nartwork\n[ U ] the study or activity of making images and designs used in books, magazines, websites, etc.: He went to the Royal College of Art, where he studied graphics.computer graphics The documentary uses sophisticated computer graphics to show how the operation is performed.\nMore examplesFewer examplesLaser printers can produce letter quality text as well as high quality graphics. These computer games rely on 3-D graphics.He studied graphics and now works as a web designer from his apartment in Berlin.The system came bundled with a word processor, spreadsheet and graphics program.This course is designed to teach computer graphics creation to students with no prior graphics background.Computer graphics is a sub-field of computer science that studies methods for digitally synthesizing and manipulating visual content.\nMore examplesFewer examplesThe graphic shows the location of the proposed wind farm and comparison of the height of the turbines with nearby buildings and structures.\nSMART Vocabulary: related words and phrases\nPictures\n-scape\nabstract\naquatint\nautostereogram\nballoon\ncanvas\ncaricature\ngraphic arts\ngraphic novel\nhalo\nhellscape\nidentikit\npastel\npencil\nposter\nraster\nrehang\nscreen print\nshade\nsketch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer concepts\nSubjects & disciplines\ngraphic adjective\n(CLEAR)\nAdd to word list\nAdd to word list\nproducing very clear and detailed mental images: a graphic description of the operation\ngraphic adjective\n(DRAWING)\n[ not gradable ] having to do with drawing or images: She first worked as a graphic designer. The network has upgraded the graphic look of the show.\ngraphic noun [C]\n(DRAWING)\nA graphic can also be printing shown on television that gives additional information: Let’s take a look at the graphic of that quote.\nAdd to word list\nAdd to word list\nrelating to the use of graphs to show information: Figure 6.2 provides a graphic representationof the key processes in the management of change.\nskilled at using drawings and pictures, especially in the production of books, magazines, software, etc.: a graphic artist/illustrator\nusing drawings and pictures rather than text: We can supply both graphic and text advertisements. a graphic novel\ngiving a very strong and clear idea of something: a graphic description/depiction The article contains graphic descriptions of the effects of poverty on a whole population.\na drawing or picture that shows information: The other graphic shows the proportion of voters in each group. See also\ngraphics"}