{"id":169463,"name":"grass","type":"noun","us_sound":"ɡræs","us_link":"../audio/g/grass.mp3","uk_sound":"ɡrɑːs","uk_link":"../audio/g/ukgranu022.mp3","content":"grass noun\n(PLANT)\nAdd to word list\nAdd to word list\nA1 [ U or C ] a low, green plant that grows naturally over a lot of the earth's surface, having groups of very thin leaves that grow close together in large numbers: a blade of grasscut the grass Support garden wildlife by cutting the grass less often. a vase of dried flowers and grasses (= different types of grass)\nJustin Goode/Moment/GettyImages\n[ U ] a surface made of grass that is sometimes used as a playing area for tennis, football, and other field sports, or for horse racing: As a playing surface, she preferred grass to AstroTurf. Europe's premier grass horse makes his debut on dirt in the race today. on grass\nin tennis, playing on a grass surface: I know she's very good on grass with a good serve and volley. It was only my second match on grass and I was happy with how it went.\n[ U ] slang →\ncannabis\nMore examplesFewer examplesThe grass glistened in the early-morning dew.Football's been played on grass from day one and that's where it should stay.He sat on the grass, strumming his guitar.A narrow band of grass separated the greenhouse from the vegetable garden.Most of her followers assumed that grass was her best surface but she won all of her titles on hard courts.Visitors are requested not to walk on the grass.We sat on the shady grass for our picnic.Alongside the existing grass racecourse, they installed an artificial racetrack called an all-weather racetrack.\nSMART Vocabulary: related words and phrases\nCommon plants\nAfrican violet\nagave\naloe\naloe vera\nalpine strawberry\ndianthus\ndichondra\ndieffenbachia\ndill weed\ndracaena\nliquorice\nloganberry\nmaidenhair fern\nmaize\nmandrake\nsnake plant\nsorrel\nsotol\nsow thistle\nSpanish moss\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSurfaces on which sports take place\nTennis & racket sports\nSpecific types of drug\ngrass noun\n(PERSON)\n[ C ] UK slang a person, usually a criminal, who tells the police about other criminals' activities See also\nsupergrass UK\nSMART Vocabulary: related words and phrases\nPeople who reveal secrets & tell tales\nbig mouth\nblabbermouth\ndobber\nfink\ninformer\nnark\nrat\nrumour-monger\nscandalmonger\nscaremonger\nsneak\nsnitch\nsource\nstool pigeon\nsupergrass\ntattletale\ntelltale\nwhistle-blower\nYou can also find related words, phrases, and synonyms in the topics:\nMiscellaneous criminals\nIdioms\nthe grass is (always) greener (on the other side)\nput someone out to grass\nAdd to word list\nAdd to word list\na low, green plant with narrow leaves growing naturally over much of the earth’s surface: [ U ] Are you going to cut the grass? [ C ] Wildflowers and grasses of the Great Plains thrive without chemicals or fertilizers. grassy adjective us\nYour browser doesn't support HTML5 audio\n/ˈɡræs·i/\na grassy hillside"}