{"id":169455,"name":"grasped","type":"verb","us_sound":"ɡræsp","us_link":"../audio/g/grasp.mp3","uk_sound":"ɡrɑːsp","uk_link":"../audio/g/ukgranu020.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\ngrasp\ngrasp verb [T]\n(TAKE)\nC1 to quickly take something in your hand(s) and hold it firmly: Rosie suddenly grasped my hand.\nThesaurus: synonyms, antonyms, and examples\nto hold someone or somethingholdCan you hold this for a moment?claspHe reached out to clasp her hand.gripThe baby gripped my finger with her tiny hand.clutchSilent and pale, she clutched her mother's hand.clingOne little girl was clinging onto a cuddly toy.hang onThe child was hanging on to her mother's skirt.\nSee more results »\nIf you grasp an opportunity, you take it eagerly: We must grasp every opportunity to strengthen economic ties with other countries.\nMore examplesFewer examplesShe suddenly grasped my arm and looked at me.I grasped the gun with both hands and took aim.The baby stretched out a tiny hand and grasped my finger tightly.Feeling herself falling, she grasped the rail with both hands.The eagle swooped down and grasped the rabbit in its sharp talons.\nSMART Vocabulary: related words and phrases\nHaving in your hands\nahold\narm\nchokehold\nclasp\nclench\ncling\ncup\ndandle\ngrasp\ngrip\nhand in hand idiom\nhandle\nhang\nhang on\nhang/hold on like grim death idiom\nnurse\nonto\npurchase\nseize\ntaken\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccepting & agreeing\ngrasp verb [T]\n(UNDERSTAND)\nC1 to understand something, especially something difficult: I think I managed to grasp the main points of the lecture. The government has acknowledged that homelessness is a problem but it has failed to grasp the scale of the problem.\nThesaurus: synonyms, antonyms, and examples\nto understand somethingunderstandI understand why he did that.comprehendHe doesn't seem to comprehend the scale of the problem.get the pictureOK. Don't say any more. I get the picture.followIt was so complicated I couldn't follow what he was saying.graspI think I grasped the main points of the lecture.digestThis chapter is so difficult to digest. I'll have to read it again later.\nSee more results »\nSMART Vocabulary: related words and phrases\nUnderstanding and comprehending\nappreciation for something\napprehend\napprehensible\napprehension\nastutely\nbear\ncatch\ncolour\nhandle\nkeep someone up\nknow a hawk from a handsaw idiom\nknow the score idiom\nknow/see where someone is coming from idiom\nlatch\ntease something apart\nto get a handle on something idiom\nto have a handle on something idiom\ntumble to something\ntune in\nunderstanding\nSee more results »\nIdiom\ngrasp the nettlePhrasal verb\ngrasp at something"}