{"id":169517,"name":"grateful","type":"adjective","us_sound":"ˈɡreɪt.fəl","us_link":"../audio/g/grateful.mp3","uk_sound":"ˈɡreɪt.fəl","uk_link":"../audio/g/ukgrate001.mp3","content":"Add to word list\nAdd to word list\nB1 showing or expressing thanks, especially to another person: grateful (to someone) for something I'm so grateful (to you) for all that you've done. If you could get that report finished by Thursday, I'd be very grateful.grateful to After the earthquake we felt grateful to be alive.grateful that I'm just grateful that I'm not still working for him.most grateful formal I would be most grateful if you would send me the book immediately. Synonym\nthankfulOpposite\nungrateful\nThesaurus: synonyms, antonyms, and examples\nshowing or expressing thanks to someonegratefulI'm grateful for your kindness.appreciativeI'm really appreciative of all the help you've given me.I/we appreciateI really appreciate all the help you've given me.glad ofWe were very glad of some extra help.indebted toI'm indebted to my parents for all their love and support.\nSee more results »\nMore examplesFewer examplesIt was a long journey and I was grateful for his company.I tried to convey in my speech how grateful we all were for his help.I'd be eternally grateful if you could arrange it.We are all profoundly grateful for your help and encouragement.The authors are grateful for the unceasing support of the editors in London and New York.\nSMART Vocabulary: related words and phrases\nRelieved and thankful\na load/weight off your mind idiom\nappreciate\nappreciative\nappreciative of something\nappreciatively\nbeholden\nbless\nbless you! idiom\ncount\nI owe you (one) idiom\nin acknowledgment of something\nindebtedness\nmind\nobliged\nrelease\nthank your lucky stars idiom\nthankful\nthankfully\nthankfulness\nthanks\nSee more results »\nRelated word\ngratefullyGrammar\nGrateful or thankful?We use grateful to talk about how we feel when someone is kind to us or does us a favour: …\nAdd to word list\nAdd to word list\nshowing or expressing thanks, esp. to another person: I’m grateful for your love and support. gratefully adverb us\nYour browser doesn't support HTML5 audio\n/ˈɡreɪt·fə·li/\nWe gratefully acknowledge the support of the Lincoln Fund."}