{"id":169735,"name":"great","type":"adjective","us_sound":"ɡreɪt","us_link":"../audio/g/grate.mp3","uk_sound":"ɡreɪt","uk_link":"../audio/g/ukgranu029.mp3","content":"great adjective\n(BIG)\nAdd to word list\nAdd to word list\nA2 large in amount, size, or degree: an enormous great hole The issue is of great importance to voters. The improvement in water standards over the last 50 years has been very great. A great many people would agree.the great majority of The great majority of (= almost all) people would agree.great pleasure formal It gives us great pleasure to announce the engagement of our daughter Maria.great sorrow formal It is with great sorrow that I inform you of the death of our director.great sympathy I have great sympathy for you.great deal of I spent a great deal of time there. Synonyms\nastronomical (LARGE) informal\nbig (LARGE)\ncolossal\nelephantine formal\nenormous\ngargantuan\ngiant\ngigantic\nginormous informal\ngoodly old-fashioned\nhefty\nhuge\nimmense\njumbo\nlarge\nmahoosive UK informal\nmammoth\nmassive\noutsize\noversize mainly US\nprodigious formal\nrespectable\nsizeable mainlyUK\nstupendous\nthumping UK informal\ntidy mainly UK\ntremendous\nvast\nvoluminous formal\nwalloping informal humorous\nwhopping informal\nThesaurus: synonyms, antonyms, and examples\ngreater than the average size or amountbigThey live in a big house in the country.largeA large number of people were crowded into the room.greatThe party was a great success.enormousThey bought an enormous house in the suburbs.\nSee more results »\n[ before noun ] used in names, especially to mean large or important: a Great Dane (= large type of dog) Catherine the Great the Great Wall of China the Great Bear (= group of stars) greater than mathematics\n&#160; specialized\nlarger in number or amount than: X must be equal to or greater than 10.\nSee more\nMore examplesFewer examplesA great number of women used to die in childbirth.For a goalkeeper, it's a great advantage to have big hands.He's a great comfort to his mother.She has finally got the job she wanted, but at great personal cost .The pay differential between workers and management is too great.\nSMART Vocabulary: related words and phrases\nBig and quite big\nappreciable\nbaronial\nbigly\nbloated\nboxcar\nbulky\nfullness\ngrandly\ngrowthy\nheaping\nhearty\nheftily\nhefty\npalatially\npumped\nrambling\nroomy\nroyal\nroyally\nthe bigger the better idiom\nSee more results »\ngreat adjective\n(FAMOUS)\nB2 approving famous, powerful, or important as one of a particular type: a great politician/leader/artist/man/woman This is one of Rembrandt's greatest paintings. Who do you think is the greatest modern novelist?\nThesaurus: synonyms, antonyms, and examples\nhaving great effect or influenceimportantIt was one of the most important legal cases of the century.bigThis is a big match tonight - if we lose, we won't be in the playoffs.majorThis is a major decision so we'd better get it right.significantDid he make any significant changes to my suggestions?\nSee more results »\nMore examplesFewer examplesThe cinematic effects in her films are clearly borrowed from the great film-makers of the past.Rome, Carthage and Athens were some of the great city-states of the ancient world.Gathered all together in this church, we commemorate those who lost their lives in the great war.As a child, he aspired to be a great writer.Despite her limitations as an actress, she was a great entertainer.\nSMART Vocabulary: related words and phrases\nVery important or urgent\nall-important\nat all costs idiom\nbe a matter of life and/or death idiom\ncardinally\nchief\nleading\nlife-altering\nlife-and-death\nlife-changing\nmainly\noverriding\nprimary\nprime\nprincipally\nprior\nprized\nseminal\ntectonic\nweightily\nweighty\nSee more results »\ngreat adjective\n(EXTREME)\nB1 extreme: great success/difficulty\nMore examplesFewer examplesWe're living in a time of great change.The numerous awards on the walls bear witness to his great success.It takes great skill to weave a basket from/out of rushes.To my great surprise, they agreed to all our demands.The George Cross is a decoration that is bestowed on British civilians for acts of great bravery.\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabsolutely\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\ngreat adjective\n(GOOD)\nA1 informal very good: a great idea We had a great time last night at the party.it is great to It's great to see you after all this time! \"I'll lend you the car if you like.\" \"Great! Thanks a lot!\" \"What's your new teacher like?\" \"Oh, he's great.\" \"How are you feeling now?\" \"Great.\"\nThesaurus: synonyms, antonyms, and examples\nextremely pleasant, enjoyable, or likableexcellentThe food was excellent, thank you.wonderfulHave a wonderful trip!terrificThat's such terrific news, congratulations!fabulousI love her dress, it's fabulous.greatThe film was great.\nSee more results »\ninformal used to mean that something is very bad: Oh great ! That's all I need - more bills!\nMore examplesFewer examplesEveryone says it's a great movie, but I think it's overrated.My new hiking boots will be great once I've broken them in.Ireland boasts beautiful beaches, great restaurants and friendly locals.I think the party was great.There's a great film on TV at midnight.\nSMART Vocabulary: related words and phrases\nExtremely good\nadmirable\namazing\namazingly\nask for someone\naward-winning\nfirst-rate\nfive-star\ngold-plated\ngourmet\ngreatness\nhave no parallel phrase\npar excellence\nsensational\nshining\nsock\nsplendid\nsplendidly\nstellar\nsuperiority\nwonderfully\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInformal words for bad\nRelated word\ngreatnessIdioms\nbe a great one for something\ngo great guns\ngreat minds think alike\nno great shakes\nB2 used to emphasize the meaning of another word: a great big spider a great long queue You great idiot! Pat's a great friend of mine.\nMore examplesFewer examplesThey left a great enormous pile of washing-up in the sink.Take your great fat hands off my private things, you!Who parked that horrible great lorry right outside my window?She had a whopping great bruise on her arm.He just stood there with a silly great grin on his face.\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabsolutely\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\na famous person in a particular area of activity: former tennis great Arthur Asheall-time great Woody Allen, one of the all-time greats of the cinema\nSMART Vocabulary: related words and phrases\nFamous people\nArchimedes\nAristotle\nbig name\nboldface\nboldfaced\nglitterati\nHippocrates\nhousehold name\nimmortal\nit girl\nJulius Caesar\nlegend\nluminary\nnotable\npantheon\npersonage\npersonality\npublic figure\nsuperstar\nVIP\nSee more results »\nIdiom\nthe great and the good\nused with a word for a family member to mean one generation away from that member: your great-grandmother (= the grandmother of one of your parents) your great-grandson (= the grandson of your child)\nThesaurus: synonyms, antonyms, and examples\na grandchildgrandchildNow I see my grandchildren every week.grandsonShe has a 10 -year-old grandson.granddaughterHis life is transformed by the arrival of his orphaned granddaughter.great-I have six grandchildren and ten great-grandchildren.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\na grandparentgrandparentMy grandparents are both in their 80s.grandmotherWe went to visit our grandmother in hospital.grandfatherHer paternal grandfather was a miner.grandmaWhen grandma comes to visit, she always brings sweets.grannyShe visited her granny in Pasadena.nanUK She was brought up by her nan.\nSee more results »\nMore examplesFewer examplesThis is your great-uncle George. He's Daddy's uncle.I have seven grandchildren, and lots of great-nephews and -nieces.Adelia was my great-aunt and a very grand old lady.He is the great-great-grandson of Sigmund Freud.We found the graves of my great-great-grandfather and his first and second wives.\nSMART Vocabulary: related words and phrases\nFamily: relations in general\nanti-family\naunt\nauntie\nbaby daddy\nbiologically\nfatherhood\nfilial\nfilially\nfirst cousin\nfraternal\nkinsman\nkinswoman\nkith and kin\nlong-lost\nloved one\nrelationally\nrelationship\nrelative\nremoved\nsecond cousin\nSee more results »\ngreat adjective [-er/-est only]\n(LARGE)\nAdd to word list\nAdd to word list\nlarge or unusually large in amount or degree: the Great Lakes He went on to great success as an actor. There was a great deal of (= a lot of) excitement in the classroom before lunch.\ngreat adjective [-er/-est only]\n(IMPORTANT)\nimportant, powerful, or famous: a great president a great athlete\ngreat adjective [-er/-est only]\n(GOOD)\ninfml very good or very effective; excellent: We had a great time. She has a great voice. This stuff is great for cleaning windows.\ngreatness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈɡreɪt·nəs/\nHer greatness as a writer is beyond question.\ngreat noun [C]\n(IMPORTANT PERSON)\na famous person in a particular area of activity: This sports facility is named after the tennis great Arthur Ashe.\ngreat- prefix\n(FAMILIES)\nused with a word for a family member, such as grandmother, to mean one generation older than that family member: great-grandmother"}