{"id":169753,"name":"greatness","type":"noun","us_sound":"ˈɡreɪt.nəs","us_link":"../audio/g/greatness.mp3","uk_sound":"ˈɡreɪt.nəs","uk_link":"../audio/g/ukgravi016.mp3","content":"greatness noun [U]\n(IMPORTANCE)\nAdd to word list\nAdd to word list\nB2 importance and fame, power, or success: Her greatness as a writer is unquestioned. They are puffed up with grand notions of their country's historical greatness.\nMore examplesFewer examplesShe has no doubts about Washington's greatness as president.The greatness of a leader is not just in his achievements but in the obstacles he has had to overcome.The station itself gave testimony to the lost commercial greatness of the area.He was weary of the baggage that attends greatness - the obnoxious fans, the endless obligations, the scrutiny of the media. He deplores the imbecility of the academic world for not sufficiently recognizing his greatness.\nSMART Vocabulary: related words and phrases\nSkill, talent and ability\nability\naccomplishment\naccuracy\nacumen\nadroitness\nendowment\nflair\nforte\nfunctional skills\nfunctioning\ngenius\npolish\nprestidigitation\nproficiency\nprowess\npyrotechnic\nspeciality\nwheelhouse\nwizardry\nworkmanship\nSee more results »\ngreatness noun [U]\n(SIZE/EXTENT)\nthe large amount, size, or degree of something: What surprised me was the greatness of the change. Do not underestimate the greatness of this calamity.\nMore examplesFewer examplesHe bemoaned the greatness of the burdens that were laid upon him.She felt the greatness of their love and forgiveness.Let us keep the mountains the way they are so that the people of the future can enjoy the wildness and the greatness of the earth.\nSMART Vocabulary: related words and phrases\nBig and quite big\nappreciable\nbaronial\nbigly\nbloated\nboxcar\nbulky\nexpansive\ngrandly\nheaping\nhearty\nheftily\nhefty\nhigher\npumped\nrambling\nroomy\nroyal\nroyally\nsizable\nthe bigger the better idiom\nSee more results »\ngreatness noun [U]\n(GOOD QUALITY)\ninformal the very good quality of something: I just can't get over the greatness of this record.\nMore examplesFewer examplesI don't usually harp on about the greatness of a dish - but the pie I made today was as good as it gets.\nSMART Vocabulary: related words and phrases\nExtremely good\nadmirable\namazing\namazingly\nask for someone\naward-winning\ndivine\nfirst-rate\nfive-star\ngold-plated\ngourmet\nhave no parallel phrase\nhigh-class\npar excellence\nshining\nsock\nsplendid\nsplendidly\nstellar\nstupendously\nwonderfully\nSee more results »\nSee\ngreat"}