{"id":169781,"name":"greedy","type":"adjective","us_sound":"ˈɡriː.di","us_link":"../audio/g/greedy.mp3","uk_sound":"ˈɡriː.di","uk_link":"../audio/g/ukgravi023.mp3","content":"greedy adjective\n(WANTING MORE)\nAdd to word list\nAdd to word list\nB2 disapproving wanting a lot more food, money, etc. than you need: greedy, selfish peoplegreedy for He's greedy for power/success. Synonyms\nacquisitive (WANTING THINGS) formal often disapproving\navaricious formal disapproving\ncovetous formal disapproving\nenvious\ngrasping disapproving\nThesaurus: synonyms, antonyms, and examples\nwanting more of something than you needgreedyI've never met anyone so greedy for power.avariciousHe acquired his wealth by being an avaricious, unscrupulous businessman.rapaciousHe's a rapacious lawyer who will stop at nothing to win a case.acquisitiveShe was ruthlessly acquisitive and often bought expensive items just to keep others from owning them. graspingShe's a selfish, grasping old woman.\nSee more results »\nMore examplesFewer examplesYou greedy pig! You're not having another chocolate biscuit!It would be greedy to have another slice of cake.He was portrayed as a greedy, grasping man.Don't be greedy!Is it just greedy to want more money?\nSMART Vocabulary: related words and phrases\nGreedy\navarice\navaricious\navariciously\nconsumerism\ngrabby\ngrasping\ngreed\ngreedily\ngreediness\nMammon\nmaterialism\nmaterialist\nmaterialistic\nmaterialistically\nrapacious\nrapaciously\nrapaciousness\nrapacity\nravenous\nsomeone's eyes are bigger than their belly/stomach idiom\nSee more results »\ngreedy adjective\n(IN COMPUTING)\ncomputing\n&#160; specialized A greedy algorithm (= a set of mathematical instructions or rules given to a computer to help calculate something) or method of solving a problem involves making the best choice at each stage without considering future stages: They tested the algorithm against the so-called greedy algorithm used as the basis for the allocation of servers by most internet host providers. A greedy strategy for the problem is the following: \"At each step of the journey, visit the nearest unvisited city.\"\nMore examplesFewer examplesIn this paper we discuss the problem of convergence for greedy algorithms.These methods of approximation belong to a family of greedy approximation methods (greedy algorithms).Compared to greedy methods, exhaustive tokenization gives all of the probable tokens of words.For a greedy method such as this one, different tokenizing directions may give different results for the same sentence.Chen (2015) employs a greedy heuristic search.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhexadecimal\nhill climbing\nhome automation\nhotspot\nimportation\nmeg\noptical\nprotocol\nsimulation\ntethering\ntexturing\nthreading\ntick box\ntimesharing\nSee more results »\nRelated words\ngreedily\ngreediness"}