{"id":170081,"name":"gridlock","type":"noun","us_sound":"ˈɡrɪd.lɑːk","us_link":"../audio/g/gridlock.mp3","uk_sound":"ˈɡrɪd.lɒk","uk_link":"../audio/g/ukgrena010.mp3","content":"Add to word list\nAdd to word list\na situation where roads in a town become so blocked by cars that it is impossible for any traffic to move: A car breaking down at rush hour could cause gridlock across half the city.\na situation in which no progress can be made: The Senator rejected arguments that his plan could produce legislative gridlock.\nMore examplesFewer examplesI believe our cities actually need more taxis to break the gridlock.If it is free of gridlock the port can develop into a valuable business infrastructure supporting economic growth.He warned that the union's action could result in gridlock throughout the public sector. Haiti's Senate broke almost four months of political gridlock on Thursday.\nSMART Vocabulary: related words and phrases\nOn the road: traffic jams\nback\nback someone up\nbacked up\nbottleneck\nbumper\ncongestion\ngridlocked\nhigh-traffic\njam\nrasta roko\nrush hour\nsnarl-up\nsock\nsock something/someone in (with sb)\ntail back\ntailback\ntraffic\ntraffic calming\ntraffic jam\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDelaying and wasting time\nto cause a road or area to be so blocked by traffic that it is impossible for any vehicles to move: The accident has gridlocked the entire freeway. The protest by truck drivers aimed to gridlock the country to force concessions on fuel prices.\nto put something or someone in a situation in which no progress can be made: The result would be to divide the country and gridlock the government.\nMore examplesFewer examplesAirport managers feared that a flood of private vehicles with few places to park could gridlock the loop road.The spontaneous celebrations included a parade of cars that gridlocked the centre of the town. Downloading so many huge files at once could gridlock the internet.They want to avoid a constitutional battle which would gridlock the Commons for years.\nSMART Vocabulary: related words and phrases\nOn the road: traffic jams\nback\nback someone up\nbacked up\nbottleneck\nbumper\ncongestion\ngridlocked\nhigh-traffic\njam\nrasta roko\nrush hour\nsnarl-up\nsock\nsock something/someone in (with sb)\ntail back\ntailback\ntraffic\ntraffic calming\ntraffic jam\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDelaying and wasting time\nAdd to word list\nAdd to word list\na situation where streets that meet and cross become so blocked by cars that it is impossible for any traffic to move"}