{"id":170219,"name":"grind","type":"verb","us_sound":"ɡraɪnd","us_link":"../audio/g/grind.mp3","uk_sound":"ɡraɪnd","uk_link":"../audio/g/ukgrena028.mp3","content":"grind verb [T]\n(MAKE SMALLER)\nAdd to word list\nAdd to word list\nto make something into small pieces or a powder by pressing between hard surfaces: to grind coffee Shall I grind a little black pepper over your salad?grind something into something They grind the grain into flour (= make flour by crushing grain) between two large stones.\nSMART Vocabulary: related words and phrases\nSqueezing and grinding\ncompact\ncompression\ncompressive\nconcertina\nconstrict\nconstriction\ngnash your teeth idiom\nmash\nmill\nnoncompressible\npinch\npound\npresser\npulp\nsnap\nsquash\nsquinch\nsquish\ntamp\nunmilled\nSee more results »\ngrind verb [T]\n(RUB)\nto rub something against a hard surface, in order to make it sharper or smoother: She has a set of chef's knives that she grinds every week.grind something down He ground down the sharp metal edges to make them smooth. The car engine was making a strange grinding noise. See also\ngrindstone grind your teeth\nto make a noise by rubbing your teeth together: She grinds her teeth in her sleep.\nSee more\nSMART Vocabulary: related words and phrases\nScratching and rubbing\nabrade\nabrasion\nbuff\nchafe\nchaff\nerode\nerosive\nregrind\nrub\nrub something down\nrubdown\nscour\nscrape\nscratch\nscratching\nscuff\nsmooth\ntickle\ntowel\nwear (something) away\nSee more results »\ngrind verb [T]\n(COMPUTER GAMES)\nslang in computer games, to repeat tasks many times in order to make your character more powerful, get more useful things, etc. : It can be hard to grind a game without getting bored. He asked me how to grind the game without spending money.\nSMART Vocabulary: related words and phrases\nMiscellaneous games & activities\nair hockey\nbeer pong\nbelly dancing\nboomerang\nbran tub\nbuildering\nChinese puzzle\njigsaw\njuggling\njump rope\nkeepy-uppy\nkorfball\nLARP\norigami\npinball\nstory mode\nsubworld\nsudoku\ntable football\ntabletop\nSee more results »\nIdioms\ngrind the faces of the poor\ngrind someone's gears\ngrind to a halt/standstillPhrasal verbs\ngrind someone down\ngrind something into something\ngrind something out\ngrind noun\n(POWDER)\n[ C ] the size of grains in a substance that has been ground, especially coffee: Use the correct grind for your coffee brewer. Cook time will vary from 5–10 minutes for instant grits to around 45 minutes for the coarser grinds.\n[ C ] an action of grinding a substance into a powder: Season with a few grinds of black pepper.\nSMART Vocabulary: related words and phrases\nWords meaning small pieces and amounts\nby a nose idiom\nclipping\ncrumb\ndab\ndash\ndollop\ngrain\nort\nparing\npeewee\npinch\npotsherd\nskinny\nspark\nswatch\ntad\nthimbleful\ntidbit\ntiddler\ntrace\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSqueezing and grinding\ngrind noun\n(WORK)\n[ S ] informal a difficult or boring activity that needs a lot of effort: Having to type up my handwritten work was a real grind.daily grind The daily grind of taking care of three children was wearing her down.\n[ C ] US disapproving, informal a boring person who studies all the time and does nothing else\n[ C usually plural ] Irish English, informal extra lessons in a subject from a private teacher: She's getting grinds. He can give you maths grinds.\nSMART Vocabulary: related words and phrases\nWork, working and the workplace\nact as something\nall work and no play (makes Jack a dull boy) idiom\nassignment\nbandh\nbe at work idiom\nhoop\nhot-desking\nhotelling\nhousekeeping\nin the line of duty idiom\ninduction\nindustry\nlabour\nmoonlight\nskivvy\nslave\nslog\nslouch\nspadework\nsweat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople who are boring and old-fashioned\nClasses & courses\ngrind verb\n(CRUSH)\nAdd to word list\nAdd to word list\n[ T ] past tense and past participle ground us/ɡrɑʊnd/ to crush a substance between hard, moving surfaces into small pieces or a powder: Every morning I go to the kitchen and grind some coffee. Add a teaspoon of freshly ground black pepper.\ngrind verb\n(RUB)\n[ T ] past tense and past participle ground us/ɡrɑʊnd/ to rub an object against a hard surface in order to make it sharper, thinner, or smoother: Laborers grind and shape steel bars into decorative fences.\n[ T ] past tense and past participle ground us/ɡrɑʊnd/ If you grind two sets of objects, you press and rub them together in a way that makes an unpleasant noise: Ursula grinds her teeth at night. Idiom\ngrind to a halt\ngrind noun [U]\n(ACTIVITY)\ndifficult or unpleasant activity that is tiring or repeated too often: Karen came to the hotel for a rest from the daily grind.\nAdd to word list\nAdd to word list\na difficult or boring activity that needs a lot of effort: He recalls the grind of working his day job and then in a bar at night.\nthe daily grind\nemployment, especially when this consists of boring activities: The recession has driven many would-be-retirees back to the daily grind.\ngrind to a halt/standstill\nto stop gradually: Business ground to a standstill during the bad weather."}