{"id":170372,"name":"gritty","type":"adjective","us_sound":"ˈɡrɪt̬.i","us_link":"../audio/g/eus72092.mp3","uk_sound":"ˈɡrɪt.i","uk_link":"../audio/g/ukgrind015.mp3","content":"gritty adjective\n(SANDY)\nAdd to word list\nAdd to word list\ncontaining grit (= very small pieces of stone) or like grit: The last spoonfuls of the mussels' cooking liquid might be a bit gritty.gritty texture I didn't like the gritty texture of the sauce.\nMore examplesFewer examplesHe sat uncomfortably on the gritty shingle.The olive oil flavour was overpowering and the rice flour was too gritty.\nSMART Vocabulary: related words and phrases\nPhysics: the state of matter\nabsorbency\nacidic\nallotropic\nallotropy\ncompressible\ncrystalline\ne-liquid\nfluidity\nimpervious\nmelted\npolyunsaturated\nrarefy\nreflective\nrustily\nrusty\nscaly\nself-healing\nsloppily\nsloppiness\nsloppy\nSee more results »\ngritty adjective\n(REAL)\nusually approving showing the unpleasant or difficult features of something as they really are: gritty realism The novel was praised for its gritty realism and emotional intensity.gritty drama This is a gritty crime drama about corruption and greed.gritty portrayal \"La Haine\" is a gritty portrayal of life on a housing estate in Paris. I thought the style of the film was a bit slick, and I wanted something more gritty.\nMore examplesFewer examplesShe wanted to document the East End of London in all its gritty reality.He writes with the gritty authenticity that comes from actual combat experience.This is the gritty part of town.\nSMART Vocabulary: related words and phrases\nTrue, real, false, and unreal\nactual\nactuality\nactually\nall that glitters is not gold idiom\nanger\nfalse flag\nfalsely\nfantastical\nfever dream\nfictional\nnon-material\nnon-realistic\nnot so much idiom\nnothing could be further from the truth idiom\nnothing could have been further from my mind/thoughts idiom\nunreal\nuntrue\nuntruly\nunverifiable\nurban myth\nSee more results »\ngritty adjective\n(BRAVE)\napproving brave and determined: gritty determination He showed the gritty determination that we've come to expect from him. She proved to be a gutsy and gritty opponent.\nSMART Vocabulary: related words and phrases\nBrave and courageous\nadventurous\nadventurously\naudacious\nballsy\nbe man enough to do something idiom\nfaint heart never won fair lady/maiden idiom\nfearless\nfearlessly\ngallant\ngallantly\nlion-hearted\nman up\nmanfully\nmuster something up\nnerves of steel idiom\nunflinchingly\nunperturbed\nvaliant\nvaliantly\nvalorously\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStrong-willed\nSee also\nnitty-gritty\nAdd to word list\nAdd to word list\ncontaining or covered with small pieces of stone or sand: gritty dust\nstrong and determined in dealing with an unpleasant situation: a gritty, no-nonsense approach"}