{"id":170395,"name":"grizzly","type":"noun","us_sound":"ˈɡrɪz.li","us_link":"../audio/g/cdo0623usgriz1704.mp3","uk_sound":"ˈɡrɪz.li","uk_link":"../audio/g/cdo0623ukgriz1700.mp3","content":"Add to word list\nAdd to word list\na large brown bear from the inland (= away from the coasts) part of western North America, which has a hump (= raised area) on its shoulders: The ban on hunting grizzlies remained in most states. Black bears are smaller than grizzlies.\nMore examplesFewer examplesDeviating from typical behaviour, these grizzlies stayed in the valley for the entire season.Grizzlies, wolves, wolverines, cougars, lynx, and other species roam freely here.Many people questioned whether there were any grizzlies left in the state.Several grizzlies in search of food at lower elevations had to be killed by wildlife officials.The research team was studying the interactions of grizzlies and black bears.\nSMART Vocabulary: related words and phrases\nWild mammals\naardvark\nanteater\narmadillo\nBactrian\nbandicoot\ngrizzly bear\nhedgehog\nhippopotamus\njavelina\njoey\npeccary\npine marten\nplatypus\npolar bear\npolecat\ntamandua\ntapir\nTasmanian devil\nTasmanian wolf\nthylacine\nSee more results »\ngrizzly adjective\n(GREY)\nused to describe a person whose hair is becoming grey or white, or the hair itself: He saw the farmer's grizzly face and asked to take his picture. His grizzly facial hair has gone. Synonyms\ngreying (HAIR)\ngrizzled\nMore examplesFewer examplesThe team has replaced a couple of fresh faces with grizzlier ones.His old, puckered face was touched with grizzly grey hair and pinched into a thousand wrinkles.\nSMART Vocabulary: related words and phrases\nHair colour\nashy\nauburn\nbalayage\nblonde\nblondes have more fun idiom\nblondie\nbronde\nbrunette\ncarroty\nchestnut\ncolouring\nflaxen\ngray\ngrey\ngreying\nmousy\nperoxide blonde\nplatinum blonde\nraven\nsandy\nSee more results »\ngrizzly adjective\n(COMPLAINING)\nUK A grizzly baby or child is crying continuously but not very loudly, or complaining all the time: If your baby is grizzly or cranky, consider what might be making them uncomfortable. She needed the money to buy medicine for a grizzly child. Related word\ngrizzle\nMore examplesFewer examplesThe baby was getting grizzly and crying.He's never been grizzly with teething before.The show was so exciting that even the most grizzly child forgot the long journey to see it.\nSMART Vocabulary: related words and phrases\nBad-tempered\nargumentative\nbad-tempered\nbe hell on wheels idiom\nbe like a bear with a sore head idiom\nbe spoiling for a fight idiom\ngrouchy\ngrumpily\ngrumpiness\ngrumpy\nhave a short fuse idiom\npettishly\npetulance\npetulancy\npetulant\npetulantly\nstroppy\nsurlily\nsurliness\ntestily\ntestiness\nSee more results »"}