{"id":170403,"name":"groan","type":"noun","us_sound":"ɡroʊn","us_link":"../audio/g/groan.mp3","uk_sound":"ɡrəʊn","uk_link":"../audio/g/ukgrind018.mp3","content":"Add to word list\nAdd to word list\nC2 a deep, long sound showing great pain or unhappiness: We could hear the groans of the wounded soldiers.\na complaining noise or phrase: groan of He looked at the piles of dirty dishes and gave a groan of dismay.\nMore examplesFewer examplesThe rescuers could hear the groans of someone trapped in the rubble.A groan went up from around the office when the electricity went off.The groans of the wounded and dying could be heard all over the battlefield.He gave a terrible groan before collapsing to the ground.We heard great groans coming from the nextdoor delivery room, followed by bloodcurdling shrieks.\nSMART Vocabulary: related words and phrases\nSounds made by humans with their mouths\ncatcall\ncaterwauling\ncheer\ncrow\ncrunch\nembouchure\nglug\ngrowl\nhiss\nlaugh, shout, scream, etc. your head off idiom\nmewl\nsquall\nululation\nunsounded\nvocalization\nwail\nwhistle\nwhoop\nwolf whistle\nyelp\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSadness and regret\nPain & painful\nComplaining\ngroan verb [I]\n(MAKE SOUND)\nC2 to make a deep, long sound showing great pain or unhappiness: He collapsed, groaning with pain. [ + speech ] \"Not again,\" he groaned (= said in a low unhappy voice).\nto complain or speak unhappily: moan and groan She's always moaning and groaning (= complaining a lot) about the weather.\nMore examplesFewer examplesHe groaned with pain before losing consciousness.He groaned at the sight of all the dirty dishes piled everywhere.When the computer crashed again, he groaned with frustration.\"I'm fed up with you moaning and groaning all the time!,\" she shouted.The crash victim groaned as they lifted her gently onto a stretcher.\nSMART Vocabulary: related words and phrases\nSounds made by humans with their mouths\ncatcall\ncaterwauling\ncheer\ncrow\ncrunch\nembouchure\nglug\ngrowl\nhiss\nlaugh, shout, scream, etc. your head off idiom\nmewl\nsquall\nululation\nunsounded\nvocalization\nwail\nwhistle\nwhoop\nwolf whistle\nyelp\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSadness and regret\nPain & painful\nComplaining\ngroan verb [I]\n(HAVE TOO MUCH)\nto carry or have a very large quantity of something: At this time of year the plum trees are groaning with fruit. His bookshelves groan under works by Turgenev, Chekhov, and Camus. Souvenir stalls groan under the weight of tacky merchandise. We were greeted by the sight of groaning buffet tables.\nto find it difficult to manage or continue because you have too much of something: After little investment in infrastructure for 25 years, the transport system is groaning. The hospitals are already groaning with urgent cases. Households are groaning under unprecedented amounts of debt. They groan under the weight of too many expectations.\nMore examplesFewer examplesThe dining table groans beneath platters of cakes, pastries, cookies and fruit.The judicial system is groaning under heavy case loads.Our groaning jails are actually making crime worse.\nSMART Vocabulary: related words and phrases\nPhysical supports and supporting\nabutment\nbearing\nbolster\nbookend\nbuoy\nburden\nbuttress\nmodillion\npile\npillar\nprop\nprop something up\nrafter\nrunner\nscaffold\nshore\nsinew\nstilt\nunderpin\nweight-bearing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExperiencing difficulties\nAdd to word list\nAdd to word list\na low, sad sound that is continued for a while and that is made by someone who is suffering from pain or unhappiness: Nick let out a groan."}