{"id":170475,"name":"groomer","type":"noun","us_sound":"ˈɡruː.mɚ","us_link":"../audio/g/cdo0123usgroo0957.mp3","uk_sound":"ˈɡruː.mər","uk_link":"../audio/g/cdo0123ukgroo1137.mp3","content":"groomer noun [C]\n(FOR ANIMALS)\nAdd to word list\nAdd to word list\na person whose job is to clean an animal, usually by brushing its fur or hair: She wants to be a dog groomer or a vet. Jose works as a horse groomer at a local stables. Compare\ngroom noun\nMore examplesFewer examplesFor short-haired cats and dogs, most groomers recommend stainless-steel combs because they slide through coats more easily.The groomer is responsible for washing and cleaning the horse, braiding the mane and oiling the coat if the horse is competing at a show.\nSMART Vocabulary: related words and phrases\nPeople who work with animals\napiarist\nbeekeeper\nbreeder\nbuckaroo\ncowboy\ncowman\ndogcatcher\ndrover\ngaucho\ngoatherd\njackaroo\njillaroo\nmahout\nostler\npoulterer\nshepherdess\nstable boy\nwhisperer\nwrangler\nSee more results »\ngroomer noun [C]\n(SKIING)\na device for making the surface of snow smoother, flatter, or harder so it is easier to ski or walk on: We hooked the groomer to a snowmobile. There may be winter work at the resort doing things like operating the groomers. See also\nsnow groomerCompare\ngrooming machine\ninformal a surface for skiing on where the snow has been prepared to make it smoother, flatter, or harder: I'm not a good enough skier to ski on anything except groomers.\nMore examplesFewer examplesThe caterpillar-tracked vehicle is a groomer, designed to flatten snow for smooth skiing.The tourists stay mainly on the groomers, leaving acres of powder free for the locals.They are quite happy to ski groomers all day.\nSMART Vocabulary: related words and phrases\nWinter sports\nairboard\nairboarder\nairboarding\nAlpine skiing\naprès-ski\ngroom\nice skating\ninbounds\nluge\nmogul\nmush\nmusher\npiste\nsled\nsnowblade\nsnowblading\nsnowboard\nsnowboarder\nsnowboarding\ntuck\nSee more results »\ngroomer noun [C]\n(CRIMINAL)\nsomeone who grooms children (= becomes friends with them with the intention of trying to persuade them to have a sexual relationship): The software identifies internet groomers. Online groomers often pretend to be a child to befriend potential victims."}