{"id":170589,"name":"ground","type":"noun","us_sound":"ɡraʊnd","us_link":"../audio/g/ground.mp3","uk_sound":"ɡraʊnd","uk_link":"../audio/g/ukgroov019.mp3","content":"ground noun\n(LAND)\nthe ground [ S ]\nAdd to word list\nAdd to word list\nB1 the surface of the earth: I sat down on the ground.\nMore examplesFewer examplesCracks had appeared in the dry ground.The plane dived towards the ground and exploded in a ball of flame.A post had been driven into the ground near the tree.The nuclear waste has been entombed in concrete many metres under the ground.At the end of the race his legs gave out and he collapsed on the ground.\nB2 [ U ] soil: soft/stony ground The ground was frozen hard and was impossible to dig.\nB1 [ C ] an area of land used for a particular purpose or activity: a football ground The lake has become a dumping ground for toxic chemicals. skills learnt on the training ground (= place where sports teams practise) grounds [ plural ]\nC2 the gardens and land that surround a building and often have a wall or fence around them: We went for a walk around the hospital grounds.\nSee more\nSMART Vocabulary: related words and phrases\nThe Earth & outer space - general words\nablate\nanti-gravity\natmosphere\natmospherically\nauroral\ncosmic\ngravity\nhorizon\nhydrosphere\nionospheric\nlithosphere\nlithospheric\nmacrocosm\nmesosphere\nmesospheric\nMother Nature\nthe Big Bang\nunconformity\nweightlessness\nzero gravity\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSoil\nGeography: areas of land in general\nground noun\n(CAUSE)\nC2 [ C usually plural ] a reason, cause, or argument: on grounds of She is suing the company on grounds of unfair dismissal.ground for UK Do you have any ground for suspecting them? [ + to infinitive ] We have grounds to believe that you have been lying to us. [ + that ] He refused to answer on the grounds that the question violated his rights to privacy.\nThesaurus: synonyms, antonyms, and examples\nthe cause of somethingreasonI frankly don’t understand the reason for the delay.causeInvestigators have not yet determined the cause of the fire. rootWe need to get to the root of her problems.motiveThere seems to have been no motive for the murder.ground(s)On what grounds was she dismissed?\nSee more results »\nMore examplesFewer examplesThere should be no discrimination on the grounds of colour.Do you have any grounds for complaint ?The accused pleaded not guilty on grounds of diminished responsibility.He refused to say anything on the grounds that he might incriminate himself.She is suing the company on grounds of unfair dismissal.\nSMART Vocabulary: related words and phrases\nMotives and reasons\nautotelic\ncauseless\ndrive\nfirst principles\nfrom a place of idiom\nhidden agenda\nimpulse\ninclination\njustification\nmainspring\nmotivation\nmotive\nname\nobject\npeg\nplace\nshould\nwherefores\nwhy\nSee more results »\nground noun\n(AREA OF KNOWLEDGE)\nC2 [ U ] an area of knowledge or experience: on familiar ground When the conversation turns to politics he's on familiar ground (= he knows a lot about this subject).common ground Once we'd found some common ground (= things we both knew about) we got along very well together.cover a lot of ground The lectures covered a lot of ground (= included information on many different subjects).go over the same ground I enjoyed her first novel, but I felt in the second she was going over the same ground (= dealing with the same area of experience).\nMore examplesFewer examplesThe debate is becoming polarized and there seems to be no middle ground.I think you're on very shaky ground with that argument.He's annoying to argue with because he keeps shifting his ground.The party has watered down its socialist ideals in order to appeal to the centre ground.We covered a lot of ground in the first few weeks of the course.\nSMART Vocabulary: related words and phrases\nTopics & areas of interest\nangle\nbackyard\nbailiwick\ncause célèbre\ncentrism\ncon\nconvention\ndemesne\nfront\nkingdom\nleitmotiv\nprovince\nscore\nspecialism\nsubject\ntalk\ntalking point\ntheme\nthemed\ntopically\nSee more results »\nground noun\n(POPULARITY)\ngain ground\nC1 If a political party or an idea or belief gains ground, it becomes more popular or accepted: The Republicans are gaining ground in the southern states.\nSee more lose ground\nC1 If a political party or an idea or belief loses ground, it becomes less popular or accepted: More conservative candidates are losing ground in key battleground states.\nSee more\nground noun\n(WIRE)\n[ C usually singular ] US (UK earth) a wire that makes a connection between a piece of electrical equipment and the ground, so the user is protected from feeling an electric shock if the equipment develops a fault\nSMART Vocabulary: related words and phrases\nElectrical switches & connections\nadapter\nclicker\ncoaxial\ncorded\ndimmer\ndimmer switch\njunction box\noutlet\noverride\npatch\npatch someone through\npause\nplug\nplug (something) in/plug (something) into something\nplug-in\npowerbank\nshaver point\nspark plug\nswitchboard\nterminal\nSee more results »\nground noun\n(COFFEE)\ngrounds [ plural ]\nthe small grains of coffee left at the bottom of a cup or other container that has had coffee in it: A lot of coffee shops give away grounds for use in compost.\nSee more\nIdioms\ndrive/work yourself into the ground\nget (something) off the ground\ngo/be run to ground\non the ground\nground verb\n(GRIND)\npast simple and past participle of\ngrind\nSMART Vocabulary: related words and phrases\nSqueezing and grinding\ncompression\ncompressive\nconcertina\nconstrict\nconstriction\ngnash your teeth idiom\nmash\nmill\nnip\nnoncompressible\npinch\npound\npresser\npulp\nsnap\nsquash\nsquinch\nsquish\ntamp\nunmilled\nSee more results »\nground verb\n(KEEP ON LAND)\nbe grounded\nIf a ship is grounded, it cannot move because it has hit solid ground: be grounded on The oil tanker was grounded on a sandbank.\nSee more\n[ T often passive ] If aircraft are grounded, they are prevented from flying or ordered not to fly: The snowstorm meant that all planes were grounded.\nSMART Vocabulary: related words and phrases\nAir travel: travelling by aircraft\naboard\naeronaut\nair bridge\nair corridor\nair rage\nair taxi\nbird strike\nbusiness class\ncoach\ncrash-land\nflying\njet\nlandfall\nmedevac\nnon-flying\npost-landing\nreclaim\nscramble\nsubsonically\nupgrade\nSee more results »\nground verb\n(PUNISH)\n[ T ] to forbid (= refuse to allow) a child or young person from going out as a punishment: My parents grounded me for a week.\nSMART Vocabulary: related words and phrases\nPunishing & punishments\nankle bracelet\nankle tag\nball and chain\nbar\nbe brought/called to account idiom\ndiscipline\nendorse\nendorsement\nexcommunication\nfixed penalty\nflay\nflay someone alive idiom\nget what's coming to you idiom\npenalty\nsentence\nskin someone alive idiom\nslam dunk\nsomeone should be shot idiom\nsort\nsort something out\nSee more results »\nground verb\n(PUT WIRE)\n[ T usually passive ] US (UK earth) to connect a piece of electrical equipment to the ground with a wire: You could get a nasty shock from that water heater if it isn't grounded properly.\nSMART Vocabulary: related words and phrases\nElectricity & electronics\nanodize\nanti-static\narc\nbitstream\nbrownout\ncapacitance\nchargeable\nelectricity\nhigh-voltage\nhoming\ninduction\ninsulating tape\nlinesman\nmagnet\nmultimeter\nnegatively\nnon-electric\nnon-electrical\nnon-electronic\nsolid-state\nSee more results »\nground verb\n(CAUSE)\nbe grounded in something formal\nto be based firmly on something: Fiction should be grounded in reality.\nSee more\nmainly US (UK usually minced) Ground food has been cut up into very small pieces, often using a special machine: ground turkey ground sirloin\nSMART Vocabulary: related words and phrases\nPreparing food\nbatch cooking\nbiga\nboil\nbutter\nbuttered\ncan't boil an egg idiom\nclarify\nglaze\nglazed\ngrate\ningredient\njerk\nre-season\nrecipe\nrehydrate\nrestuff\nrice\ntailgate\ntoss\nzap\nSee more results »\nSee also\nground beef\nground\n(CRUSH)\nAdd to word list\nAdd to word list\npast simple and past participle of grind\nground noun\n(LAND)\n[ U ] the surface of the earth or of a piece of land: We laid a blanket on the ground for our picnic.\nground noun\n(AREA OF KNOWLEDGE)\n[ U ] an area of knowledge or experience; a subject: This teacher just keeps going over the same ground again and again.\nground noun\n(CAUSE)\n[ C usually pl ] a reason, cause, or argument: [ + that clause ] He refused to answer on the grounds that he’d promised to keep it secret.\nground noun\n(WIRE)\n[ C ] a connection between a piece of electrical equipment and the earth, or a wire that makes this connection\n[ C ] A ground is also an object that holds a very large number of electrons, and can accept or supply more when there is an electric current. Idiom\nin on the ground floor\nground verb [T]\n(PUNISH)\ninfml to punish an older child by not allowing the child to go out or be involved in social activities: My parents grounded me for a week.\nground verb [T]\n(CAUSE)\nto have a reason, cause, or argument for your actions or beliefs: His beliefs are grounded in his experience.\nground verb [T]\n(LAND)\nto put or keep on the ground: All flights have been grounded because of the snowstorm.\nAdd to word list\nAdd to word list\n[ C, usually plural ] a reason for something: on (the) grounds of sth The doctor refused to surrender patient records on grounds of confidentiality.on the grounds that Researchers shut down the trial on the grounds that the vaccine was proving ineffectivegrounds for sth Only 13 of the contracts examined listed incompetence as legitimate grounds for dismissal.on health/environmental/legal grounds The college was shut on health and safety grounds. See also\nbattleground\ndumping ground\ndrive/run/work sb into the ground\nto make someone work very hard, especially so that they become ill or extremely tired: Although we worked everyone into the ground, we didn't get the job done in time. They were running themselves into the ground.\ndrive/run/work sth into the ground\nto use something so much that it breaks or stops working: They decided to run the car into the ground instead of changing it.\ngain/make ground\nto become more popular or successful: Despite making ground within her own party, she still has to watch her back.gain/make ground on sb The search engine is continuing to gain ground on the market leader.\nFINANCE to increase in value: The shares have steadily made ground.gain/make ground against sth The Euro continued to gain ground against the pound and the dollar through the course of the week.\nget off the ground\nif a project or activity gets off the ground, it starts or starts to be successful: There is a difference between a project which never gets off the ground and one which suddenly goes bad.\nget sth off the ground\nto start a project or activity or to start making it successful: A lot more money will be required to get this project off the ground.\ngive/lose ground\nto become less popular or successful: Smaller parties always lose ground in elections.give/lose ground to sb The firm is continuing to give ground to its foreign rivals.\nto prevent a ship or aircraft from sailing or flying: The bad weather meant that helicopters were grounded."}