{"id":170696,"name":"grovelling","type":"adjective","us_sound":"ˈɡrɑː.vəl.ɪŋ","us_link":"../audio/g/cdo0623usgrov1718.mp3","uk_sound":"ˈɡrɒv.əl.ɪŋ","uk_link":"../audio/g/cdo0623ukgrov1714.mp3","content":"Add to word list\nAdd to word list\nbehaving with too much respect towards someone, in order to show that you want to please them or want them to forgive you: grovelling apology Their spokesperson went on TV to make a grovelling apology. They are grovelling sycophants. Related word\ngrovel (TRY TO PLEASE)\nMore examplesFewer examplesThe company was forced to make a grovelling apology to millions of its clients after the system went down for several hours.They were forced into a grovelling apology.He responded by sending a grovelling letter of apology.The paper published a hasty and grovelling retraction.They published a series of grovelling articles about him.It was suggested that the letter might be too grovelling.\nSMART Vocabulary: related words and phrases\nPraising insincerely or too eagerly\nbackhanded compliment\nbootlicker\nbow and scrape idiom\ncrawler\ncreep\nglad-handing\ngrovel\ngrovellingly\nhagiographic\nidealization\nobsequious\nobsequiously\npeople pleaser\nplay up to someone\nschmooze\nsycophantic\nsycophantically\ntoady\ntoadying\nunctuous\nSee more results »\na way of behaving with too much respect towards someone in order to show that you want to please them or want them to forgive you: They would have to do some grovelling. He was sure that grovelling wouldn't help. Related word\ngrovel (TRY TO PLEASE)\nMore examplesFewer examplesIt was time to give in and do some grovelling. There would definitely be some serious grovelling involved.First he needed to get the grovelling out of the way.He looked embarrassed by the other man's fulsome grovelling.She would never do her grovelling and pleading in front of other people.\nSMART Vocabulary: related words and phrases\nShowing respect and admiration\nadmiration\nadmire\nadmiring\nadmiringly\napproving\napprovingly\nfreedom\nfulsome\nfulsomely\nfulsomeness\nglorify\nhallow\nhomage\npay your respects idiom\nput someone on a pedestal idiom\nregild\nrespectfully\nretire a number idiom\nrevere\nworshipful\nSee more results »"}