{"id":170716,"name":"growler","type":"noun","us_sound":"ˈɡraʊ.lɚ","us_link":"../audio/g/cdo1121usgrow1936.mp3","uk_sound":"ˈɡraʊ.lər","uk_link":"../audio/g/cdo1121ukgrow1745.mp3","content":"growler noun [C]\n(BEER CONTAINER)\nAdd to word list\nAdd to word list\nmainly US informal a jug or large bottle that can be filled with beer, especially at a brewery (= a place where beer is made). A growler usually contains 64 fluid ounces: I stop by once every week or so to get my growler refilled. Beer and root beer is brewed at the facility, and half-gallon growlers are sold there. Compare\nhowler (BEER CONTAINER)\nMore examplesFewer examplesThe brewpubs can also sell \"growlers,\" half-gallon jugs filled at the tap for the customer who wants to bring some beer home.The beer is sold both on draft by the glass and by the half-gallon growler to go.Tonight would be the perfect night for some ribs and a growler of cold local beer.\nSMART Vocabulary: related words and phrases\nContainers for liquids and gases\naerosol\namphora\nbottle\nbucket\ncanister\nchurn\nflask\nhip flask\nhot-water bottle\nhottie\nhowler\ninkwell\noxygen tank\nsiphon\nsprayer\nstoup\nThermos\ntin can\ntinnie\ntravel mug\nSee more results »\ngrowler noun [C]\n(PERSON)\nsomeone who makes a growling sound (= a low, rough sound) when they sing or speak: I love Tom Waits and this is one of my favourites from the old growler.\nMore examplesFewer examplesThe singer is from London, but his vocals aim for the smoky drawl of a bourbon growler from Tennessee. Tam White is Scotland's favourite blues growler.The player is also known as Ringhio - growler - or Pitbull.\nSMART Vocabulary: related words and phrases\nSinging\na cappella\naccompaniment\naccompany\nalto\nanthem\nbanger\nbarbershop\ncrooner\ndirge\nditty\ndiva\ndoxology\nintonation\njingle\nraise the roof idiom\nrapping\nscreamer\nseptet\nserenade\ntreble\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDescribing qualities of the human voice\ngrowler noun [C]\n(SEA ICE)\na mass of ice in the sea, especially one that has broken off a larger iceberg or glacier: He reported hitting a growler, a rogue fragment of iceberg, while doing over 12 knots.\nMore examplesFewer examplesWe had hit a small, all-but-melted iceberg - a \" growler \" - that barely broke the surface but still bashed a dent in our bows.You can learn about iceberg towing and the life cycles of growlers and bergies.\nSMART Vocabulary: related words and phrases\nPrecipitation: snow & ice\nanti-icing\navalanche\nbe snowed in idiom\nbe snowed up idiom\ndrifting\nfreezing\nglacially\nglacier\nhail\niceberg\nicicle\npermafrost\nsleet\nslushy\nsnowfall\nsnowflake generation\nsnowpack\nsnowstorm\nspindrift\nsubglacial\nSee more results »\ngrowler noun [C]\n(CARRIAGE)\nUK a four-wheeled carriage pulled by a horse: They were nicknamed growlers because of the noise made by their iron wheels.\nprill/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesI took a growler and made for the address I had been given: theatrical lodgings, in Westminster.\nSMART Vocabulary: related words and phrases\nCarriages & carts\nbrougham\nbuggy\ncarriage\ncarryall\nchaise\nchuckwagon\ncoupe\ncovered wagon\ndray\ngig\npopemobile\nrickshaw\nsedan chair\nstagecoach\nsurrey\ntrap\ntrishaw\ntuktuk\nwagon\nwain\nSee more results »"}