{"id":170705,"name":"grow","type":"verb","us_sound":"ɡroʊ","us_link":"../audio/g/grow.mp3","uk_sound":"ɡrəʊ","uk_link":"../audio/g/ukgroun013.mp3","content":"grow verb\n(INCREASE)\nAdd to word list\nAdd to word list\nA2 [ I or L or T ] to increase in size or amount, or to become more advanced or developed: Children grow so quickly. This plant grows best in the shade. She's grown three centimetres this year. Football's popularity continues to grow. The labour force is expected to grow by two percent next year. The male deer grows large, branching horns called antlers.\nThesaurus: synonyms, antonyms, and examples\nto increaseincreaseWe need to increase production to meet demand.growThe number of people living alone grows each year.risePrices rose by 10 per cent.go upHouse prices keep going up.escalateCrime in the city has escalated in recent weeks.\nSee more results »\nB1 [ I or T ] If your hair or nails grow, or if you grow them, they become longer: Lottie wants to grow her hair long. Are you growing a beard? Wow, your hair's grown!\nA2 [ I ] If a plant grows in a particular place, it exists and develops there: There were roses growing up against the wall.\nA2 [ T ] If you grow a plant, you put it in the ground and take care of it, usually in order to sell it: The villagers grow coffee and maize to sell in the market.\n[ T ] to make a business bigger by increasing sales, employing more people, etc.: We aim to grow the company by giving the customer a better deal.\nMore examplesFewer examplesFew plants grow in tundra regions.India grows tea for export.Complaints to the Banking Ombudsman grew by 50 percent last year.The thickness of the mulch will prevent weeds growing around the shrubs.Most of the produce sold in the market is grown by peasant farmers.\nSMART Vocabulary: related words and phrases\nIncreasing and intensifying\naccretion\naccumulate\naccumulative\naccumulatively\nadd fuel to the fire idiom\nblaze\ncrank\nexplosive\ngo up\ngrowing\ngrowingly\nheighten\nhot up\nmushroom\nramp something up\nratchet something up/down\nre-escalate\nre-escalation\nredouble\nstake\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking progress and advancing\nBecoming bigger\nEnlarging and inflating\nFlowers - general words\nGardening - general words\nBusiness - general words\ngrow verb\n(BECOME)\ngrow tired, old, calm, etc.\nB2 to gradually become tired, old, calm, etc.: He grew bored of the countryside.\nSee more grow to do something\nto gradually start to do something: I've grown to like her over the months.\nSee more Phrasal verbs\ngrow apart\ngrow into someone/something\ngrow into something\ngrow on someone\ngrow out of something\ngrow up\ngrow verb\n(INCREASE)\nAdd to word list\nAdd to word list\n[ I/T ] to increase in size or amount, or to allow or encourage something to increase in size or to become more advanced or developed: [ I ] The population is growing rapidly. [ I ] She’s grown a lot since we last saw her. [ T ] He began to grow a beard. [ I ] The economy is expected to grow by 2% next year.\ngrow verb\n(DEVELOP)\n[ I/T ] to provide a plant with the conditions it needs to develop, or to develop from a seed or small plant: [ I ] This plant grows best in the shade. [ T ] We’re growing some herbs on the windowsill.\ngrow verb\n(BECOME)\nto develop gradually, or to start to do something gradually: [ L ] I grew too old to be interested. [ + to infinitive ] She has grown to like him.\nPhrasal verbs\ngrow into something\ngrow on someone\ngrow out of something\ngrow up\nAdd to word list\nAdd to word list\n[ I ] to increase in size or amount, or to become more advanced or developed: The company is exploring the idea of acquisitions as a way to grow.grow by sth The labour force is expected to grow by 2% next year.grow from sth to sth The number of stores in the town has grown from 80 to over 150.grow at a rate of sth Sales have grown at a rate of 16.2% annually since 2008. to grow rapidly/steadily/significantly\n[ T ] to develop something, so that its amount, size, or level of success increases: grow a company/business The loan will be used to buy the machinery we need to grow the company.grow revenue/market share/sales The Chinese companies grew their revenue by 53% last year. This money is going to projects that will create jobs and helpgrow the economy.\n[ T ]\n&#160; PRODUCTION if you grow a particular plant or crop, you plant it and take care of it, usually in order to sell it: We grow organic fruit and vegetables.\nPhrasal verbs\ngrow into sth\ngrow out of sth"}