{"id":170714,"name":"growl","type":"verb","us_sound":"ɡraʊl","us_link":"../audio/g/growl.mp3","uk_sound":"ɡraʊl","uk_link":"../audio/g/ukgroun016.mp3","content":"Add to word list\nAdd to word list\nto make a low, rough sound, usually in anger: growl at The dog growled at her and snapped at her ankles. [ + speech ] \"Not now, I'm busy,\" he growled. Compare\ngrumble verb\nrumble verb (SOUND)\nSMART Vocabulary: related words and phrases\nAnimal (non-human) sounds\nbarky\nbray\nbuzzy\ncaterwauling\nchatter\ncheep\nchirp\nclip-clop\ncockcrow\ncoo\nhonk\nmiaow\nmoo\npurr\nroar\nsqueal\ntrumpet\ntu-whit tu-whoo\nwarble\nwhinny\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming angry and expressing anger\na long, low sound, like the threatening sound made by a dog: The dog eyed me suspiciously and gave a low growl.\nMore examplesFewer examples The routes would have airplanes flying over areas of the north East Valley that are now unfamiliar with the growl of jet engines.He's a creature of undetermined species whose foul smell and loud growls panicked picnickers for several summers. It wasn't until about 2 p.m. Sunday when downtown Tampa felt the storm in earnest, with trees swaying at odd angles and wind making an eerie growl. Cameras and crowds respond to him because he comes fully to life before an audience, his low growl blossoming into an orotund baritone.\nSMART Vocabulary: related words and phrases\nAnimal (non-human) sounds\nbarky\nbray\nbuzzy\ncaterwauling\nchatter\ncheep\nchirp\nclip-clop\ncockcrow\ncoo\nhonk\nmiaow\nmoo\npurr\nroar\nsqueal\ntrumpet\ntu-whit tu-whoo\nwarble\nwhinny\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSounds made by objects, movement or impact\nSounds made by humans with their mouths\nAdd to word list\nAdd to word list\nto make a low, rough sound, usually in anger: The dog growled at her.\nIf your stomach growls, it is making a low, continuous noise because you are hungry. growl noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ɡrɑʊl/\nI heard a growl outside our tent, and prayed that whatever was out there would go away."}