{"id":170733,"name":"growth","type":"noun","us_sound":"ɡroʊθ","us_link":"../audio/g/growth.mp3","uk_sound":"ɡrəʊθ","uk_link":"../audio/g/ukgroun017.mp3","content":"Add to word list\nAdd to word list\nB2 [ U ] The growth of a person, animal, or plant is its process of increasing in size: A balanced diet is essential for healthy growth. Plant growth is most noticeable in spring and early summer.\nB2 [ U ] an increase in the size or the importance of something: The government is trying to limit population growth. The rapid growth of opposition to the plan has surprised the mayor.growth area Electronic publishing is a growth area (= an area of activity that is increasing in size and developing quickly).\nThesaurus: synonyms, antonyms, and examples\nan increaseincreaseThere has been an sharp increase in municipal taxes this year.riseLast month saw a rise in the rate of inflation.gainWe are not seeing the gains in productivity that we expected.boostWe are hoping for a boost in sales this year.\nSee more results »\n[ C ] a lump (= a solid mass) growing on the outside or inside of a person, animal, or plant that is caused by a disease: a cancerous growth on the liver\n[ C or U ] something that has grown: Graham came back from the camping trip with a week's growth of beard on his chin.\nMore examplesFewer examplesThe report looks at economic growth in Europe and elsewhere.The company has shown exceptional growth over the past two years.Some types of antibiotic are used to promote growth in farm animals.Any growth in unemployment is self-evidently a matter of extreme seriousness.Measures should be taken to halt the speed-up in population growth.\nSMART Vocabulary: related words and phrases\nBecoming bigger\naccrete\naccrue\nanti-growth\nballoon\nbell\nbillow\nbump\nelongate\nengorged\nenlarge\nenlargement\nexpansion\npile\npile on the pounds idiom\npuff\npuff up\nput something on\nregenerate\nscalability\nstretch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSwellings & lumps\nHair\nAdd to word list\nAdd to word list\nthe process of developing or of increasing in size: [ U ] Plant growth is most noticeable in spring. [ U ] His budget is designed to promote economic growth in this country.\nA growth is also tissue growing on the outside or inside of a person, animal, or plant which is caused by a disease.\nAdd to word list\nAdd to word list\nECONOMICS an increase in the ability of an economy or business to produce goods and services: the growth of the Indian economy We have had three successive years of economic growth.growth rate/rate of growth The economy's growth rate is likely to slow.revenue/job growth The steel company reported revenue growth of 55% last year on strong demand for its products. annual/future/long-term growth rapid/strong/impressive growth slow/weak growth sustainable/unsustainable growth\nan increase in size, amount, degree, level, etc.: the growth of sth The growth of farm spending has not been halted. I have been impressed by the rapid growth of the fair trade movement.growth in sth a 19% growth in internet use The growth in the money supply was faster than expected.\nFINANCE, STOCK MARKET the increase in value of an investment over a long period: Choose a trust that invests for growth rather than for income. The investor should stay in for long-term growth. a growth company\nSee also\ncapital growth\neconomic growth\nex-growth\nexternal growth\nhigh-growth\nmarket growth\nmonetary growth"}