{"id":171067,"name":"guard","type":"noun","us_sound":"ɡɑːrd","us_link":"../audio/g/guard.mp3","uk_sound":"ɡɑːd","uk_link":"../audio/g/ukgrumb021.mp3","content":"guard noun\n(PERSON WHO PROTECTS)\nAdd to word list\nAdd to word list\nB1 [ C ] a person or group of people whose job is to protect a person, place, or thing from danger or attack, or to prevent a person such as a criminal from escaping: prison guards security guardspost a guard There are guards posted (= standing and watching) at every entrance.armed guard Armed guards are posted around the site.border guard The frontier is patrolled by border guards. be under guard\nto be kept in a place by a group of people who have weapons: The ex-president was under armed guard in the palace.\nSee more stand/keep guard (also be on guard)\nto be responsible for protecting someone or something, or for preventing someone from escaping: Two of the soldiers kept guard over the captured guns.\nSee more changing of the guard\na ceremony in which a group of soldiers replaces the soldiers who have finished their time on duty standing outside an important public building, such as a palace (= a building where a king or queen lives): The band played the national anthem during the changing of the guard.\na time when a new person or group starts to be in control of a society, organization, etc. with the result that there are a lot of changes: His resignation as Secretary of State marks the beginning of a changing of the guard in Washington.\nSee more\nMore examplesFewer examplesThey tried to buy the guard at the bank off but he told the police and the gang were arrested.The guards failed to observe who delivered the package.The border guards stopped me and asked to see my papers.There are guards on the door to keep out undesirables.Armed guards were stationed around the airport.\nSMART Vocabulary: related words and phrases\nProtection and protectors\nadopt\nadoptable\naegis\nanti-shark\nanti-skid\nchaperone\ncustodian\ncybersecurity\ndefence mechanism\nden mother\ndoorkeeper\nelder care\nmuzzle\nprecaution\npreservationist\nsafe space\nsafeguarding\nsafekeeping\nsafety net\nsecurity guard\nSee more results »\nguard noun\n(ON A TRAIN)\n[ C ] UK (US conductor) a railway official who travels on and is responsible for a train\nSMART Vocabulary: related words and phrases\nRailway workers\nconductor\nengine driver\nengineer\nmotorman\nporter\nsignalman\nstationmaster\nstoker\nguard noun\n(DEVICE)\n[ C ] a device that protects a dangerous part of something or that protects something from getting damaged: a fire guard a trigger guard The helmet has a face guard attached.\nSMART Vocabulary: related words and phrases\nMachines - parts\nair compressor\nair filter\naxle\ncogwheel\ncompressor\nconsole\ncontrol panel\ncontroller\ncowl\ninstrumentation\njet\nmechanism\npivot\nslide\nspline\nsplit pin\nstepney\nuniversal joint\nvee belt\nwheel\nSee more results »\nguard noun\n(TEAM POSITION)\n[ C ] in basketball, one of the two positions taken by players who are especially skilful and good at shooting: The 5'8\" guard became the first Japanese player in the NBA. See also\npoint guard\nshooting guard\n[ C ] in American football, a player who plays next to the centre and tries to stop players from the opposing team reaching his quarterback (= the player who directs play): left/right guard Williams started nine games at left/right guard.offensive guard He played offensive guard for the university team.\nMore examplesFewer examplesThey let the Argentine guards make entry passes from the top of the circle. He was a guard as a younger player and has impressive ball handling and shooting skills. The left guard fell on the ball for the touchdown.\nSMART Vocabulary: related words and phrases\nBasketball, netball & volleyball\nairball\nbackboard\nballer\nbeach volleyball\nbrick\ncatch and face idiom\ncharge\ncoast\ndunk\nelbow\nfoul\nfree throw\ninbounds pass\nkorfball\nlay someone up\nlay something in\nnetball\noutrebound\nscreen\nsquare\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAmerican football\nguard noun\n(BOXING)\n[ S ] in boxing and other fighting sports, a position in which you hold your arms up to protect yourself from hits from the opposing fighter: drop your guard A more skilled boxer can evade him, pound his ribs to slow him down and make him drop his guard.let your guard down In the seventh round, Moore let his guard down and was floored.\nMore examplesFewer examplesThe Italian has quick hands and, if Harrison decides to drop his guard, he may be in trouble.He managed to keep his guard up when a right and left followed.Ben took a quick step forward before Seb could raise his guard.\nSMART Vocabulary: related words and phrases\nFighting sports\naikido\nall-in wrestling\narm-wrestling\nbantamweight\nblack belt\nfeint\nfull nelson\ngrappler\ngumshield\nhalf nelson\nhammerlock\nleft-hander\npugilist\npugilistic\npunch-drunk\npunchbag\npuncher\npunching bag\nsouthpaw\nwrestler\nSee more results »\nguard noun\n(CURLING)\n[ C ] in curling (= a sport played on ice in which stones are slid towards a target), a stone that is slid into a position where it can protect the team's other stones from being hit: guard stone The GB team puts a guard stone up, but Norway bashes it away.\nMore examplesFewer examplesSweden set up a guard just in front of the house.The team without the last stone advantage will start with a centre guard. There's a single Canadian corner guard in play.\nSMART Vocabulary: related words and phrases\nWinter sports\nairboard\nairboarder\nairboarding\nAlpine skiing\naprès-ski\ngroom\nice rink\nice skater\nice skating\ninbounds\nluge\nmogul\nmush\nsled\nsnow groomer\nsnowblade\nsnowblading\nsnowboard\nsnowboarder\ntuck\nSee more results »\nIdioms\nbe on (your) guard\ncatch someone off guard\ndrop/lower your guard\nguard verb [T]\n(WATCH)\nB2 to protect someone or something from being attacked or stolen: Soldiers guard the main doors of the embassy.\nB2 to watch someone and make certain they do not escape from a place: Five prison officers guarded the prisoners.\nMore examplesFewer examplesThe village was guarded by a ragtag group of soldiers.The offices were securely guarded.Armed security officers are employed to guard the president.The police officers guarding the door let in the celebrities, but they prevented us lesser/mere mortals from going inside.He was employed to guard the singer when she was on tour.\nSMART Vocabulary: related words and phrases\nDefending and protecting\nanti-bug\nanti-mosquito\nbaby\nbandobast\nbastion\nbuffer\ncocoon\ndefensive\nfight back\nfoot patrol\nharbour\nharm\nhave (got) someone's back idiom\nhold off\npoisonous\nshelter\nsheltered\nshield\nsplashproof\nstand/keep guard phrase\nSee more results »\nguard verb [T]\n(NOT TELL)\nto keep information secret: jealously guard Journalists jealously (= carefully) guard their sources of information.\nSMART Vocabulary: related words and phrases\nSecrecy and privacy\nanonymity\nanonymization\nanonymize\nanonymous\nanonymously\ndead men tell no tales idiom\ndissimulate\ndissimulation\ndown-low\nentre nous\nprivate\nprivately\nprivileged\npseudonym\npseudonymization\nunrevealed\nunsourced\nunstated\nuntraceable\nwhitewashing\nSee more results »\nguard verb [T]\n(SPORT)\nin sports such as American football and basketball, to prevent a member of the opposing team from taking control of the ball by staying close to them all the time: Who is your most challenging player to guard? Synonyms\ncover\nmark\nMore examplesFewer examplesHe's an intimidating player and opponents rarely guard him one on one.We have a lot of guys that are able to play different positions and guard different players.Each player is not only responsible for guarding his own man, but for offering help defence.\nSMART Vocabulary: related words and phrases\nGeneral terms used in ball sports\naggregate score\nassist\nback pass\nbackspin\nballplayer\ndump\nkicker\nlay someone off\nlayoff\nlong ball\npace\npassing\npitch\nstroke\nthe long ball game idiom\nundefended\nunderhand\nunderspin\nunhittable\nuppish\nSee more results »\nPhrasal verb\nguard against something\ninformal for\nthe National Guard\nSMART Vocabulary: related words and phrases\nThe armed forces generally\nanti-military\narmy\nAWOL\nbarracks\nCAO\ncasualty assistance officer\ncasualty notification officer\ncasualty officer\ndog tag\nechelon\nmilitary\nmufti\nparamilitary\npsych ops\nquarter\nquick march! idiom\nsoldierly\ntemporary duty\nthe armed forces\nthe SBS\nSee more results »\nAdd to word list\nAdd to word list\na person or group of people whose job it is to protect a person, place, or thing from danger or attack, or to prevent a person such as a criminal from escaping: prison guards Armed guards were posted at every exit.\nIn sports, a guard is a player who supports and defends other players of his or her team. Idiom\non (your) guard\nAdd to word list\nAdd to word list\nWORKPLACE a piece of equipment that protects the user of a machine from being injured by a sharp or dangerous part on the machine: Make sure that the safety guard is in position before using the cutting machine.\na person or group of people whose job is to protect a person, place or thing, or to prevent a person, such as a criminal, from escaping: a night guard at a bank border/prison/security guards\nbe on your guard (against sth)\nto be careful to avoid being tricked or getting into a dangerous situation: Stores must always be on their guard against credit card fraud.\nto protect something from being known, found, harmed, or taken: The California-based company is aggressively guarding its secret technology.guard (sth) against sth The firewall guards the computer against viruses or other harmful programs."}