{"id":171049,"name":"guaranteeing","type":"verb","us_sound":"ˌɡer.ənˈtiː","us_link":"../audio/g/guarantee.mp3","uk_sound":"ˌɡær.ənˈtiː","uk_link":"../audio/g/ukgrumb019.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nguarantee\nguarantee verb [T]\n(PROMISE)\nIf a product is guaranteed, the company that made it promises to repair or change it if a fault develops within a particular period of time: The fridge is guaranteed for three years.\nB2 to promise that something will happen or exist: [ + two objects ] European Airlines guarantees its customers top-quality service. The label on this bread says it is guaranteed free of/from preservatives (= it contains no preservatives).\nThesaurus: synonyms, antonyms, and examples\nto promise someone somethingpromiseI promise that I'll be home before dark.guaranteeI can't guarantee that the operation will be successful.give (someone) your wordHe gave me his word that the job would be finished on time.assure\"Don't worry, your car will be ready tomorrow\", the mechanic assured him.swearI didn't know what happened, I swear.pledgeWe are asking people to pledge their support for our campaign.\nSee more results »\nIf you guarantee someone's debt, you formally promise to accept the responsibility for that debt if the person fails to pay it.\nMore examplesFewer examplesJournalists may enter the danger zone but unfortunately we cannot guarantee their safety.The electricity company guarantees connection within 24 hours.The management guaranteed that outsourcing wouldn't mean job losses.The police have reassured witnesses who may be afraid to come forward that they will be guaranteed anonymity.I can guarantee that you will enjoy the film.\nSMART Vocabulary: related words and phrases\nMaking & breaking promises & commitments\nbe on your honour idiom\nbond\nbreach\nbreach of contract\ncommitment\ncovenant\ncross my heart (and hope to die) idiom\ndeliver\nfink\ngo back on something\nHippocratic oath\npromise\nrepledge\nswear someone in\nundeliverable\nundelivered\nundertake\nundertaking\nunkept\nvow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInsurance\nguarantee verb [T]\n(MAKE CERTAIN)\nIf something guarantees something else, it makes certain that it will happen: [ + (that) ] The £50 deposit guarantees (that) people return the boats after their hour has finished.\nIf something is guaranteed to happen or have a particular result, it is certain that it will happen or have that result: [ + to infinitive ] Just looking at a picture of the sea is guaranteed to make me feel sick.\nSMART Vocabulary: related words and phrases\nCertainty\n(as) clear as day idiom\n(as) sure as eggs is eggs idiom\nand that's flat! idiom\nassure someone of something\nassured\ndecidedly\ndeffo\ndefinite\ndefinitely\ndefinitive\nirrefutably\nmake no mistake (about it) idiom\nmistake\nnail something on\nnailed on\nsolidity\nsquarely\nwatertight\nwould\nyou can bet your life idiom\nSee more results »"}