{"id":171084,"name":"guardian","type":"noun","us_sound":"ˈɡɑːr.di.ən","us_link":"../audio/g/guardian.mp3","uk_sound":"ˈɡɑː.di.ən","uk_link":"../audio/g/ukgrumb026.mp3","content":"Add to word list\nAdd to word list\na person who has the legal right and responsibility of taking care of someone who cannot take care of himself or herself, such as a child whose parents have died: The child's parents or guardians must give their consent before she has the operation.\nThesaurus: synonyms, antonyms, and examples\nyour parentsparentMy parents died when I was young.biological parentSome children are raised by grandparents or other family members, instead of their biological parents.adoptive parentWhen he was 7 months old, his mother gave him up to his adoptive parents.motherHave you met my mother?fatherMy father fully supports my life choices.mumUK My mum and dad go there every year.\nSee more results »\nformal someone who protects something: guardian of These three official bodies are the guardians of the nation's countryside. a self-appointed guardian of public morals\nSMART Vocabulary: related words and phrases\nParenting & caring for children\nadopt\nadoptable\nadopted\nadoptee\nadoption\ncared-for\ncaretaking\nchild-rearing\nchildless\nchildlessness\nlawnmower parent\nlooked-after\nmothering\nnanny\nnon-custodial\nstay-at-home\nswaddle\nunadoptable\nunadopted\nunweaned\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProtection and protectors\nAdd to word list\nAdd to word list\na person who has the legal right and responsibility of taking care of someone who is not responsible for his or her own care, such as a child whose parents have died\nA guardian is also someone who protects something: She characterized the department as the guardian of the nation’s forests.\nAdd to word list\nAdd to word list\nLAW a person who has the legal responsibility to take care of someone who cannot take care of themselves, for example a child whose parents have died: The child's parent or guardian chooses which type of Child Trust Fund to open.\nsomeone who protects something: The Bank of England's reputation as the guardian of financial stability has been tested by these events."}