{"id":171047,"name":"guarantee","type":"noun","us_sound":"ˌɡer.ənˈtiː","us_link":"../audio/g/guarantee.mp3","uk_sound":"ˌɡær.ənˈtiː","uk_link":"../audio/g/ukgrumb019.mp3","content":"Add to word list\nAdd to word list\nB2 [ C or U ] a promise that something will be done or will happen, especially a written promise by a company to repair or change a product that develops a fault within a particular period of time: The system costs £99.95 including shipping and handling and a twelve-month guarantee.come with/have a guarantee The TV comes with/has a two-year guarantee. a money-back guarantee [ + that ] The United Nations has demanded a guarantee from the army that food convoys will not be attacked. [ + (that) ] There is no guarantee (that) the discussions will lead to a deal.guarantee of A product as good as that is a guarantee of commercial success (= it is certain to be successful).under guarantee The shop said they would replace the television since it was still under guarantee. Synonyms\nassurance (PROMISE)\nbond (PROMISE)\ncommitment\noath (PROMISE)\npledge\npromise (SAY CERTAINLY)\nundertaking (PROMISE) formal\nvow\nword (PROMISE)\n[ C ] a formal agreement to take responsibility for something, such as the payment of someone else's debt\n[ C ] something valuable that you give to someone temporarily while you do what you promised to do for them, and that they will keep if you fail to do it\nMore examplesFewer examplesYour new TV comes with a two year guarantee as standard.Our cars carry a twelve-month guarantee.Can you give me a cast-iron guarantee that the work will be completed on time?I can't give you any guarantees.The washing machine broke down just after the guarantee ran out.\nSMART Vocabulary: related words and phrases\nOfficial documents\naccounts\naffidavit\naleatory\nannal\napostille\nengrossment\nfiling\nfree pass\nget-out clause\nGreen Paper\nprenuptial agreement\nproceedings\npt\nPTO\nrecertification\nrecertify\nrenewable\ntitle deed\nwarrant\nwrit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking & breaking promises & commitments\nguarantee verb [T]\n(PROMISE)\nIf a product is guaranteed, the company that made it promises to repair or change it if a fault develops within a particular period of time: be guaranteed for The fridge is guaranteed for three years.\nB2 to promise that something will happen or exist: [ + two objects ] European Airlines guarantees its customers top-quality service.guaranteed free of/from The label on this bread says it is guaranteed free of/from preservatives (= it contains no preservatives).\nThesaurus: synonyms, antonyms, and examples\nto promise someone somethingpromiseI promise that I'll be home before dark.guaranteeI can't guarantee that the operation will be successful.give (someone) your wordHe gave me his word that the job would be finished on time.assure\"Don't worry, your car will be ready tomorrow\", the mechanic assured him.swearI didn't know what happened, I swear.pledgeWe are asking people to pledge their support for our campaign.\nSee more results »\nIf you guarantee someone's debt, you formally promise to accept the responsibility for that debt if the person fails to pay it.\nMore examplesFewer examplesJournalists may enter the danger zone but unfortunately we cannot guarantee their safety.The electricity company guarantees connection within 24 hours.The management guaranteed that outsourcing wouldn't mean job losses.The police have reassured witnesses who may be afraid to come forward that they will be guaranteed anonymity.I can guarantee that you will enjoy the film.\nSMART Vocabulary: related words and phrases\nMaking & breaking promises & commitments\nbe on your honour idiom\nbond\nbreach\nbreach of contract\ncommitment\ncovenant\ncross my heart (and hope to die) idiom\ndeliver\nfink\ngo back on something\nHippocratic oath\npromise\nrepledge\nswear someone in\nundeliverable\nundelivered\nundertake\nundertaking\nunkept\nvow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInsurance\nguarantee verb [T]\n(MAKE CERTAIN)\nIf something guarantees something else, it makes certain that it will happen: [ + (that) ] The £50 deposit guarantees (that) people return the boats after their hour has finished.\nIf something is guaranteed to happen or have a particular result, it is certain that it will happen or have that result: [ + to infinitive ] Just looking at a picture of the sea is guaranteed to make me feel sick.\nSMART Vocabulary: related words and phrases\nCertainty\n(as) clear as day idiom\n(as) sure as eggs is eggs idiom\nand that's flat! idiom\nassure someone of something\nassured\ndecidedly\ndeffo\ndefinite\ndefinitely\ndefinitive\nirrefutably\nmake no mistake (about it) idiom\nmistake\nnail something on\nnailed on\nsolidity\nsquarely\nwatertight\nwould\nyou can bet your life idiom\nSee more results »\nAdd to word list\nAdd to word list\na promise that something will be done or will happen, esp. a written promise by a company to repair or change a product that develops a fault within a particular period of time: [ C ] The vacuum cleaner comes with a two-year guarantee.\nGuarantee is also the state of being certain of a particular result: [ U ] No matter how many stars you have in the show, there’s no guarantee (= it is not certain that) it will be a success.\nIf you guarantee something, you promise that a particular thing will happen or exist: [ + (that) clause ] I guarantee (you) that our team will play hard and have a shot at winning the championship.\nIf something is guaranteed to happen or have a particular result, it is certain that it will happen or have that result: [ + to infinitive ] Eating all that rich food is guaranteed to give you indigestion.\nAdd to word list\nAdd to word list\nto promise that something will happen or is true: guarantee sb sth European Airlines guarantees its customers top-quality service.guarantee that sth is sth We guarantee that our products are 100% safe.be guaranteed (to be) sth Their bread is guaranteed free of preservatives.\nto make something sure to happen or to be true: Good design does not always guarantee success.guarantee that How can we guarantee that no one can access our intranet?\nCOMMERCE if a company guarantees a product or service, it gives a written promise to return the customer's money or repair or exchange the product if there is a problem with it within a particular period: guarantee sth for sth We guarantee all our work for six months.\nBANKING to offer something valuable to someone with the agreement that they can keep it if you fail to pay a loan or do what you promise: If you guarantee the loan, you will lose the business if you default on payments.\n[ C or U ]\n&#160; COMMERCE a written promise by a company to return a customer's money or repair or change the product if there is a problem within a particular period after buying it: The system costs £99.95 including postage, packing and a 12-month guarantee. I'm afraid we can't replace the television as it's no longer under guarantee.come with/have/carry a guarantee The laptop has a two-year guarantee.a guarantee on sth There is a six-month guarantee on all our vehicle repairs. The store offers money-back guarantees on all electronics.\n[ C ] something that makes another thing sure to happen or to be true: no guarantee of sth/not a guarantee of sth Laboratory testing of a new drug is not a guarantee of safety.a guarantee that There is no guarantee that the discussions will lead to a deal.\n[ C ] a promise from someone that something will be done or will happen: a guarantee that The CEO gave employees a guarantee that he would keep the factory open at all costs.\n[ C ]\n&#160; BANKING something valuable that you offer to someone with the agreement that they can keep it if you fail to pay a loan or do what you promise: a guarantee against sth The mortgage borrower provides the house as a guarantee against the loan. See also\nbank guarantee\nbank guarantee fund\ncheque guarantee card\ncompany limited by guarantee\ncross guarantee\ndebt guarantee\nexport credit guarantee\nfinancial guarantee insurance\nperformance guarantee"}