{"id":171222,"name":"guernsey","type":"noun","us_sound":"ˈɡɜ˞ːn.zi","us_link":"../audio/g/cdo0318usguer2175.mp3","uk_sound":"ˈɡɜːn.zi","uk_link":"../audio/g/cdo0318ukguer0628.mp3","content":"Add to word list\nAdd to word list\nUK a thick, knitted sweater made of wool, of a type originally worn by fishermen: The rugged, weatherbeaten face would have looked more appropriate above a seaman's guernsey. Synonym\ngansey UK\nAustralian English a piece of clothing worn on the top half of a football player's body, especially in Australian Rules football: You can buy football guernseys online.\nMore examplesFewer examplesYour guernsey should match your shorts.I bought an AFL footy guernsey on eBay.Each guernsey has a different number on the back.Where can I buy the Gold Coast home guernsey?\nSMART Vocabulary: related words and phrases\nJumpers, shirts & tee-shirts\nbandeau\nbeach shirt\nblouse\nbodysuit\nboob tube\ndashiki\ndress shirt\ngansey\nhair shirt\nhalter\npolo shirt\npolo-necked\npullover\nresort shirt\nroll neck\ntunic\nturtleneck\nturtlenecked\ntwinset\nV-neck\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSportswear & swimwear\nFootball/soccer\nan island in the English Channel. It is the second largest of the group of islands called the Channel Islands: Mackworth was born 8 February 1848 in Guernsey.\nMore examplesFewer examples Pilots are based mainly at Guernsey or JerseyYou'll find a warm welcome on the beautiful, historic island of Guernsey.By 1482 he had been made captain and governor of Guernsey.Music was provided by the Guernsey Youth Jazz Orchestra.He paid for my brother and his wife to go and stay in Guernsey for a weekend.\nSMART Vocabulary: related words and phrases\nTowns & regions: named regions of countries\nAberdeen City\nAberdeenshire\nAffrilachian\nAK\nAL\nEnglish Canadian\nEssex\nfife\nfl.\nMissouri\nMissourian\nMN\nMonmouthshire\nMontana\nStirling\nStirlingshire\nStrathclyde\nSuffolk\nthe Fertile Crescent\nthe Sunbelt\nSee more results »"}