{"id":171233,"name":"guess","type":"verb","us_sound":"ɡes","us_link":"../audio/g/guess.mp3","uk_sound":"ɡes","uk_link":"../audio/g/ukguate006.mp3","content":"Add to word list\nAdd to word list\nA2 to give an answer to a particular question when you do not have all the facts and so cannot be certain if you are correct: I didn't know the answer, so I had to guess.guess right/wrong On the last question, she guessed right/wrong. [ + question word ] Guess when this was built. [ + (that) ] I guessed (that) she was your sister. She asked me to guess her age.guess something to be something I guessed the total amount to be about £50,000.\nThesaurus: synonyms, antonyms, and examples\nto guessguessGuess who called yesterday?estimateThey estimate that the work will take at least ten weeks.divineMum had divined my state of mind rather shrewdly.surmiseFrom the expression on his face, she surmised that something bad had happened.conjectureIt would be reasonable to conjecture that lack of exercise contributed to his obesity.speculateA spokesperson declined to speculate on the cause of the plane crash.\nSee more results »\nA2 to give the correct answer or make the correct judgment: [ + question word ] I bet you can't guess how old he is. She guessed the answer on her first try. \"You have a new job, don't you?\" \"Yes, how did you guess?\" guess what? A2 informal\nused before telling someone something interesting or surprising: Guess what? We won the game 4–0.\nSee more I guess B1 informal\nused when you believe something is true or likely but are not certain: [ + (that) ] I guess (that) things are pretty hard for you now. I guess I should start looking for a lawyer. It's been four or five weeks, I guess, since I last spoke to her. I guess most people know about their breakup by now. \"Do you like sushi?\" \"I guess? I've only had it once.\"\nused to show agreement, but not very strong agreement: That would be okay, I guess. I stand corrected, I guess.\nused to say what you are probably going to do: I guess I'd better get dressed. I'll ask the teacher in the morning I guess.\nMore examplesFewer examplesI'm never going to guess the answer if you don't give me a clue.She presents such a cheerful front that you'd never guess she's ill.From her slow, deliberate speech I guessed she must be drunk.No prizes for guessing where Daniel is.She gave the present a quick squeeze and tried to guess what was inside.\nSMART Vocabulary: related words and phrases\nGuessing, supposing and suspecting\napproximate\nas much idiom\nconjecture\nconsider\ndeem\ndraw\nfall\nhypothesize\nimagine\njump\njump to conclusions idiom\nmark someone down as something\nmisjudge\nmisjudgment\npresumptive\npresumptively\npresuppose\nsupposably\nsurmise\nsuspect\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nImagining and conceiving\nAccepting & agreeing reluctantly\nPlanning, expecting and arranging\nIdiom\nkeep someone guessingPhrasal verb\nguess at something\nB1 an attempt to give the right answer when you are not certain if you are correct: have/make a guess Go on - have/make a guess.wild guess Both teams made some wild guesses (= made without much thought), none of which were right.\nsomeone's opinion about something that is formed without any knowledge of the situation: \"I wonder why she's not here.\" \"My guess is that her car has broken down.\"\nMore examplesFewer examplesBoth teams made some wild guesses , none of which were right.I wouldn't like to hazard a guess.That was an inspired guess.This is only a rough guess.That's my best guess but I could well be wrong.\nSMART Vocabulary: related words and phrases\nGuesses and assumptions\na shot in the dark idiom\napproximation\nassumption\nconjecturally\nconjecture\ncounterfactual\nestimate\nmisestimate\nmisestimation\noverestimate\noverestimation\npreception\nproposition\npurportedly\nre-estimate\nsneaking\nspeculation\nspeculative\nspeculatively\nsuspicion\nSee more results »\nIdioms\nbe anyone's guess\nat a guess\nyour guess is as good as mine\nAdd to word list\nAdd to word list\nto give an answer to a question when you do not have all the facts and so cannot be certain if you are right: [ I ] I didn’t know the answer, so I had to guess. [ + (that) clause ] He guessed (that) she was about 50.\nTo guess can also mean to give the correct answer: [ T ] She guessed the right answer.\nTo guess also means to think or believe: [ T ] My plane leaves in an hour, so I guess I’d better be going. [ T ] \"Is he going to call you back?\" \"I guess so.\"\nan attempt to give the right answer when you are not certain if you are right: Go on, take a guess.\nSomeone’s guess is also an opinion about something, formed without any knowledge of the situation: I don’t know why she’s late, but my guess is she got off at the wrong exit. Idioms\nyour guess is as good as mine\nsomething is anyone's guess"}