{"id":171239,"name":"guessing","type":"verb","us_sound":"ɡes","us_link":"../audio/g/guess.mp3","uk_sound":"ɡes","uk_link":"../audio/g/ukguate006.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nguess\nA2 to give an answer to a particular question when you do not have all the facts and so cannot be certain if you are correct: I didn't know the answer, so I had to guess. On the last question, she guessed right/wrong. [ + question word ] Guess when this was built. [ + (that) ] I guessed (that) she was your sister. She asked me to guess her age. I guessed the total amount to be about £50,000.\nThesaurus: synonyms, antonyms, and examples\nto guessguessGuess who called yesterday?estimateThey estimate that the work will take at least ten weeks.divineMum had divined my state of mind rather shrewdly.surmiseFrom the expression on his face, she surmised that something bad had happened.conjectureIt would be reasonable to conjecture that lack of exercise contributed to his obesity.speculateA spokesperson declined to speculate on the cause of the plane crash.\nSee more results »\nA2 to give the correct answer or make the correct judgment: [ + question word ] I bet you can't guess how old he is. She guessed the answer on her first try. \"You have a new job, don't you?\" \"Yes, how did you guess?\" guess what? A2 informal\nused before telling someone something interesting or surprising: Guess what? We won the game 4–0. I guess B1 informal\nused when you believe something is true or likely but are not certain: [ + (that) ] I guess (that) things are pretty hard for you now.\nMore examplesFewer examplesI'm never going to guess the answer if you don't give me a clue.She presents such a cheerful front that you'd never guess she's ill.From her slow, deliberate speech I guessed she must be drunk.No prizes for guessing where Daniel is.She gave the present a quick squeeze and tried to guess what was inside.\nSMART Vocabulary: related words and phrases\nGuessing, supposing and suspecting\napproximate\nas much idiom\ncall\nconjecture\nconsider\ndeem\nfall\nguess\njump\njump to conclusions idiom\nmark\nmark someone down as something\nmisjudge\nmisjudgment\npluck\npresuppose\nspeculate\nsupposably\nsurmise\nthink of something\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nImagining and conceiving\nLinguistics: interjections\nIdiom\nkeep someone guessingPhrasal verb\nguess at something"}