{"id":171248,"name":"guest","type":"noun","us_sound":"ɡest","us_link":"../audio/g/guest.mp3","uk_sound":"ɡest","uk_link":"../audio/g/ukguate009.mp3","content":"Add to word list\nAdd to word list\nA2 a person who is staying with you, or a person you have invited to a social occasion, such as a party or a meal: 150 guests were invited to the wedding. We have guests staying this weekend.guest list Is he on the guest list?paying guest UK He is a paying guest (= he pays for the use of a room in someone's home).\nA2 a person who is staying in a hotel: We would like to remind all our guests to leave their keys at reception before they depart.\na person who is not a member of something such as a club or website, but is allowed to use it: Non-members may use club facilities as a guest for a small fee. Please log in using your password, or click here to continue as a guest.\nB2 a person, such as an entertainer, who has been invited to appear on a television or radio programme, or to help perform or produce something: Our special guest on the programme tonight is Robert de Niro. Madonna made a guest appearance at the concert. Simon Rattle will be the guest conductor with the London Symphony Orchestra.\nsomething such as an animal that is living in a place, especially where it is not wanted: unwanted guest Warm weather is the ideal breeding ground for bacteria — an unwanted guest at any cookout or picnic.uninvited guest Foreclosed houses around the country have been colonized by stray dogs, rats and other uninvited guests.\nMore examplesFewer examplesHe welcomes his guests at the door.Each ticket admits one member and one guest.My next guest needs no introduction .The rules require that you bring only one guest to the dinner.The hotel staff were glad to see the back of such a difficult guest.We offer our guests a wide range of outdoor/sporting activities.\nSMART Vocabulary: related words and phrases\nTravellers & visitors\nbird of passage\ncaravan\ncarpool\ndaily passenger\nday-tripper\nemmet\nexpedition\nflashpacker\ngrief tourist\nhouseguest\nitinerant\npassenger\nrover\nsightseer\nstayer\nsuper-commuter\nswagman\ntouristic\ntripper\nvoyager\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTourism & holidays\nOrganizations - position & status\nEntertainers in general\nAnimal dwellings - natural\nIdiom\nbe my guest!\nIf a person, especially an entertainer, guests on a programme or show, they are invited to appear or perform on it: guest on He guests on their latest video.\nSMART Vocabulary: related words and phrases\nBroadcasting in general\nairplay\nairtime\nairwaves\naudio described\naudio description\ncarry\ncommentary box\nheadline\nhost\ninterchannel\nlive stream\nlocation\nmistune\nproduce\nserialize\nshowrunner\nslow motion\nstation break\nsubtitled\ntune\nSee more results »\nAdd to word list\nAdd to word list\na person who is staying with you in your home, or a person whom you have invited to a social occasion, such as a party or a meal: dinner/wedding guests\nA person who is staying in a hotel is also called a guest.\nIf you are someone’s guest, that person is paying for you: Four senators and their families were flown to Martinique as guests of the oil company.\nAdd to word list\nAdd to word list\na person who has been invited to a place: The factory owners treated us as honored guests. The store opening featured several guest speakers from the local business community.\na person who is staying in a hotel: We would like to remind all our guests to leave their keys at reception before they depart. guest of honour\nthe most important person who has been invited to a place, who is shown special respect"}