{"id":171309,"name":"guide","type":"noun","us_sound":"ɡaɪd","us_link":"../audio/g/guide.mp3","uk_sound":"ɡaɪd","uk_link":"../audio/g/ukguate016.mp3","content":"guide noun [C]\n(BOOK)\nAdd to word list\nAdd to word list\nB1 a book that gives you the most important information about a particular subject: a hotel/wine guideguide to We've compiled a guide to all the fun events taking place around the French capital.\na guidebook: guide to We recommend you buy a reputable guide to Spain before travelling there.travel guide All major travel guides agree on a five-star rating system.\nMore examplesFewer examplesHe has written a fully comprehensive guide to Rome.He's written the definitive guide to Britain's Lake District.The informative asides about rural life make this wine guide rather special.The grammar guide falls between two stools - it's too difficult for a beginner but not detailed enough for an advanced student.It says in the guide that this area of the countryside offers some of the best walks in England.\nSMART Vocabulary: related words and phrases\nBooks: reference books\nalmanac\nannual\natlas\nbible\ncoursebook\ndictionary\ngazetteer\ngrammar\nhandbook\nheadword\nmanual\npeerage\nphrase book\nspeller\ntextbook\nthe Yellow Pages\nthesaurus\nwho\nwho's who idiom\nyearbook\nSee more results »\nguide noun [C]\n(HELP)\nsomething that helps you form an opinion or make a decision about something else: rough guide I never follow recipes exactly when I cook - I just use them as rough guides.\nMore examplesFewer examplesUse the picture on the front of the box as a guide to what the finished model should look like.The instructions are offered as guides and are not meant to be taken too literally.The number of houses for sale gives you a guide to the state of the property market.The tests are a rough guide to students' progress.As a rough guide, ten paces is about equal to ten yards.\nSMART Vocabulary: related words and phrases\nReasons and explanations\nalibi\nargumentation\nascribe something to something\nascription\nascriptive\ndefinition\nexplain\nexplanation\nexplication\nexposition\nextenuating\nextenuation\nflack\nkey\nreason\ntalk\nunclarified\nwarrantable\nwarrantably\nwherefores\nSee more results »\nguide noun [C]\n(PERSON)\nA2 a person whose job is showing a place or a particular route to visitors: We hired a guide to take us up into the mountains.tour guide Our tour guide recommended some good places to eat in the area.\nMore examplesFewer examplesA guide conducts tours of the cathedral every afternoon.We had to ask our guide to interpret for us.We needed a guide and he was only too happy to oblige.You will be taken round the museum by one of the guides.The guides sometimes receive gratuities from the tourists that supplement their salaries.\nSMART Vocabulary: related words and phrases\nTourism & holidays\nair bridge\nair corridor\namenity kit\naparthotel\nawayday\ncaravanning\necotourism\nescape\nhigh season\nlayover\nmini-break\npackage tour\nphrase book\npost-holiday\nput something up\nranger station\nsightsee\nstopover\ntourism\ntourist trap\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTaking someone somewhere or telling them the way\nguide noun [C]\n(INFLUENCE)\na person or thing that influences what you do or think: Let your conscience be your guide.\nSMART Vocabulary: related words and phrases\nPeople in charge of or controlling other people\nacephalous\nadministrator\nanti-management\nauthority\nbureaucrat\ncontroller\ncouncil\ncounter-power\ndean\ndeputy\nmanipulator\nmistress\nmovers and shakers\nmulti-headed\nofficer\ntsar\nvice presidency\nvice president\nvicegerency\nvicegerent\nSee more results »\nguide noun [C]\n(TV SCREEN)\n(also Guide) the screen on a television that shows you a list of all the programmes that are available and where and when they are broadcast: The guide allows you to browse scheduled programmes across time, date, and channel. Select \"Guide\" from the main menu. The remote control has a Guide button.\nSMART Vocabulary: related words and phrases\nBroadcasting: television\naerial\nautotune\nbest boy\nboob tube\nbreakfast television\nbroadcast\ngaffer\nghost image\ngoggle-box\nHD\nHDTV\nplasma screen\nreceiver\nshout-out\nsmart TV\nsquare-eyed\nsubtitler\nsweep\nthe small screen phrase\nzap\nSee more results »\nguide verb\n(HELP)\n[ T ] to show someone how to do something difficult: guide someone through something Our lawyer guided us through the more complicated questions on the form.\nMore examplesFewer examplesThe government is planning to launch a benchmarking scheme to guide consumers.Parents have the right to expect information to guide them through a growing, yet unregulated market.The instructions will guide you through the process of assembling the equipment.The glossary is useful for guiding you through some of the technical terms that are used in the book.The help file will guide you through the installation process.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensive\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nreflect\nreveal\nunwrap\nvent\nvirtue signalling\nvisualization\nSee more results »\nguide verb\n(SHOW WAY)\nB1 [ T ] to show people around a place: guide someone through something The curator guided us through the gallery, pointing out the most famous paintings in the collection.guided tour Samira gave us a guided tour of the city.\nB1 [ T ] to take someone somewhere or to show someone how to get somewhere: guide someone to something The shop assistant guided me to the shelf where the gardening books were displayed. The runway lights guide the plane in to land.\n[ T usually + adv/prep ] to take hold of part of someone's body, especially their arm, and take that person somewhere: He took my arm and guided me to the bar.\nMore examplesFewer examplesJane guided us round the colleges.My colleague here will guide you around the museum.He guided us through the woods.It's better if you have someone to guide you round the city.UK Shall I guide you round the house?\nSMART Vocabulary: related words and phrases\nTaking someone somewhere or telling them the way\naccompanied by someone/something\naccompany\naccompany someone to something\nbring\nbring someone/something along\nchaperone\nconvoy\ndirect\ndrop\nlead\nrefer to someone/something\nride\nsee someone off\nshepherd\nshow someone around (something)\nshow someone over something\nstick\nusher\nusherette\nwalk\nSee more results »\nguide verb\n(MAKE MOVE)\n[ T usually + adv/prep ] to make something move in the direction in that you want it to go: The pilot guided the plane onto the runway. She guided the child's head and arms into the T-shirt.\nSMART Vocabulary: related words and phrases\nAffecting and influencing\nacross-the-board\naffect\napplicability\nbe/fall under someone's influence/spell idiom\nbear on something\nbearing\nconflict\near\ninstrumental\ninstrumentality\ninstrumentally\ninterinfluence\ninvolve\npen\nrail\nsphere of influence\nspill\nspill over\nsportswashing\nstart (something) off\nSee more results »\nguide verb\n(INFLUENCE)\n[ T ] to influence someone's behaviour: Trust your own judgment and don't be guided by what anyone else thinks.\nThesaurus: synonyms, antonyms, and examples\nto have power to cause a change in someone or somethingaffectLow-income women were disproportionately affected by the legislation. influenceThe jury could have been influenced by all the media coverage surrounding the case.be/fall under someone's influence/spellThe young queen seemed to fall under the spell of her counsellor, believing everything he told her.be under someone's spellWe warned her about him, but all he had to do was turn on the charm and she was under his spell.guideHe is guided by the core beliefs of his religion.impactSevere storms will impact on travel across the region tonight.\nSee more results »\nSMART Vocabulary: related words and phrases\nAffecting and influencing\nacross-the-board\naffect\napplicability\nbe/fall under someone's influence/spell idiom\nbear on something\nbearing\nconflict\near\ninstrumental\ninstrumentality\ninstrumentally\ninterinfluence\ninvolve\npen\nrail\nsphere of influence\nspill\nspill over\nsportswashing\nstart (something) off\nSee more results »\n[ C ] (also Girl Guide) a girl between ten and 14 years old who is a member of the Guides organization Compare\nBoy Scout US, or old-fashionedUK\nGirl Scout US\nScout the Guides [ plural ] (US the Girl Scouts)\nan international organization for young women that encourages them to take part in different activities and to become responsible and independent: In the Guides, you can work towards various Interest Badges.\nSee more\nSMART Vocabulary: related words and phrases\nNamed organizations & societies & their members\nAFC\nAMA\nbeaver\nBeavers phrase\nBrown Owl\nCND\nFRS\nmafia\nMasonic\nmasonry\nMLB\nMLS\nNAACP\nOPEC\nOxfam\nrainbow\nranger\nthe IOC\nthe Red Crescent\nthe Red Cross\nSee more results »\nAdd to word list\nAdd to word list\na person whose job it is to show a place or a route to visitors: Our tour guide in Rome was a lovely young woman who spoke perfect English.\nA guide is also a book or piece of information that gives advice or help on how to do or understand something: a travel guide a guide to the best restaurants a tax guide\nto show a place or a route to visitors: She guided me into her living room and offered me a seat on her couch. We took a guided tour of (= A guide showed us) the historic houses in Newport.\nto give someone advice or help on how to do or understand something: If you want to learn how to use the computer, it has a program that will guide you through it (= show you how to use it).\nTo guide someone or something can also mean to control or influence that person or thing: Public policy must be guided by the best information available.\nAdd to word list\nAdd to word list\nsomething that helps you form an opinion or make a decision about something else: Examine your financial goals using the checklist on page 120 as a guide.a guide to sth GDP is not always a reliable guide to the health of an economy. As a rough guide, expect to pay up to €500 for a basic website.\na book, website, etc. that gives you the most important information about a particular subject: a useful guide for new investorsa guide to sth The website is an online consumer guide to the best electronic products.\n(also tour guide) a person whose job is showing a place or a particular route to visitors: Our guide was full of wonderful stories.\n[ T ] to help someone form an opinion or make a decision: The survey is used to guide interest rate policy. Public opinion is guided by the mass media. A love of risk and adventure has guided his career.\n[ T ] to show someone how to do something difficult: guide sb through/to/toward sth Our lawyer guided us through the more complicated questions on the form. The new system is designed to guide consumers to the cheapest and simplest loan offers. A team of advisors was hired to guide the company forward.\n[ T ] to take someone somewhere, or make something move in the direction in which you want it to go: guide sb/sth around/into/toward sth A series of signs guide visitors around the factory. Guide the motor carefully into place and secure it with the screws."}