{"id":171307,"name":"guidance","type":"noun","us_sound":"ˈɡaɪ.dəns","us_link":"../audio/g/guidance.mp3","uk_sound":"ˈɡaɪ.dəns","uk_link":"../audio/g/ukguate015.mp3","content":"Add to word list\nAdd to word list\nB2 help and advice about how to do something or about how to deal with problems connected with your work, education, or personal relationships: I've always looked to my father for guidance in these matters. careers guidance\nThesaurus: synonyms, antonyms, and examples\nadviceadviceLet me give you some advice.helpI didn't know who to turn to for help.a piece of adviceLet me give you a piece of advice.counselI will miss his wise counsel.guidanceYoung people don't always appreciate the guidance offered by their parents and teachers.counsellingUK Victims of abuse usually need expert counselling.\nSee more results »\nthe process of directing the flight of a missile or rocket: a missile guidance system\nMore examplesFewer examplesOur instructors can provide guidance on how to use the equipment.The booklet offers practical guidance on how to set up a business.Under his teacher's guidance, she has developed into an accomplished pianist.The role of the supervisor is to provide guidance to the student.She frequently sought guidance from her parents.\nSMART Vocabulary: related words and phrases\nGiving advice\nadvice column\nadvice columnist\nadvisability\nadvisable\nadvise against doing something\nagony uncle\nbrain trust\nclinic\nconsultant\nconsulting\ncounselling\nMonday-morning quarterback idiom\nPrivy Councillor\nrun over/through something\nshoe\nSpAd\nsteer\ntake someone's advice\ntalk some sense into sb idiom\nwaste\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDetonation & bombardment\nAdd to word list\nAdd to word list\nhelp and advice about how to do something or about how to deal with problems: She never got any guidance when she needed it. The school district needs another guidance counselor to work with students (= a person employed to give help and advice to students).\nAdd to word list\nAdd to word list\nhelp and advice about how to do something or to deal with problems: give/offer/provide guidance (to sb) The website offers guidance to employers on employment law.guidance on sth The first chapter gives guidance on how to make the best use of existing staff. Freelance staff have been brought in to help develop software systems under Chris's guidance.\nFINANCE written information that a company gives about its probable financial results for a particular period, before the period has ended: to provide/give/issue guidancequarterly/full-year guidance There are only a few companies that don't issue quarterly earnings guidance."}