{"id":171320,"name":"guidepost","type":"noun","us_sound":"ˈɡaɪd.poʊst","us_link":"../audio/g/cdo1121usguid1946.mp3","uk_sound":"ˈɡaɪd.pəʊst","uk_link":"../audio/g/cdo1121ukguid1751.mp3","content":"Add to word list\nAdd to word list\na pole at the side of a road, especially at a point where two or more roads meet, that gives information about places where the road goes and distances to them: My bike wobbled all over the road, but fortunately I missed all the trees and guideposts and managed not to fall off. Synonym\nsignpost\nsomething that helps to show where something is: Some flowers have pollinator guideposts that are visible to human eyes; the yellow stripe on an iris is one example.\na rule or a piece of advice or information that helps people understand something or know what to do: Consider the following points as general guideposts. To their mind, children were being raised without clear moral guideposts. Synonym\nguideline\nMore examplesFewer examplesSome timber is suitable for piles or girders used in bridge construction; other types of timber are used in making guideposts.The Great Square of Pegasus is a useful guidepost for locating nearby constellations in the sky. For people in search of new reading matter, reviews and \"recommended\" lists are popular guideposts.One of the relatively few clear and simple guideposts we have in this area of law is the widely understood rule that teachers don't get involved with religious activities on school premises.Dollar values and percentages may be used as guideposts, but are not conclusive evidence.\nSMART Vocabulary: related words and phrases\nRoads: lights, signs & markings on roads\nanti-billboard\nBelisha beacon\nbillboard\nbollard\nbus lane\ncrossing\nmilestone\nno standing phrase\nno waiting phrase\nP, p\npylon\nreflector\nsharrow\nsignpost\nstop light\nstop sign\nstoplight\nthe lights phrase\nyellow line\nzebra crossing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShowing and demonstrating\nRules & laws\nGiving advice"}