{"id":171394,"name":"guilt","type":"noun","us_sound":"ɡɪlt","us_link":"../audio/g/gilt.mp3","uk_sound":"ɡɪlt","uk_link":"../audio/g/ukgigan012.mp3","content":"guilt noun [U]\n(FEELING)\nAdd to word list\nAdd to word list\nB2 a feeling of worry or unhappiness that you have because you have done something wrong, such as causing harm to another person: He suffered such feelings of guilt over leaving his children.a pang of guilt She remembered with a pang of guilt that she hadn't called her mother.\nMore examplesFewer examplesA sense of guilt was deeply embedded in my conscience.I've been gnawed by guilt about not replying to her letter yet.I admit I felt a twinge of guilt as we left.We've both suffered agonies of guilt over what happened.He's suffering from overpowering feelings of guilt.\nSMART Vocabulary: related words and phrases\nSadness and regret\naw\nbe/weigh on your conscience idiom\nbitter\nblack dog\nbreastbeating\ncry\ndistress\nfeel bad idiom\ngloominess\nglumness\ngroan\nguilt complex\nmelancholia\nprick someone's conscience idiom\nregretful\nregretfully\nremorse\nremorseful\nrepentant\nwretchedness\nSee more results »\nguilt noun [U]\n(RESPONSIBILITY)\nB2 the fact of having done something wrong or committed a crime: admit your guilt Both suspects admitted their guilt to the police.establish guilt The prosecution's task in a case is to establish a person's guilt beyond any reasonable doubt. Compare\ninnocence\nMore examplesFewer examplesThe police have no definitive proof of her guilt.The prosecution has to establish his guilt beyond any reasonable doubt.A jury should not interpret the silence of a defendant as a sign of guilt.Newly-discovered documents cast doubt on the guilt of the two men.With so little evidence to prove her guilt, few people thought she should be hanged for murder.\nSMART Vocabulary: related words and phrases\nGuilty\nadmission of guilt\nanswerable\nblameworthy\nblood\nconvict\nconvicted\nconviction\nculpable\nguiltiness\nguilty\nguilty as charged idiom\nhave (someone's) blood on your hands idiom\nreconvict\nreconviction\nresponsible\nsuspect\nAdd to word list\nAdd to word list\nthe fact or state of having done something wrong or committed a crime: In the US, people accused of a crime are presumed to be innocent until their guilt is proven.\nGuilt is also a feeling of anxiety or unhappiness that you have done something immoral or wrong, such as causing harm to another person: She was tormented by feelings of guilt after putting her mother in a nursing home."}