{"id":171396,"name":"guilty","type":"adjective","us_sound":"ˈɡɪl.ti","us_link":"../audio/g/eus72110.mp3","uk_sound":"ˈɡɪl.ti","uk_link":"../audio/g/ukguate029.mp3","content":"guilty adjective\n(FEELING)\nAdd to word list\nAdd to word list\nB1 feeling guilt: guilty about I feel so guilty about forgetting her birthday. She must have done something wrong, because she's looking so guilty.guilty conscience You've got a guilty conscience - that's why you can't sleep.\nThesaurus: synonyms, antonyms, and examples\nashamedashamedHe was ashamed that he had been caught stealing.embarrassedI was too embarrassed to admit I was wrong.abashedShe looked at the floor, abashed.shamefacedHe stood shamefaced at the door, looking at the vase he had just knocked to the ground.sheepishShe startled, then gave him a sheepish smile as she picked up her dropped papers.\nSee more results »\nMore examplesFewer examplesDon't make me feel guilty.I feel guilty about leaving you here all on your own.I was feeling a bit guilty about having shouted at her.You have a guilty look on your face.The look of reproach on his face made her feel guilty.\nSMART Vocabulary: related words and phrases\nSadness and regret\naw\nbe/weigh on your conscience idiom\nbitter\nblack dog\nbreastbeating\ncry\ndistress\nfeel bad idiom\ngloominess\nglumness\ngroan\nguilt\nprick\nprick someone's conscience idiom\nregretful\nregretfully\nremorse\nrepentant\nwrench\nwretchedness\nSee more results »\nguilty adjective\n(RESPONSIBLE)\nB2 responsible for breaking a law: guilty of The jury has to decide whether a person is guilty or innocent of a crime.proven guilty A person accused of a crime is presumed innocent until proven guilty.plead guilty to The defendent pleaded guilty (= they formally admitted their guilt in court) to the charge of manslaughter. Compare\ninnocent adjective (NOT GUILTY)\nThesaurus: synonyms, antonyms, and examples\nbe to blame for somethingbe to blameNo one can decide who is to blame.be at faultBoth the fans and the players were at fault.be someone's faultThis is all my fault.be responsibleWe're still trying to determine who was responsible for the attacks.the blame lies withSome of the blame lies with investors.the blame rests withMuch of the blame rests with the government, which has confused people with conflicting health messages\nSee more results »\nthe guilty party\nthe person who has done something wrong or who has committed a crime: She was knocked down by a speeding driver, and the guilty party was never caught. I didn't download this music. I think one of the children must have been the guilty party. The Truth and Reconciliation Commission noted that, until the guilty parties were confronted, there could not be justice. If the guilty party cannot be identified, all of you will be punished. How dare he act as though she were the guilty party when the situation was all his own fault? Synonyms\ncriminal\ncrook (CRIMINAL) informal\nculprit\nevildoer\nfelon specialized\nmalefactor formal\noffender\noutlaw\nperpetrator\nvillain UK informal\nwrongdoer formal\nMore examplesFewer examplesThe tobacco companies may be guilty of contempt of court for refusing to produce the documents.Without corroboration from forensic tests, it will be difficult to prove that the suspect is guilty.He was found guilty of defrauding the Internal Revenue Service.If found guilty, he faces six months in jail and a heavy fine.He would be found guilty under a strict interpretation of the law.\nSMART Vocabulary: related words and phrases\nGuilty\nadmission of guilt\nanswerable\nblameworthy\nblood\nconvict\nconvicted\nconviction\nculpable\nguilt\nguiltiness\nguilty as charged idiom\nhave (someone's) blood on your hands idiom\nreconvict\nreconviction\nresponsible\nsuspect\nYou can also find related words, phrases, and synonyms in the topics:\nObeying & breaking the law\nRelated words\nguiltily\nguiltinessIdiom\nguilty as charged\nAdd to word list\nAdd to word list\nIf you feel guilty, you feel that you have done something wrong: I feel so guilty about forgetting your birthday.\nSomeone who has a guilty conscience is unhappy because of something wrong that the person feels he or she has done."}