{"id":171876,"name":"gut","type":"noun","us_sound":"ɡʌt","us_link":"../audio/g/gut.mp3","uk_sound":"ɡʌt","uk_link":"../audio/g/ukgunge028.mp3","content":"gut noun\n(BOWELS)\nAdd to word list\nAdd to word list\n[ C ] the long tube in the body of a person or animal, through which food moves during the process of digesting food: Meat stays in the gut longer than vegetable matter.\n[ C ] informal a person's stomach when it is extremely large: beer gut He's got a huge beer gut (= large stomach caused by drinking beer). guts C2 [ plural ]\nbowels: My guts hurt.\nSee more\n[ U ] a strong thread made from an animal's bowels used, especially in the past, for making musical instruments and sports rackets\nSMART Vocabulary: related words and phrases\nThe digestive system\nchyme\ncoeliac\ncolonic\ncolorectal\ndefecation\ndigestive system\nentrails\ngastrointestinal\ngullet\ninnards\nintestine\njejunum\nlacteal\nmechanical digestion\nng\noesophageal\noesophagus\nperistalsis\nsmall intestine\ntummy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe human torso\nCords, ropes, cables & string\ngut noun\n(FEELING)\ngut feeling/reaction informal\na strong belief about someone or something that cannot completely be explained and does not have to be decided by reasoning: I have a gut feeling that the relationship won't last.\nSee more sb's gut informal\na way of deciding what should be done or what is right, that is based on how someone feels rather than thinking about reasons: My head said that I should go but my gut said I should stay.\nSee more\ngut noun\n(BRAVERY)\nguts B2 [ plural ] informal\ncourage in dealing with danger or uncertainty: [ + to infinitive ] It takes a lot of guts to admit to so many people that you've made a mistake.\nSee more\nIdioms\nhave someone's guts for garters\nwork/play/fight your guts out\ngut verb [T]\n(EMPTY A BUILDING)\nto destroy the inside of a building completely, usually by fire: A fire gutted the bookshop last week.\nto remove the inside parts and contents of a building, usually so that it can be decorated in a completely new way\nSMART Vocabulary: related words and phrases\nDestroying and demolishing\nannihilate\nannihilation\napocalypse\nbash\nbash through (something)\nbe sacrificed on the altar of something idiom\ncostly\nerosionally\nerosive\nextirpate\nextirpation\nfall in\nsack\nsacking\nsacrifice\nscarred\nself-destruct\nself-devouring\nsink\nwipe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEmptying\ngut verb [T]\n(REMOVE ORGANS)\nto remove the inner organs of an animal, especially in preparation for eating it: She gutted the fish and cut off their heads.\nSMART Vocabulary: related words and phrases\nPreparing animals & fish for cooking\nbone\nboneless\nbutchery\nceviche\nchine\nclean\ndebeard\ndevein\nfleishig\nFrenching\nhang\njoint\npaillard\npluck\nrender\nskin\nskinless\nspatchcock\ntenderize\nuntrimmed\nSee more results »\ngut noun [C/U]\n(STOMACH)\nAdd to word list\nAdd to word list\nthe bowels or the stomach: [ U ] I had a feeling of sickness deep in the gut.\nYour gut is also the front part of your body near the waist: [ C usually sing ] He’d added a few extra pounds to his gut.\nThe guts of a machine are its inner, necessary parts: [ pl ] The front panel was attached to the guts of the unit by three color-coded wires.\ngut adjective [not gradable]\n(FEELING)\ncoming from or having to do with your emotions, not from thought: My gut reaction is we’d better not get involved.\ngut verb [T]\n(DESTROY)\nto destroy or remove the inside parts of a building: The warehouse was gutted – only the charred walls remained."}