{"id":165334,"name":"gymnastics","type":"noun","us_sound":"dʒɪmˈnæs.tɪks","us_link":"../audio/g/gymnastics.mp3","uk_sound":"dʒɪmˈnæs.tɪks","uk_link":"../audio/g/ukgutsy020.mp3","content":"Add to word list\nAdd to word list\nB1 physical exercises and activities performed inside, often using equipment such as bars and ropes, intended to increase the body's strength and the ability to move and bend easily: I do gymnastics after school on Fridays. She won several medals in the gymnastics. the US women's gymnastics team See also\nartistic gymnastics\nrhythmic gymnasticsRelated word\ngymnastic\nsometimes disapproving the ability to think, speak, sing, etc. quickly and cleverly, especially while changing what you are thinking, saying, or singing many times: verbal gymnastics His verbal gymnastics while trying to avoid answering the question were astonishing.vocal gymnastics We all admired the singer's vocal gymnastics.mental gymnastics I'd like to handle my own financial affairs without having to do mental gymnastics.\nMore examplesFewer examplesBlanca hopes to earn a college scholarship through gymnastics.I was so impressed with the men's gymnastics at the Olympics.The school gymnastics team won its second national title.Politicians resort to verbal gymnastics rather than take direct responsibility for anything. Navigating the loopholes in the law required some linguistic gymnastics.He had to employ some ethical gymnastics to defend his friend's behaviour.\nSMART Vocabulary: related words and phrases\nGymnastics\naerialist\nartistic gymnastics\nasymmetric bars\nbackflip\nfree running\ngym\ngymnast\ngymnastic\npommel horse\nsplit\nspotter\nstand on your hands/head idiom\nstick\nstick the/your landing idiom\nthe parallel bars\ntrampoline\ntrampolining\ntrampolinist\ntrapeze\ntwist\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIntelligence\nSly & devious\nAdd to word list\nAdd to word list\nphysical exercises that increase the body’s strength, balance, and ability to move gracefully, often using special equipment, or the competitive sport of performing such exercises"}