{"id":409407,"name":"zero","type":"number","us_sound":"ˈzɪr.oʊ","us_link":"../audio/z/zero.mp3","uk_sound":"ˈzɪə.rəʊ","uk_link":"../audio/z/ukzealo010.mp3","content":"Add to word list\nAdd to word list\nA2 [ C or U ] (the number) 0; nothing: Five, four, three, two, one, zero. The number one million is written with a one and six zeros. Heavy rain has reduced visibility almost to zero (= its lowest point).\nB1 [ U ] on a set of numbers for comparing temperature in degrees Celsius, the level of temperature at which water freezes: The temperature is expected to drop to ten degrees below zero tonight.\nMore examplesFewer examplesTemperatures rarely rise above zero in winter.Plus 8 is eight more than zero.The temperature has fallen below zero.The temperature could fall below zero overnight.I missed out a zero when dialling her number.\nSMART Vocabulary: related words and phrases\nNumbers: cardinal, including nought & zero\nB, b\nbi\ncipher\ndeca-\nduodecillion\nfifteen\nfive\nforty\ngoogol\njillion\nkazillion\nnaught\nnineteen\nsix\nsixty\nten\nthirteen\nthirty\nunit\nzillion\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCold\nMeasurements of temperature\nIdiom\nzero to hero\nnothing or 0 in number: zero growth/inflation\nno or none; used to emphasize that something does not exist: There's still zero evidence that she was directly involved in the decision. The plot twist is stupid and obvious and makes zero sense. He said that his chances of getting the job were zero.\nMore examplesFewer examplesWe strive for zero accidents. Every accident is a terrible tragedy.To me and many Americans he has zero credibility.We got zero applause between songs, and the sketches went over so poorly we abandoned one in the middle.He had zero experience of running a big organization.\nSMART Vocabulary: related words and phrases\nNumbers: cardinal, including nought & zero\nB, b\nbi\ncipher\ndeca-\nduodecillion\nfifteen\nfive\nforty\ngoogol\njillion\nkazillion\nnaught\nnineteen\nsix\nsixty\nten\nthirteen\nthirty\nunit\nzillion\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSomething, anything, nothing, and everything\nzero number\n(NUMBER)\nAdd to word list\nAdd to word list\n0\nzero noun [U]\n(NOTHING)\nnothing; not anything: Visibility in the fog was just about zero.\nzero adjective [not gradable]\n(NOT ANY)\nnot any or no: The economy showed zero growth in the first quarter of this year.\nAdd to word list\nAdd to word list\n[ C or U ] the number 0: They agreed to cut tariffs on 4,000 categories of goods to between zero and 5% by 2013.\n[ U ] nothing at all, or the lowest possible amount: The intent of sustainable business development is to drive outputs of hazardous waste to zero.zero cost/growth The economic reform packages stirred the economy from zero growth.\n[ U ]\n&#160; MEASURES on a set of numbers for comparing temperature in degrees Celsius, the level of temperature at which water freezes: The temperature dropped to ten degrees below zero.\ninformal →\nzero coupon bond"}