{"id":409990,"name":"zone","type":"noun","us_sound":"zoʊn","us_link":"../audio/z/zone.mp3","uk_sound":"zəʊn","uk_link":"../audio/z/ukzit__009.mp3","content":"Add to word list\nAdd to word list\nB1 an area, especially one that is different from the areas around it because it has different characteristics or is used for different purposes: an earthquake zone a nuclear-free zone He was charged with driving at 75 mph in a 55 mph zone. This stretch of coast has been designated a danger zone. The UN Security Council has established a no-fly zone (= one where aircraft are not permitted to fly).\ngeography, environment\n&#160; specialized one of the five parts the earth is divided into according to temperature, marked by imaginary lines going around it from east to west: temperate zones\nMore examplesFewer examplesA demilitarized zone has been created on the border between the warring countries.The incident graphically illustrates just how dangerous the situation in the war zone has become.Journalists may enter the danger zone but unfortunately we cannot guarantee their safety.The city has declared itself a nuclear-free zone.The commander-in-chief was given 36 hours to secure a withdrawal of his troops from the combat zone.\nSMART Vocabulary: related words and phrases\nSpace - general words\nbay\nbox\nchamber\nelbow room\nexpanse\nfloor\nfootprint\nheadroom\nnon-spatial\nroom\nspace\nspacial\nspacing\nspacious\nspatialize\nspatially\nstanding room\nsubzone\nvoid\nway\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWeather & climate - general words\nIdiom\nin the zone\nto give a special purpose to a particular area, such as an area in a town: The former dockyard has been zoned for industrial use.\nSMART Vocabulary: related words and phrases\nCivil engineering in general\nbrownfield\nbuilt environment\ncaisson\ncivil engineer\ncivil engineering\ngeotechnical\ninfrastructure\nlineman\nlinesman\nplanning\nplanning permission\npurpose-built\nquantity surveyor\nreclamation\nribbon development\nstructural engineer\nsubsea\ntown planner\ntown planning\nurbanize\nSee more results »\nPhrasal verb\nzone out\nAdd to word list\nAdd to word list\nan area, esp. one that has different characteristics from the ones around it or is used for different purposes: a construction/work/flood/combat/war zone He was charged with driving 75 mph in a 55 mph zone.\nto set rules for the use of land or for the types of structures that can be built on it: The land is now zoned for single-family homes on two-acre plots. This area was originally zoned commercial.\nAdd to word list\nAdd to word list\nan area, especially one that is different from the areas around it, because it has different characteristics or is used for different purposes: a danger/safety zone a construction/no-parking/nuclear-free zone\none of the areas into which a larger area is divided for a particular purpose: Most bus fares in the borough are to rise by 43%, while tube users in zone 1 will see an increase of 25%. The car was going faster than 60 mph in a 40-mph zone.a charging/fare zone New technology makes it much cheaper to determine whether a vehicle is in a charging zone.\nan area of a city that is used for a particular purpose or activity: a commercial/industrial/residential zone Trucks are permitted within a 20-25 mile commercial zone where they drop off their trailers.\nLAW a geographical region or group of countries that share a particular system, law, etc.: customs-free/passport-free zones Next to the airport is a special economic zone, an enclave of relative economic freedom designed to attract investors. External exchange rates matter less in a single currency zone of such size. See also\ndevelopment zone\nduty-free zone\nenterprise zone\nthe eurozone\nforeign trade zone\nfree trade zone\nspecial economic zone\ntime zone\nto give a special purpose to a particular area, such as an area in a town: be zoned for sth The acreage includes land zoned for commercial usage.\nto divide an area of land into different smaller areas: They will have to zone a sufficient amount of land to meet housing needs."}