{"id":299609,"name":"raced","type":"verb","us_sound":"reɪs","us_link":"../audio/r/race.mp3","uk_sound":"reɪs","uk_link":"../audio/r/ukrabbi008.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nrace\nrace verb\n(COMPETITION)\nB1 [ I or T ] to (cause to) compete in a race: He has been racing for over ten years. I used to race (against) him when we were boys. He's racing three of his dogs on Saturday.\nMore examplesFewer examplesLast time she raced against the Brazilian, she won by a whisker.He collects vintage cars, which he races occasionally.They raced against each other to settle the bet.He was racing against several more experienced runners.For religious reasons, she will not race on Sundays.\nSMART Vocabulary: related words and phrases\nCompeting in sport\nbring\nbring someone on\nbye\nbye week\ncatchup\nclash\nduel\nexplosive\nfield\nflying start\ngo the distance idiom\nmatch\noutduel\npark the bus idiom\npartner\npartner up\nplay big idiom\nplay sb on idiom\nsquare\nweigh\nSee more results »\nrace verb\n(HURRY)\nC1 [ I or T, usually + adv/prep ] to move or go fast: He raced down the street. The ambulance raced (= quickly took) the injured to a nearby hospital. The summer seems to have raced by (= passed very quickly). He raced the car engine (= made it work faster than it needed to) as he sat impatiently at the traffic lights.\nThesaurus: synonyms, antonyms, and examples\nto move fastspeedHe ran back to his car and sped off.raceShe raced over and hugged me.flyShe flew across the room just in time to stop the baby falling off the chair.beltUK Traffic was belting along the motorway.tearA fire truck came tearing down the road.streakBullets streaked across the sky.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto runrunShe saw him running down the street.sprintI had to sprint to catch the bus.jog\"What do you do to keep fit?\" \"I jog and go swimming.\"raceHe raced up the stairs to answer the phone.rushEveryone rushed to the door when the alarm went off.dashHe dashed out the door after the dog.\nSee more results »\nSMART Vocabulary: related words and phrases\nMoving quickly\nagility\nbeetle\nbob up\nbowl down/along something\nbuzz\ncareen\nfly\ngallop\ngun\noutsail\npelt\nscamper\nscoot\nscrabble\nscramble\nscud\nshoot\nstampede\nton\ntrot\nSee more results »\nIdiom\nsomeone's heart/mind/pulse races"}