{"id":299603,"name":"race","type":"noun","us_sound":"reɪs","us_link":"../audio/r/race.mp3","uk_sound":"reɪs","uk_link":"../audio/r/ukrabbi008.mp3","content":"race noun\n(COMPETITION)\nAdd to word list\nAdd to word list\nA2 [ C ] a competition in which all the competitors try to be the fastest and to finish first: Do you know who won/lost the race? Let's have a swimming race. They're taking part in a race to the top of Mont Blanc.\nC1 [ C ] an attempt to be the first to do or to get something: Kieran and Andrew are in a race for promotion. [ + to infinitive ] Three newspapers are involved in a race to publish the story. Another candidate has now entered the presidential race (= the attempt to be elected as president). Finishing this project by December is going to be a race against time/the clock (= an attempt to finish fast within a time limit). races [ plural ]\na series of horse races in a particular place on one day: a day at the races He often has a day at the races.\nSee more\nMore examplesFewer examplesI was just congratulating Ceri on winning her race.If an athlete makes a false start, the race must be restarted.Several jockeys were arrested on suspicion of fixing the race.It was a real race against time to get all the costumes sewn for the play.He found three 400 metre races in two days hard going.\nSMART Vocabulary: related words and phrases\nCompetitions, & parts of competitions\nbathing beauty\nbe a game of two halves idiom\nbeauty contest\nbeauty pageant\nbenefit match\ncompetition\ndebate\nelimination tournament\nhead-to-head\nnon-major\nomnium\non your marks, get set, go! idiom\npeloton\npostgame\npre-meeting\npro-am\nquiz\nspelling bee\nstarter\nunder starter's orders idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCompeting and contending (non-sporting)\nrace noun\n(PEOPLE)\nC1 [ C ] one of the main groups to which people are often considered to belong, based on physical characteristics that they are perceived to share such as skin colour, eye shape, etc.: People of many different races were living side by side.\n[ U ] the idea that people can be divided into different groups based on physical characteristics that they are perceived to share such as skin colour, eye shape, etc., or the dividing of people in this way: Discrimination on grounds of race will not be tolerated. What they don't realize is that these issues transcend (= rise above) race. Anyone can be affected.\n[ C, + sing/pl verb ] dated a group of people who share the same language, history, characteristics, etc.: The British are an island race.\nMore examplesFewer examplesShe teaches the students to have respect for different races and appreciate the diversity of other cultures.People should not be stigmatized on the basis of race.Today, many Americans are still grappling with the issue of race.Discrimination on the basis of race, gender, age or disability is not allowed.\nIdiom\nplay the race card\nrace verb\n(COMPETITION)\nB1 [ I or T ] to (cause to) compete in a race: He has been racing for over ten years. I used to race (against) him when we were boys. He's racing three of his dogs on Saturday.\nMore examplesFewer examplesLast time she raced against the Brazilian, she won by a whisker.He collects vintage cars, which he races occasionally.They raced against each other to settle the bet.He was racing against several more experienced runners.For religious reasons, she will not race on Sundays.\nSMART Vocabulary: related words and phrases\nCompeting in sport\nbring\nbring someone on\nbye\nbye week\ncatchup\nclash\nduel\nexplosive\nfield\nflying start\ngo the distance idiom\nmatch\noutduel\npark the bus idiom\npartner\npartner up\nplay big idiom\nplay sb on idiom\nrun\nweigh\nSee more results »\nrace verb\n(HURRY)\nC1 [ I or T, usually + adv/prep ] to move or go fast: He raced down the street. The ambulance raced (= quickly took) the injured to a nearby hospital. The summer seems to have raced by (= passed very quickly). He raced the car engine (= made it work faster than it needed to) as he sat impatiently at the traffic lights.\nThesaurus: synonyms, antonyms, and examples\nto move fastspeedHe ran back to his car and sped off.raceShe raced over and hugged me.flyShe flew across the room just in time to stop the baby falling off the chair.beltUK Traffic was belting along the motorway.tearA fire truck came tearing down the road.streakBullets streaked across the sky.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto runrunShe saw him running down the street.sprintI had to sprint to catch the bus.jog\"What do you do to keep fit?\" \"I jog and go swimming.\"raceHe raced up the stairs to answer the phone.rushEveryone rushed to the door when the alarm went off.dashHe dashed out the door after the dog.\nSee more results »\nSMART Vocabulary: related words and phrases\nMoving quickly\nagility\nbeetle\nbelt\nbob up\nbowl down/along something\ncareen\ngallop\ngun\nleg\noutrush\noutsail\npelt\nrush\nscamper\nscoot\nscorch\nscrabble\nscuttle\nshoot\ntrot\nSee more results »\nIdiom\nsomeone's heart/mind/pulse races\nrace noun\n(COMPETITION)\nAdd to word list\nAdd to word list\n[ C ] a competition between people or animals to see who can get from the starting place to the finish before all the others: a horse race She won the 100-meter race in 11.06 seconds.\n[ C ] fig. A race is also an urgent effort: [ + to infinitive ] It was a race against time to get the project finished by Friday’s deadline.\n[ C ]\n&#160; politics &amp; government A race is also a competition to be elected to a political position: The governor of California plans to enter the presidential race.\nrace noun\n(PEOPLE)\n[ C/U ] any social group into which humans can be divided according to perceived similarities in their physical characteristics: [ U ] Discrimination because of race is against the law.\nrace verb [I/T]\n(COMPETE)\nto compete in a race or run a race with someone: [ I/T ] He’s been racing (cars) for over ten years.\nfig. To race is also to move fast or to happen quickly: [ I always + adv/prep ] The boys came racing across the playground. [ I always + adv/prep ] Last summer seemed to race by."}