{"id":299901,"name":"radio","type":"noun","us_sound":"ˈreɪ.di.oʊ","us_link":"../audio/r/radio.mp3","uk_sound":"ˈreɪ.di.əʊ","uk_link":"../audio/r/ukradia012.mp3","content":"Add to word list\nAdd to word list\nA1 [ C ] a piece of electronic equipment used for listening to radio broadcasts: a car radio I switched on the radio.\nPortugal2004/iStock/Getty Images Plus/GettyImages\nA1 [ S or U ] the programmes that you hear when you listen to the radio: I heard a good programme on the radio last night. I don't listen to radio much.\nB1 [ U ] the system or work of broadcasting sound programmes for the public to listen to: a local radio station She's got some kind of job in radio.\n[ C or U ] a piece of electronic equipment that can send and receive spoken messages or signals, or the messages or signals that are sent or received: We sent a message over the radio/by radio. The children got radio-controlled toy cars for Christmas.\nMore examplesFewer examplesShe set her clock by the time signal on the radio.We've had complaints that you've been playing your radio too loud.You turn this dial to find a different radio station.I heard a really interesting programme on the radio this morning.I rigged up a temporary radio aerial from a coat hanger.\nSMART Vocabulary: related words and phrases\nBroadcasting: radio\nam\nantenna\nanti-jamming\nanti-radar\nautotune\nbeacon\nCB\nLW\nmedium wave\nmulti-wavelength\nmultichannel\nMW\nreceiver\nreception\nshort wave\nshout-out\ntranny\ntransponder\ntuner\ntwo-way\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBroadcasting in general\nto send a message to someone by radio: We'll have to radio for more supplies. They radioed their base for help.\nSMART Vocabulary: related words and phrases\nBroadcasting: radio\nam\nantenna\nanti-jamming\nanti-radar\nautotune\nbeacon\nCB\nLW\nmedium wave\nmulti-wavelength\nmultichannel\nMW\nreceiver\nreception\nshort wave\nshout-out\ntranny\ntransponder\ntuner\ntwo-way\nSee more results »\nAdd to word list\nAdd to word list\na device for receiving, and sometimes broadcasting, sound messages, or the receiving or sending of sound messages: [ C ] I listen to the radio in the morning to get the weather report.\nRadio is also the work of broadcasting sound programs for the public to listen to.\nphysics Radio waves are the energy waves of a certain length that are used in radio broadcasts.\nto send a message to someone by radio: [ I/T ] They radioed (their base) for help."}