{"id":300183,"name":"rafter","type":"noun","us_sound":"ˈræf.tɚ","us_link":"../audio/r/rafter.mp3","uk_sound":"ˈrɑːf.tər","uk_link":"../audio/r/ukraffl003.mp3","content":"rafter noun [C]\n(IN ROOF)\nAdd to word list\nAdd to word list\nany of the large, sloping pieces of wood that support a roof: Each rafter spans half the width of the building. We had installed insulation between the rafters.\nkryzanek/iStock/Getty Images Plus/GettyImages the rafters\n[ plural ] the structure consisting of sloping pieces of wood that support a roof, or the space that is formed by these pieces of wood: The rescue was hampered by a stubborn fire in the rafters of the building that burned through the night. Many owls are living in trees or in the rafters of new buildings under construction, which offer a cool, shady daytime roost.\nMore examplesFewer examplesThe room was so small that she had to hang her Christmas tree from a rafter.As he ended his speech, a blizzard of confetti and balloons cascaded from the rafters.\nSMART Vocabulary: related words and phrases\nParts of buildings: roofs & parts of roofs\narcaded\nchimney pot\nchimney stack\ncupola\ndamp-proof\ndome\nfascia\nmansard roof\nonion dome\npediment\npinnacle\nre-roof\nreshingle\nrib\nrooftop\nslate\nsoffit\nsun deck\nthatched\nthatcher\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysical supports and supporting\nrafter noun [C]\n(ON BOAT)\na person travelling on a raft (= a flat floating structure or a small rubber or plastic boat filled with air), or taking part in the sport of rafting or whitewater rafting: The rafters said that bad weather and the rough sea accounted for the long trip. Rescuers believe all of the whitewater rafters trapped in the rapids of the Illinois river in Oregon have been accounted for.\nMore examplesFewer examplesSeveral rafters were rescued by a cruise ship off the coast of Florida.Read these top safety tips for novice whitewater rafters.\nSMART Vocabulary: related words and phrases\nSailing & boating\nage of sail\naweigh\nbargee\nbargeman\nbear away\nmaritime\nnavigable\nocean-going\noutsail\npassage\nportage\nrafting\nre-rig\nsail\nsailing\nsea legs\nseafaring\nseamanship\nshipboard\nunder sail idiom\nSee more results »\nIdiom\nto the rafters\nAdd to word list\nAdd to word list\nany of the large, specially shaped pieces of wood that support a roof"}