{"id":300299,"name":"raid","type":"noun","us_sound":"reɪd","us_link":"../audio/r/raid.mp3","uk_sound":"reɪd","uk_link":"../audio/r/ukraffl016.mp3","content":"Add to word list\nAdd to word list\nC2 a short sudden attack, usually by a small group of people: The commandos made/staged/carried out a daring raid (on the enemy). planes on a bombing raid\nthe act of entering a place by force in order to steal from it: Millions of dollars were stolen in a bank raid last night.\nC2 an occasion when the police enter a place suddenly in order to find someone or something: The drugs were found during a police raid on the house.\nMore examplesFewer examples23 people were arrested and large quantities of heroin were seized in a dawn raid .Two schools were hit during the air raid.The bank robbers wore masks throughout the raid.Hundreds of civilians were massacred in the raid.In the raid, police found several boxes of obscene videotapes.\nSMART Vocabulary: related words and phrases\nAttacking & invading\naggressor\nambush\nbeleaguer\nbeleaguered\nbesiege\nblitz\nblitzkrieg\ncyberbullying\ncyberwarfare\nfalse flag\nforay\ngoing-over\nhard power\nhit and run\nkamikaze\npost-conquest\npre-emption\nprivateer\nreconquer\nreconquest\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArriving, entering and invading\nStealing\nDetection & solving crimes\nC2 to attack a place suddenly: The nomads raided the enemy camp and captured over 100 camels.\nto enter a place illegally and usually violently, and steal from it: The post office was raided late at night.\nC2 (of the police) to enter a place suddenly in order to find someone or something: Police officers from the organized crime division have raided businesses in central London.\ninformal to take something from a place, usually secretly: I caught Toby raiding the fridge.\nSMART Vocabulary: related words and phrases\nAttacking & invading\naggressor\nambush\nbeleaguer\nbeleaguered\nbesiege\nblitz\nblitzkrieg\ncyberbullying\ncyberwarfare\nfalse flag\nforay\ngoing-over\nhard power\nhit and run\nkamikaze\npost-conquest\npre-emption\nprivateer\nreconquer\nreconquest\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArriving, entering and invading\nStealing\nDetection & solving crimes\nTaking things away from someone or somewhere\nAdd to word list\nAdd to word list\na planned attack by a military group that is done suddenly and unexpectedly and is intended to destroy or damage something: an air raid a bombing raid\nA raid is also a planned but sudden and unexpected entering of a place by the police in order to search for something or stop an illegal activity.\nto enter a place suddenly and unexpectedly in order to search for something or stop an illegal activity: The FBI said it had no plans to raid the suspect’s farm.\nTo raid is also to unfairly or secretly take something for your own use or benefit: The movie company was accused of raiding talent from other studios.\nAdd to word list\nAdd to word list\nan attempt to take control of a company by buying a lot of its shares: He helped build one of Britain's biggest conglomerates during the 1980s with a series of daring corporate raids. a raid on sth So far, it has not decided what it will do to stop a raid on its shares. See also\nbear raid\ndawn raid"}