{"id":300341,"name":"railroad","type":"noun","us_sound":"ˈreɪl.roʊd","us_link":"../audio/r/railroad.mp3","uk_sound":"ˈreɪl.rəʊd","uk_link":"../audio/r/ukraffl022.mp3","content":"Add to word list\nAdd to word list\nthe metal tracks on which trains run: We live close to the railroad line. She travelled across Siberia on the Trans-Siberian railroad.\ntbradford/iStock/Getty Images Plus/GettyImages\nA2 the system of tracks, stations, trains, etc.: a railroad station/timetable/siding Thomas Grant worked on the railroad(s) for 50 years.\nMore examplesFewer examplesWe see that freight railroads make good profits while rendering excellent service.The railroads have lost a lot of business to trucking companies.The bridge carries the railroad across the river.The book discusses the decline of the railroads in the United States.It was the worst railroad disaster in Indian history.\nSMART Vocabulary: related words and phrases\nRailways & railway lines\nAmtrak\nartery\nbranch line\nbuffer\nelectrify\nfunicular\njunction\nlevel crossing\nlight rail\nlight railway\nmetro\nmonorail\nrailroad tie\nRR\nsiding\nsignal\nsignal box\nswitch\nswitchback\ntrack\nSee more results »\nto force something to happen or force someone to do something, especially quickly or unfairly: We were railroaded into signing the agreement.\nSMART Vocabulary: related words and phrases\nCausing somebody to act\narm-twisting\nbludgeon\nbounce someone into something\nbulldoze\nbully\ncoercion\nforcible\nforcibly\nhold someone to ransom idiom\nimpel\nimpose\nput/tighten the screws on someone idiom\nram something down someone's throat idiom\nram something into someone\nransom\nreduce\nreduce someone to something\nslap\nsqueeze\nwring\nSee more results »\n(of a room or building) long and narrow: In her railroad apartment, one room follows the next. We extended the old railroad kitchen and now have a large, open-plan kitchen-diner.\nSMART Vocabulary: related words and phrases\nNarrow and thin\nattenuate\nattenuated\nattenuation\nelongate\nnarrow\nnarrowness\ntapering\nthin\nthinly\nultra-thin\nwafer-thin\nwasp waist\nYou can also find related words, phrases, and synonyms in the topics:\nArchitecture\nrailroad noun [C]\n(TRANSPORTATION)\nAdd to word list\nAdd to word list\na system of transportation using special vehicles whose wheels turn on metal bars fixed to the ground, or a particular company using such a system: railroad tracks a railroad station the Pennsylvania Railroad\nrailroad verb [T always + adv/prep]\n(FORCE)\nto force something to happen or force someone to do something, esp. quickly and unfairly: We feel that our client was railroaded into pleading guilty.\nAdd to word list\nAdd to word list\n[ C or U ] a system of tracks that trains travel along: A potential client turned down the site because it isn't near a railroad.a railroad car/track/bridge, etc. Downtown is bordered at one end by railroad tracks, the other end by a bayou. a railroad depot/station\n[ C ] the companies, work, and people involved in transporting people and goods by train: We understand the railroads need to make a profit. After dropping out of school, he worked on the railroad.\nto force somebody to do or accept something without allowing them to refuse: railroad sb into doing sth We felt we were being railroaded into accepting a deal.railroad sb into sth We could be railroaded into a merger. Unfortunately, this scheme is being railroaded through Westminster under the pretext of immigration control."}