{"id":300365,"name":"rain","type":"noun","us_sound":"reɪn","us_link":"../audio/r/rain.mp3","uk_sound":"reɪn","uk_link":"../audio/r/ukraffl025.mp3","content":"Add to word list\nAdd to word list\nA1 drops of water from clouds: Rain is forecast for tomorrow. Come inside out of the rain. We had heavy/light rain all day. We got caught in pouring/torrential (= a lot of) rain without either raincoats or umbrellas. There will be showers of rain/rain showers (= short periods of rain) in the east. It looks like rain (= as if rain is going to fall).\nJason Webber Photography/Moment/GettyImages the rains [ plural ]\nthe season of the year in tropical countries when there is a lot of rain: Villagers are now waiting for the rains to come so that the rice will grow.\nSee more\nMore examplesFewer examplesDo you think those are rain clouds on the horizon?All I could hear was the drip of the rain from the roof.At last the rain began to ease off.All areas of the country will have some rain tonight.The water level in the lake is much higher after heavy rain.\nSMART Vocabulary: related words and phrases\nPrecipitation: rain\nbucket\nbucket down\ncloud seeder\ncloud seeding\ncloudburst\ndeluge\ndownpour\ndrizzle\nheaven\nmizzle\npelt\npiss\nrain gauge\nrainbow\nseed\nshower\nsun shower\ntorrentially\nwash\nwash (something) out\nSee more results »\nIdiom\ncome rain or shine\nA1 If it rains, water falls from the sky in small drops: I think it's starting to rain. It's raining hard/heavily (= a large amount of rain is falling).\nMore examplesFewer examplesThere's a slight coolness in the air - do you think it's going to rain?This little stream can become a deluge when it rains heavily.It's rained all day today.It had been raining hard most of the afternoon.You'll have to stay in at playtime today, because it's raining.\nSMART Vocabulary: related words and phrases\nPrecipitation: rain\nbucket\nbucket down\ncloud seeder\ncloud seeding\ncloudburst\ndeluge\ndownpour\ndrizzle\nheaven\nmizzle\npelt\npiss\nrain gauge\nrainbow\nseed\nshower\nsun shower\ntorrentially\nwash\nwash (something) out\nSee more results »\nIdioms\nit never rains but it pours\nit's raining cats and dogs!\nrain on someone's paradePhrasal verbs\nrain (something) down\nrain something off\nAdd to word list\nAdd to word list\ndrops of water that fall from clouds: It looks like rain (= as if rain is going to fall). rainy adjective us\nYour browser doesn't support HTML5 audio\n/ˈreɪ·ni/\na rainy afternoon Idiom\na rainy day\nRain can also mean to fall in a large amount: Debris from the explosion rained down. Idiom\nrain cats and dogs"}