{"id":300399,"name":"rainmaker","type":"noun","us_sound":"ˈreɪn.meɪ.kɚ","us_link":"../audio/r/cdo1119usrain1002.mp3","uk_sound":"ˈreɪn.meɪ.kər","uk_link":"../audio/r/cdo1119ukrain0909.mp3","content":"rainmaker noun [C]\n(CAUSING RAIN)\nAdd to word list\nAdd to word list\nsomething or someone that causes rain to fall: This is our first winter storm system of the season, and it's developing into a good rainmaker.\na person who is believed to have a magical power to bring and control rain: Don Antonio is a shaman and rainmaker.\nMore examplesFewer examplesWith water increasingly scarce in its parched and heavily populated northeastern plain, China has become the world's leading rainmaker, using aircraft, rockets and even antiaircraft guns to seed the clouds for precious moisture.Some recent evidence affirms that the city is an important rainmaker for its neighbours. The heat stored and emitted by all those buildings, streets and sidewalks evidently adds a charge to thunderstorms and summer showers.The story was about a Nigerian rainmaker who was trying to prevent rain spoiling a burial ceremony.\nSMART Vocabulary: related words and phrases\nPrecipitation: rain\nbucket\nbucket down\ncloud seeder\ncloud seeding\ncloudburst\ndownpour\ndrizzle\nheaven\nmizzle\npelt\npiss\npuddle\nrain gauge\nrainstorm\nseed\nshower\ntorrentially\nwash\nwash (something) out\nwet\nSee more results »\nrainmaker noun [C]\n(MAKING MONEY)\na person who is able to bring large amounts of money into a company, for example by attracting rich clients (= customers for a service): He is a senior partner and top rainmaker at a famous Manhattan law firm. The university hired high-salaried, experienced professors who were considered research-money rainmakers.\nMore examplesFewer examplesHe was paid as much as $1 million as a \"rainmaker\" for the law firm. For the last decade he has been one of Wall Street's most successful lawyers as a senior partner and top rainmaker at Fried, Frank, Harris, Shriver Jacobson.Their rival firm had a handful of rainmakers able to woo elite clients from Europe and Asia.He is described as a major fund-raiser - among the top 10 percent of party rainmakers. Is there still such a thing as a rainmaker who by his very name and association can get you business?\nSMART Vocabulary: related words and phrases\nSuccessful (things or people)\na head of steam idiom\nachiever\nalive\nalpha male\narrive\nascendant\nballer\nhave something in your pocket idiom\nhave the world at your feet idiom\nhealthily\nheavy hitter idiom\nhigh-flyer\npocket\nrail\nrepresent\nsuccessful\nsuccessfully\nsuperachiever\nsuperhit\nsuperseller\nSee more results »\nAdd to word list\nAdd to word list\nsomeone who makes a lot of money for a company or who helps someone or something to succeed: The firm needed a rainmaker to bring in business and to raise capital. For the Democrats, he became a valued rainmaker, contributing nearly $1 million."}