{"id":300428,"name":"raise","type":"verb","us_sound":"reɪz","us_link":"../audio/r/raise.mp3","uk_sound":"reɪz","uk_link":"../audio/r/ukrains003.mp3","content":"raise verb [T]\n(LIFT)\nAdd to word list\nAdd to word list\nB1 to lift something to a higher position: Would all those in favour please raise their hands? He raised the window and leaned out. Mary Quant was the first fashion designer to raise hemlines.\nThesaurus: synonyms, antonyms, and examples\nto move from a lower position to a higher positionliftI can't lift my arm past this point without pain.raiseRaise your hand if you have a question, please.elevatePut pressure on the wound and keep the injured limb elevated.pick upIf the baby cries, pick him up and cuddle him.scoop upShe scooped up the crying toddler and carried him off to his cot.\nSee more results »\nMore examplesFewer examplesThe conductor raised his baton.She raised her gun, took aim and fired.Anyone wishing to dissent from the motion should now raise their hand.The contraction of this muscle raises the lower arm.The lever is used to raise the barrier.\nSMART Vocabulary: related words and phrases\nRaising and lowering\ndepress\nelevate\nelevated\nhike\nhike something up\nhoick\nhoist\njack\njack something up\nlift\nprise\nprize\npry\nput something up\nre-erect\nride\nride up\nrun\nwinch\nyo-yo\nSee more results »\nraise verb [T]\n(INCREASE)\nB1 to cause something to increase or become bigger, better, higher, etc.: The government plan to raise taxes. I had to raise my voice (= speak more loudly) to make myself heard over the noise. The inspector said that standards at the school had to be raised. Our little chat has raised my spirits (= made me feel happier).\nMore examplesFewer examplesThe increase in interest rates will raise the cost of living.The government's decision to raise taxes has caused a great furore.Banks have raised their lending rates by 2%.The campaign has certainly succeeded in raising public awareness of the issue.You'll have to raise your voice if you want to be heard in here.\nSMART Vocabulary: related words and phrases\nIncreasing and intensifying\naccretion\naccumulate\naccumulative\naccumulatively\nadd fuel to the fire idiom\nblaze\ncrank\nexplosive\ngo up\ngrowing\ngrowingly\nheighten\nhot up\nmushroom\nramp something up\nratchet something up/down\nre-escalate\nre-escalation\nredouble\nstake\nSee more results »\nraise verb [T]\n(EXIST)\nB2 to cause to exist: Her answers raised doubts/fears/suspicions in my mind. This discussion has raised many important issues/problems. The announcement raised a cheer/laugh. I want to raise (= talk about) two problems/questions with you. I want to start my own business if I can raise (= obtain) the money/cash/capital/funds.formal The chapel was raised (= built) as a memorial to her son.\nMore examplesFewer examplesThis latest scandal has raised doubts about his suitability for the post.This case has raised a multitude of questions.A series of unsolved murders on the island has raised fears that a psychopathic serial killer is on the loose.I would like to raise a point of order.This raises the question of teacher pay.\nSMART Vocabulary: related words and phrases\nCreating and producing\nanti-creative\nartefact\nattribute\nattribute something to someone\nbang something out\nbash\ncrank\ngenerative\ngenerativity\ngrind something out\nhandmade\nknock\nremake\nrig\nrig something up\nroll (something) out\nrollout\nrun something up\nspin\nyield\nSee more results »\nraise verb [T]\n(DEVELOP)\nB2 to take care of a person, or an animal or plant, until they are completely grown: Her parents died when she was a baby and she was raised by her grandparents. The lambs had to be raised by hand (= fed milk by people) when their mother died. The farmer raises (= breeds) chickens and pigs. The soil around here isn't good enough for raising (= growing) crops. Synonyms\nbring someone up\nrear (CARE FOR)Compare\neducate\nMore examplesFewer examplesAlthough he was raised a Catholic, he was an agnostic for most of his adult life.She decided to turn vegan after watching a documentary about how poultry is raised.She thinks she knows everything about raising children, but I could tell her a thing or two.He was born and raised in Texas.My dad died when we were small so my mum raised the family on her own.\nSMART Vocabulary: related words and phrases\nParenting & caring for children\nadopt\nadoptable\nadopted\nadoptee\nadoption\ncared-for\ncaretaking\nchild-rearing\nchildless\nchildlessness\nkinship carer\nlawnmower parent\nlooked-after\nmothering\nnanny\nsnowploughing\nstay-at-home\nswaddle\nunadoptable\nunadopted\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal farming - general words\nraise verb [T]\n(CARD GAMES)\nIf you raise another player in a game of cards, you risk more money than that player has risked: I'll raise you. [ + two objects ] I'll raise you $50.\nSMART Vocabulary: related words and phrases\nCard games\nall in\nbidding\nblackjack\nbridge\nbusted flush\ncanasta\ncard sharp\ndeal\ndiamond\nhonour\njack\npool\nqueen\nre-raise\nrebid\nrecut\nrookie card\nsolitaire\nspade\nstraight\nSee more results »\nraise verb [T]\n(STOP)\nformal to end or stop: They agreed to raise the trade embargo if three conditions were met. After three weeks the siege was raised.\nSMART Vocabulary: related words and phrases\nCausing something to end\nabandon\nabandonment\nall good things (must) come to an end idiom\nand have done with it idiom\nbe over the hump idiom\nbrake\ncure\nfreeze\nhalt\nhang\njack something in\nkill something stone-dead idiom\nknock\nlid\nsnap\nsnuff something out\nstamp on something\nstamp something out\nstanch\nstaunch\nSee more results »\nraise verb [T]\n(COMMUNICATE)\nto communicate with someone, especially by phone or radio: I've been trying to raise Jack/Tokyo all day.\nSMART Vocabulary: related words and phrases\nCommunicating & keeping in touch\nahold\nbackchannel\nbell\ncall back\ncall someone up\ncatchup\ncommunication\ncommunicative\ncommunicator\ndrop\ninteractive\npeople skills\npick\npick someone/something up\npropagation\nradio silence\nreach\nring\ntinkle\nvia\nSee more results »\nGrammar\nRaise or rise?Raise must have an object, as it is a transitive verb. It is a regular verb; its three forms are raise, raised, raised: …\nIdioms\nraise (a few) eyebrows\nraise someone from the dead\nraise your game\nraise your hand to/against someone\nraise hell\nraise the roof\nan increase in the amount that you are paid for the work you do: She asked the boss for a raise.\nSMART Vocabulary: related words and phrases\nEarning money\nassessable\nbank\nbase pay\nbasic\nbasic income\ndisposable income\nhand over fist idiom\nin arrears idiom\nkilling\nline your pocket(s) idiom\nmake an honest living idiom\npro rata\nprofit from something\nprorate\npull\npull something down\nrake something in\nretainer\nrevenue\nsick pay\nSee more results »\nraise verb [T]\n(LIFT)\nAdd to word list\nAdd to word list\nto cause something to be lifted up or become higher: He raised the window shades. Stephie raised her hand to ask the teacher a question.\nraise verb [T]\n(BECOME BIGGER)\nto cause something to become bigger or stronger; increase: I had to raise my voice to be heard over the noise in the classroom. There are no plans to raise taxes, the president said. I don’t want to raise your hopes too much, but I think the worst of the flooding is over.\nraise verb [T]\n(DEVELOP)\nto take care of children or young animals until completely grown: They raised a family and now want to enjoy their retirement.\nraise verb [T]\n(BRING ABOUT)\nto bring something to your attention; cause to be noticed: This raises a number of important issues.\nTo raise money is to succeed in getting it: I want to start my own business if I can raise enough money. Idiom\nraise hell\nraise noun [C]\n(SOMETHING BECOMING BIGGER)\nan increase in the amount money you earn: She asked her boss for a raise.\nAdd to word list\nAdd to word list\nto increase the amount, level, or quality of something: The Bank of England was expected to raise the cost of borrowing after higher than expected inflation figures.raise salaries/prices/taxes There is increasing pressure on exporters to raise prices in foreign markets.raise awareness/standards/quality The new government is pledging to raise standards in education.\nFINANCE to manage to get money to invest in a business, project, property, etc.: raise capital/funds/money We will raise funds for reconstruction by disposing of assets. The share issue in the coffee company aims to raise €5m from investors eager to invest in ethical concerns. raise a loan/mortgage\nto mention something that you are worried or not sure about so that it can be examined and dealt with: raise concerns/doubts/fears The company announced a package of reforms to address concerns raised by shareholders. raise issues/objections/questions\nACCOUNTING to prepare an invoice: The exporter raises an invoice in the usual way on the overseas buyer.\nCOMMUNICATIONS to make or arrange a phone call, especially to discuss technical help, business, etc.: If you have a technical fault, you can raise a call using the in-house system.\nHR an increase in salary or wages: A 2% raise for each employee would add $28 million to the overall budget."}