{"id":300506,"name":"rally","type":"noun","us_sound":"ˈræl.i","us_link":"../audio/r/rally.mp3","uk_sound":"ˈræl.i","uk_link":"../audio/r/ukrains013.mp3","content":"rally noun [C]\n(MEETING)\nAdd to word list\nAdd to word list\nC2 a public meeting of a large group of people, especially supporters of a particular opinion: 5,000 people held an anti-nuclear rally. an election/campaign rally\nMore examplesFewer examplesThe rally has been cancelled for the good of all concerned.It was heartening to see so many people at the rally.The rally was organized by local trade union officials.Demonstrators were bussed in from all parts of the country to attend the protest rally.They held a rally outside the town hall.\nSMART Vocabulary: related words and phrases\nMeeting people\nacquaintance\nayup\nbump into someone\ncounter-rally\ncross someone's path/cross paths with someone idiom\nfarewell\nmake yourself known idiom\nmass\nmeeting\nmuster point\nopen house\npaths cross idiom\npay your respects idiom\npower lunch\nre-encounter\nre-meet\nreconvene\nrecross\nrendezvous\nrespect\nSee more results »\nrally noun [C]\n(RACE)\nC2 a car or motorcycle race, especially over long distances on public roads: The French driver has taken the lead in the Paris-Dakar rally.\nSMART Vocabulary: related words and phrases\nMotor racing\nautocross\ncockpit\nDNF\ndrag racing\ndrag strip\ngo-karting\ngrand prix\ngrid\nhill climb\nmotocross\nrace car\nrace car driver\nracing car driver\nracing driver\nscramble\nslingshot\nspeedway\nspin out\nstarter\nstock car\nSee more results »\nrally noun [C]\n(SPORT)\na continuous exchange of hits between players in tennis, squash or badminton\nSMART Vocabulary: related words and phrases\nTennis & racket sports\nadvantage\nbackhand\nball boy\nball girl\nbaseline\nbird\nbreak\ncode violation\ncourt\ndouble\ndouble fault\ngroundstroke\nlob\noverhead\nserve\nsquash\nsweet spot\nunreturnable\nunseeded\nvolley\nSee more results »\nrally noun [C]\n(IMPROVEMENT)\nan improvement: Share prices fell again today after yesterday's rally.\nSMART Vocabulary: related words and phrases\nBecoming better\nalive\nblossom\nblossom into something\nby/in leaps and bounds idiom\ncome alive idiom\ncome along\ncorrective\nheal\nlook up\nmake a man (out) of someone idiom\nmarginal\nmend\nmend your ways idiom\nself-betterment\nself-improvement\nshape up\nshape up or ship out! idiom\nsharpen\nsharpen (something) up\nwipe\nSee more results »\nrally verb\n(SUPPORT)\n[ I or T ] to (cause to) come together in order to provide support or make a shared effort: Supporters/Opponents of the new shopping development are trying to rally local people in favour of/against it. The president has called on the people to rally to/behind the government. [ + obj + to infinitive ] The general rallied his forces to defend the town. \"Workers of the world unite!\" was their rallying cry/call (= a phrase said to encourage support).\nSMART Vocabulary: related words and phrases\nForming groups (of people)\nalienated\nbe ranged against/with something/someone\nclass reunion\ncluster\ncrowd\ncrowd around (someone/something)\nfederalization\nflock\nform\ngather\nincestuousness\nmob\nrange\nregather\nregroup\nreunion\nround\nround something/someone up\nthe assembled company\nthrong\nSee more results »\nrally verb\n(IMPROVE)\n[ I ] to return to a better condition: The nurse said my mother had rallied after a poor night. The team played badly in the first half of the game but rallied in the second. The pound rallied against the dollar in trading today.\nThesaurus: synonyms, antonyms, and examples\nto improve somethingimproveHis health has improved dramatically since he started exercising.get betterThe first part of the book isn't very good but it gets better.rallyThe team played badly in the first half but rallied in the second.recoverWe are still waiting for the economy to recover.look upOur financial situation is looking up.pick upBusiness is really beginning to pick up.\nSee more results »\nSMART Vocabulary: related words and phrases\nBecoming better\nalive\nblossom\nblossom into something\nby/in leaps and bounds idiom\ncome alive idiom\ncome along\ncorrective\nheal\nlook up\nmake a man (out) of someone idiom\nmarginal\nmend\nmend your ways idiom\nself-betterment\nself-improvement\nshape up\nshape up or ship out! idiom\nsharpen\nsharpen (something) up\nwipe\nSee more results »\nPhrasal verb\nrally round (someone)\nrally noun [C]\n(MEETING)\nAdd to word list\nAdd to word list\na public meeting of a large group of people, esp. to show support for a particular opinion, political party, or sports team: He helped organize the first national rally against the war.\nrally noun [C]\n(IMPROVEMENT)\nIn baseball, a rally is a period during which a team scores a lot of runs (= points), esp. when it has been losing.\nrally verb [I/T]\n(IMPROVE)\nto return or bring to a better condition; improve or cause to succeed: [ I ] Cleveland rallied in the fourth quarter to beat Washington, 111-102. [ I ] The dollar rallied against the yen in trading today.\nrally verb [I/T]\n(MEET TOGETHER)\nto bring or come together in order to provide support or make a shared effort: [ I ] African-American groups rallied around the president when he was under attack.\nAdd to word list\nAdd to word list\nSTOCK MARKET a sudden increase in share prices after a period when they have been falling or there has been low activity: a rally in sth The shares of gold mining companies were boosted by a rally in bullion prices.spark/cause/trigger a rally News of the retail industry's first-quarter profits triggered a rally in share prices.stage/enjoy a rally Major oil producers staged a rally despite weaker prices for crude oil.a powerful/sharp/strong rally After a powerful rally last year, stocks have languished for the first quarter of this year. a market/price/stock rally a brief/late/early rally\nPOLITICS a large public meeting where a lot of people show their support for something: attend/hold a rally The anti-war rally was attended by around 5,000 people. speak at/address a rally a campaign/political/protest rally an election rally\nSTOCK MARKET to improve after a period of falling share prices or of low activity : The company's stocks rallied after an initial fall.rally against sth The pound rallied against the dollar in trading today.rally from/to sth Shares in the retailer rallied to 257p after dropping to 230p last month.rally (by) 10 points/20%/1p, etc. The Nasdaq rallied 41% to hit 2313.85. rally sharply/strongly"}