{"id":300820,"name":"random","type":"adjective","us_sound":"ˈræn.dəm","us_link":"../audio/r/random.mp3","uk_sound":"ˈræn.dəm","uk_link":"../audio/r/ukramsh012.mp3","content":"Add to word list\nAdd to word list\nC1 happening, done, or chosen by chance rather than according to a plan: random checks/tests/attacks We asked a random sample/selection of people what they thought.\nThesaurus: synonyms, antonyms, and examples\nhappening by chance with no cause or reasonrandomIt was a random encounter between two long-lost friends.chanceA chance meeting brought them back together.arbitraryIt seems like the decision to cancel such a successful TV programme was completely arbitrary.haphazardHer cabinets were stuffed with a haphazard jumble of books, clothes, tins of soup, and papers.coincidentalAny similarity between the characters in this book and real people, living or dead, is purely coincidental.inadvertentA good editor will catch and correct all inadvertent typos in a text.\nSee more results »\ninformal strange or unusual: I just saw Billy wearing a top hat - he's so random!\ninformal unknown and unexpected in a particular situation: Some random guy walked in. at random\nC1 by chance, or without being chosen intentionally: The winning entry will be the first correct answer drawn at random.\nSee more\nMore examplesFewer examplesAnd what might be the underlying significance of these supposedly random acts of violence?To my untutored eye that just looks like a load of random brush strokes and yet it's a very valuable painting.It seems that the attack was a random act of violence.The survey was carried out among a random sample of voters.The security guards carried out random checks on people entering the building.\nSMART Vocabulary: related words and phrases\nChance and randomness\naccident\naccident of birth\naleatory\narbitrarily\narbitrariness\ncrapshoot\neven-money\nfluke\nfluky\nfortuitous\nluck\nluck into something\nmore by accident than design idiom\nmore by luck than judgment idiom\nnon-purposive\nserendipitous\nserendipitously\nsortition\nstumble into something\nunsystematic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnique and unusual\nStrange, suspicious and unnatural\nNot expected or planned\nUnknown and unfamiliar\nRelated word\nrandomly\nan unknown or unexpected person: You can't make a whole movie with randoms off the street.\nMore examplesFewer examplesI'm not going to give my phone number to some random who asks for it.She doesn't want to go on holiday with a load of randoms she doesn't know.\nSMART Vocabulary: related words and phrases\nNot expected or planned\nabrupt end\nabrupt halt\nabruptly\nabruptness\nad hoc\nimprovidently\ninadvertence\ninadvertency\ninadvertent\ninadvertently\nrudely\nsharpness\nsine die\nspirit\nspontaneity\nunstarry\nunsuspected\nuntimely\nuntoward\nunwilled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnknown and unfamiliar\nAdd to word list\nAdd to word list\nhappening, done, or chosen by chance rather than according to a plan or pattern: a random sample He was stopped at the border in a random check. at random\nAt random means by chance, or without any organization or plan: Dylan picked several books at random. randomly adverb us\nYour browser doesn't support HTML5 audio\n/ˈræn·dəm·li/\nThe people I interviewed were chosen randomly. randomness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈræn·dəm·nəs/\nAdd to word list\nAdd to word list\nhappening, done, or chosen by chance rather than following a system, plan, or rule: random audits/checks/tests They discussed the idea of carrying out random forensic audits on listed companies as a deterrent to fraud. The questionnaires are assigned on a random basis.\nat random\nwithout involving any system or decision: chosen/drawn/selected at random The winner will be the first complete entry drawn at random after the closing date."}