{"id":300845,"name":"range","type":"noun","us_sound":"reɪndʒ","us_link":"../audio/r/range.mp3","uk_sound":"reɪndʒ","uk_link":"../audio/r/ukramsh017.mp3","content":"range noun\n(SET)\nAdd to word list\nAdd to word list\nB1 [ C ] a set of similar things: I offered her a range of options. There is a wide/whole range of opinions on this issue.\nB1 [ C ] mainly UK (US usually line) the goods made by one company or goods of one particular type that are sold in a shop: We stock the full range of model railway accessories.UK This jacket is part of our autumn/spring range.\nB1 [ C ] a group of hills or mountains: a mountain range the Pennine Range We could see a low range of hills in the distance.\nScott Robertson/Moment/GettyImages\nMore examplesFewer examplesOur views coincide on a range of subjects.As an actor he could communicate a whole range of emotions.This range of clothing is specially designed for shorter women.There was a range of fairground amusements, including rides, stalls and competitions.The mountain range stretched away into infinity.\nSMART Vocabulary: related words and phrases\nGroups and collections of things\nage bracket\nagglomerate\nagglomeration\nAladdin's cave\nanthology\nbasket\ncrop\ndataset\nempty set\nensemble\nfamily\nfeast\npackage\npermutation\npool\nportfolio\nselection\nsheaf\nsheaves\nstarter pack\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProducts & producers\nGeography: hills & mountains\nrange noun\n(LIMIT)\nB2 [ S ] the amount, number, or type of something between an upper and a lower limit: The price range is from $100 to $500. The product is aimed at young people in the 18–25 age range. The coat was in/out of my price range. This type of work is outside/beyond/out of my range (of experience).\nC2 [ S or U ] the distance within which you can see, hear, or hit someone: The ship was in/out of range of our guns. He was shot at point blank/at close range (= from very near).\n[ S ] the period of time in the future within which something is planned or expected to happen: long-range plans short-/medium-/long-range weather forecasting\n[ S ] the distance that a vehicle or aircraft can travel without having to stop for more fuel: short-/medium-/long-range airliners\n[ C ] all the musical notes that a singer can sing or a musical instrument is able to produce\nMore examplesFewer examplesThe opposing units opened fire simultaneously at close range and a 15-minute firefight ensued.Her remarkable vocal range spanned three and a half octaves.Two bullets were fired into the car at point-blank range.He's often bracketed with the romantic poets of this period although this does not reflect the range of his work.Their ideal holiday was out of their price range.\nSMART Vocabulary: related words and phrases\nRange and limits\nall the way to idiom\nambit\nanywhere\nband\nbeyond the bounds of something\ncompass\nfinite\nfinitude\ngamut\nglass ceiling\nlimit\nlimited\nparametrically\nproviso\nrealm\nrestricted\nscope\nspectrum\nstretch\nstring\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMeasurements of length & distance\nPlaying music\nSinging\nrange noun\n(WEAPONS AREA)\n[ C ] an area where people can practise shooting or where bombs or other weapons can be tested: The soldiers were practising on the rifle/shooting range. The bomb was tested on a missile range in the desert.\nSMART Vocabulary: related words and phrases\nGuns\nblaster\nblaze\ncannon\ncannonade\ncannonball\ncock\ndischarge\ngunnery\ngunpoint\ngunsmith\nkick\nmachine gun\nplug\npot\nsalvo\nsemi-automatically\nsemiautomatic\nshoot something down\nshoot up\nshooter\nSee more results »\nrange noun\n(LAND)\n[ C ] US land for animals to feed on: The cowboys were herding the cattle on the range.\nSMART Vocabulary: related words and phrases\nAnimal farming - general words\nanimal husbandry\naquaculture\naquaponics\nbedding\nbeekeeping\ndip\ndraft\ndrove\nhand-reared\nheeler\nherd\nhoneycomb\nkept\nshear\nsheep shearing\nsheepdog\nshepherd\nslaughter\nsubtherapeutic\nteaser\nSee more results »\nrange noun\n(COOKER)\n[ C ] UK (also kitchen range) an old type of cooker, with one or more ovens and cooking surfaces, that is heated with wood or coal and is kept hot all the time\nAlphotographic/iStock/Getty Images Plus/GettyImages\n[ C ] US (UK cooker) a large box-shaped device that is used to cook and heat food, either by putting the food inside or by putting it on the top: She was cooking soup on the range. Synonym\nstove\nSMART Vocabulary: related words and phrases\nKitchen appliances\nAga\nair fryer\nblender\nbroiler\ncafetière\nfrier\ngas mark\ngriddle\ngrinder\nhalogen hob\nliquidizer\nmeat grinder\nmincer\nmulticooker\noven\nstove\nstove hood\nstovetop\nteakettle\ntoaster\nSee more results »\nrange verb\n(LIMIT)\nB2 [ I usually + adv/prep ] to have an upper and a lower limit in amount, number, etc.: Dress sizes range from petite to extra large. Prices range between $50 and $250.\nMore examplesFewer examplesBeauty treatments range from an eyelash tint at £8 to a deep cleansing facial costing £58.Their ages range from 12 to 18.The critics' opinions of the new film ranged from 'poor' to 'outstanding'.Average temperatures in July range from 15 to 25 degrees.The variety of accommodation available ranges from a studio flat to a four-bedroomed house.\nSMART Vocabulary: related words and phrases\nRange and limits\nall the way to idiom\nambit\nanywhere\nband\nbeyond the bounds of something\ncompass\nfinite\nfinitude\ngamut\nglass ceiling\nlimit\nlimited\nparametrically\nproviso\nrealm\nrestricted\nscope\nspectrum\nstretch\nstring\nSee more results »\nrange verb\n(POSITION)\n[ T usually + adv/prep ] to position people or things together, especially in rows: The crowd ranged itself along the route of the procession. The troops were ranged in front of the commanding officer. Synonym\narrange (PUT IN POSITION)\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nconcordance\ndescribe\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nset something up\nshake someone down\nshort-list\nshortlist\nsort\ntick\nSee more results »\nrange verb\n(MOVE)\n[ I usually + adv/prep ] to move or travel freely: The hens range freely about/over the farm. The walkers ranged through/over the hills all day.\n[ I usually + adv/prep ] (of a piece of writing or speech) to deal with: Our discussion ranged over many current issues. The findings of a wide-ranging (= including many subjects) survey of young people's attitudes are published today.\nSMART Vocabulary: related words and phrases\nWalking and walkers\nbring/call something/someone to heel idiom\ncavalcade\nconstitutional\nfoot traffic\nhiker\nhoof it idiom\nrace walking\nrambler\nrambling\nretread\nshanks's pony\nsleepwalk\nsleepwalking\ntramp\ntread\ntrekking pole\nwalk\nwalkable\nwalkabout\nwalkies\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRegarding and concerning\nPhrasal verb\nbe ranged against/with something/someone\nrange noun\n(LIMIT)\nAdd to word list\nAdd to word list\n[ C/U ] the level to which something is limited, or the area within which something operates: [ C ] a wide range of subjects [ C ] The coat was beautiful, but way out of my price range. [ C ] I like temperatures in the 60s and 70s, somewhere in that range.\n[ C/U ] Range is also the period of time within which something happens, or the distance something travels: [ U ] the short/intermediate/long range [ U ] He was shot at very close range.\n[ C/U ] A vehicle’s or aircraft’s range is the distance that it can travel without having to stop for more fuel.\nrange noun\n(SET)\n[ C ] a set of similar or related things: We offer a wide range of options. The clinic provides a full range of medical services.\n[ C ] A range (also (also line)) is a group of products of a particular type.\nrange noun\n(MOUNTAINS)\n[ C ] a group of mountains or hills: the San Juan Range\nrange noun\n(PRACTICE AREA)\n[ C ] an area where people can practice shooting guns or hitting golf balls, or where weapons can be tested\nrange noun\n(LAND)\n[ C ] a large area of land for animals to feed on, or the region a type of animal or plant comes from and is most often found in\nrange noun\n(STOVE)\n[ C ] a stove used for cooking that has a top surface with burners (= devices for controlling flames or heat) for heating food and usually an oven (= enclosed cooking space): gas/electric range\nrange verb [I always + adv/prep]\n(LIMIT)\nto be limited to a particular length, amount, or area: Prices range from $50 to $250. Our discussions ranged over many issues.\nrange verb [I always + adv/prep]\n(LAND)\nto move or travel with complete freedom: The hikers ranged over the hills all day.\nAdd to word list\nAdd to word list\n[ C, usually singular ] a number of similar things considered as a group: a range of sth They provide IT and consultancy services to a range of clients.a wide/broad range The new regulations allow a much wider range of companies to sell legal services. a range of issues/options/possibilities\n[ C ]\n&#160; COMMERCE a set of products of a similar type that are sold by a particular company or store: a broad/wide/huge range We stock a wide range of printers and accessories.a full/extensive range They aim to offer a full range of online services for travellers.a small/narrow/limited range Big-discount retailers sell a limited range at highly competitive prices.\n[ C, usually singular ] the amount or type of something between an upper and lower limit: in the range of $1500-$2000/£10,000-12,000, etc. The cost of building the new stadium is estimated to be in the range of €150-180 million.in the ... range Their annual salaries are in the $30,000 to $40,000 range.age/frequency/income range We interviewed customers across the whole age range, from 16 to 65.\n[ C, usually singular ]\n&#160; FINANCE, STOCK MARKET the highest and lowest price at which a particular share has traded over a period of time: Most of the fund's purchases are in the 250p-300p trading range.\n[ S ] the limits of power, responsibility, experience, etc. that a person or organization has: range of experience/skills/abilities The project is outside my range of experience.\ntrade in a narrow/tight range\nFINANCE, STOCK MARKET to set the price of stocks or shares at a level where there is very little difference between the bottom and top price, especially when investors are nervous about a financial market: The markets traded in a narrow range ahead of today's US interest-rate decision.\nSee also\nmid-range\nprice range\nproduct range\ntop-of-the-range\nto have an upper and lower limit in amount, level, etc.: range from sth to sth Prices range from $50 to $1500.range between sth and sth Charges range between 15% and 25%.\nto include a group of things of the type described: range from sth to sth They sell products ranging from batteries to high-end electronic goods."}