{"id":300892,"name":"ranking","type":"noun","us_sound":"ˈræn.kɪŋ","us_link":"../audio/r/ranking.mp3","uk_sound":"ˈræn.kɪŋ","uk_link":"../audio/r/ukramsh020.mp3","content":"Add to word list\nAdd to word list\na rank or level, for example in a competition: Last year Wiseman rose from 266 to 35 in the tennis world rankings. The city's housing costs were enough to earn it a ranking of 66th nationally.\nSMART Vocabulary: related words and phrases\nOrganizations - position & status\nambassador\nanti-elite\nanti-elitist\napparatchik\nback seat\nbrother\ncounterpart\nfish\ngrassroots\nhigh-ranking\nopposite number\nrank\nreach\nspokeswoman\nsuper-elite\nsuperboard\nsuperiority\nsuperordinate\nthane\ntitularly\nSee more results »\nbeing the officer of highest rank present at a particular time: General Steinberger was the ranking officer present at the meeting.\nSMART Vocabulary: related words and phrases\nGeneral ranks in the armed forces\nADC\nadjutant\naide-de-camp\nartificer\nbombardier\nC-in-C\ncaptain\ncommandant\ncommander-in-chief\ncommissioned\ncommissioned officer\nfive-star\nflash\ngrunt\nLt\nmarshal\nNCO\nnon-commissioned\nnon-commissioned officer\nofficer\nSee more results »\nranking adjective [not gradable]\n(POSITION)\nAdd to word list\nAdd to word list\nhaving the highest rank or standing in relation to others of the same kind: The Senator is the ranking Republican on the committee.\nAdd to word list\nAdd to word list\n[ C ] the position or level something or someone has in a list that compares their importance, quality, success, etc.: Figures in brackets indicate the ranking of the leading host economies on a per capita basis. The UK's actual ranking won't be known until a new Top 500 list is released.\n[ C ] a list that compares the importance, quality, success, etc. of people or things of the same type: The company has dropped in the Franchise 500 ranking from No. 23 last year to No. 59.\n[ U ] the action of deciding where someone or something should be in a list that compares things of the same type: The ranking system is based on a complicated formula with different items such as reputation or performance carrying different weights.ranking as sth She referred to the bank's ranking by the U.S. Environmental Protection Agency as the largest purchaser of green-power energy credits in the United States.\nhaving the highest position of authority in an organization, at a meeting, etc.: He is the ranking member on several Senate subcommittees. See also\nhigh-ranking\nlow-ranking\nmiddle-ranking\ntop ranking"}