{"id":300884,"name":"rank","type":"noun","us_sound":"ræŋk","us_link":"../audio/r/rank.mp3","uk_sound":"ræŋk","uk_link":"../audio/r/ukramsh019.mp3","content":"rank noun\n(POSITION)\nAdd to word list\nAdd to word list\nC1 [ C or U ] a position in an organization, such as the army, showing the importance of the person having it: senior/high/junior/low rank He has just been promoted to the rank of captain. Ministers of cabinet rank receive a higher salary than other ministers. Having a large income is one of the advantages of rank (= high position).\n[ C or U ] a particular position, higher or lower than others: He's in the front/first rank of (= one of the best) international tennis players. Consumer preferences were placed in rank order from 1 to 5. ranks [ plural ]\nthe members of a group or organization: party ranks Party ranks have swelled by nearly 300,000.\nSee more rise from/through the ranks\nto be moved up from a low level position in an organization to a higher one: He rose through the ranks to become a general.\nSee more\nMore examplesFewer examplesColonel is the military rank between lieutenant-colonel and brigadier.A hospital registrar is of a lower rank than a consultant.He was promoted to the rank of major in recognition of his valour during the battle.He achieved ambassadorial rank in 1958.After many years at the company he eventually worked his way up to the rank of Chief Executive Officer.\nSMART Vocabulary: related words and phrases\nOrganizations - position & status\nambassador\nanti-elite\nanti-elitist\napparatchik\nback seat\nbrother\ncounterpart\nfish\ngrassroots\nhigh-ranking\nopposite number\nreach\nseat\nspokeswoman\nsuper-elite\nsuperboard\nsuperiority\nsuperordinate\nthane\ntitularly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nQuality and standard\nrank noun\n(ROW)\n[ C ] a row, especially of people or things standing side by side: The front rank of the riot squad raised their shields.literary We could see nothing for miles but serried ranks (= many close rows) of fir trees.\n[ C ] a place where taxis wait for passengers: There were no taxis at the taxi/cab rank.\nImage from Scott Gibbons/Moment Open/GettyImages\nSMART Vocabulary: related words and phrases\nThings collected in lines or rings\nchain\ncolumn\ncrocodile\nfile\ninterrow\nline\nqueue\nring\nrope\nrow\nsingle file\nstring\nthread\ntier\ntrain\ntwo-tier\nYou can also find related words, phrases, and synonyms in the topics:\nTrain & bus stations & taxi ranks\nrank adjective\n(EXTREME)\n[ before noun ] (especially of something bad) complete or extreme: It was rank stupidity to drive so fast on an icy road. The horse that won the race was a rank outsider.\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabsolutely\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\nrank adjective\n(GROWN)\nused to describe plants that grow too fast or too thickly, or an area covered by these: The abandoned garden was rank with weeds.\nSMART Vocabulary: related words and phrases\nFertile or infertile land\nbarren\nbarrenly\nbarrenness\nbread basket\ncultivable\ndenude\nfertile\nfertility\ngranary\nhardscrabble\nhospitable\nhostile\nluscious\nlushly\novergrown\nscrabbly\nsterile\nuncultivated\nunfruitful\nverdant\nSee more results »\nrank adjective\n(SMELL)\nsmelling strong and unpleasant: His clothes were rank with sweat. Synonyms\nfetid formal\nfunky (BAD) US informal\nmalodorous formal\nniffy UK informal\npungent\nputrid (DECAYED)\nsmelly\nstinking informal\nstinky informal\nwhiffy UK informalOpposites\nfragrant\nperfumed\nscented\nSMART Vocabulary: related words and phrases\nSmells & smelling\nacridly\nanosmic\nbergamot\ndeodorize\ndeodorizing\nfetid\nfragrant\nmalodorous\nminging\nodourless\npiny\npungency\npungently\nrankly\nredolence\nredolent\nscented\nsmelly\nsniff\nstink\nSee more results »\nC1 to have a position higher or lower than others, or to be considered to have such a position: A captain ranks (= has a position) above a lieutenant. My entry was ranked third in the flower show. She ranked the bottles in order of size along the shelf. In my opinion, he ranks among the theatre's greatest actors. 2012 must rank as (= be) the most difficult year for Europe since the 30s.\nMore examplesFewer examplesA few incredulous spectators watched as Paterson, ranked 23rd in the world, beat the champion.He is now ranked one hundredth in world tennis.She currently ranks ninth in the world.Rank your answers to the survey in order of preference.Her victory must rank as one of the greatest upsets in the history of the tournament.\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nconcordance\ndescribe\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nset something up\nshake someone down\nshort-list\nshortlist\nsort\ntick\nSee more results »\nrank noun [C/U]\n(POSITION)\nAdd to word list\nAdd to word list\na position in relation to others higher or lower, showing the importance or authority of the person having it: [ C ] You get more privileges if you have a higher rank. [ U ] He rose quickly in rank. rankings plural noun us\nYour browser doesn't support HTML5 audio\n/ˈræŋ·kɪŋz/\nShe has been near the top of the 800-meter rankings for the past 13 years.\nrank adjective\n(SMELLY)\nsmelling very unpleasant: a rank odor\nAdd to word list\nAdd to word list\n[ C or U ] a position in an organization such as the government, army, etc. that shows the importance of someone's job compared to other positions: high/low/middle rank The committee usually consists of people of a higher rank than the person being interviewed. a management/executive rank the top/highest rank Despite his lack of Cabinet rank, U.N. diplomats said that the US representative would be listened to carefully.\n[ S ] a particular position in a list that shows how important, good, profitable, etc. something is compared to other things of the same type: the first/top/highest rank of sth A big merger would put the firm into the first rank of global companies.fall/slip in rank The fund has slipped in rank to eighth position in the Nasdaq. the bottom/lowest rank\nranks [ plural ]\nthe members of a group or organization: Party ranks have grown by nearly 100,000.the ranks of sth The deal will help them join the ranks of the established leaders in the mobile phone market.\nthe ordinary employees in a company, rather than the managers: Solidarity in the ranks has produced an agreement that protects jobs for our communities.\nrise from/through the ranks\nto keep moving up from a low position in an organization to higher ones: He joined the company in 2000 and has been rising through the ranks ever since.\n[ I or T ] to have or be put into a position on a list of other similar things or people, that compares their importance, level of success, etc.: rank third/thirtieth, etc. The chemical company will rank 17th among U.S. chemical companies based on sales.be ranked third/thirtieth, etc. The Japan fund has gone from strength to strength and is ranked fourth in its sector.rank (sth) among sth The district ranks among the bottom ten in the state for residents' income. She was ranked among the 25 most powerful business women in the world.rank low/high Energy costs rank high in importance in consumer's minds.rank above/below sth England ranked below many other European countries for employment.\n[ T ] to make a list of things in order, comparing their importance, level of success, quality, etc.: We rank a broad range of stocks using both value characteristics and growth characteristics. When facing a number of challenges, it is often useful to rank their importance so appropriate attention can be provided.rank sth according to/by sth Cities were ranked according to how many international conferences they hosted.\nPhrasal verb\nrank as"}