{"id":300983,"name":"rape","type":"verb","us_sound":"reɪp","us_link":"../audio/r/rape.mp3","uk_sound":"reɪp","uk_link":"../audio/r/ukrapac003.mp3","content":"Add to word list\nAdd to word list\nB2 to force someone to have sex when they are unwilling, using violence or threatening behaviour: She was pulled from the car and raped. An alleged sexual predator is on trial for raping a young man.\nMore examplesFewer examplesShe was raped as a young girl.She said that he'd raped her.He had raped her repeatedly during this period.He raped and murdered several women.She does a lot of counselling with women who've been raped and abused.\nrape noun\n(SEX CRIME)\nB2 [ C or U ] (an example of) the crime of forcefully having sex with someone against their wishes: He had committed several rapes. He was convicted of rape.\nMore examplesFewer examplesThe judge was reviled in the newspapers for his opinions on rape.We're hearing reports of the systematic rape and torture of prisoners.Some of the most disturbed children had witnessed really traumatic things, such as rape and murder.Why do so many rapes go unreported?The woman alleged rape, but the accused insisted that it was consensual.\nrape noun\n(DESTRUCTION)\n[ U ] destruction of the natural world, often for profit: The road builders were accused of the rape of the countryside.\nSMART Vocabulary: related words and phrases\nEnvironmental issues\nagroecology\nair pollution\nanoxia\nanoxic\nanti-conservation\ncarbon capture\ndumping ground\neco-footprint\nenvironmentalism\nenvironmentally\nESG\nfeed-in tariff\nfood insecure\nparticulate\nreduce, reuse, recycle idiom\nsequester\nsequestration\nsingle-use\nskip diving\nsmoggy\nSee more results »\nrape noun\n(PLANT)\n[ U ] (also oilseed rape, rapeseed); (US also canola) a plant with yellow flowers from which oil and animal food are produced\nKeren Su/China Span/China Span/GettyImages\nSMART Vocabulary: related words and phrases\nCrop plants & economic plants\nbeet\nblack mustard\nbrassica\nbreadstuff\ncanola\ncrown vetch\ncrucifer\nfat hen\nfield corn\nflax\nmangelwurzel\nmanioc\nmesquite\nmulti-line\nneep\nSudan grass\nsugar beet\nsugar cane\nsweetcorn\ntall fescue\nSee more results »\nAdd to word list\nAdd to word list\nto force someone to have sex when he or she is unwilling\nRape also means to damage or destroy something by using it in an unsuitable way: Developers are raping the countryside. rape noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/reɪp/\n[ U ] He was convicted of rape."}