{"id":301271,"name":"ratchet","type":"noun","us_sound":"ˈrætʃ.ɪt","us_link":"../audio/r/ratchet.mp3","uk_sound":"ˈrætʃ.ɪt","uk_link":"../audio/r/ukrasp_009.mp3","content":"ratchet noun [C]\n(DEVICE)\nAdd to word list\nAdd to word list\na part of a machine that allows movement in one direction only. It is usually a wheel with teeth-like parts that either slide over or lock against the free end of a bar: The ratchet at the other end of the axle only turns one way. Keep the ratchet mechanism lubricated with oil.\nKypros/Moment/GettyImages\n(also ratchet wrench) a tool consisting of a metal handle and a socket, used for turning objects in one direction only: The bolts can be removed with a ratchet. I had almost every ratchet and wrench in the tool catalogue at my disposal.\nbbeltman/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesMost handbrakes need about four clicks on the ratchet -if yours takes much more, a garage should adjust it.Catapults were loaded and cocked by means of large wheels with ratchets.Walnut leaves have a jagged sawtooth edge rather like a ratchet.the ratchets of a deckchair\nSMART Vocabulary: related words and phrases\nMachines - parts\nair compressor\nair filter\naxle\ncogwheel\ncompressor\nconsole\ncontrol panel\ncontroller\ncowl\nguard\ninstrumentation\njet\nregulator\nslide\nspline\nsplit pin\nstepney\nuniversal joint\nvee belt\nwheel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTools in general\nratchet noun [C]\n(NOISE-MAKER)\nUS (also rattle) a wooden device that when turned around and around produces a noise like a series of knocks\nFloortje/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nToys & dolls\nballoon\nbeach ball\nchew toy\ncuddly toy\ndoll's house\nfidget\nfidget spinner\nfinger puppet\ngacha\nmarble\nmarionette\nmud pie\nrag doll\nRussian doll\nslap bracelet\nslime\nsnow globe\nsock puppet\nSoft Stuff\nstuffed animal\nSee more results »\nratchet noun [C]\n(SITUATION)\nsomething that makes a situation change or develop in one direction only, for example by being able to rise but not fall or the other way round: Presidential power often acts like a one-way ratchet: It can be increased far more easily than it can be reduced. A price ratchet means that prices do not move downward but are free to move up.\nSMART Vocabulary: related words and phrases\nNot able to be changed\nbe no hard and fast rules idiom\nburn your boats/bridges idiom\ncongenital\ncontinuity\ndeep-seated\nincorrigible\nincurably\ninelastic\ninelasticity\ninflexible\nirreversible\nirreversibly\nirrevocable\nirrevocably\nleopard\nunalterable\nunchangeable\nuncompromising\nuncompromisingly\nunredeemable\nSee more results »\nAdd to word list\nAdd to word list\nto change an activity, amount, or feeling by degrees: [ I ] Interest rates always ratchet down in an election year. [ M ] Critics are trying to ratchet up public pressure on lawmakers.\nAdd to word list\nAdd to word list\nFINANCE, STOCK MARKET an arrangement by which managers are given increasing numbers of shares in a company in relation to increases in its profits or success: The sale has been rewarding for the chief executive, whose original 20% stake grew to 30% under a ratchet arrangement.\nPRODUCTION a part of a machine that allows controlled movement in one direction only\na system that controls activity: Tightening the interest-rate ratchet to control inflation would risk tipping the economy into a nasty downturn."}