{"id":301279,"name":"rateable","type":"adjective","us_sound":"ˈreɪ.t̬ə.bəl","us_link":"../audio/r/cdo0623usrate3266.mp3","uk_sound":"ˈreɪ.tə.bəl","uk_link":"../audio/r/cdo0623ukrate3290.mp3","content":"rateable adjective\n(FINANCE)\nAdd to word list\nAdd to word list\nfinance &amp; economics\n&#160; specialized A rateable part of something, such as a payment, is an amount that is calculated based on how much someone is owed or should pay, or how much is owed or should be paid for a particular period of time: The Corporation would only pay its rateable proportion of the claim. The policyholder would be responsible for a rateable proportion of the loss. Related word\nrateably\nfinance &amp; economics\n&#160; UK, specialized If a property is rateable, it is able to be taxed: rateable value Companies pay business rates at about 44 percent of the rateable value of a commercial property. The table shows the percentage of city households in each rateable banding.\nMore examplesFewer examplesThe bankers could not continue to allow a rateable interest on money deposited in their banks. At present, rates are calculated from the rateable value of business premises.\nSMART Vocabulary: related words and phrases\nInsurance\nactuarial\nactuary\nassessor\nbroking\nclaim\ncomprehensive\ncopay\nguarantee\nindemnify\nlife assurance\nloss adjuster\nmature\nnon-network\nnoncoverage\nObamacare\npi\npolicy\nprotect\nthird-party insurance\nunderwrite\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBorrowing & lending\nNumerical relationships\nTaxation\nrateable adjective\n(MEASURE)\nable to be judged according to its value, quality, etc.: Only two of the scales provided a \"not rateable\" category. Rateable improvement often depends on an actual change in level of activity.\nMore examplesFewer examplesFor these reasons, results were considered on the basis of percentage of total rateable time.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\ndive\nenquiry\ngauge\ngo through\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nreinvestigation\nthe acid test\nweigh\nSee more results »\nRelated word\nrate\nAdd to word list\nAdd to word list\nINSURANCE a rateable part of a payment is the amount that can be charged to someone else : Where appropriate a ratable proportion of the claim may be recovered direct from other insurers.\nTAX able to be taxed: The government currently views fibre-optic cable as a rateable asset that businesses should pay tax on."}