{"id":301277,"name":"rate","type":"noun","us_sound":"reɪt","us_link":"../audio/r/rate.mp3","uk_sound":"reɪt","uk_link":"../audio/r/ukrasp_010.mp3","content":"rate noun [C]\n(MEASURE)\nAdd to word list\nAdd to word list\nB2 the speed at which something happens or changes, or the amount or number of times it happens or changes in a particular period: Although she's recovering from her illness, her rate of progress is quite slow. I told my assistants to work at their own rate. The taxi was going at a tremendous rate. the growth/inflation/mortality/unemployment, etc. rate The drug has a high success/failure rate.\nThesaurus: synonyms, antonyms, and examples\nslowlyslowlyI got out of bed and walked slowly to the door.slowGo slower! I can't keep up.at a slow paceThey are easy hikes, done at a slow pace.at a slow speedYou only have to hit a pedestrian at a slow speed to kill them.at slow rateThe economy grew at a slower rate during the second half of the year.\nSee more results »\nMore examplesFewer examplesOver the last year, the rate of inflation has crept up to almost 7 percent.The success rate was abnormally high.We'll be lucky if we get there by midnight at this rate.The city's most shocking statistic is its high infant mortality rate.The survey found no correspondence between crime and unemployment rates.\nSMART Vocabulary: related words and phrases\nSpeed of motion\nairspeed\nat full/half throttle idiom\nbriskness\ncelerity\nclip\nclock\ncruising speed\nground speed\nhypersonic\nhypervelocity\ninstantaneous velocity\nlight speed\nmomentum\nmulti-speed\npace\nspeediness\nsupersonically\nswiftness\nvelocity\nzip\nSee more results »\nrate noun [C]\n(PAYMENT)\nB2 an amount or level of payment: We agreed a rate with the painter before he started work. What's the going (= standard) rate for this type of work? Do you pay your mortgage on a fixed or variable rate (= of interest)?\nMore examplesFewer examplesThe new phone rates will affect all consumers including businesses.The lower tax rate is particularly advantageous to poorer families.Our expectations are that the UK will cut its interest rate.We charge a flat rate of $25 per hour.The hotel has a special discount rate for newlyweds.\nSMART Vocabulary: related words and phrases\nAmounts of money\nappropriation\nbalance\nbank\nbounty\nbuck\ncapital\ncircumstance\ncoin\nfisc\nfloat\nholdback\nliving wage\nmoney supply\nnut\npayout\npool\nsub\ntrough\nwherewithal\nyour daily bread idiom\nSee more results »\nrate noun [C]\n(TAX)\nrates [ plural ]\na local tax paid in Australia, and in Britain in the past, by the owners of houses and other buildings: I see rates are going up again.\nSee more\nIdioms\nat a rate of knots\nat any rate\nat this rate\nrate verb [T]\n(JUDGE)\nC1 to judge the value or character of someone or something: How do you rate him as a football player? She is rated very highly by the people she works for.informal \"What do you think of her as a singer?\" \"I don't really rate her (= I do not think that she is very good).\" I rate cars as one of the worst polluters of the environment. [ + obj + noun ] On a scale of one to ten, I'd rate his book a five. Traffic accidents are so frequent that they don't rate a mention (= are not considered to be worth reporting) in the newspaper unless a lot of people are killed. See also\nunderrate\noverrate rate as something\nto be considered to be something of a particular quality: That rates as the worst film I've ever seen.\nSee more\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\nassign\ndive\nenquiry\ngo through\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\nreinspect\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nthe acid test\nweigh\nSee more results »\nrate verb [T]\n(TAX)\nUK In Britain in the past, a building was rated to decide how much local tax the owner should pay.\nSMART Vocabulary: related words and phrases\nTaxation\namortizable\nanti-dumping\nanti-progressive\nanti-tax\nat source phrase\nfinancial year\nfiscal year\nflat tax\ngas tax\nHMRC\nregressive\nregressively\nroad tax\nsales tax\nself-assessment\ntaxpayer\nthe taxman\ntithe\ntop rate\nunprogressive\nSee more results »\nC1 used with words such as first, second, etc. to show how good you think something is: His suggestions are always first-rate (= very good). This company produces second/third-rate (= not very good) goods.\nSMART Vocabulary: related words and phrases\nQuality and standard\nbar\nbenchmark\ncachet\ncalibre\nconform\nconform to/with something\nideal\nlevel\nmark\nmulti-levelled\nmultilevel\nnotch\nqualitative\nstar\nstarred\nstatus\nstyle\ntake first/second place idiom\nunranked\nupscale\nSee more results »\nrate noun [C]\n(MEASUREMENT)\nAdd to word list\nAdd to word list\na measurement of the speed at which something happens or changes, or the number of times it happens or changes, within a particular period: the rate of change/decay rates of digestion/oxygenation We have relatively low unemployment rates these days. If we improve students’ self-esteem, we could reduce the dropout rate.\nrate noun [C]\n(PAYMENT)\nan amount or level of payment: Interest rates may rise soon. Rental rates vary depending on the size of the car.\nrate verb\n(VALUE)\nto judge the value or worth of something: [ T ] Half of those surveyed rated his work as good. [ L ] The movie is rated R. [ I ] Mark Twain has rated as an enduring author for 100 years.\ndisapproving If you say someone or something doesn’t rate, you mean the person or thing is of poor quality or not worth consideration.\nAdd to word list\nAdd to word list\nthe speed at which something happens: at a fast/slow/steady rate The economy grew at a slower rate in the third quarter than previously estimated.an alarming/incredible/surprising rate The future of the channel is under threat after losing viewers and advertisers at an alarming rate.cut/reduce/slow down the rate The dip in consumer spending was a key factor in slowing down the rate of growth in the economy. double/increase/speed up the rate of sth improve/maintain the rate of sth\nthe amount of something, or the number of times something happens in a particular period: at a rate of 20%/100 a day, etc. The group's business plan shows it growing at its current rate for the next five years.rising/falling rate The report examines the reasons for the rising rate of personal bankruptcy.unemployment/jobless rate Economists predict that the unemployment rate will continue to rise over the next 12 months. It is an area with high poverty and a high crime rate. the birth/death/divorce rate the failure/success rate\nHR, INSURANCE an amount of money that is charged or paid for a particular service: cheap/competitive/reasonable rate The network offers the cheapest rates for mobile calls from abroad. The survey found that the average rate of pay was $9.51 per hour for women and $12.95 for men.charge/pay/set a rate We charge a rate of between €500 and €800 per day. a daily/hourly/weekly rate\nFINANCE, TAX the amount that is charged as tax on income, interest on loans, etc., usually shown as a percentage: a competitive/reduced/special rate Some internet banks offer personal loans at highly competitive rates.falling/high/rising rate How much a bond fund falls in a rising rate environment depends on its duration.a fall/rise/cut in the rate We are likely to see a rise in the rate of VAT. an annual/monthly/quarterly rate the loan/savings ratea rate cut/increase/hike I think we need another rate increase to keep inflation down.\nrates [ plural ]\nTAX, GOVERNMENT in the UK, a local tax paid for some public services: The company was told it had to pay rates of £1,100 a year on the small piece of land. See also\nabsorption rate\nAER\nAPR\naverage rate\nbank rate\nbase rate\nbasic rate\nbill rate\ncapitalization rate\ncapped rate\nView all\ncheque rate\nclick-through rate\ncompound rate\nconversion rate\nday rate\ndepreciation rate\ndiscount rate\neffective rate\neffective tax rate\nEuribor\nexchange rate\nfixed rate\nflat rate\nfloating rate\ngoing rate\ngrowth rate\ninterbank offered rate\ninterest rate\nlending rate\nmarginal rate\nmarket rate\nmortality rate\nnegative interest rate\nnominal interest rate\npiece rate\nprime rate\nrack rate\nshort-period rate\nstandard rate\ntax rate\nteaser rate\nuniform business rate\nvariable rate\nwater rates\n[ I or T ] to have, or be thought to have, a particular value or quality: rate (sth) highly The broadband deal is rated highly in a survey by Which magazine. The sector's most highly-rated analyst team advised investors to book profits.rate (sth) as sth That must rate as one of the worst investments the company has ever made. be rated a failure/success\n[ T ] to give something a particular value or position in a list, according to a set of standards: The survey asked consumers to rate the elements that would most influence their purchasing decision.be rated A/15/R, etc. This film is rated 18, and is for adults only.\n[ T ]\n&#160; COMMERCE, ENVIRONMENT to give something such as a piece of electrical equipment a number or letter that shows how powerful it is, how much electricity it uses, etc. so that consumers can compare products: be rated A/B/X, etc. The washing machine is rated A for energy efficiency.\n[ T ]\n&#160; FINANCE, STOCK MARKET to give an investment a particular value after examining the level of risk involved: be rated (as) investment grade/A/Triple A etc. Debt rated AA has a very strong capacity to pay interest and repay principal.\nrate sth (as) a buy/hold/sell\nFINANCE, STOCK MARKET to advise investors to buy, keep, or sell particular shares or bonds See also\nzero-rated\nused with words such as first, second, etc. to show how good or bad you think something is: first-/top-rate An innovative person with top-rate business credentials is needed to fill the position of executive director."}