{"id":301337,"name":"ratio","type":"noun","us_sound":"ˈreɪ.ʃi.oʊ","us_link":"../audio/r/ratio.mp3","uk_sound":"ˈreɪ.ʃi.əʊ","uk_link":"../audio/r/ukrasp_020.mp3","content":"Add to word list\nAdd to word list\nC1 the relationship between two groups or amounts that expresses how much bigger one is than the other: The ratio of men to women at the conference was ten to one/10:1. The school is trying to improve its pupil-teacher ratio (= the number of teachers compared with the number of students).\nMore examplesFewer examplesCompute the ratio of the object's height to its weight.What is the car's power to weight ratio?The staff to student ratio has increased dramatically in the last five years.The efficiency of a machine is the ratio between the energy it supplies and the energy put into it.Pi is the ratio of a circle's circumference to its diameter.\nSMART Vocabulary: related words and phrases\nStatistics\nactuarial\nasymmetric\nbackground variable\ncategorical variable\ncentral tendency\ncontextual variable\nentropic\nentropically\nentropy\nGaussian distribution\nhomoscedasticity\nidentifiability\nmedian\nquantile\nresponse variable\nstandard deviation\nstat\nstatistic\nstatistically\nstochastic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNumerical relationships\nAdd to word list\nAdd to word list\nmathematics a comparison of two numbers calculated by dividing\nRatio is also a relationship between two groups or amounts that expresses how much bigger one is than the other: a low student-teacher ratio The ratio of men to women at the conference was ten to one.\nAdd to word list\nAdd to word list\nthe relationship between two amounts, represented by two numbers or a percentage, expressing how much bigger one is than the other: the ratio of sth to sth The ratio of exports to imports also improved from 70.4% to 83.2%. The ratio of house prices to earnings is 55% above its average level in the past 20 years. The ratio of men to women at the conference was 10:1. The company was performing well according to all the key ratios. See also\naccounting ratio\nacid test ratio\nasset turnover ratio\nbook-to-bill ratio\ncapital adequacy ratio\ncapital ratio\ncash ratio\ncash deposit ratio\ncollection ratio\ncombined ratio\ncurrent ratio\ndebt/equity ratio\ndebt ratio\ndebt coverage ratio\ndebt service ratio\ndividend payout ratio\ndividend-price ratio\nexpense ratio\nfinancial ratio\ninventory-to-sales ratio\nliquid ratio\nliquidity ratio\nloan-to-value ratio\nmanagement ratio\nnet P/E ratio\nnet quick assets ratio\noperating expense ratio\npayout ratio\nP/D ratio\nP/E ratio\nprice-dividend ratio\nprice/earnings ratio\nreserve ratio\nsolvency ratio\nstock turnover ratio\nturnover ratio"}