{"id":301335,"name":"rating","type":"noun","us_sound":"ˈreɪ.t̬ɪŋ","us_link":"../audio/r/rating.mp3","uk_sound":"ˈreɪ.tɪŋ","uk_link":"../audio/r/ukrasp_018.mp3","content":"Add to word list\nAdd to word list\nC1 [ C or U ] a measurement of how good or popular someone or something is: The government's approval/popularity rating sank to an all-time low. Synonyms\nappraisal\nassessment\nestimation (OPINION)\nevaluation\njudgment (DECIDE) ratings C2 [ plural ]\na list of television and radio programmes showing how popular they are: Advertisers are interested in ratings.\nSee more\nMore examplesFewer examplesHe was refused a mortgage because he had a bad credit rating.The party's rating in the opinion polls has slumped since Smith became leader.The new car has been given an excellent safety rating.Their nearest school has a very poor rating compared to others in the area.The department was awarded the highest rating after the inspection last year.\nSMART Vocabulary: related words and phrases\nJudgments and analyses\nanalysis\nanatomy\nappraisal\nappraisee\nassessment\ncognizable\nconstruction\nforensics\nimpact assessment\nimpact statement\ninterpretation\njob evaluation\nnotice\nprognosticate\nprognostication\nrap\nre-evaluation\nre-review\nrestudy\nverdict\nSee more results »\nAdd to word list\nAdd to word list\nA rating is a record of the number of people who watch or listen to a particular broadcast: Advertisers are interested in ratings.\nAdd to word list\nAdd to word list\na measurement of the quality or success of something, or of particular features it has, especially when compared with other things of the same type: get/receive/be awarded a rating The game was awarded a five-star rating by Gamer magazine.approval/popularity rating The president's approval rating was around 60%. a high/excellent/positive rating a low/poor ratinga 30%/9 point/3-star, etc. rating Consumers gave the product a 7.5 point rating on a scale of 1 to 10.a rating scale/system There is currently a voluntary rating system in place for violence on TV.\nFINANCE, STOCK MARKET a calculation by a ratings agency of the level of risk of an investment or loan: cut/downgrade/lower a rating raise/lift/upgrade a rating have/maintain a rating A policy condition is that the securities must be rated in the four top rating categories by S&amp;P or Moody's.\nINSURANCE a calculation by an insurance company of how much someone should pay for insurance, based on the level of risk involved: The proposed change in the city's flood insurance rating could reduce premiums by 5%. calculate/have/receive a rating\nCOMMERCE, ENVIRONMENT a number or letter showing how powerful something such as a piece of electrical equipment is, how much electricity it uses, etc. so that consumers can compare products: These green mortgages are available only to those buying a new home with a high energy efficiency rating.\nratings [ plural ]\nCOMMUNICATIONS, MARKETING figures that show how many people watch or listen to a television or radio programme: good/high ratings Advertisers seek out the programmes with the highest ratings for their main campaigns. low/poor ratings declining/improving ratings ratings go up/downratings battle/war The two channels are locked in a ratings battle. See also\nAAA\naverage audience rating\nBest's rating\nbond rating noun\nbuy rating\ncredit rating\ndebt rating\nfleet rating\nhold rating\nsecurity rating\nView all\nsell rating\nStandard and Poor's"}