{"id":301350,"name":"ration","type":"noun","us_sound":"ˈræʃ.ən","us_link":"../audio/r/ration.mp3","uk_sound":"ˈræʃ.ən","uk_link":"../audio/r/ukrasp_021.mp3","content":"Add to word list\nAdd to word list\na limited amount of something that one person is allowed to have, especially when there is not much of it available: During the war, no one was allowed more than their ration of food, clothing and fuel. rations [ plural ]\nthe total amount of food that is given to someone to be eaten during a particular activity and in a particular period of time, especially an amount given to soldiers when they are fighting: Rations were frequently allocated in public to ensure fairness.\nSee more\nan amount of something that you would expect to have: We've had more than our ration of problems recently.\nSMART Vocabulary: related words and phrases\nGeneral words for size and amount\n-sized\namount\nbulk\ncontent\nelement\nextent\nfootprint\ngood things come in small packages idiom\nlevel\nload\nlot\nmeasure\nmuch\norder\npercent\nquantity\nquota\nsmall-scale\nso much idiom\nstrength\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSharing\nto limit the amount of a particular thing that someone is allowed to have: Do you remember when petrol was rationed to five gallons a week? My children would watch television all day long, but I ration it.\nSMART Vocabulary: related words and phrases\nLimiting and restricting\nanti-libertarian\nboundary\nbox someone/something in\nchain\nchain someone to something\ncripplingly\ncrowd\ncurb\ncurtail\ncurtailment\nkeep (herself) to herself idiom\nkeep something down\nlimit\nlimitation\nlimitative\nstranglehold\nstunt\nsuffocatingly\ntempered\ntie someone down\nSee more results »\nPhrasal verb\nration something out\nAdd to word list\nAdd to word list\na limited amount (of something) that one person is allowed to have, esp. when there is not much of it available: Rations of rice were distributed to the refugees. ration verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈræʃ·ən, ˈreɪ·ʃən/\nEven their clothing is rationed. rationing noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈræʃ·ə·nɪŋ, ˈreɪ·ʃə-/\nfood rationing\nAdd to word list\nAdd to word list\na limited amount of something that you are allowed to have when there is not much of it available: Each family has to make do with a weekly ration of gas. With ranchers reducing their herds because of high-priced grain rations, some see retail beef prices jumping more than 10% next year.\nto control the supply of something when there is not much of it available, or to limit the amount of a particular thing that someone is allowed to have: ration sth to sth The garage was forced to ration gas to 20 litres per person.ration sb to sth During the war, people were rationed to just 50 grams of meat a week. rationing noun [ U ]\nthe rationing of credit during the credit crunch Phrasal verb\nration sth out"}