{"id":301371,"name":"rationalization","type":"noun","us_sound":"ˌræʃ.ən.əl.əˈzeɪ.ʃən","us_link":"../audio/r/eus73833.mp3","uk_sound":"ˌræʃ.ən.əl.aɪˈzeɪ.ʃən","uk_link":"../audio/r/ukrasp_028.mp3","content":"rationalization noun [C or U]\n(FINDING REASONS)\nAdd to word list\nAdd to word list\nan attempt to find reasons for behaviour, decisions, etc., especially your own: This is just a convenient rationalization for something you wanted to do anyway. Entitlement may include rationalization of negative behaviour.\nMore examplesFewer examplesIn spite of my rationalization of her behaviour, she did succeed in shaming me.Avoid self-serving rationalizations about questionable behaviour.The rationalizations minimizing this reality and their dangers should be reconsidered and argued more thoughtfully.\nSMART Vocabulary: related words and phrases\nReasons and explanations\nalibi\namplification\nargumentation\nascribe something to something\nascription\nascriptive\ncase\ndefinition\nexplanation\nexplication\nexposition\nextenuating\nextenuation\nflack\nkey\nreason\ntalk\nwarrantable\nwarrantably\nwherefores\nSee more results »\nrationalization noun [C or U]\n(MAKING EFFECTIVE)\nthe process of making a company, way of working, etc. more effective, usually by combining or stopping particular activities: We feel the rationalization of manufacturing and distribution under a single management is overdue. Fierce competition among large numbers of firms hindered modernization and rationalization of the industry.\nMore examplesFewer examplesThe gap between skilled and unskilled has decreased, as a result of capitalist rationalization. After a period of rationalisation we are now in good shape to take advantage of improving markets.They had plenty of experience of Landless's quite ruthless industrial rationalisation programmes.\nSMART Vocabulary: related words and phrases\nManaging and organizing\nadmin\nadminister\nadministration\nanti-bureaucracy\nbronze command\nfixer\nflabbily\nget up\nget your act together idiom\ngold command\nmobilize\nmount\npaperwork\nparty planner\nparty planning\nproject-manage\nrationalize\nrecentralization\nscrum\nwieldy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking things better\nSee\nrationalize"}