{"id":301685,"name":"re","type":"preposition","us_sound":"riː","us_link":"../audio/r/ray.mp3","uk_sound":"riː","uk_link":"../audio/r/ukrayon013.mp3","content":"Add to word list\nAdd to word list\nformal (especially in business letters) about; on the subject of: Re your communication of 15 February ...\nused in the subject line of an email when it is a reply to another email, followed by the subject of the original message: Re: invoice\nSMART Vocabulary: related words and phrases\nRegarding and concerning\nabout\napply to\napropos\napropos of something\naround\nas\ncover\ndeal with someone\ndepartment\nhereof\nin respect of something idiom\nin the brain/looks department idiom\ninto\nrange\nrelate\nsay\nthereof\ntowards\nvis-à-vis\nwise\nSee more results »\nthe second note of the sol-fa musical scale\nSMART Vocabulary: related words and phrases\nNotes of the musical scale\nB, b\nC, c\nD, d\ndoh\nE, e\nflat\nhigh doh\nla\nlah\nmajor\nmi\nmiddle C\nminor\nnote\nregister\nsoh\nsol\nsol-fa\nte\nti\nSee more results »\nused to add the meaning \"do again\", especially to verbs: rebuild remarry reusable\nreturning something to its original state: the regreening of our country (= making it green again by planting trees, allowing grass to grow, etc.)\nSMART Vocabulary: related words and phrases\nRepeating an action\nbe at it again idiom\nbe/sound like a broken record idiom\nbinge-watch\nbingeable\nblitz\ndrill\nhere we go (again) idiom\niteration\niterative\niteratively\nkeep on doing something\nkeep your eye in idiom\nrepetitive\nrepetitively\nreplicable\nreprise\nreproduce\nreproducible\nreproducibly\nrewrite\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRestoring and reviving\nshort form of are: You're late.\nAdd to word list\nAdd to word list\n(esp. in business letters) about; on the subject of: Re your memo July 10, I have indeed received the order.\nused esp. with verbs to add the meaning \"do again\": reactivate; reactivation; reassess; reassessment; reassign; recommence; re-create; redistribute; redistribution; redraft; reevaluate; reevaluation; refocus; reformulate; reformulation; reinterpret; reinterpretation; reinvest; reinvestment; reoccur; reorient; reorientation\nAdd to word list\nAdd to word list\nabbreviation for\nreinsurance : used in the names of companies that deal with reinsurance: According to its website, Swiss Re is a leading risk carrier and worldwide provider of financial services.\nCOMMUNICATIONS, INTERNET used in the subject line of an email to show that you are replying to an email that was sent to you with the same title. If you reply to an email, this word is automatically added to the reply the person you are emailing receives: The email was titled \"Re: Our Meeting Next Week.\"\nCOMMUNICATIONS used in business letters to refer to a letter or something in a letter you have received and are replying to: Re your communication of 15 February...\nadded in front of words to mean \"again\": rebranding rebuild reusable"}