{"id":301779,"name":"reached","type":"verb","us_sound":"riːtʃ","us_link":"../audio/r/reach.mp3","uk_sound":"riːtʃ","uk_link":"../audio/r/ukrayon014.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nreach\nreach verb\n(ARRIVE)\nB1 [ T ] to arrive at a place, especially after spending a long time or a lot of effort travelling: We won't reach Miami until five or six o'clock. They finally reached the coast after five weeks sailing. News of his accident had only just reached us.\nThesaurus: synonyms, antonyms, and examples\nto arrive at a placearriveAfter a long day's travel, we finally arrived.get What time did you get there?reachWe won't reach Miami until evening.makeWe made it to the airport just in time for our flight.get inThe train gets in at 6:40 p.m.turn upShe turned up at my house late one night.\nSee more results »\nreach a decision, agreement, conclusion, etc.\nB2 to make a decision, agreement, etc. about something: She reached the conclusion that there was no more she could do. We'll inform you when a decision has been reached. The jury took four days to reach a verdict.\nMore examplesFewer examplesThe wind mocked their attempts to reach the shore by pushing the boat further and further out to sea.It now seems unlikely that the Democratic nominee will reach the Oval Office.By the time they reached the summit they were exhausted.The police were certainly quick off the mark reaching the scene of the accident.The hurricane will probably have spent most of its force by the time it reaches the northern parts of the country.\nSMART Vocabulary: related words and phrases\nArriving, entering and invading\nannex\nannexation\nbe on the scene idiom\nbeen\nbreak\nbreak someone in\nhit\ningress\ninterloper\nintrude\nintrusion\ninvade\njump\nrock up\nroll up! idiom\nscene\nset foot in somewhere idiom\nshow up\ntrespass\nturn\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccepting & agreeing\nreach verb\n(LEVEL)\nB2 [ T ] to get to a particular level, especially a high one: The temperature is expected to reach 30°C today. He's just reached the grand old age of 95. I've reached the point where I'm not going to put up with her criticisms of me any more. Synonyms\naccomplish\nachieve\nattain formal\nfulfil (MAKE HAPPEN) mainly UK\nrealize (ACHIEVE)\nThesaurus: synonyms, antonyms, and examples\nto achieve somethingachieveAfter years of rejection, she finally achieved success on the big screen.fulfilI fulfilled my dreams of becoming a marine biologist.realizeUK There was nothing to prevent her from realising her ambitions.come trueI worked so hard to be a doctor, and now my dream has come true.accomplishThese goals will be extremely hard to accomplish.attainAfter years of struggle, the nation attained independence.\nSee more results »\nMore examplesFewer examplesShe will inherit her father's estate when she reaches her majority.People in Britain legally reach adulthood at 18.This car can reach 60mph from a standing start in less than six seconds.The problem of inflation has reached epic proportions.The song reached No. 32 in the pop charts.\nSMART Vocabulary: related words and phrases\nSucceeding, achieving and fulfilling\nA game\naccomplish\nachieve\nacquit\nactualize\nbear\nget to/reach first base idiom\ngo (like/down) a bomb idiom\ngo far idiom\ngo from strength to strength idiom\ngo into orbit idiom\nkill\npan\nrise\nscale the heights idiom\nscrape through (something)\nsew something up\nslam dunk\nsmash it idiom\nstand out\nSee more results »\nreach verb\n(STRETCH)\nB2 [ I or T ] to stretch out your arm in order to get or touch something: She's grown so tall that she can reach the door handle now. He reached for the phone and knocked over a glass. The child reached down/out/over and picked up the kitten. He reached his hand out for the money. [ + two objects ] UK Can you reach me (down) that book?\n[ I or T ] If an object reaches something, the top or bottom of it touches that thing: The ladder won't quite reach the top of the wall. She was wearing a dress that reached (to) her ankles.\nMore examplesFewer examplesThe flex on this iron isn't long enough to reach the socket.She poured the cream until it reached the brim.That coat reaches your ankles, shorty!I can't reach my zip - could you unfasten it, please?If I stand on the tips of my toes, I can just reach the top shelf.\nSMART Vocabulary: related words and phrases\nStretching the body\nakimbo\ncrane\ndistend\ndistension\nextend\noutstretched\nreach\nspread\nstretch\nstretch (yourself) out\nYou can also find related words, phrases, and synonyms in the topics:\nArriving, entering and invading\nreach verb\n(COMMUNICATE)\nB2 [ T ] to communicate with someone in a different place, especially by phone or email: I've been trying to reach you on the phone all day.\n[ T ] to understand and communicate with someone: He's a strange child and his teachers find it difficult to reach him.\nSMART Vocabulary: related words and phrases\nCommunicating & keeping in touch\nahold\nbackchannel\nbell\ncall back\ncall someone up\ncatchup\ncommunication\ncommunicative\ncommunicator\ndrop\nhear\nliaison\npick\npick someone/something up\npick up the phone idiom\npropagation\nradio silence\nrapporteur\nreach\ntransmit\nSee more results »\nIdiom\nreach for the starsPhrasal verb\nreach out (to someone)"}