{"id":301813,"name":"reaction","type":"noun","us_sound":"riˈæk.ʃən","us_link":"../audio/r/reaction.mp3","uk_sound":"riˈæk.ʃən","uk_link":"../audio/r/ukrayon017.mp3","content":"reaction noun\n(BEHAVIOUR)\nAdd to word list\nAdd to word list\nB2 [ C ] behaviour, a feeling or an action that is a direct result of something else: I love to watch people's reactions when I say who I am. There has been an immediate/widespread/hostile reaction against the government's proposed tax increases. Reactions to the proposal so far have been adverse/favourable/mixed.\nThesaurus: synonyms, antonyms, and examples\nan answeranswerWe're still waiting for an answer.reply \"How far?\" asked Nigel. \"Not far,\" was the mumbled reply.answer105 is the correct answer.responseThank you for your swift response.reactionWhat was her reaction when she was asked for her resignation?retortAlan snapped back with a witty retort.\nSee more results »\nreactions [ plural ]\nsomeone's ability to act quickly when something happens: You need to have quick reactions to play these computer games.\n[ C usually singular ] a type of behaviour or opinion that is produced or held with the intention of being different from something else: Her left-wing views are a reaction against the conservatism of her parents.\nMore examplesFewer examplesThe protests are a delayed reaction to last week's announcement.The committee kept the results of the survey to itself, fearing a bad public reaction.There has been a mixed reaction to the changes.Young people's reactions to world events are often at variance with those of their parents.The proposal has received a generally favourable reaction.\nSMART Vocabulary: related words and phrases\nReacting and responding\nact on something\nadverse reaction\nbacklash\nbat\nbat something back\nbite\nnon-responsive\non your toes idiom\noverreact\noverreaction\npearl-clutching\nreception\nrespond\nstrike while the iron is hot idiom\nsupersensitivity\nticklish\nticklishly\ntoe\nultra-sensitive\nwake\nSee more results »\nreaction noun\n(UNPLEASANT EFFECT)\nB2 [ C ] an unpleasant effect resulting from eating particular things or taking particular drugs: Some people have an allergic reaction to shellfish.\nSMART Vocabulary: related words and phrases\nPoisoning and allergy\nallergen\nallergenic\nallergic\nanaphylactic\nanaphylactic shock\nanaphylaxis\nanimatedly\nhypersensitivity\nhypoallergenic\nintolerance\nintolerant\njimson weed\nlactose intolerance\nlisteriosis\npoisoner\npoisoning\ntoxicology\nvenom\nvenomous\nWarfarin\nSee more results »\nreaction noun\n(IN SCIENCE)\n[ C or U ]\n&#160; chemistry an occasion when two or more substances react with and change each other: a chemical reaction\nSMART Vocabulary: related words and phrases\nPhysical & chemical processes\nabsorbable\nabsorptive\nabsorptive capacity\nabsorptivity\nacidification\ndegradable\nexcitability\nexcitation\nexcite\nexergonic\nexothermic\nexothermic reaction\nimpregnate\nre-emission\nre-emit\nreabsorb\nreact\nreboil\nscald\nvaporize\nSee more results »\nreaction noun\n(NO CHANGE)\n[ U ] disapproving the belief or principle that there should be no social or political change, and the attempt to stop such change from happening: We must not allow reaction to stand in the way of progress.\nSMART Vocabulary: related words and phrases\nCustom, tradition & conformity\nAmericanization\nanti-classical\nanti-conventional\nanti-institutional\nanti-traditional\nconventionalized\nconventionally\ncounter-tradition\ncrowd\ncustom\nmores\nmulticultural\nmulticulturalism\nmulticulturally\nnon-classical\ntraditionalist\ntraditionally\nultra-conservatism\nultra-conservative\nultra-traditional\nSee more results »\nAdd to word list\nAdd to word list\nbehavior, a feeling, or an action that is a direct result of something else: My initial reaction was to call off the party. Senator, what is your reaction to the proposal to cut Medicare benefits?\nA reaction is also a change that opposes a previous opinion or behavior: His art is a reaction against photographic realism.\nbiology A reaction can also be an unpleasant effect on the body resulting from something eaten or taken, such as a drug.\nchemistry A chemical reaction is the change that happens when two or more substances are mixed with each other.\nAdd to word list\nAdd to word list\nthe way that something happens, or that someone does something, as a result of something else: reaction to sth We've seen little market reaction to the latest inflation figures.reaction against sth There was an immediate reaction against the proposed tax increases."}