{"id":301774,"name":"reach","type":"verb","us_sound":"riːtʃ","us_link":"../audio/r/reach.mp3","uk_sound":"riːtʃ","uk_link":"../audio/r/ukrayon014.mp3","content":"reach verb\n(ARRIVE)\nAdd to word list\nAdd to word list\nB1 [ T ] to arrive at a place, especially after spending a long time or a lot of effort travelling: We won't reach Miami until five or six o'clock. They finally reached the coast after five weeks sailing. News of his accident had only just reached us.\nThesaurus: synonyms, antonyms, and examples\nto arrive at a placearriveAfter a long day's travel, we finally arrived.get What time did you get there?reachWe won't reach Miami until evening.makeWe made it to the airport just in time for our flight.get inThe train gets in at 6:40 p.m.turn upShe turned up at my house late one night.\nSee more results »\nreach a decision, agreement, conclusion, etc.\nB2 to make a decision, agreement, etc. about something: She reached the conclusion that there was no more she could do.\nSee more\nMore examplesFewer examplesThe wind mocked their attempts to reach the shore by pushing the boat further and further out to sea.It now seems unlikely that the Democratic nominee will reach the Oval Office.By the time they reached the summit they were exhausted.The police were certainly quick off the mark reaching the scene of the accident.The hurricane will probably have spent most of its force by the time it reaches the northern parts of the country.\nSMART Vocabulary: related words and phrases\nArriving, entering and invading\nannex\nannexation\nbe on the scene idiom\nbeen\nbreak\nbreak someone in\nhit\ningress\ninterloper\nintrude\nintrusion\ninvade\njump\nland\nrock up\nroll up! idiom\nset foot in somewhere idiom\nshow up\ntrespass\nturn\nSee more results »\nreach verb\n(LEVEL)\nB2 [ T ] to get to a particular level, especially a high one: The temperature is expected to reach 30°C today. He's just reached the grand old age of 95. I've reached the point where I'm not going to put up with her criticisms of me any more. Synonyms\naccomplish\nachieve\nattain formal\nfulfil (MAKE HAPPEN) mainly UK\nrealize (ACHIEVE)\nThesaurus: synonyms, antonyms, and examples\nto achieve somethingachieveAfter years of rejection, she finally achieved success on the big screen.fulfilI fulfilled my dreams of becoming a marine biologist.realizeUK There was nothing to prevent her from realising her ambitions.come trueI worked so hard to be a doctor, and now my dream has come true.accomplishThese goals will be extremely hard to accomplish.attainAfter years of struggle, the nation attained independence.\nSee more results »\nMore examplesFewer examplesShe will inherit her father's estate when she reaches her majority.People in Britain legally reach adulthood at 18.This car can reach 60mph from a standing start in less than six seconds.The problem of inflation has reached epic proportions.The song reached No. 32 in the pop charts.\nSMART Vocabulary: related words and phrases\nSucceeding, achieving and fulfilling\nA game\naccomplish\nachieve\nacquit\nactualize\nbear\nget to/reach first base idiom\ngo (like/down) a bomb idiom\ngo far idiom\ngo from strength to strength idiom\ngo into orbit idiom\nkill\npan\nrise\nscale the heights idiom\nscrape through (something)\nsew something up\nslam dunk\nsmash it idiom\nstand out\nSee more results »\nreach verb\n(STRETCH)\nB2 [ I or T ] to stretch out your arm in order to get or touch something: She's grown so tall that she can reach the door handle now. He reached for the phone and knocked over a glass. The child reached down/out/over and picked up the kitten. He reached his hand out for the money. [ + two objects ] UK Can you reach me (down) that book?\n[ I or T ] If an object reaches something, the top or bottom of it touches that thing: The ladder won't quite reach the top of the wall. She was wearing a dress that reached (to) her ankles.\nMore examplesFewer examplesThe flex on this iron isn't long enough to reach the socket.She poured the cream until it reached the brim.That coat reaches your ankles, shorty!I can't reach my zip - could you unfasten it, please?If I stand on the tips of my toes, I can just reach the top shelf.\nSMART Vocabulary: related words and phrases\nStretching the body\nakimbo\ncrane\ndistend\ndistension\nextend\noutstretched\nspread\nstretch\nstretch (yourself) out\nYou can also find related words, phrases, and synonyms in the topics:\nArriving, entering and invading\nreach verb\n(COMMUNICATE)\nB2 [ T ] to communicate with someone in a different place, especially by phone or email: I've been trying to reach you on the phone all day.\n[ T ] to understand and communicate with someone: He's a strange child and his teachers find it difficult to reach him.\nSMART Vocabulary: related words and phrases\nCommunicating & keeping in touch\nahold\napproach\nbackchannel\nbell\ncall back\ncall someone up\ncatchup\ncommunication\ncommunicative\ncommunicator\ndrop\ninteractive\npeople skills\npick\npick someone/something up\npropagation\nradio silence\nring\ntinkle\nvia\nSee more results »\nIdiom\nreach for the starsPhrasal verb\nreach out (to someone)\nreach noun\n(DISTANCE)\nB2 [ U ] Your reach is the distance within which you can stretch out your arm and touch something: I like to keep a notebook and pencil within (arm's) reach. The top shelf is within/out of (his) reach. Make sure that you keep all dangerous substances out of the reach of the children.\nB2 [ U ] the distance that can be travelled, especially easily: We live within (easy) reach of the station.\n[ S ] the length of your arm when you stretch it out: You've got quite a long reach - can you get that box down from the top shelf for me?\n[ C usually singular ] an act of stretching out your arm: He made a sudden reach for his gun.\nMore examplesFewer examplesChocolate and sweets are kept on a high shelf out of the reach of the children.I have my book and my paper and everything else that I need within arm's reach.Can you get that magazine down for me? It's out of my reach.Everything that I use for work is within reach.We're within easy reach of the shops here.\nSMART Vocabulary: related words and phrases\nMeasurements of length & distance\nbreadth\ncm\ndecimetre\nfathom\nft\nin\nkilometre\nkm\nlinear\nmicron\nmile\nmm\nmpg\nnautical mile\nscalar\nsq.\nsquare\nthick\nwidth\nyard\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStretching the body\nreach noun\n(LIMIT)\nC2 [ S or U ] the limit within which someone can achieve something: An expensive trip like that would be completely beyond/out of (my) reach (= I would not have enough money to pay for it). After years of saving, the car was at last within (her) reach (= she had enough money to pay for it).\nThesaurus: synonyms, antonyms, and examples\nto be expensivecost a (small) fortuneThis trip cost a fortune.cost an arm and a legDrinks at that club cost an arm and a leg.be daylight robberyWhat they're charging to get in is daylight robbery.be highway robbery$50 for two drinks? That's highway robbery!be a rip-off£200 for a concert ticket is a total rip-off.be prohibitively expensiveThe cost of textbooks alone makes schooling prohibitively expensive for many.\nSee more results »\nSMART Vocabulary: related words and phrases\nAchievable\n-ible\nable\naccomplishable\nachievable\nattainable\ndoable\nfeasibility study\nfeasible\nfeasibly\nhumanly\nmanageably\nmight\nposs\npossible\npracticability\npracticable\npractical\nrunning\nviably\nvincible\nSee more results »\nreach noun\n(PART)\nreaches [ plural ]\na part of a river or part of an area of land: upper reaches of The expedition set out for the upper reaches of the Amazon.\nthe highest or lowest levels of an organization: upper reaches of The news has shocked the upper reaches of the government.\nSee more Idiom\na reach of the imagination\nreach verb\n(ARRIVE)\nAdd to word list\nAdd to word list\n[ T ] to arrive somewhere: The storm continues to move west and is expected to reach the east coast of Florida tomorrow.\nreach verb\n(BECOME HIGHER)\n[ T ] to become higher or greater so as to equal a particular level: The temperature is expected to reach 90° today. The government fears unemployment will reach 10%.\n[ T ] To reach is also to develop to a stage in order to achieve a particular result: We hope to reach agreement soon on the new trade policy. They reached the conclusion that nothing further could be done.\nreach verb\n(STRETCH)\n[ I/T ] to stretch out your arm to its full length in order to take or touch something: [ T ] Our little girl isn’t tall enough to reach the light switches. [ I always + adv/prep ] The receptionist reached for the phone. [ I always + adv/prep ] She reached across the table and took his hand.\n[ I/T ] If an object reaches something, the top or bottom of it touches that thing: [ T ] The ladder won’t quite reach the roof.\nreach verb\n(COMMUNICATE)\n[ T ] to communicate with someone in another place, usually by telephone: I’ve been trying to reach you all afternoon, but your phone was busy. Phrasal verb\nreach out to someone\nreach noun [U]\n(STRETCH)\nthe distance to which you can put out your arm and touch something: All medicines should be kept out of the reach of children.\nAdd to word list\nAdd to word list\nto get to a particular high or higher level: Profits are expected to reach $11.2 billion in the hotel industry next year.reach a record/an all-time high Stocks reached a record 10-month high.\nMARKETING to succeed in advertising or selling a product or service to a particular group of people: The internet is a major tool for reaching new customers.\nto achieve something after careful thought or discussion: reach a conclusion/decision reach a compromise/deal\nreach (an) agreement on sth\nto make an agreement after careful thought or discussion: The company is understood to have reached an agreement with its principal backers. The four leaders reached agreement on an $820 million state construction program.\nto communicate with someone in a different place, especially by phone or email: He's out of the office right now, but I'll try and reach him on his cellphone. If you can't get through on the phone, you can always reach us by email.\n[ S ]\n&#160; MARKETING the number of people that a company is able to advertise or sell a product or service to: a broad/global/international reach advertising/business/market reach The company's reach has expanded from 170 million users last year to more than 500 million this year.expand/extend/increase your reach The merger will double the size of the company and extend its reach into larger markets in six additional states.\nreaches [ plural ]\nthe highest or lowest levels of an organization or system: the higher/lower/upper reaches of sth Many shares on the lower reaches of the stock market have enjoyed a buoyant run.\nbeyond/out of (sb's) reach (also beyond/out of the reach of sb)\nthat someone is not able to get or buy: Now even small starter homes are priced out of the reach of low-income working people.\nwithin (sb's) reach (also within the reach of sb)\nthat someone is able to get or buy: She felt that the job she had always wanted was finally within reach. A high percentage of these homes are within financial reach of moderate-income families."}