{"id":301807,"name":"react","type":"verb","us_sound":"riˈækt","us_link":"../audio/r/react.mp3","uk_sound":"riˈækt","uk_link":"../audio/r/ukrayon015.mp3","content":"Add to word list\nAdd to word list\nB2 to act in a particular way as a direct result of something else: She slapped him and called him names, but he didn't react. The judge reacted angrily to the suggestion that it hadn't been a fair trial. Many people react (badly) to (= are made ill by) penicillin.\nThesaurus: synonyms, antonyms, and examples\nto answer someoneanswer\"Thank you\", she answered.replyThe man replied that something was missing.respondWe aim to respond to all enquiries within five working days.reactHe reacted positively to the proposal.get back toI'll look into it and get back to you.explain\"What happened?\" she asked. - \"There's no time to explain!\" he said.\nSee more results »\nchemistry to change in a physical or chemical way when put with another substance: Potassium reacts with water.\nMore examplesFewer examplesIt's difficult to gauge how they'll react.She slapped him and called him names, but he didn't react.The prime minister reacted angrily to claims that he had lied to the House of Commons.She reacted surprisingly calmly to the news of his death.The government was very slow to react to the problem.\nSMART Vocabulary: related words and phrases\nReacting and responding\nact on something\nadverse reaction\nbacklash\nbat\nbat something back\nbite\nnon-responsive\non your toes idiom\noverreact\noverreaction\npearl-clutching\nreaction\nrespond\nsupersensitivity\nticklish\nticklishly\ntoe\nultra-sensitive\nunsensitized\nwake\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysical & chemical processes\nPhrasal verb\nreact against something\nAdd to word list\nAdd to word list\nto act in a particular way as a direct result of something else: How do you think she’ll react when she hears the news? The State Department reacted favorably to the proposal.\nchemistry If substances react, they change when brought together.\nAdd to word list\nAdd to word list\nif prices or markets react, their levels rise or fall as a direct result of something that happens: react to sth How did bank share prices react to last year's financial results?react badly/favourably/positively The market reacted positively to last week's news of the £53.7m bid.react with sth The shares reacted with a 22p fall to 684p.\nto behave in a particular way as a direct result of something else: react calmly/cautiously react quickly/stronglyreact to sth The union reacted angrily to the threat of job losses.react by doing sth China has reacted to reports of unsafe products by cracking down on its own manufacturers."}