{"id":301881,"name":"ready","type":"adjective","us_sound":"ˈred.i","us_link":"../audio/r/ready.mp3","uk_sound":"ˈred.i","uk_link":"../audio/r/ukreadi006.mp3","content":"ready adjective\n(PREPARED)\nAdd to word list\nAdd to word list\nA1 prepared and suitable for fast activity: [ + to infinitive ] Are you ready to leave?ready to Are you ready to order, Madam?ready when you are Okay, Evie, ready when you are (= I am ready to do what we have arranged). Dinner's ready! Are you ready? Hurry up - we're late.get ready We're leaving at eight o'clock, so you've got half an hour to get ready.ready for The army are said to be ready for action.be made/got ready for something The concert hall was made/got ready (= prepared) for the performance. ready and waiting\nwaiting and prepared to act: Secret information allowed the police to be ready and waiting when the robbers came out of the bank.\nSee more\nMore examplesFewer examplesIf you're near the garage, could you check to see if the car's ready?Well, he wants the report ready by tomorrow but I can always fob him off with some excuse.She had to get the kids ready for school.The way things are, I'll never have this ready by June.The emergency services are ready to spring into action at a moment's notice.\nSMART Vocabulary: related words and phrases\nAvailable and accessible\naccessibility\naccessible\naccessibly\nat your command idiom\navailability\ndrop\nnon-restricted\nnothing\nobtainable\noffer\non call idiom\non demand idiom\non/about your person idiom\nrelease\nseason\nunfrozen\nunlock\nunobtainable\nup for grabs idiom\nvacant\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReady and willing\nready adjective\n(QUICK)\n[ before noun ] mainly approving quick with answers, jokes, solutions, etc.: He had a ready reply to every question.ready wit He was charming, with a ready wit (= the ability to quickly say clever and funny things).\nSMART Vocabulary: related words and phrases\nIntelligence\nacuity\nacumen\nagility\napt\naptness\nbrain\ngumption\nhighbrow\nhorse sense\nhyper-intelligent\nimaginative\npenetrative\nperceptively\npercipient\npercipiently\nperspicacious\nperspicaciously\nprofundity\nsubtlety\nwisdom\nSee more results »\nIdioms\nbe ready to do something\nbe ready to roll\nready to hand\nready, set, go!\nat the ready\nprepared to be used or to act immediately: He stood by the phone, pencil at the ready.\nSee more\nready adjective [not gradable]\n(PREPARED)\nAdd to word list\nAdd to word list\nprepared and suitable for action or use: Dinner is ready. The twins are getting ready for bed. [ + to infinitive ] I’m ready to go now. [ + to infinitive ] \"Are you ready to order?\" the waiter asked.\nready adjective [not gradable]\n(WILLING)\nwilling: My friends are always ready to help me out.\nready adjective [not gradable]\n(QUICK)\nquick, esp. in answering or in thinking of what to say: He had a ready reply to every question.\nAdd to word list\nAdd to word list\navailable to be used at any time: a ready source/supply\nready cash/money informal\nmoney that is available to be spent immediately: A demand by the court to pay the tax claim immediately would destroy the firm because it does not have enough ready cash."}