{"id":302004,"name":"real","type":"adjective","us_sound":"ˈriː.əl","us_link":"../audio/r/real.mp3","uk_sound":"rɪəl","uk_link":"../audio/r/ukreadi011.mp3","content":"real adjective\n(NOT IMAGINARY)\nAdd to word list\nAdd to word list\nA2 existing in fact and not imaginary: Assuring the patient that she has a real and not imaginary problem is the first step. There is a very real threat that he will lose his job. Synonym\ntrue (REAL)\nThesaurus: synonyms, antonyms, and examples\nexisting in factrealHe doesn't think climate change is real.trueHe had finally found true love.actualWe had 500 people register for the conference, but we won't have the actual number of attendees until afterwards.factualThere's no factual information at all in that email.\nSee more results »\nreal earnings, income, etc.\nthe value of earnings, etc. after the effect of rising prices is considered: Wages rose by 2.9 percent last year, but real earnings still fell by 1.3 percent.\nSee more in real terms\nafter considering things that affect what a number or amount really means, such as the effect of rising prices: Average earnings rose 5 percent in real terms after deducting income tax.\nSee more the real world\nthings as they really are, not as they exist in the imagination, in a story, on the internet, etc.: Over-protecting children does not equip them to deal with the real world.\nSee more\nMore examplesFewer examplesShe has a real feel for language.Was King Arthur a real or a legendary character?Politicians these days are more interested in playing to the gallery than exercising real influence on world events.Most modern kings and queens rule their countries only in a formal way, without real power.The main political parties are merely shadow-boxing, instead of tackling the real economic problems facing this country.\nSMART Vocabulary: related words and phrases\nTrue, real, false, and unreal\nactual\nactuality\nactually\nall that glitters is not gold idiom\nanger\nfalse flag\nfalsely\nfantastical\nfever dream\nfictional\nnon-material\nnon-realistic\nnot so much idiom\nnothing could be further from the truth idiom\nnothing could have been further from my mind/thoughts idiom\nunreal\nuntrue\nuntruly\nunverifiable\nurban myth\nSee more results »\nreal adjective\n(NOT FALSE)\nA2 [ before noun ] being what it appears to be and not false: real leather/fur Is that a toy gun or the real thing? Synonym\ngenuineOpposite\nfake\nThesaurus: synonyms, antonyms, and examples\nbeing what it appears to berealThat's not his real hair, is it? I thought it was a bad wig!genuineThe painting is a genuine Picasso.authenticThe clerk certified that the documents were authentic.honest-to-goodnessMy father is an honest-to-goodness door-to-door salesman.\nSee more results »\n[ before noun ] UK approving (especially of foods) produced using traditional methods and without artificial substances: The pub sells several kinds of real ale (= traditional beer). for real B2 informal\nreal, not pretended: I thought it was just a drill but apparently it was for real.\nSee more\nMore examplesFewer examplesYou can always tell a real bow tie from one that clips on.\"Is that real fur on your collar?\" \"Certainly not - I only wear fake fur.\"Those flowers aren't real - they're made of plastic.George Orwell was a pseudonym - his real name was Eric Blair.It turned out that he wasn't a real doctor at all - he was just a sham.\nSMART Vocabulary: related words and phrases\nTrue, real, false, and unreal\nactual\nactuality\nactually\nall that glitters is not gold idiom\nanger\nfalse flag\nfalsely\nfantastical\nfever dream\nfictional\nnon-material\nnon-realistic\nnot so much idiom\nnothing could be further from the truth idiom\nnothing could have been further from my mind/thoughts idiom\nunreal\nuntrue\nuntruly\nunverifiable\nurban myth\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nVarious qualities of food\nreal adjective\n(IMPORTANT)\nB2 [ before noun ] the most important; the main: The real difficulty was the language, because my children don't speak English. Novelty value may be a part of it, but the real reason people like our paper is that it speaks the truth.\nMore examplesFewer examplesKnowledge of languages is a real asset in this sort of work.My one real vice is chocolate.Creativity, ingenuity and flair are the songwriter's real talents.The real disease affecting the country is inflation.The proposal was dismissed as a diversionary tactic intended to distract attention from the real problems.\nSMART Vocabulary: related words and phrases\nIntelligence\nacuity\nacumen\nagility\napt\naptness\nbrain\ngumption\nhighbrow\nhorse sense\nhyper-intelligent\nimaginative\npenetrative\nperceptively\npercipient\npercipiently\nperspicacious\nperspicaciously\nprofundity\nwhip-smart\nwisdom\nSee more results »\nreal adjective\n(VERY GREAT)\nB2 [ before noun ] used to emphasize a noun: He's a real gentleman. She was a real help. It's a real nuisance.\nMore examplesFewer examplesI get a real kick out of owning my own car.She picked up some real bargains in the sale.You were right about Pete - he's a real troublemaker.You gave us a real scare when you fainted, you know.It was a real culture shock to find herself in London after living on a small island.\nSMART Vocabulary: related words and phrases\nBig and quite big\nappreciable\nbaronial\nbigly\nbloated\nboxcar\nbulky\nfullness\ngrandly\ngrowthy\nheaping\nhearty\nheftily\nhefty\npalatially\npumped\nrambling\nroomy\nroyal\nroyally\nthe bigger the better idiom\nSee more results »\nIdioms\nget real!\nis he/she for real?\nvery: I like this homemade lemonade, it's real good! It's real easy to do.\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabsolutely\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\nthe standard unit of money used in Brazil: The Brazilian real has gained 83 percent in value against the dollar. The dam is expected to cost 9.5 billion reals.\nMore examplesFewer examplesInstead of paying 5,000 reals in taxes, I just pay 2,500.A few reals can get you a statue of the Virgin of Aparecida.The dollar once bought four Brazilian reals.\nSMART Vocabulary: related words and phrases\nCurrencies\nAltcoin\nariary\nbimetallism\nbitcoin\nCDN\ndecimal currency\nECU\nescudo\nguilder\nkrone\nlira\nmulti-currency\nnon-convertible\nnon-dollar\npaisa\npieces of eight\nrouble\nrupiah\nshilling\ntraveller's cheque\nSee more results »\nreal adjective\n(ACTUAL)\nAdd to word list\nAdd to word list\nexisting in fact; not imaginary: There is a real possibility that he will lose his job. This is a true story about real people.\nreal adjective\n(NOT FALSE)\nbeing what it appears to be; genuine: Are those flowers real or fake? The chest of drawers is a real antique.\nreal adjective\n(VERY GREAT)\n[ not gradable ] very great or to a great degree: He’s a real gentleman. The current situation is a real mess.\nIdiom\nthe real McCoy\nreal adverb [not gradable]\n(VERY GREAT)\nin a very great way or to a great degree: I get cold real easy. It’s real nice to meet you.\nAdd to word list\nAdd to word list\nECONOMICS after considering the effects of inflation: Wages rose by 2.9% last year, but real earnings still fell by 1.3%. Japan's economy grew by 1.5% in real terms in the first quarter."}