{"id":302020,"name":"realignment","type":"noun","us_sound":"ˌriː.əˈlaɪn.mənt","us_link":"../audio/r/usravin021.mp3","uk_sound":"ˌriː.əˈlaɪn.mənt","uk_link":"../audio/r/ukreadi013.mp3","content":"realignment noun [C or U]\n(CHANGING IDEAS)\nAdd to word list\nAdd to word list\nthe process of changing your ideas or policies so that they are the same as those of another person or group; the result of this process: This war will inevitably lead to a realignment of/within European politics. The presidential election could play an important role in the state's realignment.\nMore examplesFewer examplesAmerican voters are in the middle of a major realignment.The company will not reveal the full scope of its manufacturing realignment for several months. The financial crisis is likely to cause a radical realignment of the global economy.\nSMART Vocabulary: related words and phrases\nBalance and imbalance\naccord with something\nalign\naxisymmetric\nbalance (something) out/up\nbalance of power\nharmonious\nharmonization\nharmonize\nharmony\nimbalance\nin accord with someone/something\nnon-symmetrical\nnonequilibrium\noff balance\non an even keel idiom\none man's loss is another man's gain idiom\nunbalance\nunharmonious\nwell balanced\nwell rounded\nSee more results »\nrealignment noun [C or U]\n(CHANGING POSITION)\nthe act of putting something, or the fact of being put, into a new or correct position, or an instance of this: She had undergone a nose job and a chin realignment. The plan called for the realignment of streets in the area.\nMore examplesFewer examplesShe underwent surgery for a pelvic realignment earlier this year.Even a relatively minor realignment of Greenwood Lake Turnpike has been immersed for years in the red tape of preliminary planning.The movement or realignment of a body part to its normal position is known as reduction.\nSMART Vocabulary: related words and phrases\nPlacing and positioning an object\n-based\nappose\naround\nchange something around\ncircle\nconsign\nfit\ngone\ninstall\nlie\nmanoeuvrable\npile (something) up\nplant\nreinstall\nreinstallation\nrelocate\nreorientate\nreorientation\ntranspose\ntransposition\nSee more results »\nSee\nrealign\nAdd to word list\nAdd to word list\nWORKPLACE the process of changing the way a company or organization works or does business: The realignment comes at a time of rapid change in the online advertising market, as advances in technology create new opportunities for advertising.realignment of sth They're making an effort to boost supply capacity amid a global realignment of the industry. organizational/management/internal realignments a major/radical/strategic realignment a realignment plan/process/exercise\nECONOMICS the process of changing the value of a currency compared to the value of other currencies or of changes in interest rates: Most people in Europe would be happier if the burden of the dollar's realignment were shared more evenly.realignment of sth Realignments of exchange rates can be potentially disruptive. currency realignment"}