{"id":302048,"name":"realize","type":"verb","us_sound":"ˈriː.ə.laɪz","us_link":"../audio/r/realize.mp3","uk_sound":"ˈrɪə.laɪz","uk_link":"../audio/r/ukreadi021.mp3","content":"realize verb\n(BECOME AWARE)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to understand a situation, sometimes suddenly: They didn't realize the danger they were in. [ + (that) ] \"Do you realize (that) this is the third time you've forgotten?\" she said angrily. [ + question word ] I realize how difficult it's going to be, but we must try. As he watched the TV show, he suddenly realized (that) he'd seen it before. \"You're standing on my foot.\" \"Sorry, I didn't realize.\"\nThesaurus: synonyms, antonyms, and examples\nto know factsknowI know you've been hiding something from me.be familiar withI'm very familiar with various accountancy software packages.informedit's important to keep the public informed about the steps they're taking.be apprised ofThe suspect will be apprised of their rights.realizeI realized that it was too late to stop them from finding out. have heard ofMost Americans have never heard of the California Air Resources Board.\nSee more results »\nMore examplesFewer examplesI didn't realize we had to write each answer on a new sheet of paper.If we carry this argument to its logical conclusion, we realize that further investment is not a good idea.As she drew closer I realized that I knew her.He looked somewhat shamefaced when he realized his mistake.Her voice tapered off as she realized everyone was listening.\nSMART Vocabulary: related words and phrases\nUnderstanding and comprehending\nappreciation for something\napprehend\napprehensible\napprehension\nastutely\nbear\ncolour\nhandle\nkeep someone up\nknow a hawk from a handsaw idiom\nknow the score idiom\nknow/see where someone is coming from idiom\nlatch\nscale\nto get a handle on something idiom\nto have a handle on something idiom\ntumble to something\ntune in\nuncomprehending\nunderstanding\nSee more results »\nrealize verb\n(ACHIEVE)\nC1 [ T ] to achieve something you were hoping for: Lots of money, a luxury house, a fast car - Danny had realized all his ambitions by the age of 25. Synonyms\naccomplish\nachieve\nattain formal\nfulfil\nreach\nThesaurus: synonyms, antonyms, and examples\nto achieve somethingachieveAfter years of rejection, she finally achieved success on the big screen.fulfilI fulfilled my dreams of becoming a marine biologist.realizeUK There was nothing to prevent her from realising her ambitions.come trueI worked so hard to be a doctor, and now my dream has come true.accomplishThese goals will be extremely hard to accomplish.attainAfter years of struggle, the nation attained independence.\nSee more results »\nsomeone's worst fears are realized [ T ]\nused for saying that something that someone was worrying about really happened: Ten years later her worst fears were realized.\nSee more\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nreattribute\nreawaken\nrender\nseed\nspark\nSee more results »\nrealize verb\n(MONEY)\nfinance &amp; economics\n&#160; specialized to be sold for a particular amount of money: The paintings are expected to realize $500,000 each. realize assets finance &amp; economics\n&#160; specialized\nto sell property in order to get some money: He had to realize all his assets to pay off his debts.\nSee more\nSMART Vocabulary: related words and phrases\nSelling\nauction\nBlack Friday\nbundle\nbundling\nchain of production\nconcession\noversell\npanic selling\npeddle\npile\npile it high and sell it cheap idiom\npoint of sale\nsell out\nsellout\nshift\nsoft sell\nsold\nspecial offer\nsting\nsupersize\nSee more results »\nrealize verb [T]\n(BECOME AWARE)\nAdd to word list\nAdd to word list\nto become aware of or understand a situation: He realized the store would be closing in a few minutes. [ + (that) clause ] Suddenly I realized (that) I was lost.\nrealize verb [T]\n(ACHIEVE)\nto achieve things you hope for or plan for: They finally realized their goal of buying a summer home.\nrealize a gain/profit/loss\nAdd to word list\nAdd to word list\nFINANCE to make or lose money when you sell something: They're trading on an extremely short-term basis and will sell once they can realize a profit. Following liquidation of the portfolio, the County realized a loss of approximately $600 million of its investment in the County Pools.\nFINANCE to make money or a profit from doing something: In the past 12 months, the firm has realized a double-digit increase in sales and return on capital.\nrealize assets\nFINANCE to sell assets for cash: They have three years to realise their assets and pay back as much of the debt as possible.\nto achieve something you planned to do or hoped for: To realize their full financial potential, firms need to retain the talent and know-how that made them successful in the first place."}