{"id":302060,"name":"really","type":"adverb","us_sound":"ˈriː.ə.li","us_link":"../audio/r/eus73854.mp3","uk_sound":"ˈrɪə.li","uk_link":"../audio/r/ukreadi022.mp3","content":"really adverb\n(NOT IMAGINARY)\nAdd to word list\nAdd to word list\nB1 in fact: He isn't really angry - he's just pretending. You don't really expect them to refuse, do you?\nA2 used to say that something is certain: Thank you, but I really couldn't eat another thing. He's really going to do it this time.\nMore examplesFewer examplesThe constraints of politeness wouldn't allow her to say what she really thought about his cooking.I don't really know how she got the job, but I suspect her mother's got contacts.He doesn't really mean it - he's just being contrary.A joke can be very revealing about what someone's really thinking.She's not really angry - it's just a put-on.\nSMART Vocabulary: related words and phrases\nTrue, real, false, and unreal\nactual\nactuality\nactually\nall that glitters is not gold idiom\nanger\nfalse flag\nfalsely\nfantastical\nfever dream\nfictional\nnon-material\nnon-realistic\nnot so much idiom\nnothing could be further from the truth idiom\nnothing could have been further from my mind/thoughts idiom\nunreal\nuntrue\nuntruly\nunverifiable\nurban myth\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCertainty\nreally adverb\n(VERY)\nA1 very or very much: She's really nice. This room is really hot. That's really interesting. It's a really difficult decision. \"Did you like it? Not really (= no).\"\nMore examplesFewer examplesSecurity checks have become really strict at the airport.I had to fill in this really complicated form.We had a really rough crossing - I was sick three times.Why do you have a down on him? I think he seems really nice.My dad was always really good at making up stories.\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabsolutely\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\nGrammar\nReallyWe use the adverb really when we want to emphasise something: …\nA2 used to express interest, surprise, or anger: \"I'm getting married to Fred.\" \"Really? When?\" \"She's promised to shave her head for charity.\" \"Really? Do you think she'll do it?\" \"He hasn't brought the book back.\" \"Oh, really! That's the second time I've asked him!\"\nMore examplesFewer examples\"She's leaving.\" \"Really?\"\"I find him very attractive.\" \"Really?\"\"I thought it was the best film I'd ever seen.\" \"Really?\"\"I think they've just sold their house.\" \"Really?\"\"I saw him in town yesterday.\" \"Really?\"\nSMART Vocabulary: related words and phrases\nLinguistics: interjections\naiyo\nattaboy\nattagirl\nauf Wiedersehen\naw shucks\ndoctor\neat your heart out idiom\nfigure\nmazel tov\nmore\nmore power to your elbow! idiom\nneed\nneed I say more? idiom\nperiod\nroll\nthe rest is history idiom\nyou should have seen/heard something/someone idiom\nyou the man! idiom\nyuk\nyum yum\nSee more results »\nGrammar\nReallyWe use the adverb really when we want to emphasise something: …\nreally adverb [not gradable]\n(SINCERELY)\nAdd to word list\nAdd to word list\nsincerely; truly: I’m really telling the truth this time. If she really cared about me, she would have called by now.\nreally adverb [not gradable]\n(VERY GREAT)\nextremely: That was a really good movie. This room is really hot.\nreally adverb [not gradable]\n(ACTUALLY)\nactually: What really happened that day? I just don’t know if we would really use it that much.\nreally exclamation\n(EXPRESSING SURPRISE)\nused to express interest, surprise, or annoyance: \"Debbie and I are getting married.\" \"Really? When?\" Really, Jen, you should have let me know sooner."}