{"id":302161,"name":"reap","type":"verb","us_sound":"riːp","us_link":"../audio/r/reap.mp3","uk_sound":"riːp","uk_link":"../audio/r/ukreadi028.mp3","content":"Add to word list\nAdd to word list\n[ I or T ] to cut and collect a grain crop: The serfs had to cultivate the lord's land, to make his hay, and reap and gather in his harvest. He cleared away the forest and, with his own hands, planted, sowed, and reaped.\nC2 [ T ] to get something, usually something good, as a result of your actions or other people's actions: She studied every evening and reaped the benefit at exam time. This investment in the athletes' training is already reaping dividends. Do poorer countries reap the rewards of technology developed in richer nations? We sold them most of their modern weapons and now we are reaping the bitter harvest.\nSMART Vocabulary: related words and phrases\nFarming - general words\nagroecology\nagroforestry\nbiodynamic\nbiodynamics\nfarming\ngrain\nharvest\nhomestead\nhydroponically\ninorganically\nlandrace\nmaincrop\nmonoculture\nterrace\nthe Agrarian Revolution\nuntillable\nuntilled\nvertical farming\nwater stress\nwater-stressed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSucceeding, achieving and fulfilling\nIdiom\nreap what you sow\nAdd to word list\nAdd to word list\nto obtain or receive something as a result of your own actions: [ T ] They didn’t reap any benefits from that deal.\nIf you reap a crop, you cut and collect it.\nAdd to word list\nAdd to word list\nto make a large amount of money or a big profit: Outside shareholders reaped 25% of the dividends generated.reap $35 million/£1.9 billion, etc. His company has reaped more than $800 million in federal contracts over the past five years. reap profits/returns/savingsreap benefits/rewards The Treasury has reaped rewards from rising house prices as its income from stamp duty and inheritance tax has soared.\nto get the advantages of a particular situation: reap (the) benefits/rewards For now, the drop in the dollar against the euro is allowing the U.S. economy to reap rewards. Vigorous participation in the European Union is vital if the country wants to reap the benefits of globalization.reap dividends The healthy eating program is reaping dividends in terms of promoting better awareness of health issues in the community."}