{"id":302367,"name":"reassignment","type":"noun","us_sound":"ˌriː.əˈsaɪn.mənt","us_link":"../audio/r/cdo1121usreas3606.mp3","uk_sound":"ˌriː.əˈsaɪn.mənt","uk_link":"../audio/r/cdo1121ukreas3639.mp3","content":"Add to word list\nAdd to word list\n(also gender reassignment, sex reassignment) a process, including medical operations, by which someone's body is changed to match their gender, or an instance of this: There are 1,000 male-to-female gender reassignments annually. Passports can be changed, but require a letter from a doctor stating that the individual has had reassignment surgery. See also\nsex reassignment surgery\ngender affirmation\ntransition noun\nthe act of giving someone a different job or position, or an example of this: Our department deals with the reassignment of personnel. Layoffs, early retirements and job reassignments will be used to meet teacher contract demands.\nthe act of giving a piece of work to a different person, or an example of this: The reassignment of security tasks from one department to another may seem bureaucratic.\nthe act of giving something to a different person, or sharing things out in a different way, or an example of this: Some in the international community are calling for a reassignment of aid priorities. This annex permits reassignments of ﬁnancial assets between categories.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nrebid\nregift\nregive\nregrant\nspare\nSee more results »\nAdd to word list\nAdd to word list\nWORKPLACE, HR the process of giving an employee a different job, or arranging for an employee to work in a different place: District officials say the reassignments are the result of a districtwide restructuring plan.reassignment to sth We have been assured that Ms Duprez's reassignment to the community-relations board is not linked to any wrongdoing."}