{"id":302317,"name":"reasonable","type":"adjective","us_sound":"ˈriː.zən.ə.bəl","us_link":"../audio/r/reasonable.mp3","uk_sound":"ˈriː.zən.ə.bəl","uk_link":"../audio/r/ukreapp010.mp3","content":"Add to word list\nAdd to word list\nB2 based on or using good judgment and therefore fair and practical: If you tell him what happened, I'm sure he'll understand - he's a reasonable man. He went free because the jury decided there was a reasonable doubt about his guilt.\nB1 acceptable: We had a reasonable journey. We have a strong team and a reasonable chance of winning the game.\nThesaurus: synonyms, antonyms, and examples\ngood enough but not excellentacceptableYour essay was acceptable, but I think you could have done better.reasonableThey have a reasonable chance of winning.adequateThe law provides adequate compensation for robbery victims.passableI speak passable Spanish. will doIt's not perfect, but it'll do.\nSee more results »\nB1 not too expensive: Tomatoes are very reasonable at this time of year.\nThesaurus: synonyms, antonyms, and examples\ncosting less money than expectedcheapThe meal was cheaper than I expected.affordableThere's very little affordable housing around here.inexpensiveThey sell inexpensive children's clothes.reasonableI thought the food was very reasonable.dirt cheapMost of the books they sell are dirt cheap.\nSee more results »\nMore examplesFewer examplesShe's earning a reasonable wage, but nothing to what she could if she was in the private sector.For good pizzas at a reasonable price they're unbeatable.The committee felt that newspaper coverage of the murder went beyond reasonable bounds.He reached a reasonable level of competence in his English.I'd like to think I'm open to any reasonable suggestion.\nSMART Vocabulary: related words and phrases\nWise and sensible\nbe a victory for common sense idiom\ncannily\ncanny\nclear-headed\nclear-headedly\njudicious\njudiciously\nlevel-headed\nlong-sightedness\nmethod\nresponsibility\nresponsible\nresponsibly\nright-minded\nsagacious\nvictory\nwell advised\nwily\nwisdom\nwise\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nQuite good, or not very good\nRelated word\nreasonableness\nAdd to word list\nAdd to word list\nbased on or using good judgment, and therefore fair and practical: Johnson was a reasonable man. It seemed like a reasonable question/explanation.\nReasonable also means not expensive: You can still get a good house for a very reasonable price.\nReasonable also means satisfactory or not bad: He could read French with reasonable fluency.\nAdd to word list\nAdd to word list\na reasonable price, value, or offer seems fair and not too expensive: In the context of current robust economic growth, these shares look reasonable value. a reasonable price/offer/deal\nsensible and fair: We believe that our audits provide a reasonable basis for the opinion expressed above. a reasonable approach/assumption/argumentit is reasonable to assume/expect/suppose, etc. According to financial experts, it is reasonable to expect rates to climb to 3% over the next year.it is reasonable that It seems reasonable that citizens should know whether their taxes are being spent wisely.\na reasonable amount, rate, etc. is neither too large nor too small: Most economists forecast reasonable growth in GDP next year. Overall pricing of products should reflect the cost of producing them, along with a reasonable profit margin for the business."}