{"id":302315,"name":"reason","type":"noun","us_sound":"ˈriː.zən","us_link":"../audio/r/reason.mp3","uk_sound":"ˈriː.zən","uk_link":"../audio/r/ukreapp009.mp3","content":"reason noun\n(EXPLANATION)\nAdd to word list\nAdd to word list\nA2 [ C or U ] the cause of an event or situation or something that provides an excuse or explanation: The reason for the disaster was engine failure, not human error. [ + question word ] The reason why grass is green was a mystery to the little boy. [ + (that) ] The reason (that) I'm calling is to ask a favour.not standard The reason I walked out was because I was bored. [ + to infinitive ] The police have (every good) reason to believe that he is guilty. She was furious, and with reason (= with good cause). For some reason/For reasons best known to himself (= for reasons no one else knows about) he's decided to leave his job.\nThesaurus: synonyms, antonyms, and examples\nthe cause of somethingreasonI frankly don’t understand the reason for the delay.causeInvestigators have not yet determined the cause of the fire. rootWe need to get to the root of her problems.motiveThere seems to have been no motive for the murder.ground(s)On what grounds was she dismissed?\nSee more results »\nby reason of formal\nbecause of: He's always asked to these occasions by reason of his position.\nSee more\nMore examplesFewer examplesI see no reason for us to depart from our usual practice.Car exhaust is the main reason for the city's pollution.I go to church for weddings but not for any other reason.For some reason the story caught the imagination of the public.We made this decision purely for financial reasons.\nSMART Vocabulary: related words and phrases\nMotives and reasons\nautotelic\ncauseless\ndrive\nfirst principles\nfrom a place of idiom\nhidden agenda\nimpulse\ninclination\njustification\nmainspring\nmotivation\nmotive\nname\nobject\npeg\nplace\nshould\nwherefores\nwhy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReasons and explanations\nreason noun\n(JUDGMENT)\n[ U ] the ability of a healthy mind to think and make judgments, especially based on practical facts: We humans believe that we are the only animals to have the power of reason.mainly UK old-fashioned He lost his reason (= became mentally ill) when both his parents were killed in the crash. within reason\nC2 within the limits of what is acceptable and possible: We can wear anything we like to the office, within reason.\nSee more\nMore examplesFewer examplesHe argued that morality could be conceptualized as a series of principles based on human reason.And did reason prevail over emotion?If 20% of the earth's population has 80% of its resources, then it stands to reason that 80% of the population has only 20% of the resources.His powers of reason set him apart from the candidates.Choose whatever you like from the menu, within reason!\nSMART Vocabulary: related words and phrases\nMind and personality\n-hearted\n-heartedly\n-heartedness\nalexithymia\nallism\nallistic\nalter ego\nambivert\nAsperger's syndrome\ngestaltist\nhuman nature\nneurotypical\nneurotypicality\nnoddle\nnoetic\nnoggin\npsychoanalysis\npsychoanalytic\nsubconscious\nsuperego\nSee more results »\nGrammar\nReason thatWe use reason that before a clause. We often omit that, especially in statements. Reason that is less common and slightly more formal than reason why: …\nReason + to-infinitiveWe can use reason with a to-infinitive: …\nReasonWe use reason for + noun phrase, not reason of: …\nReason forWe use reason for + noun phrase, not reason of: …\nReason whyWe use reason why before a clause. We often omit why, especially in statements: …\nIdiom\nlisten to reason\nto try to understand and to make judgments based on practical facts: [ + (that) ] Newton reasoned (that) there must be a force such as gravity I spent hours reasoning out the solution to the puzzle.\nSMART Vocabulary: related words and phrases\nThinking and contemplating\na brown study idiom\nagonize\nagonize over/about something\nbeard-stroking\nbethink\ngrapple\nharbour\nin the cold light of day idiom\nintrospect\nintrospection\njoined-up thinking\nlateral thinking\nnavel\nreckon\nreweigh\nrumination\nrun through someone's mind/head idiom\nscratch your head idiom\nself-contemplation\nweigh\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nConcluding and deducing\nPhrasal verb\nreason with someone\nreason noun\n(EXPLANATION)\nAdd to word list\nAdd to word list\n[ C/U ] the cause of an event or situation, or something suggested as an explanation: [ C ] She had never stopped by before for any reason. [ C ] There must be a reason why she’s not here yet. [ U ] Adams had good reason to fire Pickering.\nreason noun\n(JUDGMENT)\n[ U ] the ability to think and make judgments, esp. good judgments: Meditation seemed to have improved her ability to reason.\nreason verb\n(JUDGE)\nto think about and make a good judgment about: [ + (that) clause ] He reasoned (that) he had only four or five years left as an athlete.\nreason verb\n(EXPLAIN)\nto argue with and try to persuade someone: [ I ] Grace kept her voice gentle, as if she were reasoning with a child. reasoning noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈri·zə·nɪŋ/\nI didn’t follow her reasoning."}