{"id":302536,"name":"rebate","type":"noun","us_sound":"ˈriː.beɪt","us_link":"../audio/r/cdo0623usreba3276.mp3","uk_sound":"ˈriː.beɪt","uk_link":"../audio/r/ukreapp019.mp3","content":"Add to word list\nAdd to word list\nan amount of money that is returned to you, especially by the government, for example when you have paid too much tax: tax rebate The government plans to give small business owners a tax rebate.\nSMART Vocabulary: related words and phrases\nTaxation\namortizable\nanti-dumping\nanti-progressive\nanti-tax\nat source phrase\nfinancial year\nfiscal year\nflat tax\ngas tax\nHMRC\nregressively\nroad tax\nsales tax\nself-assessment\nshelter\ntaxpayer\ntithe\ntop rate\nunprogressive\nuntaxed\nSee more results »\nAdd to word list\nAdd to word list\nmoney that is returned to you after you pay for goods or services, done in order to make the sale more attractive: Chrysler announced cash rebates of $1000 on some trucks.\nAdd to word list\nAdd to word list\nACCOUNTING, FINANCE, TAX an amount of money that is paid back to you after you have paid too much: She thinks she is due a tax rebate. Any homeowner who has had a devaluation in their property is eligible for a rebate.apply/qualify for a rebate A good number of senior citizens across the state have still not applied for their rebates.get/receive a rebate If you do not currently receive a rebate and are on a low income, please apply to the council now.\nCOMMERCE an amount of money that a manufacturer or store pays back to customers when they buy something: Carmakers are still using special incentives - such as rebates and cut-rate financing - to sell their vehicles. Consumers who were putting off buying a new car have been lured into dealerships by big cash rebates, analysts said. a rebate program/schemea rebate of £583/$212/20%, etc. Rebates of $100 are available for businesses who replace old air conditioners with new, energy-efficient models.offer/carry a rebate We are offering consumers rebates ranging from $75 to $125 to buy new dishwashers or refrigerators.a rebate on sth Rebates are available on all computer purchases. Compare\ndiscount noun\nCOMMERCE to pay back an amount of money to customers after they have bought something: Buying your pension through an independent adviser who can rebate all commission will keep charges down. Issuers charging an annual fee will normally rebate part of it either to the cardholder or direct to a nominated charity.\nACCOUNTING, FINANCE, TAX to pay back an amount of money to someone after they have paid too much: All overpayments must be rebated to taxpayers."}