{"id":302576,"name":"rebel","type":"noun","us_sound":"ˈreb.əl","us_link":"../audio/r/rebel_01_00.mp3","uk_sound":"ˈreb.əl","uk_link":"../audio/r/ukreapp020.mp3","content":"Add to word list\nAdd to word list\nB2 a person who is opposed to the political system in their country and tries to change it using force : The rebels took over the capital and set up a new government. rebel troops/fighters\na person who does not like rules or authority, and shows this by behaving differently from most people in society: He was a rebel when he was a teenager and dyed his hair pink.\nMore examplesFewer examplesThe rebel troops have launched a coordinated attack on government soldiers.A devastating attack was launched on the rebel stronghold.The rebels are on the point of surrender.The army recaptured the town from the rebels.The UN forces have a numerical superiority over the rebels.\nSMART Vocabulary: related words and phrases\nActivism & pressure groups\nactivism\nactivist\nagitation\nagitator\nagitprop\ncirculator\nclicktivism\nclicktivist\ncounter-demonstrate\ncounter-demonstration\nhunger striker\nidentity politics\ninsurgency\ninsurrection\ninterest group\nslacktivist\nsocial enterprise\nsocial entrepreneur\nspecial interest group\nsuper-lobbyist\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTaking action against people in power\nFreedom to act\nB2 to fight against the government: The people rebelled against the harsh new government.\nto refuse to obey rules or people in authority: Jacob rebelled against his parents' plans for him and left school at the age of 16. If you are too strict with teenagers, they often rebel.\nto react against a feeling, action, plan, etc.: My poor sick stomach rebelled at the idea of any more food.\nSMART Vocabulary: related words and phrases\nTaking action against people in power\nanarchist\nangry young man\nanti-apartheid\nanti-state\nbring\ninsurgency\ninsurrection\nlevel up\nmutineer\nmutinous\nred flag\nrevolt\nrevolution\nrevolutionarily\nrevolutionary\nsubversively\nsubversiveness\ntopple\ntroublemaker\nungovernable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRefusing & rejecting\nAdd to word list\nAdd to word list\na person who refuses to accept the government’s power and uses force to oppose it, or a person who opposes authority and thinks or behaves differently: The government tried to set up talks with the rebels. Though he dressed unusually, he never meant to be a rebel.\nUS history Soldiers fighting for the southern states in the American Civil War were called rebels. rebel verb [ I ] us\nYour browser doesn't support HTML5 audio\n/rəˈbel/ -ll-\nChildren often rebel against being forced to eat certain foods."}