{"id":302611,"name":"rebid","type":"verb","us_sound":"ˌriːˈbɪd","us_link":"../audio/r/cdo0123usrebi2045.mp3","uk_sound":"ˌriːˈbɪd","uk_link":"../audio/r/cdo0123ukrebi2383.mp3","content":"Add to word list\nAdd to word list\n[ I ] to give a new bid (= an offer to do something for a particular amount of money, when you are competing with other people to be able to do it) for something such as a job: All eligible companies were invited to rebid for the work.\n[ T ] to ask for new bids (= offers to do something for a particular price, when people are competing to be able to do it) for something such as a job: It is a government requirement to rebid contracts every three years.\n[ I ] to make a new offer of a particular amount of money for something that is for sale and compete with other people again to buy it, especially online, or at a public sale of goods or property: If you do not want the system to automatically rebid for you on any one item, leave this field blank for that item.\n[ I or T ] (in some card games) to say again, before play starts, how many points you expect to win in a particular game: What did she bid next after her partner rebid 2 clubs? It was a difficult choice whether to re-bid or not.\nMore examplesFewer examplesPrivate train companies have to re-bid to run the service.After being publicly criticised, the agency has agreed to rebid the three large contracts and give the work to small companies.She was advised to reject everything and rebid the deal.It could take a long time to rebid the licence for the casino.After he passed, she boldly rebid her spades.\nSMART Vocabulary: related words and phrases\nCompeting and contending (non-sporting)\nbe one up on someone idiom\nbid\ncat\ncatchup\nchancer\nclose-run\ncompetition\ndare\ngo in for something\ngo toe to toe idiom\nhyper-competitive\nin the game idiom\nintercollegiate\nshowing\nslugfest\nsnap at someone's heels idiom\nsuper-competitive\ntake something on\nthrow\ntoe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGiving, providing and supplying\nNegotiating prices\nBuying\nCard games"}