{"id":302685,"name":"rebound","type":"verb","us_sound":"ˌriːˈbaʊnd","us_link":"../audio/r/eus73861.mp3","uk_sound":"ˌriːˈbaʊnd","uk_link":"../audio/r/ukreapp028.mp3","content":"Add to word list\nAdd to word list\nto bounce back after hitting a hard surface\nIf an action rebounds on you, it does not have the effect you hoped for but has an unpleasant effect on you instead: His continual demands for sympathy rebounded on him because his friends finally stopped listening.\nto rise in price after a fall: Cotton rebounded from declines early in the day to end at a higher price.\nto exercise by performing jumps and movements on a rebounder (= a piece of equipment like a small trampoline): We recommend you rebound in suitable trainers, although you can also rebound barefoot.\nSMART Vocabulary: related words and phrases\nBouncing\nbob\nbounce\nbouncily\nbouncy\nbound\ncannon\ncarom\nkeepy-uppy\nricochet\nup\nYou can also find related words, phrases, and synonyms in the topics:\nFailing and doing badly\nPrice increases\nExercising & training\nthe act of rebounding: I hit the ball on the rebound (= after it had hit the wall or ground once).\nin sports, a ball or puck (= small, round, hard object used in ice hockey) that becomes available after an unsuccessful attempt to score, or an occasion when this happens\nin basketball, an occasion when a player successfully gets the ball after a shot (= attempt to score) has been missed: Over three games he averaged 14.0 points and 8.7 rebounds.\nSMART Vocabulary: related words and phrases\nBouncing\nbob\nbounce\nbouncily\nbouncy\nbound\ncannon\ncarom\nkeepy-uppy\nricochet\nup\nYou can also find related words, phrases, and synonyms in the topics:\nCompeting in sport\nBasketball, netball & volleyball\nIdiom\non the rebound\nAdd to word list\nAdd to word list\nto return to an earlier and better condition; improve: Older athletes find it harder to rebound from injuries.\nIf a ball or other object rebounds, it bounces back after hitting a hard surface. rebound noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/ˈri·bɑʊnd/\n[ U ] The artist is on the rebound from his midcareer slump.\nAdd to word list\nAdd to word list\nFINANCE if prices, shares, etc. rebound, they increase in value again after a period when they were going down in value: Cotton rebounded from declines early in the day to end at a higher price. Shares rebounded 18p to 379p yesterday.rebound from $18/6.5p/2.6% etc. The group posted a profit last year of $24.8 million, rebounding from a loss of $10.9 million the previous year. The Dow Jones Industrial Average slid as much as 53.64 to 5594.01, before rebounding to 5616.21.\nECONOMICS if an economy or a business activity rebounds, it improves after a difficult period of time: Tourism in the region is expected to rebound after last year's disastrous oil spill. Consumer confidence rebounded sharply in July, according to new figures released last week.the economy/sales/business rebounds Since the most recent downturn, the economy has rebounded, with unemployment below average.rebound from sth Shares have been rising for weeks amid speculation that the market for 18-wheel trucks is rebounding from a slump.\nECONOMICS an improvement in an economy or business activity after a difficult period of time: Central bankers are still looking for signs of a rebound in a faltering economy. The group reported a strong rebound in profitability in the first quarter.a rebound from sth Commodities markets are currently staging a rebound from recent heavy losses. a sharp/strong/significant/small rebound an economic/technical/market rebound\nbe on the rebound\nto be increasing in value or improving after being low or not very good: Sales and membership are on the rebound again, since registration procedures were simplified two years ago. February spending was on the rebound from a depressed January, when incomes fell a revised 0.5% instead of 0.4% amid severe weather conditions."}