{"id":302669,"name":"reboot","type":"verb","us_sound":"ˌriːˈbuːt","us_link":"../audio/r/usb01224.mp3","uk_sound":"ˌriːˈbuːt","uk_link":"../audio/r/ukb01224.mp3","content":"Add to word list\nAdd to word list\n(of a computer) to switch off and then start again immediately, or to make a computer do this: If this doesn't work, close the application and reboot the system. I'm just waiting for my laptop to reboot.\nto start something again or do something again, in a way that is new and interesting: With his new movie he reboots the classic Western.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\nmeg\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStarting again\nan occasion when a computer is switched off and then starts again immediately: The system shuts down, forcing a reboot.\na new and interesting version of something such as a film or television show, or the act of making a new and interesting version: They have made a much-needed \"Wizard of Oz\" reboot called \"Tin Man.\" The series needs a reboot; it has grown increasingly bizarre and forced.\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\ndrill down\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntoolbar\nvectorization\nvectorize\nvirtualization\nvirtualize\nwake word\nzip file\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking things better\nAdd to word list\nAdd to word list\nIT if you reboot a computer, or if a computer reboots, you switch it off and then switch it on again a short time later, especially in order to get rid of a problem or after you have put new software onto the computer: Once the patches have been installed, users are recommended to reboot their computer/PC. All running programs are saved to disk and then restored when you reboot."}