{"id":302750,"name":"rebuild","type":"verb","us_sound":"ˌriːˈbɪld","us_link":"../audio/r/rebuild.mp3","uk_sound":"ˌriːˈbɪld","uk_link":"../audio/r/ukreapp030.mp3","content":"Add to word list\nAdd to word list\nB1 to build something again that has been damaged or destroyed: The cathedral was completely rebuilt in 1425 after it had been destroyed by fire.\nB2 If you rebuild a system or organization, you develop it so that it works effectively: Before the election, the party claimed it would rebuild the country's economy. rebuild your life\nB2 to try to return to the good situation that you were in before an unpleasant event happened to you: Many people have difficulty in rebuilding their lives when they come out of prison.\nSee more\nMore examplesFewer examplesAfter the accident, he underwent reconstructive surgery to rebuild his face.I've decided to strip down my motorbike and rebuild it.Stoically, and with great determination, the people set about rebuilding the village.UN troops were assigned the task of rebuilding the hospital.The house was extensively rebuilt after the fire.\nSMART Vocabulary: related words and phrases\nBuilding: construction work & workers\nbanksman\nblaster\nbreak ground idiom\nbrick\nbrick something up\nelectrician\nerection\nflip\nfound\nglazier\njoiner\nrefurb\nrefurbish\nrefurbished\nrefurbishment\nrenovate\ntiler\nwell built\nworkman\nwright\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking progress and advancing\nAdd to word list\nAdd to word list\nto build something again that has been damaged or destroyed: [ T ] The historic building was completely rebuilt after it had burned down.\nIf you rebuild a system or organization, you develop it so that it works effectively: [ I ] The company is rebuilding under new management.\nAdd to word list\nAdd to word list\nto build something again after it has been destroyed or damaged: After the hurricane, the whole infrastructure of the city needed rebuilding.\nto make big changes to a company, organization, or system that is no longer effective: It is taking more time than a lot of businesses expected to resume and rebuild their operations. Certain countries have been exempted from quotas in an effort to help them rebuild their economies.\nto work hard in order to improve the way people think about you after a difficult period or a period in which you have made mistakes: Some big multinationals struggled to rebuild their credibility in the wake of the stock market crash.rebuild confidence/trust/morale We must now begin the complex process of rebuilding trust among employees and their confidence in the organization.rebuild your career/reputation/image I managed to rebuild my career by paying attention to human relationships."}