{"id":302879,"name":"recap","type":"verb","us_sound":"ˈriː.kæp","us_link":"../audio/r/eus73866.mp3","uk_sound":"ˈriː.kæp","uk_link":"../audio/r/ukrebui010.mp3","content":"Add to word list\nAdd to word list\nto repeat the main points of an explanation or a description: Finally, the teacher recapped the main points of the lesson. To recap, our main aim is to increase sales by 15 percent this year.\nMore examplesFewer examplesWe'll just recap briefly on what we did.Let me just recap here in case we're losing track.It is worth recapping the main developments over the past decade as background to this perspective.\nSMART Vocabulary: related words and phrases\nSaying again\ncascade\ndin something into someone\ndrill\ndrum\ndrum something into someone\nflog\nflog yourself to death idiom\nhammer\ninculcate\nlabour\nreaffirm\nrehash\nreiteration\nrelay\nrepetitively\nrephrase\nrestate\nrestatement\nretell\nretread\nSee more results »\nthe act of repeating the main points of an explanation or description: Could you give me a quick recap on what happened in the meeting? Perhaps a recap of recent events is required.\nMore examplesFewer examplesHere's a brief recap of what has happened so far.I'll give a full recap when I'm back, but I have had an excellent trip. Those who log on can read recaps of the previous night's races.\nSMART Vocabulary: related words and phrases\nSummaries and summarizing\nabridgment\nabstract\nbiodata\ncatch-all\ncurriculum vitae\nexecutive summary\ngist\nhandout\nin short idiom\nrecapitulation\nresume\nshorthand\nshorthand for something idiom\nstory\nsum (something/someone) up\nsynoptic\nthe long and the short of it idiom\nTLDR\nto cut a long story short idiom\nupsum\nSee more results »\nAdd to word list\nAdd to word list\nshort form ofrecapitulate: [ T ] We saw a video recapping her early career. [ I ] To recap, we expect sunny skies in the morning, rain by nightfall. recap noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈri·kæp/\nThey give a quick recap of the top news stories.\nAdd to word list\nAdd to word list\nto repeat the main points of something that has been discussed earlier at the end of a meeting or talk: Let me (just) recap very briefly what I said earlier. To recap, most people seem to agree that data collected by the government relating to environmental issues should be made available to the public.\na brief description of the main points of something that has been discussed that someone gives at the end of a meeting or talk: Here's a recap of the week's most hotly debated news items."}