{"id":302846,"name":"recall","type":"verb","us_sound":"ˈriː.kɑːl","us_link":"../audio/r/eus73863.mp3","uk_sound":"rɪˈkɔːl","uk_link":"../audio/r/ukrebui007.mp3","content":"recall verb\n(REMEMBER)\nAdd to word list\nAdd to word list\nB2 [ I or T ] to bring the memory of a past event into your mind, and often to give a description of what you remember: The old man recalled the city as it had been before the war. \"As I recall,\" he said with some irritation, \"you still owe me €150.\" [ + (that) ] He recalled (that) he had sent the letter over a month ago. [ + question word ] Can you recall what happened last night? [ + -ing verb ] She recalled seeing him outside the shop on the night of the robbery.\nThesaurus: synonyms, antonyms, and examples\nto remember somethingrememberDo you remember when her birthday is?recallI don't recall arranging a time to meet.recollectI didn't recollect having seen him.remindEvery time we meet he reminds me about the money he lent me.come back toI forgot his name but it's just come back to me.reminisceWe were just reminiscing about our school days.\nSee more results »\n[ T ] to cause you to think of a particular event, situation, or style: His paintings recall the style of Picasso.\nMore examplesFewer examplesIf you cast your mind back, you might recall that I never promised to go.She had an amazing memory and could recall verbatim quite complex conversations.He recalled his dissipated youth spent in nightclubs and bars.There was a slight tremble in her voice as she recalled her husband.The film recalls the events of First World War.\nSMART Vocabulary: related words and phrases\nRemembering, reminding and reminders\naide-mémoire\nannal\nawaken someone to something\nbe engraved on someone's memory/mind idiom\nbe etched on/in someone's memory idiom\ncommit\nhooky\nif my memory serves me right idiom\nimprint\nindelible\njog\njog someone's memory idiom\nremember\nremind\nremind someone of something/someone\nreminder\nreminisce\nresonance\nresonant\nstamp\nSee more results »\nrecall verb\n(CALL BACK)\n[ T ] to order the return of a person who belongs to an organization or of products made by a company: The ambassador was recalled when war broke out. The company recalled thousands of jars of baby food after a salmonella scare.\nSMART Vocabulary: related words and phrases\nInviting & summoning\nask\nask someone in\nask someone out\ncall\ncall (something) out\ncall someone in\nconvene\nconvoke\nfriend\ninvite\ninvite someone over\ninvitee\nplus one\nresummon\nsave\nsend\nsummon\nsummons\nuncalled\nuninvited\nSee more results »\nrecall noun\n(REMEMBERING)\n[ U ] the ability to remember things: Old people often have astonishing powers of recall. My brother has total recall (= he can remember every detail of past events).\nSMART Vocabulary: related words and phrases\nMemory and memories\nabiding memory\nassociative memory\nat/in the back of your mind idiom\nclear\nconfabulation\ncorporate memory\ndim\nghost\ngo down\nhave a memory like an elephant idiom\nlearn something by rote idiom\nlive (on) in the memory idiom\nlong memory\nmemory\nmemory bank\nrediscovery\nreminiscence\nretentive\nshort-term memory\nswimmy\nSee more results »\nrecall noun\n(CALLING BACK)\n[ C usually singular ] an occasion when someone orders the return of a person who belongs to an organization, or orders the return of products made by a company: an emergency recall of Parliament The company issued a recall of all their latest antibiotics.\nSMART Vocabulary: related words and phrases\nInviting & summoning\nask\nask someone in\nask someone out\ncall\ncall (something) out\ncall someone in\nconvene\nconvoke\nfriend\ninvite\ninvite someone over\ninvitee\nplus one\nresummon\nsave\nsend\nsummon\nsummons\nuncalled\nuninvited\nSee more results »\nrecall verb [T]\n(REMEMBER)\nAdd to word list\nAdd to word list\nto bring the memory of a past event into your mind: I can vividly recall our first kiss. [ + that clause ] He recalled that he had sent the letter over a month ago. [ + question word ] Can you recall what happened last night?\nrecall verb [T]\n(ASK TO RETURN)\nto order the return of a product made by a company because of a fault in the product\nan order for the return of a product made by a company because of a fault in the product: The government ordered a recall of the garment, saying it could burst into flames.\nthe ability to remember things: He has perfect/total recall.\nAdd to word list\nAdd to word list\nCOMMERCE if a company or manufacturer recalls a particular product, it officially asks stores and consumers to return it because it is not safe to use: The Consumer Product Safety Commission said the company is recalling 773,900 toys because of safety concerns. At least six pet food companies have recalled products made with imported wheat gluten tainted with a toxic chemical.\nMARKETING to remember something you have seen or heard in an advertisement: Research by a leading marketing corporation shows that 42% of shoppers can recall a brand they've seen on in-store screens.\n[ C ]\n&#160; COMMERCE a process in which a company or manufacturer officially asks stores and consumers to return a product because it is not safe to use: The current recall involves salad mix that was processed at a plant in Ohio. The group's global recall of nearly ten million laptop computer batteries had devastated its third-quarter earnings. a product recallissue/announce/order a recall In some cases, regulators and carmakers can spend months looking into possible defects before issuing a recall. The drugs company denied that any agency or group had pressed for a recall.a major/massive/large recall (of sth) It issued a massive recall of its peanut butter brands after a multistate salmonella outbreak.\n[ U ]\n&#160; MARKETING someone's ability to remember something that they have seen or heard in an advertisement: Creating a memorable tagline can be a highly effective way to boost brand recall."}