{"id":302981,"name":"receiver","type":"noun","us_sound":"rɪˈsiː.vɚ","us_link":"../audio/r/usl30281.mp3","uk_sound":"rɪˈsiː.vər","uk_link":"../audio/r/ukrebui021.mp3","content":"receiver noun [C]\n(EQUIPMENT)\nAdd to word list\nAdd to word list\nthe part of a phone in two parts that you hold to your ear and mouth: She picked up the receiver and dialled his number.\nSean Gladwell/Moment/GettyImages\na piece of equipment that changes radio and television signals into sounds and pictures\nMore examplesFewer examplesI went to pick up the receiver, but it had stopped ringing.She hung up the receiver in disgust.The receiver is designed to take advantage of the full frequency range transmitted.She held the receiver to her ear.When he was a child, Stuart built a radio receiver and transmitter.\nSMART Vocabulary: related words and phrases\nCommunications - telephone equipment\nanswering machine\nblower\nbrick\nburner\ncell phone\ndevice\ndumbphone\nextension\nmouthpiece\nphablet\nplatform\npowerbank\nsim\nSIM card\nsmartphone\nspeakerphone\nswitchboard\ntelephone\ntelephone booth\ntelephone exchange\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBroadcasting: radio\nBroadcasting: television\nreceiver noun [C]\n(PERSON)\n(UK also official receiver) a person who officially deals with the business matters of companies who cannot pay their debts: The company went bankrupt and was put into the hands of the receivers.\nlaw\n&#160; UK specialized A receiver of stolen goods is a person who buys and sells property that they know has been stolen.\nSMART Vocabulary: related words and phrases\nSuccess & failure in business\nadministration\naxe\nbankrupt\nbankruptcy\nbe running on fumes idiom\nbelly\ncharter\ndying\nfloat\nfold\ngo dark idiom\ngo into administration\ngo to the wall idiom\ngrowth hacker\ngrowth hacking\nshut up shop idiom\nsinking ship idiom\nsoft launch\nspin something off\nstart (something) up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBorrowing & lending\nMiscellaneous criminals\nreceiver noun [C]\n(AMERICAN FOOTBALL)\n(also wide receiver) in American football, an attacking player who is usually on the outer edge of the line of scrimmage (= the line on which the ball is positioned at the beginning of play): He's a wide receiver for the Dallas Cowboys. Synonyms\nflanker\nwideout\nSMART Vocabulary: related words and phrases\nAmerican football\nattempt\nblitz\nblocker\nblocking\ncarry\ncarry the ball idiom\nconversion\nfullback\nhuddle\nlinebacker\nnonconference\noffence\noutgain\noutkick\npick\nrush\nscrimmage\nsplit end\nSuper Bowl\ntouchdown\nSee more results »\nAdd to word list\nAdd to word list\na piece of equipment that changes radio and television signals into sounds and pictures, or that changes electrical signals into sound: a telephone receiver a stereo receiver\nIn football, a receiver is one of the players who can catch the ball on the team that is trying to score points.\nAdd to word list\nAdd to word list\nLAW, FINANCE\n&#160; (also UK official receiver) someone who is asked by a court of law to officially close a bankrupt company by selling its assets, paying as many of its debts as possible, etc.: receivers of/for sth The receivers of the collapsed UK construction giant have failed with a legal bid to recoup more than £400,000 on behalf of the company's many creditors. In the current harsh economic climate, many small businesses have found themselves in the hands of the receiver. About 200 jobs were put at risk yesterday after the group called in the receivers. A receiver was appointed to track down the assets and redistribute them to investors. an administrative/court-appointed/interim receiver\na piece of electronic equipment that changes radio and television signals into sound and pictures: a digital/satellite/GPS receiver"}