{"id":303028,"name":"reception","type":"noun","us_sound":"rɪˈsep.ʃən","us_link":"../audio/r/reception.mp3","uk_sound":"rɪˈsep.ʃən","uk_link":"../audio/r/ukrebui026.mp3","content":"reception noun\n(WELCOME)\nAdd to word list\nAdd to word list\nB2 [ C ] a formal party at which important people are welcomed: The president gave a reception for the visiting heads of state.\nC1 [ S ] the way in which people react to something or someone: Her first book got a wonderful/warm/frosty reception from the critics.\n[ U ] the act of welcoming someone or something: The new hospital was ready for the reception of its first patients. See also\nreceive (WELCOME)\nMore examplesFewer examplesI went to see the sales manager but got a rather chilly reception.The president had a hostile reception in Ohio this morning.She was buoyed (up) by the warm reception her audience gave her.Which firm will be catering at the wedding reception?Soft drinks and hors d'oeuvres will be served during the reception and a cash bar will be available.\nSMART Vocabulary: related words and phrases\nCelebrations, parties & special occasions\nafterparty\nApril Fool's Day\nbaby shower\nbachelor party\nbackslapping\nDay of the Dead\ndinner\ndinner dance\nEaster egg hunt\nfayre\nlawn party\nluau\nmasked ball\nmasquerade\nmela\nstreet party\nstrippergram\nsweet sixteen\ntea party\ntrick-or-treating\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReacting and responding\nWelcoming, greeting & greetings\nreception noun\n(WELCOME)\nB1 [ U ] the place in a hotel or office building where people go when they first arrive: Ask for me at reception. I signed in at the reception desk.\nMik122/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesPlease would you check in at the reception desk and sign your name in the book.We would like to remind all our guests to leave their keys at reception before they depart.New security measures require all visitors to sign in at reception and wear a visitor's badge.Upon your arrival, please report to the reception desk.New security measures require all visitors to sign in at reception and wear a visitor's badge.\nSMART Vocabulary: related words and phrases\nParts of buildings: passages & entrance areas\narcade\narchway\nbreezeway\nconcourse\ndesk\nentryway\ngangway\ngateway\nhall\nhallway\nlobby\nmarquee\npassage\npatio\nportal\nportico\nside entrance\nside return\nterrace\nvestibule\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHotels & hostels\nreception noun\n(SIGNALS)\n[ U ] the degree to which mobile phone, radio, or television signals are strong and clear: The phone reception is really bad out here in the woods. We live on top of a hill and so we get excellent radio reception. A new digital antenna might improve your reception. See also\nreceive (GET)\nSMART Vocabulary: related words and phrases\nBroadcasting: radio\nam\nantenna\nanti-jamming\nanti-radar\nautotune\nbandwidth\nbeacon\nCB\nLW\nmedium wave\nmulti-wavelength\nmultichannel\nMW\nRDS\nreceiver\nshort wave\nshout-out\ntranny\ntransponder\ntuner\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBroadcasting: television\nreception noun\n(SCHOOL)\n[ U ] UK the first year of infant school: a reception class/teacher\nSMART Vocabulary: related words and phrases\nSchools in general\nadmission\nassembly\nbailey\nblackboard\nblackboard jungle\nbreak something up\nbursar\nclassroom\ninfant\ninterschool\nintramural\nivory tower\njolly hockey sticks idiom\nkindergarten\nlanguage laboratory\nschoolchild\nschoolgirl\nseat of learning idiom\nsixth form\nstaffroom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClasses & courses\nreception noun\n(WELCOME)\nAdd to word list\nAdd to word list\n[ C ] the way in which people react to something or someone: The proposed jail has received a cool/lukewarm reception from local residents. American musicians found a warm reception in Europe in the 1960s.\n[ C ] A reception is also a formal party: a cocktail/wedding reception\nreception noun\n(RADIO/TELEVISION)\n[ U ] the degree to which radio or television sounds and pictures are clear: We get poor reception around here.\nAdd to word list\nAdd to word list\n[ U ]\n&#160; WORKPLACE a place inside a hotel or office building where visitors go when they first arrive: Let's meet in reception. Posters will be on display in the reception area. Collect your welcome packs from the reception desk. We need more staff working on reception.\n[ C ] a formal party to welcome someone or to celebrate something: The mayor offered to host a reception for the delegates. The product will be launched at a champagne reception.\n[ C ] the way in which people react to a new idea, product, or person: a warm/cool reception The firm's expansion in Africa is expected to meet with a mixed reception. The latest marketing plan got a frosty reception from the Board.\n[ U ]\n&#160; COMMUNICATIONS the quality of sound and pictures on a radio, television, mobile phone, etc. when it is used in a particular place: I won't be able to call you, as reception is really bad in rural areas."}