{"id":303053,"name":"recess","type":"noun","us_sound":"ˈrɪː.ses","us_link":"../audio/r/recess.mp3","uk_sound":"ˈriː.ses","uk_link":"../audio/r/ukrecep002.mp3","content":"recess noun\n(PAUSE)\nAdd to word list\nAdd to word list\n[ C or U ] a period of time in the year when the members of a parliament, court of law, or other government organization are not meeting: The Supreme Court is in recess until October but could still consider the review request and respond at any time. During summer recesses the newspaper sent him travelling round the country\n[ U ] US in school, a period of time between classes when children do not study: Recruiters work the playground during recess and invite students and families to evening information sessions. She never talked to teachers, never made friends, never played at recess.\nMore examplesFewer examplesThe Minister hopes to announce the outcome as soon as possible after the Easter parliamentary recess finishes in early April.“Back to the classroom,” he yells, as the elementary school recess bell rings.He fought with a kid who hit him with a baseball bat at recess.\nSMART Vocabulary: related words and phrases\nTime off\nabsenteeism\nadministrative leave\nBoxing Day\ncareer break\ncomp time\nescape\ngardening leave\nhartal\nholiday\nhols\nlegal holiday\nmaternity leave\nnon-work\nparental leave\nsick\nsick day\nsick leave\nsickie\nskive\ntake something off\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSchools in general\nrecess noun\n(SPACE)\n[ C ] a small area in a room that is formed by one part of a wall being set back further than other parts: The room has a recess designed to hold bookshelves.\n[ C usually plural ] a secret or hidden place: Psychoanalysts aim to explore the deepest/innermost recesses of the mind.\nSMART Vocabulary: related words and phrases\nParts of buildings: walls & parts of walls\nalcove\nbalcony\nbaseboard\ncavity wall\nchimney breast\ncwtch\ndado\ndamp course\ndamp-proof\ndamp-proofing\nparapet\npartition\nparty wall\npebbledash\nplasterboard\nwainscot\nwainscoted\nwainscoting\nwallboard\nwalled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSafe & enclosed spaces\nrecess noun\n(PAUSE)\nAdd to word list\nAdd to word list\n[ C ] a period of time in which an organized activity such as study or work is temporarily stopped: Congress returns from its August recess next week. After lunch, the kids have recess.\nrecess noun\n(SECRET PLACE)\n[ C usually pl ] a secret or hidden place: He pointed his flashlight into the dark recesses of the cave.\n[ C usually pl ] A recess is also an alcove."}