{"id":302986,"name":"receiving","type":"verb","us_sound":"rɪˈsiːv","us_link":"../audio/r/receive.mp3","uk_sound":"rɪˈsiːv","uk_link":"../audio/r/ukrebui019.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nreceive\nreceive verb [T]\n(GET)\nA2 to get or be given something: Did you receive my letter? I received a phone call from your mother. They received a visit from the police. She died after receiving a blow to the head. Members of Parliament received a 4.2 percent pay increase this year.\nThesaurus: synonyms, antonyms, and examples\nto receive or be given somethinggetI got a new bike for my birthday.receiveYou will receive your tickets by email.obtainAfter many years of trying, she finally obtained Brazilian citizenship.gainYou will improve at the job as you gain experience.earnEventually, you will earn the dog's trust.achieveShe achieved top marks in the physics exam.\nSee more results »\n(of a radio or television) to change a signal into sounds and pictures See also\nreception (SIGNALS)\nto be able to hear someone's voice when they are communicating with you by radio: I'm receiving you loud and clear.\nMore examplesFewer examplesMembers all receive a free copy of the monthly newsletter.Tomorrow the children will receive their anxiously awaited presents.One aggrieved customer complained that he still hadn't received the book he had ordered several weeks ago.The orchestra receives £2 million a year in sponsorship from various companies.The planet Jupiter radiates twice as much heat from inside as it receives from the Sun.\nSMART Vocabulary: related words and phrases\nGetting, receiving and accepting\nacquirable\nacquire\nacquisition\nawardee\ncarve\ndraw\nearn\nget back\nget out of something\nget/lay/put your hands on someone idiom\nglom onto something/someone\ngo to someone\npocket\nscore\nscrew\nscrew something out of someone\nsecure\nseize\nseize on/upon something\nsnap something up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBroadcasting: radio\nBroadcasting: television\nreceive verb [T]\n(WELCOME)\nto formally welcome a visitor or guest: She stood by the door to receive her guests as they arrived. See also\nreception (WELCOME)\nIndian English to meet someone when they arrive somewhere: My friend offered to receive me at the railway station.\nC1 to react to something or someone in a particular way that shows how you feel about it, him, or her: The speech was well/warmly/coldly, etc. received by the conference delegates. be received into something formal\nto be made a member of an organization: He was received into the church.\nSMART Vocabulary: related words and phrases\nWelcoming, greeting & greetings\nafternoon\nair kiss\naloha\nayup\nbid someone/something adieu\ng'day\ngod\nhello\nhello stranger idiom\nhiya\nhowdy\nlady\nmerry Christmas! idiom\nmind\nmorning\nnamaskar\npleased\npoke\npress the flesh idiom\nwish\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMeeting people\nReacting and responding\nOrganizations - joining & leaving\nIdiom\nbe on the receiving end"}