{"id":303058,"name":"recession","type":"noun","us_sound":"rɪˈseʃ.ən","us_link":"../audio/r/recession.mp3","uk_sound":"rɪˈseʃ.ən","uk_link":"../audio/r/ukrecep004.mp3","content":"Add to word list\nAdd to word list\nB2 a period when the economy of a country is not successful and conditions for business are bad: The country is sliding into the depths of (a) recession.\nMore examplesFewer examplesA lot of companies have been adversely affected by the recession.For the second time in ten years, the government has driven the economy into deep and damaging recession.Demand for new cars has fallen due to the recession.Until recently the country's economy has been insulated from recession by its reserves of raw materials.The recession has led to many small businesses going bankrupt.\nSMART Vocabulary: related words and phrases\nEconomics\naccommodative\nanti-economic\nanti-inflation\nanti-inflationary\nanti-recession\ndeindustrialization\ndouble-dip\nGDP\nhuman development index\nindustrialism\ninflation\nKeynesian\nliberal\nmarket economy\nmarketeering\nmonetary\npeace dividend\nretrench\nstagflation\nthe public purse\nSee more results »\nAdd to word list\nAdd to word list\nsocial studies a period when the economy of a country is not doing well, industrial production and business activity are at a low level, and there are many people unemployed: [ U ] The country is mired in recession. [ C ] The Japanese economy is experiencing its worst recession in 20 years.\nAdd to word list\nAdd to word list\nECONOMICS a period, usually at least six months, of low economic activity, when investments lose value, businesses fail, and unemployment rises: The experts predicted recession in the coal industry. The retail sector is now in recession. a deep/shallow/mild depressionenter/fall into/slide into (a) recession The economy has entered a deep recession.recover from/pull out of (a) recession The industry is recovering fast from what has proved to be a mild recession. Compare\ndepressionSee also\ndouble-dip recession"}