{"id":302963,"name":"receipt","type":"noun","us_sound":"rɪˈsiːt","us_link":"../audio/r/receipt.mp3","uk_sound":"rɪˈsiːt","uk_link":"../audio/r/ukrebui017.mp3","content":"receipt noun\n(PROOF)\nAdd to word list\nAdd to word list\nA2 [ C ] (US also sales slip) something such as a piece of paper or message proving that money, goods, or information have been received: Make sure you are given a receipt for everything you buy. More retailers are switching to email receipts instead of paper.\nMore examplesFewer examplesKeep your receipt as proof of purchase.Here's your receipt, dear.I'd thrown the receipt away.If you've got your receipt you can usually exchange the goods.Shall I put your receipt in the bag?Apple stopped printing receipts, opting to email them instead.\nSMART Vocabulary: related words and phrases\nBills & invoices\nbilling\nbond\ncharge\nchit\nclaim form\ncounterfoil\ncredit note\nmischarge\npassbook\npayslip\npro forma\nsales slip\nsavings bond\ntab\nticket\ntill roll\ntoll\ntolled\nunbilled\nwater bill\nSee more results »\nreceipt noun\n(RECEIVING)\nB2 [ U ] formal the act or state of receiving money or goods: Goods will be delivered on receipt of payment (= after the money is received). You have been in receipt of unemployment benefit for two months. receipts [ plural ]\nthe amounts of money received during a particular period by a business: receipts for The theatre's receipts for the winter were badly down.\nSee more\nSMART Vocabulary: related words and phrases\nGetting, receiving and accepting\nacquirable\nacquire\nacquisition\nawardee\ncarve\ndraw\nearn\nfill\nget back\nget out of something\nget/lay/put your hands on someone idiom\nglom onto something/someone\ngo to someone\nscore\nscrew\nscrew something out of someone\nsecure\nseize\nseize on/upon something\nsnap something up\nSee more results »\nreceipt noun\n(PAPER)\nAdd to word list\nAdd to word list\n[ C ] a piece of paper which proves that money or goods have been received: Ask the taxi driver for a receipt.\nreceipt noun\n(RECEIVING)\n[ U ] fml the act of receiving something, esp. of money or goods: We are awaiting receipt of your check.\nAdd to word list\nAdd to word list\n[ C ]\n&#160; COMMERCE\n&#160; (US sales slip); (sales check) a piece of paper that shows the price of something that you have bought and proves that you have paid for it: Can I have a receipt?get/keep/retain a receipt Always get a receipt when you withdraw cash from a machine. a credit card receipt\n[ U ] the act of receiving something: I acknowledge receipt of the sum of £10,000. Land stock of low initial cost may rise a hundredfold in value upon receipt of planning approval. We will send an acknowledgement within two working days of receipt.\nreceipts\nACCOUNTING the total amount of money received by a business or government: The economy experienced lower than expected export receipts. Tobacco tax receipts fell by $6.9 million or about 1.1%. cash/box-office receiptsreceipts rise/fall According to OECD figures, receipts rose in 17 out of 24 advanced economies in 2005.\nSee also\ncredit receipt\ndelivery receipt\ndeposit receipt\ndepository receipt\ndock receipt\ngross receipts\nnet receipts\ntrust receipt\nwarehouse receipt"}