{"id":303088,"name":"recharge","type":"verb","us_sound":"ˌriːˈtʃɑːrdʒ","us_link":"../audio/r/recharge.mp3","uk_sound":"ˌriːˈtʃɑːdʒ","uk_link":"../audio/r/ukrecep006.mp3","content":"Add to word list\nAdd to word list\nC1 [ I or T ] If a battery recharges, it becomes filled with electricity so that it can work again and if you recharge a battery, you fill it with electricity: He cursed himself for forgetting to recharge the batteries. The device can recharge throughout the day.\nC2 [ I ] (also recharge your batteries) to rest and relax for a period of time so that you feel energetic again: People use the spa to relax and recharge. Employees should be allowed to take breaks and do what is necessary to recharge. She took a trip to the South of France to recharge her batteries.\nSMART Vocabulary: related words and phrases\nElectricity & electronics\nanodize\nanti-static\narc\nbitstream\nbrownout\ncapacitance\nchargeable\nelectricity\ngenerate\nhigh-voltage\nhoming\ninsulating tape\nlinesman\nmagnet\nmultimeter\nnegatively\nnon-electric\nnon-electrical\nnon-electronic\nsolid-state\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPassive and not working\nAdd to word list\nAdd to word list\nto give (a battery) the ability to supply electricity again by connecting it to a piece of electrical equipment and filling it with electricity rechargeable adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/riˈtʃɑr·dʒə·bəl/\na rechargeable electric razor\nAdd to word list\nAdd to word list\nto put more power into a piece of electrical equipment that uses a battery by connecting it to an electricity supply: We use solar panels to recharge the battery. Where can I recharge my mobile? You can leave it to recharge overnight.\nHR to get new energy or to give new energy to something: It's important to have regular breaks and to take time to recharge.\nrecharge your batteries\nHR to rest so that you can get your energy back: I get four weeks holiday a year to recharge my batteries."}