{"id":303852,"name":"recovery","type":"noun","us_sound":"rɪˈkʌv.ɚ.i","us_link":"../audio/r/recovery.mp3","uk_sound":"rɪˈkʌv.ər.i","uk_link":"../audio/r/ukrecor010.mp3","content":"Add to word list\nAdd to word list\nthe process of becoming well again after an illness or injury: Mira made a full recovery from the operation. We're sorry to hear you're ill, and wish you a speedy recovery.\nthe process of becoming successful or normal again after problems: At last the economy is showing signs of recovery.\nB2 the process of getting something back: The police arranged the recovery of the body from the river.\nMore examplesFewer examplesWe must be careful not to do anything that might endanger the economic recovery.The doctors were astonished at the speed of her recovery.Well, you've made a miraculous recovery since last night!The prognosis after the operation was for a full recovery.He began to show signs of recovery.\nSMART Vocabulary: related words and phrases\nGiving, bringing or getting back\nbring\nbring something back\nchargeback\nclaw something back\ngiver\nput\nrecover\nrefund\nregain\nregrow\nreintroduce\nreintroduction\nreplace\nsend\nsend something back\nsyndication\ntake something back\nturn\nturn in\nturn something over to someone\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRecovering from illness\nAdd to word list\nAdd to word list\nthe act or process of getting better; improvement: [ U ] The economy is showing signs of recovery. [ U ] The story deals with the recovery of (= getting back) stolen jewelry.\nAdd to word list\nAdd to word list\n[ S or U ]\n&#160; ECONOMICS, FINANCE a process in which a situation improves after a difficult period, or in which prices increase after falling in value: Improvement in trade has been driven by the lower cost of borrowing and the recovery of the manufacturing sector. Construction activity in Europe is now showing signs of recovery. The newly elected CEO has pledged to put the company back on the road to recovery after the corporate scandal late last year. economic/global/stock market recovery a solid/strong/slow recovery recovery plans/programs/efforts(a) recovery from sth Wall Street's recovery from a poor start helped the London market restrict its loss to 10.7 points, with the FTSE 100 index finishing at 3669.7. The recovery in equity markets partly explains the fact that the firm's shares have more than doubled.make/stage a recovery Property has staged a recovery this year.a recovery begins/continues/progresses We believe it will be some time before a recovery begins.\nLAW the process of getting money from a person or company that has caused you loss or damage by order of a court of law: Most of the claimants are seeking recovery of monetary damages.\n[ S or U ] the process of getting something back that was lost or almost destroyed: Improvement was due mainly to continued recovery of market share in the drinks sector.\n[ S or U ]\n&#160; ACCOUNTING, FINANCE, TAX →\ndepreciation recovery\n[ S or U ]\n&#160; NATURAL RESOURCES the process of getting natural resources such as oil or gas from under the ground or sea: Plans to pipe greenhouse gases off to the North Sea could be used to increase oil recovery. See also\nbad debt recovery\ndisaster recovery"}