{"id":303791,"name":"recorded","type":"verb","us_sound":"rɪˈkɔːrd","us_link":"../audio/r/record_01_00.mp3","uk_sound":"rɪˈkɔːd","uk_link":"../audio/r/ukrecor002.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nrecord\nrecord verb [T]\n(STORE ELECTRONICALLY)\nA2 to store sounds or moving pictures using electronic equipment so that they can be heard or seen later: Cliff Richard has recorded more number one hit songs than any other British pop star. We recorded their wedding on video. I tried to call her, but all I got was a recorded message saying that she was away for the weekend. Was the concert live or was it recorded (= made before being broadcast)?\nMore examplesFewer examplesShe recorded her first CD at the age of 12.The robbery had been recorded on a concealed security camera.The microphone is used for recording sounds that are inaudible to the human ear.The group has gone to Los Angeles to record their new album.This camera records 1000 frames per second.\nSMART Vocabulary: related words and phrases\nRecording sounds and images\nanalogue\naudiovisual\nAV\ncut\ndeepfake\ndigitally\ndistort\ndistorted\nerase\nmix\nmute\nplay something back\npostproduction\nproduction\nre-record\nresynthesis\nresynthesize\nsample\nsampler\nvideotape\nSee more results »\nrecord verb [T]\n(STORE INFORMATION)\nB2 to keep information for the future, by writing it down or storing it on a computer: She records everything that happens to her in her diary. Unemployment is likely to reach the highest total that has ever been recorded. [ + that ] In his journal, Captain Scott recorded that he and his companions were weakened by lack of food. The coroner recorded (= decided) a verdict of accidental death.\nC1 If a device records a measurement, it shows that measurement: The thermometer recorded a temperature of 30 degrees Celsius.\nMore examplesFewer examplesTravel agencies have recorded a falling-off in bookings this summer.This was the diary in which Gina recorded her innermost thoughts and secrets.The scientists have been recording levels of pollution in the area for the last 15 years.The role of the stenographer was to record the exchanges that took place in the courtroom.The rings in the trunk of the tree record the amount by which it grew each year.\nSMART Vocabulary: related words and phrases\nWriting & typing\nannotate\nasemic\nbang\nbang something out\nbash something out\nborrow\nborrow something from something\nchart\ndot\ninscribe\nkeyboard\nre-registration\nreadability\nrecompose\nreformulate\nrekey\nsemiotics\nspeller\ntab\ntranscribe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRecording sounds and images\nMeasuring & weighing"}