{"id":303412,"name":"recolonize","type":"verb","us_sound":"ˌriːˈkɑː.lə.naɪz","us_link":"../audio/r/cdo0123usreco2064.mp3","uk_sound":"ˌriːˈkɒl.ə.naɪz","uk_link":"../audio/r/cdo0123ukreco2402.mp3","content":"Add to word list\nAdd to word list\n[ T ] usually disapproving to colonize a country (= send people to live in and govern it) again, for a second, third, etc. time: He believes it is part of a Western conspiracy to recolonize India and Africa. This effort to re-colonize an already thriving civilization was largely successful.\n[ I or T ] (of animals, plants, or organisms) to start to live or grow again in a particular area, or to encourage animals, etc. to live or grow somewhere: The frogs are beginning to recolonize their former habitat. Certain rare plants would probably be present in other areas and a number of them will recolonize over time. It may be possible to recolonize the gut with what are called \"friendly\" bacteria, available in the form of \"probiotics\" such as Lactobacillus acidophilus.\nMore examplesFewer examplesFor nine years following 1945, the French were engaged in a failed effort to recolonize Vietnam.The idea is that species could eventually re-colonize such areas, or at least pass through them during migration.Much the same set of bacteria recolonize the gut after a course of antibiotics.Fire may cause local extinctions of certain rare plants, but a number of them will recolonise over time.The little brown lizard is beginning to re-colonize the islands.\nSMART Vocabulary: related words and phrases\nColonization & self-government\nacknowledgement of country\nannex\nannexation\nanti-colonial\nanti-colonialism\ncolony\ncommonwealth\ncondominium\ncrown colony\ndecolonization\nindependence\nIndependence Day\nintercolonial\nland acknowledgment\nNat\nsecession\nself-determination\nself-governing\nself-government\nself-rule\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal & plant biology - general words"}