{"id":303539,"name":"reconcentration","type":"noun","us_sound":"ˌriː.kɑːn.sənˈtreɪ.ʃən","us_link":"../audio/r/cdo0622usreco1444.mp3","uk_sound":"ˌriː.kɒn.sənˈtreɪ.ʃən","uk_link":"../audio/r/cdo0622ukreco1508.mp3","content":"reconcentration noun [U]\n(BRINGING TOGETHER)\nAdd to word list\nAdd to word list\nthe action of bringing something together again in a large number or amount in one particular area: A declaration of emergency entails a reconcentration of power in the hands of the executive. This reduction in funding to the project will lead to a re-concentration of the poor in certain areas.\nMore examplesFewer examplesFlying insects in the tropics are exposed to the possibility of re-concentration by wind convergence.Their chief response to defeat was the reorganization and reconcentration of their commercial, agricultural, and military interests in the remaining overseas dominions. This concentration, then dispersal, then reconcentration of population in urban centres had a significant effect on housing.\nSMART Vocabulary: related words and phrases\nCollecting and amassing\naccumulate\nagglomerate\naggregation\namass\nassemble\ncompile\ncompiler\ncompletism\ncompletist\ncompost\nconcentrate\ncumulate\nfundraise\nfundraising\nharvest\npiece something together\nput something together\nrake something up\nreassemble\nreconcentrate\nSee more results »\nreconcentration noun [U]\n(MAKING STRONGER)\nthe action of making a liquid or substance stronger and reducing its size again, by removing water from it: Some of the processes lead to progressive dilution, others to physical or biological reconcentration. He was involved in laboratory studies on the reconcentration of fission products and plutonium in sediments, seaweed and fish.\nMore examplesFewer examplesThe solution can be rediluted with water to 2 ml before reconcentration.A higher temperature means greater re-concentration of the solution.\nSMART Vocabulary: related words and phrases\nBecoming and making stronger\naggrandize\nboil up\nbolster\ncement\ncharacter-building\ndeepen\nharden\nhardening\ninvigoration\njell\npower (something) up\nreinforce\nreinforcement\nrestrengthen\nsharpen\nsolidification\nsolidify\nsoup\nsoup something up\nstiffen\nSee more results »"}