{"id":303783,"name":"record","type":"verb","us_sound":"rɪˈkɔːrd","us_link":"../audio/r/record_01_00.mp3","uk_sound":"rɪˈkɔːd","uk_link":"../audio/r/ukrecor002.mp3","content":"record verb [T]\n(STORE ELECTRONICALLY)\nAdd to word list\nAdd to word list\nA2 to store sounds or moving pictures using electronic equipment so that they can be heard or seen later: Cliff Richard has recorded more number one hit songs than any other British pop star. We recorded their wedding on video. I tried to call her, but all I got was a recorded message saying that she was away for the weekend. Was the concert live or was it recorded (= made before being broadcast)?\nMore examplesFewer examplesShe recorded her first CD at the age of 12.The robbery had been recorded on a concealed security camera.The microphone is used for recording sounds that are inaudible to the human ear.The group has gone to Los Angeles to record their new album.This camera records 1000 frames per second.\nSMART Vocabulary: related words and phrases\nRecording sounds and images\nanalogue\naudiovisual\nbalance\ncut\ndeepfake\ndigitally\ndistort\ndistorted\nfast-forward\nmisrecord\nplay something back\npostproduction\nprerecord\nre-record\nremaster\nremix\nresynthesis\nsample\nsampler\nvideotape\nSee more results »\nrecord verb [T]\n(STORE INFORMATION)\nB2 to keep information for the future, by writing it down or storing it on a computer: She records everything that happens to her in her diary. Unemployment is likely to reach the highest total that has ever been recorded. [ + that ] In his journal, Captain Scott recorded that he and his companions were weakened by lack of food. The coroner recorded (= decided) a verdict of accidental death.\nC1 If a device records a measurement, it shows that measurement: The thermometer recorded a temperature of 30 degrees Celsius.\nMore examplesFewer examplesTravel agencies have recorded a falling-off in bookings this summer.This was the diary in which Gina recorded her innermost thoughts and secrets.The scientists have been recording levels of pollution in the area for the last 15 years.The role of the stenographer was to record the exchanges that took place in the courtroom.The rings in the trunk of the tree record the amount by which it grew each year.\nSMART Vocabulary: related words and phrases\nWriting & typing\nannotate\nasemic\nbang\nbang something out\nbash something out\nborrow\nborrow something from something\nchart\ndot\ninscribe\nkeyboard\nre-registration\nreadability\nrecompose\nreformulate\nrekey\nsemiotics\nspeller\ntab\ntranscribe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRecording sounds and images\nMeasuring & weighing\nrecord noun\n(INFORMATION)\nB2 [ C or U ] a piece of information or a description of an event that is written on paper or stored on a computer: The weather centre keeps a record of the weather. This summer has been the hottest on record (= the hottest summer known about).\nB2 [ C ] information about someone or something that is stored by the police or by a doctor: A person's medical records are confidential. He is well known to the police and has a long criminal record (= a list kept by the police of his previous crimes).\nC2 [ C ] the facts that are known about a person or a company and the actions they have done in the past: I won't fly with an airline that has a bad safety record (= whose aircraft have often had accidents). for the record\nsomething that you say before you tell someone something important that you want them to remember: And, just for the record, we were never any more than good friends.\nSee more\nMore examplesFewer examplesThe judge took the defendant's clean record into account when passing sentence.It was one of the hottest Augusts on record.You've got a proven work record, which gives you a big advantage.We've put all our records on computer.We keep your records on file for five years.\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\nprospectus\nPSA\npush notification\nradiogram\nreadout\nsubtlety\ntelemetry\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPieces of writing\nThe police generally\nOfficial documents\nrecord noun\n(MUSIC)\nB1 [ C ] a flat plastic disc on which music is recorded: Would you like to listen to some records?\nVincenzo Marco Vallilonga/EyeEm/GettyImages\nB1 [ C ] a song or music that has been recorded and is available for the public to buy: The Beatles' first hit record was \"Love Me Do\".\nMore examplesFewer examplesMany of the Rolling Stones' records have become rock classics.Music companies have profited from the dominance of CDs over vinyl records.Within a few years of their introduction, CDs were outselling vinyl records.Their first record didn't even chart .The group have just signed with a new record label.\nSMART Vocabulary: related words and phrases\nAudio & video equipment\n78\naudiocassette\naudiotape\nbody cam\nboom box\nbox set\ndigital audio tape\nequalizer\nhi-fi\njukebox\nPDC\nradiogram\nstereo\nsubwoofer\ntape\ntweeter\nVCR\nvideo technology\nvideocassette\nwire\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSound and image recordings\nrecord noun\n(BEST)\nB1 [ C ] the best or fastest ever done: He ran the 100 metres in 9.79 seconds and broke/smashed the world record. She set/established a new European record in the high jump.\nMore examplesFewer examplesChristie has clipped a tenth of a second off the record.It was her first crack at beating the record.Fitzgerald is keen to emulate Martin's record of three successive world titles.He failed in his attempt to break the record.His time for the 100 metres surpassed the previous world record by one hundredth of a second.\nSMART Vocabulary: related words and phrases\nSuccess and achievements\na feather in your cap idiom\na roaring success idiom\naccomplishment\nachievement\nachievement test\nascension\nascent\nboom\nevery dog has its day idiom\nfeat\nfeather\nfruition\nhave something under your belt idiom\nlaugh\nprospect\nquantum leap\nsecret sauce\nsellout\nsense of achievement\ntear\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWinning, losing & scoring in sport\nIdioms\ngo on record\noff the record\non the record\nset/put the record straight\nat a higher level than ever achieved before: The long hot summer has led to a record harvest this year. Inflation has reached record levels. We finished the work in record time (= faster than had ever been done before).\nSMART Vocabulary: related words and phrases\nSuccessful (things or people)\na head of steam idiom\nachiever\nalive\nalpha male\narrive\nascendant\nballer\nhave something in your pocket idiom\nhave the world at your feet idiom\nhealthily\nheavy hitter idiom\nhigh-flyer\nrail\nrepresent\nsmash\nstorming\nsuccessful\nsuccessfully\nsuperachiever\nsuperhit\nSee more results »\nrecord verb [T]\n(STORE INFORMATION)\nAdd to word list\nAdd to word list\nto keep information for the future by writing it down or storing it on a computer: She carefully recorded the events of the meeting.\nTo record is also to use a device to measure an amount, rate of speed, etc. and show it: Wind gusts of up to 50 miles per hour were recorded.\nrecord verb [T]\n(STORE SOUNDS/IMAGES)\nto put sounds or pictures onto magnetic tape or a computer using electronic equipment so that they can be heard or seen later: The Beatles recorded many terrific albums over the years. When I tried to phone her, all I got was a recorded message.\nrecord noun\n(BEST)\n[ C ] the best or fastest ever done: She set a new world record in the high jump. Sales this season broke/shattered the record (= were better than ever before).\nrecord noun\n(STORED SOUNDS/IMAGES)\n[ C ] a flat, plastic disk on which music is recorded\nrecord noun\n(STORED INFORMATION)\n[ C/U ] a piece of information or a description of an event that is written on paper or stored in a computer: [ C ] Did anyone make a record of what the president said at that meeting? [ C ] All medical records are kept confidential. [ C ] She has a long criminal record (= there is official information about many crimes she has done). [ U ] This summer has been the hottest on record (= the hottest summer known about).\n[ C/U ] A person’s or organization’s record is the actions that have been done in the past, and esp. how well or badly those actions have gone: [ C ] During his twenty years as a football coach, he compiled an outstanding record.\nrecord adjective [not gradable]\n(BEST)\nat a higher level than ever achieved before: Farmers in the Midwest are reporting a record harvest this year.\nAdd to word list\nAdd to word list\n[ C ] a piece of written information about something that is kept so that people can refer to it later: The records show that the company employed a staff of 300 in the 1990s. Keep a record of all transactions. It's important to maintain up-to-date financial records. company/financial/personnel records computer/electronic records\n[ C ] an achievement that is better than anything that has happened before: set/hold/break a record Sales this year have broken all records. Hotel bookings are at a pace to set a new record this year.\n[ S ] the previous behaviour and achievements of a person or an organization: When it comes to dealing with shareholders, his record is impressive. have a good/poor/excellent record on sth They have a very poor record on HR issues.record as sth She defended her record as union chief during a lengthy interview.\nbe a matter of (public) record\nto be officially written down and available to the public: His views on the proposed merger are a matter of public record.\nbe/go on record\nto say or write something officially so that it can be known by everyone: I'm on record as saying that I support the new policy. The chair went on record to say that the committee opposed the proposal. My objections to the scheme are on record.\nfor the record\nused to show that you want something to be written down exactly, or if you want to correct something that someone has said: For the record, I can categorically state that I was unaware of these developments. Just for the record, my title is Dr. not Ms.\noff the record\nused to show that what is being said is unofficial and should not be written down or told to other people: He insisted that parts of his interview be off the record. Speaking off the record, she admitted that she had doubts about the project.\non record\nwritten down in an official record: Next spring's welfare benefit increases will be some of the smallest on record.\nput sth on record\nto make sure that something is officially written down so that people will know what has been said or done: I would like to put on record my disagreement with the conclusions of the meeting.\nSee also\nattendance record\nemployer of record\nholder of record\nowner of record\nshareholder of record\nstockholder of record\ntrack record\nat a higher level than ever achieved before: Inflation has reached record levels. The tax will hit a record number of taxpayers next year. See also\nrecord high\nrecord low\nto write down information about something so that people can refer to it later: Participants were asked to record their activities in a weekly diary. It is advisable to record all details of changes to the job description.\nFINANCE, ACCOUNTING to experience or show a profit or loss, or a rise or fall in value: record a loss/gain/profit The firm recorded pre-tax profits of over $10 million. We may be forced to record a loss this year. Overnight the Dow Jones Industrial Average recorded its biggest one-day jump since early February."}