{"id":303486,"name":"recompense","type":"noun","us_sound":"ˈrek.əm.pens","us_link":"../audio/r/recompense.mp3","uk_sound":"ˈrek.əm.pens","uk_link":"../audio/r/ukrecli017.mp3","content":"Add to word list\nAdd to word list\na present given to someone to thank them for helping you, or payment given to someone because of slight problems or because of the loss of or damage to their property: I received £500 from my neighbour in recompense for the damage to my wall.\nSMART Vocabulary: related words and phrases\nMaking & accepting apologies\namends\napologetically\napologize\natone for something\natonement\nbury\nbygone\nconciliatory\ncrawl\ncrawl back (to someone) idiom\nforgive\npenance\nrepent\nrepentance\nshred\nsink\nsink your differences idiom\nsolatium\nsorry to bother you\nsoz\nSee more results »\nto give something to someone as a payment or reward for their efforts or loss: The court awarded the women $100,000 each to recompense them for nine years of lost wages. The company says it has no legal or moral responsibility to assist in recompensing customers.\nMore examplesFewer examplesThe government refused to act to recompense the innocent victim.Not all breaches of contract can be recompensed adequately by money.If the Government wishes to recompense the consumer, then the taxpayer should pay.\nSMART Vocabulary: related words and phrases\nMaking & accepting apologies\namends\napologetically\napologize\natone for something\natonement\nbury\nbygone\nconciliatory\ncrawl\ncrawl back (to someone) idiom\nforgive\npenance\nrepent\nrepentance\nshred\nsink\nsink your differences idiom\nsolatium\nsorry to bother you\nsoz\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPaying money\nAdd to word list\nAdd to word list\npayment given to someone for an injury suffered, or for the loss of or damage to property: The government seized the land without recompense to the owners.\nAdd to word list\nAdd to word list\nan amount of money that you pay to someone for work that they have done: They receive appropriate recompense for any overtime worked.\nan amount of money that you pay to someone because you have caused them to have a problem: recompense for sth Some form of recompense for this breach of contract is now due. He demanded a financial recompense for his loss of earnings.\nto pay someone for work they have done, or harm you have caused them: recompense sb for sth The court ordered that they recompense customers for the damage caused by the delay."}