{"id":303457,"name":"recommending","type":"verb","us_sound":"ˌrek.əˈmend","us_link":"../audio/r/recommend.mp3","uk_sound":"ˌrek.əˈmend","uk_link":"../audio/r/ukrecli013.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nrecommend\nB1 to suggest that someone or something would be good or suitable for a particular job or purpose, or to suggest that a particular action should be done: I can recommend the chicken in mushroom sauce - it's delicious. She has been recommended for promotion. The headmistress agreed to recommend the teachers' proposals to the school governors. [ + (that) ] The doctor recommended (that) I get more exercise. [ + -ing verb ] I recommend writing your feelings down on paper. The city has much/little to recommend it (= it has many/few pleasant qualities).\nThesaurus: synonyms, antonyms, and examples\nto give someone advicegive adviceCan you give me some advice about what to wear?adviseThe doctor advised me to get plenty of rest.counselHe counselled the young man to keep his silence.recommendDoctors recommend regular exercise.advocateI would advocate a system that is fair to everyone.\nSee more results »\nMore examplesFewer examplesWe recommend that this wine should be consumed within six months.The report recommends that more resources be devoted to teaching four-year-olds.The doctor recommended swimming as the best all-round exercise.You seemed a bit hesitant about recommending that restaurant - is something wrong with it?For your safety, we recommend you keep your seat belt loosely fastened during the flight.\nSMART Vocabulary: related words and phrases\nBacking, supporting & defending\nadopt\nadvocacy\naffirmation\nally yourself to/with someone\nargumentation\nbadge\nbailout\nbet\nchampion\nflag-waving\nkeep the flag flying idiom\npatronage\nrecommended\nred carpet\nright behind someone idiom\nroll out the red carpet idiom\nroot\nroot for someone\nstick together\nsympathetic\nSee more results »\nRelated word\nrecommended"}