{"id":303844,"name":"recover","type":"verb","us_sound":"rɪˈkʌv.ɚ","us_link":"../audio/r/eus73875.mp3","uk_sound":"rɪˈkʌv.ər","uk_link":"../audio/r/ukrecor009.mp3","content":"Add to word list\nAdd to word list\nto become completely well again after an illness or injury: It took her a long time to recover from/after her heart operation. He never really recovered from the shock of his wife dying.\nto become successful or normal again after being damaged or having problems: It took a long time for the economy to recover after the slump.\nThesaurus: synonyms, antonyms, and examples\nto improve somethingimproveHis health has improved dramatically since he started exercising.get betterThe first part of the book isn't very good but it gets better.rallyThe team played badly in the first half but rallied in the second.recoverWe are still waiting for the economy to recover.look upOur financial situation is looking up.pick upBusiness is really beginning to pick up.\nSee more results »\nB1 to get back something lost or spent: She went into a coma and died without recovering consciousness. She was astonished to see me, but she soon recovered her composure/herself (= soon gave the appearance of being calm). Police only recover a very small percentage of stolen goods. The initial outlay of setting up a company is considerable and it takes a while to recover those costs.\nMore examplesFewer examplesThe doctors say that it will take him a few weeks to recover.It will be impossible to recover all the misapplied charity money.Although she's recovering from her illness, her rate of progress is quite slow.Have you fully recovered from your illness?He looked surprised but soon recovered his self-possession.\nSMART Vocabulary: related words and phrases\nGiving, bringing or getting back\nbring\nbring something back\nchargeback\nclaw something back\ngiver\nput\nrecovery\nrefund\nregain\nregrow\nreintroduce\nreintroduction\nreplace\nsend\nsend something back\nsyndication\ntake something back\nturn\nturn in\nturn something over to someone\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRecovering from illness\nAdd to word list\nAdd to word list\nto get better after an illness or a period of difficulty or trouble: [ I ] It took her a while to recover after the operation.\nTo recover something is to find or get back the use of something lost or taken away: [ T ] The police recovered her handbag, but her wallet was gone.\nAdd to word list\nAdd to word list\n[ I ]\n&#160; ECONOMICS, FINANCE to improve after a difficult period or after falling in value: Consumer confidence has been slow to recover in the aftermath of the credit crunch. Profits are expected to recover in the current financial year. Over the past week shares have recovered considerably. Thanks in part to emergency loans, the industry recovered surprisingly quickly.recover from With the country's economy recovering from its deepest recession for 50 years, company earnings are expected to be higher than a year ago.recover to 12%/70c etc. Since their 52p low in autumn of last year, shares have recovered to 687p.\n[ T ]\n&#160; FINANCE to get back money you have spent, invested, or lost: Airlines are imposing higher surcharges in an attempt to recover a percentage of the increase in fuel prices.recover debts/investments/funds Cautious investors are likely to stay out of the market until they have recovered their initial investment.\nLAW to get money from a person or company that has caused you loss or damage by order of a court of law: recover costs/damages/money Current legislation does not permit an employee to recover damages for a hostile working environment. Harrington led the lawsuit to recover losses from the bonds issued by the fraudulent corporation.\n[ T ] to get something back that was lost or almost destroyed: New Orleans has recovered much of its economic base, and sales tax revenues are approaching normal. We had to bring in a computer expert to help us recover the data from the hard drive.\n[ T ]\n&#160; NATURAL RESOURCES to get natural resources such as oil or gas from under the ground or sea: Technological advances are helping companies recover more of the oil and gas they find."}