{"id":303369,"name":"recognizing","type":"verb","us_sound":"ˈrek.əɡ.naɪz","us_link":"../audio/r/recognize.mp3","uk_sound":"ˈrek.əɡ.naɪz","uk_link":"../audio/r/ukrecli007.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nrecognize\nrecognize verb\n(KNOW)\nB1 [ T ] to know someone or something because you have seen or heard him or her or experienced it before: I hadn't seen her for 20 years, but I recognized her immediately. Do you recognize this song? Doctors are trained to recognize the symptoms of different diseases.\nMore examplesFewer examplesHe put on a large hat and glasses as a disguise and hoped no one would recognize him.His red hair and short stature made him easy to recognize.As we drew alongside the black car, I suddenly recognized my ex-boyfriend at the wheel.Many distant relatives, most of whom I hardly recognized, turned up for my brother's wedding.He'd completely changed - I didn't recognize him.\nSMART Vocabulary: related words and phrases\nLearning & knowing\nabsorptive capacity\nacquirable\nacquire\nacquisition\nassimilate\nextension\nfamiliar\njourney\nmislearn\nmug (something) up\nnon-academic\nnon-library\nonboard\nshadow\nsit\nteachable\nthose\nuncultivated\nuncultured\nunlearnable\nSee more results »\nrecognize verb\n(ACCEPT)\nB2 [ T ] to accept that something is legal, true, or important: The international community has refused to recognize (= officially accept the existence of) the newly independent nation state. [ + (that) ] He sadly recognized (that) he would die childless. You must recognize the seriousness of the problems we are facing.\nThesaurus: synonyms, antonyms, and examples\nto accept that something is trueacceptI fully accept that I was wrong.acknowledgeI acknowledge that the project has faced delays, but we will do all we can to make up time.recognizeI do recognize that mistakes were made.admitWhy don't you just admit you got it wrong?\nSee more results »\nC1 [ T often passive ] If a person's achievements are recognized, official approval is shown for them: The Queen recognized his services to his country by awarding him an MBE.\nMore examplesFewer examplesThe country has de facto independence now, and it will soon be recognized de jure by the world's governments.His pre-eminence in his subject is internationally recognized.We need to recognize that we are now living in a plural society.Alcoholics often have to hit rock bottom before they recognize that they have a problem.Steiner was recognized as an original if unorthodox thinker.\nSMART Vocabulary: related words and phrases\nBelieving\naccept\nallegedly\narticle of faith\nascribe something to something\nascription\nbelief\ncredit\ndeluded\nevidently\nfeel it in your bones idiom\ngive someone the benefit of the doubt idiom\ngospel\nhold\nrecognize\nroom for doubt idiom\nsee something in someone/something\nseeing is believing idiom\nself-deceit\nself-deceiving\nstock\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccepting & agreeing\nPraising and applauding"}