{"id":303449,"name":"recommendation","type":"noun","us_sound":"ˌrek.ə.menˈdeɪ.ʃən","us_link":"../audio/r/recommendation.mp3","uk_sound":"ˌrek.ə.menˈdeɪ.ʃən","uk_link":"../audio/r/ukrecli014.mp3","content":"Add to word list\nAdd to word list\nB2 [ C or U ] a suggestion that something is good or suitable for a particular purpose or job: I bought this computer on John's recommendation (= because John told me that it was good). I got the job on Sam's recommendation (= because she told her employers that I was suitable for the job).\nThesaurus: synonyms, antonyms, and examples\nadviceadviceLet me give you some advice.helpI didn't know who to turn to for help.a piece of adviceLet me give you a piece of advice.counselI will miss his wise counsel.guidanceYoung people don't always appreciate the guidance offered by their parents and teachers.counsellingUK Victims of abuse usually need expert counselling.\nSee more results »\nB2 [ C ] advice telling someone what the best thing to do is: [ + that ] The report makes the recommendation that no more prisons should be built.\nMore examplesFewer examplesThey were accused of trying to emasculate the report's recommendations.The National Executive is expected to endorse these recommendations.I'd like to see the research that these recommendations are founded on.This committee can make recommendations but it has no real teeth.I don't know what to choose. What's your recommendation?\nSMART Vocabulary: related words and phrases\nBacking, supporting & defending\nadopt\nadvocacy\naffirmation\nally yourself to/with someone\nargumentation\nbadge\nbailout\nchampion\nflag-waving\nkeep the flag flying idiom\npatronage\nrecommended\nred carpet\nright behind someone idiom\nroll out the red carpet idiom\nroot\nroot for someone\nstick\nstick together\nsympathetic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGiving advice\nAdd to word list\nAdd to word list\na statement that someone or something would be good or suitable for a particular job or purpose, or the act of making such a statement: [ U ] I have to get five letters of recommendation to support my application to medical school.\nAdd to word list\nAdd to word list\n[ C or U ] advice about what is the best thing to have or do: We accept the key recommendations of the report. The committee will investigate the matter and make a recommendation to the Board. We're pulling out on the recommendation of our accountants.\n[ C ] the person or thing that has been suggested as the best choice: He was a controversial recommendation for the post. These are my recommendations for the shortlist. See also\nletter of recommendation"}