{"id":303842,"name":"recourse","type":"noun","us_sound":"ˈriː.kɔːrs","us_link":"../audio/r/recourse.mp3","uk_sound":"rɪˈkɔːs","uk_link":"../audio/r/ukrecor008.mp3","content":"Add to word list\nAdd to word list\nusing something or someone as a way of getting help, especially in a difficult or dangerous situation: It is hoped that the dispute will be settled without recourse to litigation.\nSMART Vocabulary: related words and phrases\nHelping and co-operating\nabet\naccommodative\naid\nany port in a storm idiom\nassist\nassist with something\nbridge\ncarry\nfacilitate\nfacilitation\nfinancial assistance\ngive someone a leg up idiom\ngive/lend someone a helping hand idiom\nrelief\nrun errands idiom\nshare a platform idiom\nsolid\nsponsor\nstart (something) off\nsuccour\nSee more results »\nAdd to word list\nAdd to word list\na way of dealing with a difficult or unpleasant situation: If the company won’t pay me, the only recourse left to me is to sue them.\nAdd to word list\nAdd to word list\n[ U or S ] help, usually in the form of an official system or process, for someone in a difficult situation: a recourse for sb The Ombudsman is a recourse for homeowners who feel let down by their estate agent. At present, older workers have no legal recourse if they think they have suffered age discrimination.have recourse to sth Not everyone has recourse to expensive professional advice.sb's (only) recourse is to do sth Their only recourse is to file for an appeal before an administrative law judge.without/with no recourse to We should be able to resolve these types of disputes without recourse to a public inquiry.provide/seek recourse The Patients' Bill of Rights provides recourse for patients wishing to sue for damages.\n[ U ]\n&#160; FINANCE, LAW the legal right of a lender to take assets belonging to the borrower in addition to the asset used to guarantee the loan, if the loan is not repaid: In a loan sale, a bank makes a loan and then sells the loan, without recourse, to a third party. a recourse agreement/loan/debt Compare\nnon-recourse\n[ U ]\n&#160; FINANCE, LAW the legal right to demand payment from someone who has signed a cheque or bill of exchange if the money is not paid on the agreed date: The holder of the bill of exchange uses his or her right of recourse and submits the bill of exchange to someone connected with it."}