{"id":303352,"name":"recognition","type":"noun","us_sound":"ˌrek.əɡˈnɪʃ.ən","us_link":"../audio/r/recognition.mp3","uk_sound":"ˌrek.əɡˈnɪʃ.ən","uk_link":"../audio/r/ukrecli004.mp3","content":"recognition noun\n(ACCEPTING)\nAdd to word list\nAdd to word list\nC2 [ S or U ] agreement that something is true or legal: It's a new country, hoping for diplomatic recognition from the international community. [ + that ] There's a growing recognition that this country can no longer afford to be a nuclear power. Synonyms\nacceptance\nacknowledgment\nThesaurus: synonyms, antonyms, and examples\nacceptance of somethingacceptanceThe idea was slow to find general acceptance.acknowledgmentWe still await an acknowledgment of the fact that our case was handled improperly.recognitionThere was no recognition of having done anything wrong.resignationShe sighed in weary resignation.\nSee more results »\nC2 [ S or U ] If you are given recognition, people show admiration and respect for your achievements: Ella complained that the company never gave her any recognition for her work. He was presented with a gold watch in recognition of (= to show respect for) his years as club secretary.\nMore examplesFewer examplesShe gave me a faint smile of recognition.Her body had been mutilated beyond recognition.Chen gave her a nod of recognition across the crowded room.The area had changed beyond recognition.There was a moment of recognition when the two men met each other.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nrule\nwithout a murmur idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShowing respect and admiration\nrecognition noun\n(KNOWING)\nC2 [ U ] the fact of knowing someone or something because you have seen or heard him or her or experienced it before: When he returned to his home town after the war, he found it had changed out of all/beyond all recognition (= it had changed so much that he no longer recognized it).\nSMART Vocabulary: related words and phrases\nLearning & knowing\nabsorptive capacity\nacquirable\nacquire\nacquisition\nassimilate\nbone\nextension\nfamiliar\nhit the books idiom\nminor\nmislearn\nmug (something) up\nnon-academic\nnon-library\nshadow\nsubspecialty\nswot up (something)\nteachable\nthose\nuncultivated\nSee more results »\nrecognition noun [U]\n(KNOWLEDGE)\nAdd to word list\nAdd to word list\nthe fact of knowing who a person is or what a thing is because of having seen or experienced that person or thing before: Dole obviously had the greatest name recognition of all the Republican candidates.\nrecognition noun [U]\n(APPRECIATION)\npublic appreciation for a person’s or group’s achievements: She gained recognition as an expert in energy conservation.\nRecognition also refers to the accepting of something as true: Charges were dropped in recognition of the fact that there simply wasn’t enough evidence.\nAdd to word list\nAdd to word list\nMARKETING a situation in which people know what something is when they see or hear it: After thirty years of trading, the company name enjoys global recognition. We have poor brand recognition in the Asian market. Skype's dominance and name recognition can pose problems for competitors.\nthe act of praising or rewarding someone for something they have done: We did all the work but they got all the recognition! They are to receive bonuses in recognition of their work.\nofficial agreement that an organization has authority to do things: They have been trying for three years to get recognition for their union. The council runs a recognition scheme for private colleges.\nIT the ability of a machine to read something electronically and to get information from it: text recognition software See also\nbrand recognition\nMICR\noptical character recognition\nvoice recognition"}