{"id":303547,"name":"reconcile","type":"verb","us_sound":"ˈrek.ən.saɪl","us_link":"../audio/r/reconcile.mp3","uk_sound":"ˈrek.ən.saɪl","uk_link":"../audio/r/ukrecli019.mp3","content":"Add to word list\nAdd to word list\nC2 to find a way in which two situations or beliefs that are opposed to each other can agree and exist together: It is sometimes difficult to reconcile science and religion. It's difficult to reconcile such different points of view. How can you reconcile your fur coat and/with your love of animals? be reconciled\nWhen two people are reconciled, they become friendly again after they have argued: be reconciled with They were finally reconciled with each other, after not speaking for nearly five years.\nSee more\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nrule\nwithout a murmur idiom\nSee more results »\nPhrasal verb\nreconcile yourself to something\nAdd to word list\nAdd to word list\nto adjust the way you think about a fact or situation that is opposed to another fact or situation so that you can accept both: How do we reconcile the seemingly contradictory notions of cutting taxes and balancing the budget?\nIf two people are reconciled, they become friendly again after having argued so seriously that they kept apart: After two years of not speaking to one another, the two brothers were finally reconciled.\nTo reconcile yourself to a situation is to accept it even if it is unpleasant or painful, because it cannot be changed: He has reconciled himself to the loss of the election and is moving on.\nAdd to word list\nAdd to word list\nACCOUNTING to compare different financial accounts, amounts, etc. in order to check that they add up to the same total or to explain any differences between them: They've got all the paperwork and they're now trying to reconcile the various figures. reconcile sth with sth We need to reconcile all transactions with the bank statements and cancelled cheques. I just couldn't get the numbers to reconcile."}