{"id":303639,"name":"reconnect","type":"verb","us_sound":"ˌriː.kəˈnekt","us_link":"../audio/r/cdo0319usreco1433.mp3","uk_sound":"ˌriː.kəˈnekt","uk_link":"../audio/r/cdo0319ukreco1299.mp3","content":"reconnect verb [I or T]\n(JOIN)\nAdd to word list\nAdd to word list\nto join or be joined with something else again after becoming separated: Reconnect the wires, then screw the cover back on. The drug helps damaged spinal tissue to reconnect.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconverge\nconvergence\ncor\ncross-Channel\ncumulate\njointed\njunction\nkludge\nknit\nknock\nunify\nunion\nunseparated\nwad\nweave\nSee more results »\nreconnect verb [I or T]\n(RELATIONSHIP)\nto improve a relationship that has become less good or less close: The candidate is making an effort to reconnect with rural voters. Sometimes you need to take time out of your busy lives just to be together and reconnect.\nto make you feel or understand something that you had stopped feeling or understanding: Traditional celebrations reconnect us with history.\nSMART Vocabulary: related words and phrases\nRelationships: general words\naffiliative\nbromance\ncommunion\ndalliance\ndate night\ninterpersonal\ninterpersonally\nintimate\nintimately\ninvolved\nkinship\nplatonic\nplatonically\nprivity\nre-establish\nreconnection\nsocial life\nsteady\nunromantic\nwell connected\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRemembering, reminding and reminders\nAdd to word list\nAdd to word list\nIT, COMMUNICATIONS to connect a piece of equipment with the power supply or a telephone service again after that connection has been broken: You need to disconnect and reconnect the cables. The telephone's cut off and there'll be a charge to reconnect.\nCOMMUNICATIONS, INTERNET to use a computer, mobile phone, etc. to connect to the internet again after the connection has been broken: We reopened the applications and reconnected to the internet.\nCOMMUNICATIONS to connect again a person who is phoning someone to the person they want to speak to, after the connection has been broken: One moment please, I'll try to reconnect you.\nto create a relationship with someone again after a period of time: reconnect with sb We've got to reconnect with older voters."}