{"id":303854,"name":"recovering","type":"verb","us_sound":"rɪˈkʌv.ɚ","us_link":"../audio/r/eus73875.mp3","uk_sound":"rɪˈkʌv.ər","uk_link":"../audio/r/ukrecor009.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nrecover\nto become completely well again after an illness or injury: It took her a long time to recover from/after her heart operation. He never really recovered from the shock of his wife dying.\nto become successful or normal again after being damaged or having problems: It took a long time for the economy to recover after the slump.\nThesaurus: synonyms, antonyms, and examples\nto improve somethingimproveHis health has improved dramatically since he started exercising.get betterThe first part of the book isn't very good but it gets better.rallyThe team played badly in the first half but rallied in the second.recoverWe are still waiting for the economy to recover.look upOur financial situation is looking up.pick upBusiness is really beginning to pick up.\nSee more results »\nB1 to get back something lost or spent: She went into a coma and died without recovering consciousness. She was astonished to see me, but she soon recovered her composure/herself (= soon gave the appearance of being calm). Police only recover a very small percentage of stolen goods. The initial outlay of setting up a company is considerable and it takes a while to recover those costs.\nMore examplesFewer examplesThe doctors say that it will take him a few weeks to recover.It will be impossible to recover all the misapplied charity money.Although she's recovering from her illness, her rate of progress is quite slow.Have you fully recovered from your illness?He looked surprised but soon recovered his self-possession.\nSMART Vocabulary: related words and phrases\nGiving, bringing or getting back\nbring\nbring something back\nchargeback\nclaw something back\ngiver\nrecover\nrecovery\nrefund\nregain\nregrow\nreintroduce\nreintroduction\nreplace\nsend\nsend something back\nsyndication\ntake something back\nturn\nturn in\nturn something over to someone\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRecovering from illness"}