{"id":303362,"name":"recognize","type":"verb","us_sound":"ˈrek.əɡ.naɪz","us_link":"../audio/r/recognize.mp3","uk_sound":"ˈrek.əɡ.naɪz","uk_link":"../audio/r/ukrecli007.mp3","content":"recognize verb\n(KNOW)\nAdd to word list\nAdd to word list\nB1 [ T ] to know someone or something because you have seen or heard him or her or experienced it before: I hadn't seen her for 20 years, but I recognized her immediately. Do you recognize this song? Doctors are trained to recognize the symptoms of different diseases.\nMore examplesFewer examplesHe put on a large hat and glasses as a disguise and hoped no one would recognize him.His red hair and short stature made him easy to recognize.As we drew alongside the black car, I suddenly recognized my ex-boyfriend at the wheel.Many distant relatives, most of whom I hardly recognized, turned up for my brother's wedding.He'd completely changed - I didn't recognize him.\nSMART Vocabulary: related words and phrases\nLearning & knowing\nabsorptive capacity\nacquirable\nacquire\nacquisition\nassimilate\nbone\nextension\nfamiliar\nhit the books idiom\nminor\nmislearn\nmug (something) up\nnon-academic\nnon-library\nshadow\nsubspecialty\nswot up (something)\nteachable\nthose\nuncultivated\nSee more results »\nrecognize verb\n(ACCEPT)\nB2 [ T ] to accept that something is legal, true, or important: The international community has refused to recognize (= officially accept the existence of) the newly independent nation state. [ + (that) ] He sadly recognized (that) he would die childless. You must recognize the seriousness of the problems we are facing.\nThesaurus: synonyms, antonyms, and examples\nto accept that something is trueacceptI fully accept that I was wrong.acknowledgeI acknowledge that the project has faced delays, but we will do all we can to make up time.recognizeI do recognize that mistakes were made.admitWhy don't you just admit you got it wrong?\nSee more results »\nC1 [ T often passive ] If a person's achievements are recognized, official approval is shown for them: The Queen recognized his services to his country by awarding him an MBE.\nMore examplesFewer examplesThe country has de facto independence now, and it will soon be recognized de jure by the world's governments.His pre-eminence in his subject is internationally recognized.We need to recognize that we are now living in a plural society.Alcoholics often have to hit rock bottom before they recognize that they have a problem.Steiner was recognized as an original if unorthodox thinker.\nSMART Vocabulary: related words and phrases\nBelieving\naccept\nallegedly\narticle of faith\nascribe something to something\nascription\nbelief\ncredit\ndeluded\nevidently\nfeel it in your bones idiom\ngive someone the benefit of the doubt idiom\ngospel\nhold\nroom for doubt idiom\nsee something in someone/something\nseeing is believing idiom\nself-deceit\nself-deceiving\nstock\nword\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccepting & agreeing\nPraising and applauding\nrecognize verb [T]\n(KNOW)\nAdd to word list\nAdd to word list\nto know someone or something because you have seen or experienced that person or thing before: I recognized my old high school teacher from the photograph. Doctors are trained to recognize the symptoms of different diseases.\nrecognize verb [T]\n(ACCEPT AS TRUE)\nto accept that something is true, important, or legal: [ T ] We recognize the problems you’ve faced and sympathize with you. [ + that clause ] He recognized that it was unlikely he would ever see her again.\nTo recognize is also to show public appreciation for the achievements of someone, or a person or group: [ T ] With this medal, we would like to recognize Lynn Jennings for excellence in women’s running. recognizably adverb us\nYour browser doesn't support HTML5 audio\n/ˈrek·əɡˌnɑɪ·zə·bli/\na recognizably American name\nAdd to word list\nAdd to word list\nto know what something is because you have seen it before, or because you have heard or read about it: Managers failed to recognize the symptoms as quickly as they should. More and more people are beginning to recognize our logo.\nto accept that something is true or important: We need to recognize the value of staff training and development. recognize that They failed to recognize that more investment was needed.\nto praise or reward someone for what they have done: His contribution to the project is recognized in all the reports.recognize sb for sth The award was created to recognize photographers for outstanding work.\nto accept officially that a person or an organization has authority to do things, usually because they can achieve an acceptable standard: recognize sth as sth The school has not yet been recognized as an official training centre. They refused to recognize the interim government.\nIT if a machine recognizes something, it is able to read it electronically and get information: The device recognises the bar code and records the price. He was the inventor of an early machine to recognize handwriting.\nACCOUNTING to calculate a number or amount in a particular way so that it can be included in a company's accounts: The most common system is to recognize revenue when the invoice is issued. The school finance system fails to recognise the costs of meeting required standards. They are not required to recognize in their financial statements any short-term declines in the value of stock."}