{"id":303879,"name":"recreation","type":"noun","us_sound":"ˌrek.riˈeɪ.ʃən","us_link":"../audio/r/cdo0318usrecr4050.mp3","uk_sound":"ˌrek.riˈeɪ.ʃən","uk_link":"../audio/r/cdo0317recruk4617.mp3","content":"recreation noun [C or U]\n(ENJOYMENT)\nAdd to word list\nAdd to word list\nB2 (a way of) enjoying yourself when you are not working: His favourite recreations are golf and playing Scrabble. Emma's only form of recreation seems to be shopping. Related word\nrecreational\nMore examplesFewer examplesa recreation area/centrerecreation facilitiesthe recreation industrythe council's leisure and recreation committeeThe council is encouraging the development of the property for both employment and recreation.\nSMART Vocabulary: related words and phrases\nPastimes - general words\nactivity\namusement\navocation\navocational\navocationally\ncaper\nfrolic\ngame\nhobby\ninterest\nleisure\nnonprofessional\nnonprofessionally\npastime\npursuit\nrec\nrecreate\nrecreational\nrecreationist\nrelaxation\nrecreation noun\n(MAKING/MADE AGAIN)\n[ C or U ] the act of making something exist or happen again: a recreation of one of the most famous events in history The evening will be devoted to stand-up comedy, not the re-creation of classic skits.\n[ C ] something that has been made or done to be the same as something that happened or existed in the past: From this opening tune, it was clear that hers would not be a historically obsessed re-creation. The rest of the collection is arranged in a horseshoe around a re-creation of a drive-in movie theatre.\nMore examplesFewer examplesSometimes they took a part in the recreation of a myth.A large amount of jazz performance also involves the recreation of other people's music.There also are re-creations of battle scenes using computer graphics.The film contains footage of the beauty and danger of the mountain and harrowing re-creations of the storm.\nSMART Vocabulary: related words and phrases\nStarting again\nback to square one idiom\ncontinue\nget back to someone\ngo back to someone\ngo on\nre-entrant\nreboot\nreborn\nrecommence\nrecommencement\nreinitiate\nreoccupy\nreoccur\nreoccurrence\nreopen\nreset\nslate\nstart\nstart over\nwith the slate wiped clean idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema & theatre: acting, rehearsing & performing\nModels & moulds\nAdd to word list\nAdd to word list\nsomething done for pleasure or to relax, or such activities generally: [ C ] Sarah’s favorite recreation is shopping for antiques. recreational adjective us\nYour browser doesn't support HTML5 audio\n/ˌrek·riˈeɪ·ʃə·nəl/\nRecreational facilities include a swimming pool, gym, and fully-equipped exercise center."}