{"id":303937,"name":"recruit","type":"verb","us_sound":"rɪˈkruːt","us_link":"../audio/r/recruit.mp3","uk_sound":"rɪˈkruːt","uk_link":"../audio/r/ukrecor017.mp3","content":"Add to word list\nAdd to word list\nC1 to persuade someone to work for a company or become a new member of an organization, especially the army: Charities such as Oxfam are always trying to recruit volunteers to help in their work. Even young boys are now being recruited into the army. Having slimmed to around 1,400 staff, the company is now recruiting again. an army recruiting centre/officer Compare\nenrol UK\nMore examplesFewer examplesWe only recruit go-getters who will be actively involved in the company's development.The firm is hoping to recruit a new sales director.The company recruits 20 new staff each year.The supermarket will be recruiting extra staff for the Christmas period.A new editorial assistant has been recruited.\nSMART Vocabulary: related words and phrases\nApplying for a job\nacqui-hire\nadvertisement\nanoint\nanointed\napplicant\nassign\nelect\nemploy\nemployable\nemployment\nemployment agency\nequality, diversity and inclusion\nnomination\nreferee\nreinstate\nreinstatement\nrelocation expenses\nresume\nretain\ntestimonial\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nJoining or leaving the army\nRelated word\nrecruiter\nC2 a new member of an organization, especially the army: Raw recruits (= completely new soldiers) were trained for six months and then sent to the war front.\nSMART Vocabulary: related words and phrases\nSupporters, members & defenders\nadvocate\nallyship\nanti-evolution\nanti-evolutionary\nanti-evolutionist\napologist\napostle\nbooster\ncadre\ncard-carrying member\ncustodian\ndefender\nnew/fresh blood idiom\nnon-member\nnon-membership\npatroness\nprotagonist\nseconder\nsidekick\nupholder\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSoldiers & people who fight in wars\nAdd to word list\nAdd to word list\nto persuade someone to become a new member of an organization: The coach spends a lot of time recruiting the top high school athletes. recruiter noun [ C ] us\nYour browser doesn't support HTML5 audio\n/rɪˈkrut̬·ər/\nHe worked as a military recruiter in Texas.\na new member of an organization, esp. a military organization\nAdd to word list\nAdd to word list\n[ I or T ]\n&#160; HR to employ new people to work for a company or organization: Our primary objective is to recruit, keep, and deploy good people.recruit staff/workers/employees The loan will be used for start-up costs to recruit workers and provide ongoing operating expenses.\n[ T ] to find new people to take part in an activity or event, or to help you in some way: All new customers recruited this year are exempt from the annual fee for 12 months, as are existing cardholders.\nsomeone who has just joined a company or organization: About 14% of new recruits are from ethnic minorities."}