{"id":304052,"name":"recultivate","type":"verb","us_sound":"ˌriːˈkʌl.tə.veɪt","us_link":"../audio/r/cdo0622usrecu1467.mp3","uk_sound":"ˌriːˈkʌl.tɪ.veɪt","uk_link":"../audio/r/cdo0622ukrecu1531.mp3","content":"recultivate verb [T]\n(use land)\nAdd to word list\nAdd to word list\nto prepare land for a second, third, etc. time and grow crops on it, or to grow a particular crop for a second, third, etc. time: Many hectares of farmland have been recultivated since the unexploded mines have been defused. The cotton was grown on recultivated land by Peruvian Indians.\nMore examplesFewer examplesVegetation is allowed to regenerate in areas where soil fertility is exhausted, and it is then recultivated.Of approximately a 250 square kilometre area of open mining excavation, roughly 50% has been recultivated so far.They will gradually re-cultivate and resettle lost territory.Brewers store yeast in labs so that if anything goes wrong, they can recultivate their own strain.\nSMART Vocabulary: related words and phrases\nFarming - general words\nagroecology\nagroforestry\nbiodynamic\nbiodynamics\nfarming\ngrain\nharvest\nhomestead\nhydroponically\ninorganically\nlandless\nlandrace\nmaincrop\nmonoculture\nterrace\nthe Agrarian Revolution\nuntilled\nvertical farming\nwater stress\nwater-stressed\nSee more results »\nrecultivate verb [T]\n(develop)\nto try to establish, develop, and improve something again, for a second, third, etc. time: Back in his old job, he is re-cultivating important relationships. Many wonderful bluegrass singers have helped preserve and recultivate the genre for years.\nMore examplesFewer examples I think we need to re-cultivate a culture of being intellectually curious, and reading broadly.In therapy, she was encouraged to to re-cultivate her child-like mind.\nSMART Vocabulary: related words and phrases\nMaking things better\nadd salt to something idiom\nallay\nalleviate\nalleviation\nameliorate\ncultivate\nleavening\nlevelling up\nlighten\nliven (something) up\nlubricate\nmake a difference idiom\nrectify\nremedial\nrepair\nrepolish\nrestructure\nrevamp\nrevitalize\nsharpen\nSee more results »"}