{"id":303138,"name":"recycling","type":"noun","us_sound":"ˌriːˈsaɪ.klɪŋ","us_link":"../audio/r/uscld01176.mp3","uk_sound":"ˌriːˈsaɪ.klɪŋ","uk_link":"../audio/r/ukcld01176.mp3","content":"Add to word list\nAdd to word list\nB1 the process of collecting and changing old paper, glass, plastic, etc. so that it can be used again: ways to encourage recycling a recycling centre\nB2 materials such as paper, glass, and plastic that you collect to be recycled: We put out our recycling for pickup on Tuesdays. Put this bottle with the recycling.\nMore examplesFewer examplesThe local council have just set up a committee to study recycling.Shall I take the empty bottles for recycling?We take all our aluminium cans for recycling.What's the company's position on recycling?The supermarket has installed recycling bins for old newspapers, bottles and cans.\nSMART Vocabulary: related words and phrases\nEnvironmental issues\nagroecology\nair pollution\nanoxia\nanoxic\nanti-conservation\ncarbon capture\ndumping ground\neco-footprint\nenvironmentalism\nenvironmentally\nESG\nfeed-in tariff\nfood insecure\nparticulate\nreduce, reuse, recycle idiom\nsequester\nsequestration\nsingle-use\nskip diving\nsmoggy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPreserving and saving\nRubbish and waste\nAdd to word list\nAdd to word list\nENVIRONMENT the activity of treating materials or products using a special industrial process so that they can be used again: Investment in the areas of alternative energy, pollution, and recycling has risen sharply. Much of our waste is sent to India and China for recycling.recycling of sth Recycling of raw materials and energy resources reduces the cost of production. Germany and Scandinavia are world leaders in terms of recycling technologies. a recycling business/company/industry recycling centers/plants/facilities a recycling program/scheme/system waste/plastic/metal recycling\nthe use of money for a different purpose from the one it as originally intended for: The recycling of oil wealth from Middle East producers can have an adverse effect on global financial markets."}