{"id":303135,"name":"recycle","type":"verb","us_sound":"ˌriːˈsaɪ.kəl","us_link":"../audio/r/recycle.mp3","uk_sound":"ˌriːˈsaɪ.kəl","uk_link":"../audio/r/ukrecum010.mp3","content":"Add to word list\nAdd to word list\nB1 to sort and collect rubbish in order to treat it and produce useful materials that can be used again: The Japanese recycle more than half their waste paper. Shall I just throw this bottle away, or do you recycle?\nto use something again for a different purpose: Why not recycle Christmas cards as gift tags? Students can sometimes recycle old essays to make them fit new questions.\nMore examplesFewer examplesMetal, paper and glass can be recycled.Old newspapers are pulped and recycled.As a nation we recycle a mere 20 percent of our waste.Can you recycle cardboard?She recycles as much as she can.\nSMART Vocabulary: related words and phrases\nEnvironmental issues\nagroecology\nair pollution\nanoxia\nanoxic\nanti-conservation\ncarbon capture\ndumping ground\neco-footprint\nenvironmentalism\nenvironmentally\nESG\nfeed-in tariff\nfood insecure\nparticulate\nreduce, reuse, recycle idiom\nsequester\nsequestration\nsingle-use\nskip diving\nsmoggy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPreserving and saving\nRubbish and waste\nUsing and misusing\nAdd to word list\nAdd to word list\nto collect and treat used objects and materials that are ready to be thrown out in order to produce materials that can be used again: [ T ] The law requires us to recycle paper products, glass bottles, soda cans, and some kinds of plastic.\nAdd to word list\nAdd to word list\nENVIRONMENT to use a special industrial process in order to make materials and products ready to be used again: Remember to reduce, reuse, or recycle.be recycled Equipment that is too old to repair is recycled.recycle goods/material/waste Waste is separated into four different bins in order to recycle it.recycle sth into sth Plastic bottles can be recycled into a myriad other products. Compare\nreclaim\nrepurpose\nto use money for a different purpose from the one it was originally intended for: recycle sth into sth The original capital of $500,000 has been recycled into loans totaling $22 million."}