{"id":304135,"name":"red","type":"adjective","us_sound":"red","us_link":"../audio/r/read_read.mp3","uk_sound":"red","uk_link":"../audio/r/ukrayon024.mp3","content":"Add to word list\nAdd to word list\nA1 of the colour of fresh blood: red lipstick The dress was bright red.\nA2 used to describe hair that is an orange-brown colour go/turn (bright) red\nB2 If you go/turn red, your face becomes red because you are angry or embarrassed: Look, you've embarrassed him - he's gone bright red!\nSee more\nIf your eyes are red, the white part of your eyes and the skin around your eyes is red, because of crying, tiredness, too much alcohol, etc.\nMore examplesFewer examplesThis heat has made me come out in an itchy red rash.She drives a red sports car.Nicky and I both have red hair but hers is lighter than mine.She had a red mark on her arm where she'd burned herself.He was signalling with a red flag.\nSMART Vocabulary: related words and phrases\nCommon colours\nbluely\nblueness\nbluey\nbluish\nbrown\nbrownish\ngreen\ngreenish\ngreenly\norange\norangeness\npink\npinkish\npinkness\npurpleness\npurplish\nreddish\nyellow\nyellowish\nyellowness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHair colour\nWeeping and crying\nThe eye & surrounding area\nRelated word\nrednessIdioms\nbe like a red rag to a bull\nnot a red cent\nA2 the colour of fresh blood: She uses a lot of reds and pinks in her paintings. I've always worn a lot of red. She was dressed all in red.\nnatrot/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesHe drew a heart and coloured it red.The colour red is used to denote passion or danger.In autumn, the leaves turn a dusky red.He said, by way of explanation, that he hadn't seen the traffic light change to red.She looks best in bright, vibrant colours, like red and pink.\nSMART Vocabulary: related words and phrases\nCommon colours\nbluely\nblueness\nbluey\nbluish\nbrown\nbrownish\ngreen\ngreenish\ngreenly\norange\norangeness\npink\npinkish\npinkness\npurpleness\npurplish\nreddish\nyellow\nyellowish\nyellowness\nSee more results »\nGrammar\nNoun phrases: premodifiers (big, good, red)Premodifiers consist of single adjectives, adjective phrases, single nouns and noun phrases which are used before the head in a noun phrase. …\nIdiom\nbe in the red\na person who has socialist or communist political opinions\nSMART Vocabulary: related words and phrases\nPolitical movements & groups\nalt-right\nANC\nanti-Bolshevik\nanti-Bolshevism\nanti-capitalism\nbig tent\nblack bloc\nBlairite\nBlue Dog\nleft-winger\nleftism\nleftist\nleftward\nlefty\nsectarian\nsectarianism\nsegregationist\nSinn Fein\nthe awkward gang idiom\nthe SDLP\nSee more results »\nrelating to socialist or communist political opinions: People are accusing each other of being \"Red spies\". The Red Scare of the 1950s consisted of a panic-stricken fear of communism.\nMore examplesFewer examplesHe was exposed as a Red agent by Allied prisoners of war. He foils a Red plot to drop an atom bomb on their own troops.The Red soldiers have retreated to the nearby foothills.\nSMART Vocabulary: related words and phrases\nPolitics - general words\nanti-capitalism\nanti-capitalist\nanti-communism\nanti-communist\nanti-fascism\ninterparty\ninterpellate\ninterpellation\ninterventionist\nlab\non message\nOrwellian\noverstep\nparliament\nparty politics\nstatesman\nstatesmanlike\nstateswoman\nsubsidiarity\nsuper-conservative\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPolitical movements & groups\nAdd to word list\nAdd to word list\n(of) the color of fresh blood: red gloves [ U ] She wore red. [ C ] These reds don’t match.\nphysics Red is also the color of light with the longest waves that humans can see. Idiom\nin the red\nworld history a communist (= a person who believes in shared ownership of property and control of the methods of production)\nin the red\nAdd to word list\nAdd to word list\nFINANCE a company or organization that is in the red has lost money in a particular period: Currently the group is in the red by $1.7 million.\nSTOCK MARKET shares that are in the red have fallen in value: Almost all stocks on the FTSE 250 were in the red and the index finished 426.8 points lower.\nBANKING a bank account that is in the red has an amount that is less than zero: Increasing numbers of people are finding their bank balances in the red once they've paid their monthly bills.\ninto the red\nFINANCE, BANKING into a situation where you are losing money after making a profit: go/fall/slide into the red Many technology firms have fallen deep into the red after a collapse in revenues from the telecoms industry.\nSTOCK MARKET if a stock market goes into the red, it falls to a value that is below the one at which it started: go/fall/slide into the red Stock markets slid into the red by late morning. Compare\nblack noun"}