{"id":304425,"name":"redevelopment","type":"noun","us_sound":"ˌriː.dɪˈvel.əp.mənt","us_link":"../audio/r/usrecon026.mp3","uk_sound":"ˌriː.dɪˈvel.əp.mənt","uk_link":"../audio/r/ukrecum023.mp3","content":"Add to word list\nAdd to word list\nC1 the act or process of changing an area of a town by replacing old buildings, roads, etc. with new ones: Total cost of the proposed redevelopments is not yet known. a list of redevelopment projects planned for the neighbourhood See\nredevelop\nMore examplesFewer examplesThe city is currently undergoing substantial redevelopment.Redevelopment has just begun in the area.They are providing $200 million over five years for cleanup and redevelopment efforts.\nSMART Vocabulary: related words and phrases\nCivil engineering in general\nbrownfield\nbuilt environment\ncaisson\ncivil engineer\ncivil engineering\ngeotechnical\ninfrastructure\nlineman\nlinesman\nplanning\nplanning permission\npurpose-built\nquantity surveyor\nreclamation\nstructural engineer\nsubsea\nsurveyor\ntown planner\ntown planning\ntrig point\nSee more results »\nAdd to word list\nAdd to word list\nthe improvement of an area that is in bad condition, esp. an area of old buildings in a city: [ U ] Parking is something many plans for downtown redevelopment now recognize as critical.\nAdd to word list\nAdd to word list\nthe process of replacing the buildings in an area with new ones: A recently signed privatization agreement should speed up the city's clean-up and redevelopment. The redevelopment of the park buildings has caused controversy. The committee chose 17 redevelopment zones for rebuilding. a redevelopment project/program/scheme a redevelopment authority/agency redevelopment efforts/opportunities urban/downtown/city centre redevelopment office/property redevelopmentsa £32m/$1bn/500-acre redevelopment Work will begin next month on the first phase of the 450-acre redevelopment.be demolished/sold off/targeted for redevelopment Exclusive coastal locations are increasingly being targeted for redevelopment."}