{"id":304377,"name":"redeposit","type":"verb","us_sound":"ˌriː.dɪˈpɑːz.ɪt","us_link":"../audio/r/cdo0622usrede1473.mp3","uk_sound":"ˌriː.dɪˈpɒz.ɪt","uk_link":"../audio/r/cdo0622ukrede1537.mp3","content":"redeposit verb [T]\n(money)\nAdd to word list\nAdd to word list\nto put something valuable, especially money, in a bank or safe (= a strong box or cupboard with locks) again, for a second, third, etc. time: If a guest wishes to redeposit valuables, a new receipt must be issued every time. Just withdraw £20, then redeposit it back to the same account.\nMore examplesFewer examplesPeople are withdrawing money and then re-depositing it in order to claim the higher rate.You can withdraw the funds and redeposit them, but you must do this within 60 days.Efforts to persuade customers who had withdrawn money to redeposit their savings with the building society had been successful.\nSMART Vocabulary: related words and phrases\nSaving money\nbank\ndeposit account\ndepositor\ndirect deposit\ninterest rate\nISA\non deposit idiom\npension plan\nput\nput something aside\nput something by\nretirement plan\nsalt\nsalt something away\nsave/keep money for a rainy day idiom\nscrimp\nsquirrel something away\nTESSA\nundersaver\nwar chest\nSee more results »\nredeposit verb [T]\n(leave)\nto leave something, especially a layer of a substance, in a place again, after it has been moved: It is possible to identify past sea levels with some accuracy using redeposited shells. If these chemicals are introduced into the water, they can be redeposited on shorelines, travel downstream, and accumulate in fish.\nMore examplesFewer examplesThese tiny grooves, over time, redeposit accumulated bone minerals to release them in a fluid state into the bloodstream when needed.These beaches are repeatedly eroded and redeposited.Osteocytes covered by bone both resorb and redeposit bone.\nSMART Vocabulary: related words and phrases\nPlacing and positioning an object\n-based\nappose\naround\nchange something around\ncircle\nconsign\nfit\ngone\ninstall\nlie\nmanoeuvrable\npile (something) up\nplant\nreinstall\nreinstallation\nrelocate\nreorientate\nreorientation\ntranspose\ntransposition\nSee more results »"}