{"id":304546,"name":"redisplay","type":"verb","us_sound":"ˌriː.dɪˈspleɪ","us_link":"../audio/r/cdo0622usredi1478.mp3","uk_sound":"ˌriː.dɪˈspleɪ","uk_link":"../audio/r/cdo0622ukredi1542.mp3","content":"redisplay verb [T often passive]\n(IN MUSEUM, ETC.)\nAdd to word list\nAdd to word list\nto arrange something or a collection of things again in a new place or way so that it can be seen by the public: Redisplaying the exhibits in a flexible, accessible way will embody our commitment to being a modern city. Most of the collection would be re-displayed in another building on the site.\nMore examplesFewer examplesThe collection will be redisplayed on Oct. 6 after years of storage.They will be working on the sarcophagus before it is re-displayed in a new Ancient Egyptian gallery.The permanent collection will be redisplayed on the first floor.The frieze has been re-displayed in the British Museum.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensive\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nreflect\nspeak\nvent\nvirtue signalling\nvisualization\nwhiff\nSee more results »\nredisplay verb [T often passive]\n(ON SCREEN)\nto show words, pictures, etc. again for a second, third, etc. time on a screen: If you have lost the task bar, just press Ctrl-Esc to redisplay it. Click here to re-display the list of houses to allow you to select another house.\nMore examplesFewer examplesThe error bars from these graphs are redisplayed on each of the three graphs below it.If an unknown code is entered, the prompt will be re-displayed.Often the search string will be redisplayed on the result page to indicate what was searched for.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensive\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nreflect\nspeak\nvent\nvirtue signalling\nvisualization\nwhiff\nSee more results »\nredisplay noun\n(IN MUSEUM, ETC.)\n[ S or U ] the act of arranging something or a collection of things again in a new place or way so that it can be seen by the public: A redisplay has been forced on English Heritage by the buildingconstruction work. The committee have been consulted over the redisplay of the existing porcelain collection.\nMore examplesFewer examplesSeveral exhibits await redisplay in a second room now being prepared.He paid £2 million for a lavish re-display of the world-famous collection.They have invested in the repair and redisplay of damaged material in the National Museum.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensive\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nreflect\nspeak\nvent\nvirtue signalling\nvisualization\nwhiff\nSee more results »\nredisplay noun\n(ON SCREEN)\n[ U ] the fact of words, pictures, etc. being shown electronically again, for a second, third, etc. time, for example on a computer screen: Instantaneous images can also be saved for redisplay or for printout. It is forbidden to copy any of the recipes for redisplay on other web sites.\nMore examplesFewer examplesTo exit redisplay mode, simply press Scroll Lock again.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\nmeg\noptical\nprotocol\nsimulation\ntethering\ntexturing\nthreading\ntick box\ntimesharing\nSee more results »"}