{"id":304687,"name":"redraft","type":"verb","us_sound":"ˌriːˈdræft","us_link":"../audio/r/cdo0622usredr1485.mp3","uk_sound":"ˌriːˈdrɑːft","uk_link":"../audio/r/cdo0622ukredr1549.mp3","content":"Add to word list\nAdd to word list\nto draft (= write a version of) a document again, for the second, third, etc. time: They have to redraft legislation that is no longer compatible with current rules. She drafted and re-drafted this letter carefully.\nMore examplesFewer examplesHe wrote slowly, constantly redrafting his papers.At 7.30 am, the redrafted treaty was delivered to them.It was after this incident that her father re-drafted his will.They are calling for a radical redrafting of the bill.\nSMART Vocabulary: related words and phrases\nEditing & compiling\nabridged\nanthologist\nblue pencil\nbowdlerization\nbowdlerize\nbowdlerized\nco-edit\ncompile\ndub\nexcerpt\nlexicographer\nnon-editorial\nover-edit\npost-editing\nproofreading\nrecension\nrevised\nundubbed\nunfiltered\nunrevised\nSee more results »\na second, third, etc. version of a text, a formal document, etc., or the process of producing it: After around four redrafts, a compromise document was finally revealed. The other side may demand a re-draft before they will even discuss it.\nMore examplesFewer examplesThe bill finally got its royal assent yesterday, after years of debate and countless redrafts.She will be responsible for overseeing a redraft of the plans.Your re-draft of the contract set out things more clearly than our original.\nSMART Vocabulary: related words and phrases\nPieces of writing\nannotation\nbiographic\nblog post\nChyron\ncreative writing\ncutting\ndraft\nfanfiction\nfemslash\ninscription\nintertextual\nintertextuality\nintertextually\njottings\nlegend\npassage\nself-portrait\nsubheading\ntranscript\ntypescript\nSee more results »\nAdd to word list\nAdd to word list\nto write a document, an agreement, etc. again, making changes and improvements: The contract is being redrafted to clarify certain points. redraft noun [ C ]\nHe will be responsible for overseeing a redraft of the plans."}