{"id":304793,"name":"redundancy","type":"noun","us_sound":"rɪˈdʌn.dən.si","us_link":"../audio/r/redundancy.mp3","uk_sound":"rɪˈdʌn.dən.si","uk_link":"../audio/r/ukredou008.mp3","content":"redundancy noun [C or U]\n(NOT EMPLOYED)\nAdd to word list\nAdd to word list\nC1 UK a situation in which someone loses their job because their employer does not need them: The economic downturn has meant 10,000 redundancies in the Northeast. She took voluntary redundancy.\nMore examplesFewer examplesI live in dread of redundancy.There's a lot of redundancy in the area.He was so fed up at work that redundancy was starting to look quite appealing.Some people would opt for redundancy rather than redeployment.They got rid of 80 staff in the latest round of redundancies.\nSMART Vocabulary: related words and phrases\nTypes of employment\nadmin\nadministrative\nadministrative assistant\nadministratively\nat the coalface idiom\njobbing\njobless\njoblessness\njobseeker\nlabour-intensive\nqualified\nrecertify\nredundant\nretcon\nroustabout\nwhite-collar\nwho's who idiom\nwilderness years idiom\nwork experience\nwork placement\nSee more results »\nredundancy noun [C or U]\n(NOT NEEDED)\na situation in which something is unnecessary because it is more than is needed: The aircraft has seven computer systems running in parallel, so as to provide enough redundancy to cope with computer breakdowns.\nlanguage\n&#160; specialized the unnecessary use of more than one word or phrase meaning the same thing: Avoid redundancy or unnecessary words. \"The phrase 'humourless workplace' is a redundancy,\" he says. Synonym\ntautology\nMore examplesFewer examplesHe said the symposium has been invaluable in reducing redundancy in research.All the programs are being scrutinized for effectiveness, and there is an emphasis on seeking out and eliminating redundancies.In the case of images, considerable redundancy can be found simply by locating parts of the image that are the same.\nSMART Vocabulary: related words and phrases\nToo much and unnecessary\nado\nbe up to your neck (in something) idiom\nbellyful\nbinge\ncarry/take coals to Newcastle idiom\ndrown\ngush\nhave your (fair) share of something idiom\nhyper\nimmoderate\nimmoderately\ninappeasable\noverdose\nplay gooseberry idiom\nplenty\npleonasm\npleonastic\nplethora\nunwarranted\nweigh someone/something down\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSaying again\nAdd to word list\nAdd to word list\nHR a situation in which someone loses their job because their employer does not need them: The takeover is expected to result in over 1,000 redundancies.be threatened with/face redundancy 200 workers at the plant face redundancy.volunteer for/take redundancy Employees feel their only options are to move or take redundancy.compulsory/voluntary redundancy The bank has asked its 700 support staff to consider voluntary redundancy. heavy/large-scale/widespread redundancies a redundancy programme/scheme redundancy costs a redundancy notice Compare\nlayoff See also\ncollective redundancy\nvoluntary redundancy"}