{"id":304795,"name":"redundant","type":"adjective","us_sound":"rɪˈdʌn.dənt","us_link":"../audio/r/redundant.mp3","uk_sound":"rɪˈdʌn.dənt","uk_link":"../audio/r/ukredou009.mp3","content":"redundant adjective\n(NOT NEEDED)\nAdd to word list\nAdd to word list\nC2 (especially of a word, phrase, etc.) unnecessary because it is more than is needed: In the sentence \"She is a single unmarried woman\", the word \"unmarried\" is redundant.\nSMART Vocabulary: related words and phrases\nToo much and unnecessary\nado\nbe up to your neck (in something) idiom\nbellyful\nbinge\ncarry/take coals to Newcastle idiom\ndrown\ngush\nhave your (fair) share of something idiom\nhyper\nimmoderate\nimmoderately\ninappeasable\noverdose\nplay gooseberry idiom\nplenty\npleonasm\npleonastic\nplethora\nunwarranted\nweigh someone/something down\nSee more results »\nredundant adjective\n(NOT EMPLOYED)\nB2 UK having lost your job because your employer no longer needs you: To keep the company alive, half the workforce is being made redundant.figurative New technology often makes old skills and even whole communities redundant.\nMore examplesFewer examplesThe company was losing money and it had to make people redundant.She was made redundant a year ago and hasn't found any work since.They're threatening to make a third of the workforce redundant.She was told she was being made redundant yesterday.He was made redundant and given a big pay-off.\nSMART Vocabulary: related words and phrases\nTypes of employment\nadmin\nadministrative\nadministrative assistant\nadministratively\nat the coalface idiom\njobbing\njobless\njoblessness\njobseeker\nlabour-intensive\nqualified\nrecertify\nredundancy\nretcon\nroustabout\nwhite-collar\nwho's who idiom\nwilderness years idiom\nwork experience\nwork placement\nSee more results »\nAdd to word list\nAdd to word list\nmore than what is usual or necessary, esp. using extra words that mean the same thing: My English teacher was merciless if what we wrote was abstract, sentimental, or redundant.\nBr People who are redundant have become unemployed because they are no longer needed at their place of work. redundancy noun [ U ] us\nYour browser doesn't support HTML5 audio\n/rɪˈdʌn·dən·si/\nThey’re trying to cut the redundancy of some federal programs.\nAdd to word list\nAdd to word list\nHR having lost your job because your employer no longer needs you: redundant employees/staff/workers\nbe made redundant\nHR to lose your job because your employer no longer needs you: She was made redundant from the company after eight years.\nnot needed or more than is needed: Old copies of a textbook soon become redundant when a new edition comes out.redundant buildings/equipment/properties The levels of revenue generated by the auction sale of redundant properties was very encouraging."}