{"id":304756,"name":"reduce","type":"verb","us_sound":"rɪˈduːs","us_link":"../audio/r/reduce.mp3","uk_sound":"rɪˈdʒuːs","uk_link":"../audio/r/ukredou006.mp3","content":"Add to word list\nAdd to word list\nB1 to become or to make something become smaller in size, amount, degree, importance, etc.: Do nuclear weapons really reduce the risk of war? The plane reduced speed as it approached the airport. My weight reduces when I stop eating sugar. We bought a TV that was reduced from £500 to £350 in the sales. I reduced the problem to a few simple questions.\nThesaurus: synonyms, antonyms, and examples\nto become smaller or lessdecreaseThe tests show that the tumour has decreased in size since we started treatment. lessenA healthy diet lessens your risk for cardiovascular disease.lowerThey've just lowered the age at which you can join.reduceThey've just reduced the price.bring downThey are bringing down their prices.dropStock prices dropped today after the company's announcement.\nSee more results »\nto heat a liquid until it becomes thicker and less in quantity; to become thicker and less in quantity in this way: Reduce the sauce by boiling for five minutes. Simmer until the liquid has reduced by about one third.\nMore examplesFewer examplesThe government has pledged to reduce the amount of chemicals used in food production.Wearing the correct type of clothing will reduce the risk from radiation.When one airline reduces its prices, the rest soon follow suit.Mindful of the poor road conditions, she reduced her speed to 30 mph.We are firmly committed to reducing unemployment.\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nabridgment\nattenuate\nattenuated\nattenuating\nattenuation\nboil\ndamp\nfall off\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nroll back something\nrollback\nrun someone/something down\nrundown\nsag\nshave\ntelescope\ntumble\nSee more results »\nIdiom\nreduce, reuse, recyclePhrasal verbs\nreduce someone to something\nreduce something to something\nAdd to word list\nAdd to word list\nto make something less in size, amount, degree, importance, or price: A low-fat diet can reduce the risk of heart disease. Grunn employs 17,900 people, but that number will be reduced by 500 workers. All electronic equipment in the store has been reduced (= lowered in price).\nTo reduce someone or something to a particular state is to cause that person or thing to be in that state: Without any information, we’ve been reduced to guessing what happened. The town was reduced to rubble in the fighting.\nAdd to word list\nAdd to word list\nto make something less in price, size, amount, etc.: reduce costs/prices The retailer moved its supply base overseas to reduce costs.reduce risk/debt/losses Diversification is a good way of reducing risk. reduce emissions/waste/pollution He decided to reduce his hours to give him more time with his family. reduce sth by sth The bank planned to reduce its staff levels by around 20% by 2012.reduce sth from sth to sth The reorganization will reduce the number of managers from 15 to no more than 8. Mercury is reducing its stake in the company to 10 percent.\nreduce, reuse, recycle\nENVIRONMENT, SOCIAL RESPONSIBILITY an expression used to encourage people to waste less, by using less and using things again, in order to protect the environment"}