{"id":304776,"name":"reduction","type":"noun","us_sound":"rɪˈdʌk.ʃən","us_link":"../audio/r/reduction.mp3","uk_sound":"rɪˈdʌk.ʃən","uk_link":"../audio/r/ukredou007.mp3","content":"reduction noun\n(MAKING SMALLER)\nAdd to word list\nAdd to word list\nB2 [ C or U ] the act of making something, or of something becoming, smaller in size, amount, degree, importance, etc.: a reduction in traffic huge price reductions\nThesaurus: synonyms, antonyms, and examples\nthe fact of getting smaller or becoming lessdecreaseThere has been a steady decrease in the number of visitors.fallA fall in the price of petrol is unlikely.fall-offThere's been a sharp fall-off in demand for the product since the company's scandal broke.falling-offThere has been a slight falling-off in public sector employment growth.riseThere has been a sharp rise in home sales this month.\nSee more results »\n[ C ] a copy of a photograph, picture, etc. that is smaller than the original one\nMore examplesFewer examplesThe treaty has led to a dramatic reduction in the number of land-based missiles in Europe.Stiffening competition in the market has led to a reduction in the company's profits this year.The reduction in funds is throttling the development of new programmes.The airline halved its overseas service because of a sharp reduction in traffic.The Green Party have called for a substantial reduction in the emission of greenhouse gases by the UK.\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nabridgment\nattenuate\nattenuated\nattenuating\nattenuation\nboil\ndamp\nfall off\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nroll back something\nrollback\nrun someone/something down\nrundown\nsag\nshave\ntelescope\ntumble\nSee more results »\nreduction noun\n(CHEMISTRY)\n[ U ]\n&#160; chemistry\n&#160; specialized the addition of one or more electrons to a chemical element: Oxidation, the loss of electrons, is always accompanied by reduction, the gain of the same electrons.\nSMART Vocabulary: related words and phrases\nChemistry - general words\nacceptor\naerosol\naerosolize\nallotrope\namphiprotic\nchemical formula\ndistilled water\nelectrolyte\nendocrine disruptor\nendothermic\nepitaxial\nepitaxially\nepitaxy\ninorganic chemistry\nionic bond\nnonelectrolyte\nnonreactive\npreatomic\nreactive\nreactivity\nSee more results »\nreduction noun\n(MEDICAL)\n[ C or U ]\n&#160; medical\n&#160; specialized the act of putting a broken bone or another part of the body back into its correct position: Reduction of the fracture corrects and maintains alignment. The displaced fracture required open reduction and internal plate fixation, together with dental wire to stabilize the front teeth. the reduction of a dislocated shoulder The technology allows surgeons to visualize fracture reductions.\nAdd to word list\nAdd to word list\n[ C or U ] the process of making something less in price, size, amount, etc., or the fact of it becoming less: a reduction in sth The cutbacks have required a 10% reduction in staff numbers. Policyholders will be preparing themselves for further reductions in bonuses on maturing policies.a dramatic/significant/substantial reduction I was warned of a significant reduction in the projected payout. a gradual/slight/steady reductiondebt/deficit/spending reduction The emphasis is on long-term debt reduction.rate/tariff/tax reduction Banks have announced mortgage rate reductions to bolster the housing market. poverty reduction emissions/greenhouse gas reductions cost reduction programs/targets\n[ C ]\n&#160; COMMERCE an amount by which the price of something is reduced: to get/make a reduction on sth I got a reduction on the skirt because there was a button missing.big/massive reductions Stores are offering big reductions this weekend."}