{"id":305277,"name":"referee","type":"noun","us_sound":"ˌref.əˈriː","us_link":"../audio/r/referee.mp3","uk_sound":"ˌref.əˈriː","uk_link":"../audio/r/ukredou017.mp3","content":"referee noun [C]\n(JUDGE)\nAdd to word list\nAdd to word list\nB2 a person who is in charge of a sports game and who makes certain that the rules are followed: We only lost the game because the referee was biased.\nOSTILL/iStock/Getty Images Plus/GettyImages\na person or organization that helps to find a fair answer to a disagreement: A judge is acting as referee in the pay dispute between the trade union and management.\nMore examplesFewer examplesThe footballer appealed to the referee for a free kick.He was suspended for four matches after arguing with the referee.The referee decided to allow the goal.The referee whistled and the game was over.Referees have been instructed to penalize players who deliberately waste time.\nSMART Vocabulary: related words and phrases\nRefereeing & judging in sport\nadjudicate\nadjudication\nadjudicator\nassistant referee\ncall\ncaution\ncooler\nfair play\nfourth official\njury\nref\nregulation time\nscore\nscorekeeper\nscorer\nsending off\nsin-binning\nsplit decision\numpire\nyellow card\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople who analyse and judge\nreferee noun [C]\n(SUPPORTER)\nUK (also reference) a person who knows you and who is willing to describe and, usually, praise you, in order to support you when you are trying to get a job, etc.: She gave her college tutor as her referee to the interviewer.\nSMART Vocabulary: related words and phrases\nApplying for a job\nacqui-hire\nadvertisement\nanoint\nanointed\napplicant\nassign\nelect\nemploy\nemployable\nemployment\nemployment agency\nequality, diversity and inclusion\nnomination\nprospect\nreinstate\nreinstatement\nrelocation expenses\nresume\nretain\ntestimonial\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSupporters, members & defenders\nto be a referee in a game: They had to ask one of the spectators to referee (the match).\nSMART Vocabulary: related words and phrases\nRefereeing & judging in sport\nadjudicate\nadjudication\nadjudicator\nassistant referee\ncall\ncaution\ncooler\nfair play\nfourth official\njury\nref\nregulation time\nscore\nscorekeeper\nscorer\nsending off\nsin-binning\nsplit decision\numpire\nyellow card\nSee more results »\nAdd to word list\nAdd to word list\n(in some sports) a person who controls a game and makes sure the rules are followed, or more generally a person who helps to find a fair solution to a disagreement: Fans booed the referee’s call. referee verb [ I/T ] us\nYour browser doesn't support HTML5 audio\n/ˌref·əˈri/\n[ T ] He volunteered to referee the game.\nAdd to word list\nAdd to word list\nHR\n&#160; UK ( US reference) a person who knows you and who is willing to describe your character and abilities in order to support you when you are trying to get a job, etc.: give/name/list sb as a referee People who have attended the courses can always give the course tutor as a referee. Applications in the form of a CV should include the names of two referees.\na person or an organization that helps to find a fair answer to a disagreement: That law is designed to sort out the finances of an overextended debtor, with a judge acting as referee to protect the interests of creditors.\na person who checks a technical document before it is published: Technical referees are experts in their field and eminently suitable to comment on the scientific soundness of the proposal.\nCOMMERCE\n&#160; (also referee in case of need) a person whose name is on a bill of exchange (= document ordering payment at a particular time for goods or services) and who can be asked for payment if the bill is not paid: The holder may exercise his right of presenting the bill of exchange to the referee in case of need."}