{"id":305282,"name":"reference","type":"noun","us_sound":"ˈref.ɚ.əns","us_link":"../audio/r/reference.mp3","uk_sound":"ˈref.ər.əns","uk_link":"../audio/r/ukredou019.mp3","content":"reference noun\n(MENTION)\nAdd to word list\nAdd to word list\nB2 [ C or U ] a mention of something: Knowing what had happened, I avoided making any reference to (= mentioning) weddings.formal I am writing with/in reference to (= in connection with) your letter of 15 March.\nMore examplesFewer examplesShe made a veiled reference to her former employer.He made several references to his time in France.I am writing to you with reference to the job advertised in yesterday's newspaper.He spoke at length without once making reference to the current crisis.She spoke in very vague terms and there were no direct references to specific situations.\nSMART Vocabulary: related words and phrases\nQuoting & making references\nallude to someone/something\nallusion\nallusive\nallusiveness\nas for someone/something idiom\nbandy\nbandy something around\nbring\nen passant\nfurther\nhark\nquotable\nquotably\nquote\nquote... unquote idiom\nref\nrefer to someone/something\nreferent\nreported speech\ntouch\nSee more results »\nreference noun\n(IN A PIECE OF WRITING)\nB2 [ C ] a writer or a book, article, etc. that is mentioned in a piece of writing, showing you where particular information was found\n[ C ] (abbreviation ref) in a business letter, a number that tells you who to speak to or where to look for more information: In all future letters on this subject, please use/quote our reference JW/155/C.\nMore examplesFewer examplesYou need to make a list of all your references.There was a long list of references at the end of the article.Where are your references?\nSMART Vocabulary: related words and phrases\nQuoting & making references\nallude to someone/something\nallusion\nallusive\nallusiveness\nas for someone/something idiom\nbandy\nbandy something around\nbring\nen passant\nfurther\nhark\nquotable\nquotably\nquote\nquote... unquote idiom\nref\nrefer to someone/something\nreferent\nreported speech\ntouch\nSee more results »\nreference noun\n(LETTER)\nB2 [ C ] a letter that is written by someone who knows you, to describe you and say if you are suitable for a job, course, etc.: My old headteacher said he would write/give me a glowing (= very good) reference.\nMore examplesFewer examplesWe need a reference from your former employer.I like to keep in with my ex-employer, you never know when you might need a reference.We should really have taken up her references.I'm often asked to provide references for ex-employees.She provided a written reference from a previous employer.\nSMART Vocabulary: related words and phrases\nApplying for a job\nacqui-hire\nadvertisement\nanoint\nanointed\napplicant\nassign\nelect\nemploy\nemployable\nemployment\nemployment agency\nequality, diversity and inclusion\nnomination\nreferee\nreinstate\nreinstatement\nrelocation expenses\nresume\nretain\ntestimonial\nSee more results »\nreference noun\n(LOOK AT)\nC1 [ U ] a quick look at a book, piece of paper, etc. in order to find information and help: He made the whole speech without reference to the notes in front of him.\nSMART Vocabulary: related words and phrases\nReading\ncross-refer\ndeconstruct\ndeconstruction\ndip\ndip into something\nflick through something\nhave your nose in a book idiom\nleaf\nlip-read\nnose\nperusal\npore over something\nput something/someone down\nread someone's lips idiom\nread something out\nriffle\nsemiotics\nthumb through something\ntsundoku\nwade through something\nSee more results »\nreference noun\n(MENTIONING)\nAdd to word list\nAdd to word list\n[ C/U ] the act of mentioning someone or something in speech or writing: [ U ] Avoid making any reference to his accident.\nreference noun\n(STATEMENT)\n[ C ] a written statement describing your character and abilities, or the person who writes this statement: She has excellent references. Could I list you as a reference on my application?\nreference noun\n(CONNECTION)\n[ U ] the act of making a connection between subjects: His comments were in reference to a stupid question someone asked.\nreference noun\n(AUTHORITY)\n[ C/U ] a text that records facts and information: [ C ] There is a list of the author’s references at the end of the article.\n[ C/U ] A reference is also the act of looking at a text: [ U ] These books are for reference only and may not be checked out of the library.\n[ C/U ] A reference can also mean a reference book: [ C ] What references did you use for this research?\nAdd to word list\nAdd to word list\n[ C ]\n&#160; COMMUNICATIONS, WORKPLACE\n&#160; ( abbreviation ref) a set of numbers or letters on a document such as a business letter, used so that people know what it relates to: give/quote/use a reference In all future letters on this subject, please quote our reference JW/155/C/2011. Please write with a full CV quoting the appropriate reference number.\n[ C ]\n&#160; HR a letter that is written by someone who knows you, often a previous employer, to describe you and say if you are suitable for a job, course, etc.: give/write sb a reference His former boss gave him an excellent reference. She has good references and an acceptable CV.check/follow up/take up references We still need to recall the candidate for a second interview, and follow up references. a reference check Compare\ntestimonial\nHR\n&#160; (also personal reference, UK also referee) a person who knows you and who is willing to write a reference for you: give/list/name sb as a reference He said he was happy for me to list him as a reference.\n[ C or U ] a mention of something: make reference to sth He didn't make any reference to the new product in his report.\n[ C or U ] comparison with something: reference to sth Comparative advertising is where one trader advertises his goods by reference to another trader's goods.\n[ C ] a statement that gives information about the financial situation and business history of a company, an organization, etc.: Check payment records of prospective customers through league tables, status agency reports, bank or trade references twice a year.\n[ U ] the action of looking at a book, piece of paper, etc. in order to find information or help: reference to sth He made the whole speech without reference to the notes in front of him. reference books/works/publishing\nfor (future) reference\nin order to be looked at for information in future: You should keep the prospectus on file for future reference.\nfor future reference, ...\nused when telling someone something so they know about it in future: For future reference, he prefers to be addressed as 'Mr.'\nin/with reference to sb/sth formal\nused, especially in business letters, to say what you are writing or talking about: I am writing with reference to your letter of 15 March.\nterms of reference\nthe subjects or questions which a study or report is intended to include: The inquiry's terms of reference included the consideration of pay and conditions in the fire service. See also\nbank reference\ncredit reference\nto refer to someone or something: He spoke about his ambitious plans, referencing writer and motivator Dale Carnegie. See Diagram 3.1 referenced above."}