{"id":305381,"name":"refit","type":"verb","us_sound":"ˌriːˈfɪt","us_link":"../audio/r/usredne011.mp3","uk_sound":"ˌriːˈfɪt","uk_link":"../audio/r/ukrefit002.mp3","content":"Add to word list\nAdd to word list\nto put a ship or a building, etc., especially a public or industrial building, back into good condition by repairing it or adding new parts: The bars will be refitted and re-branded by their new owner. The outmoded plants are refitted with clean technology. The ship sailed into the dock to refit.\nMore examplesFewer examplesWe refitted our kitchen a couple of years ago.The cost of refitting the Mexican tuna fleet to use dolphin-safe nets and techniques is put at $25 million. Repeated attempts to start up a newly refitted reactor were delayed by a series of minor faults.\nSMART Vocabulary: related words and phrases\nCorrecting and mending\ncalibration\nclean (someone/something) up\ncorrection\nfiddle (around) with something\nfine-tune\nmess\nrecondition\nreconstruct\nreconstruction\nrectifiable\nrectification\nremedy\nrevise\nscratch\nset/put the record straight idiom\nsmooth something away\nsmoothen\nsort\nsort something out\ntinker\nSee more results »\nthe process of putting a ship or a building, etc., especially a public or industrial building, back into good condition by repairing it or adding new parts: The yacht was undergoing a refit in a boatyard. Major store refits are planned for the months ahead.\nMore examplesFewer examplesAfter a £9 million refit many of the rides now have an interactive feel.The boat underwent an extensive refit, which improved it both aesthetically and functionally.Is there actually enough Royal Navy refit work to keep two dockyards in full employment?\nSMART Vocabulary: related words and phrases\nCorrecting and mending\ncalibration\nclean (someone/something) up\ncorrection\nfiddle (around) with something\nfine-tune\nmess\nrecondition\nreconstruct\nreconstruction\nrectifiable\nrectification\nremedy\nrevise\nscratch\nset/put the record straight idiom\nsmooth something away\nsmoothen\nsort\nsort something out\ntinker\nSee more results »\nAdd to word list\nAdd to word list\nPROPERTY, COMMERCE, PRODUCTION to make repairs or changes to a building, factory, or store in order to improve it or change its purpose: The company plans to refit the plant so it can process crude oil from Canada, creating 80 new jobs. The pubs will be refitted and re-branded by their new owner.\nTRANSPORT to get a ship back into good condition by repairing it or adding new parts: The yard has won a £100m order to refit a nuclear submarine for the Royal Navy.\nPROPERTY, COMMERCE, PRODUCTION the process of making repairs or changes to a building in order to improve it or change its purpose: Last week the company opened its flagship store on Regent Street following a £13m refit. The chain has embarked on a major refit programme to draw in customers.\nTRANSPORT the process of getting a ship back into good condition: The total bill for salvage, repairs and refit will be €204 million. Reductions in the size of the fleet are threatening refit work for the shipyard."}