{"id":305358,"name":"refine","type":"verb","us_sound":"rɪˈfaɪn","us_link":"../audio/r/eus75909.mp3","uk_sound":"rɪˈfaɪn","uk_link":"../audio/r/ukredou027.mp3","content":"Add to word list\nAdd to word list\nto make something pure or improve something, especially by removing unwanted material: Crude oil is industrially refined to purify it and separate out the different elements, such as benzene.\nC2 to improve an idea, method, system, etc. by making small changes: Engineers spent many months refining the software.\nThesaurus: synonyms, antonyms, and examples\nto improve somethingimproveHis health has improved dramatically since he started exercising.get betterThe first part of the book isn't very good but it gets better.rallyThe team played badly in the first half but rallied in the second.recoverWe are still waiting for the economy to recover.look upOur financial situation is looking up.pick upBusiness is really beginning to pick up.\nSee more results »\nSMART Vocabulary: related words and phrases\nCorrecting and mending\ncalibration\nclean (someone/something) up\ncorrection\nfiddle (around) with something\nfine-tune\nmess\nrecondition\nreconstruct\nreconstruction\nrectifiable\nrectification\nremedy\nrevise\nscratch\nset/put the record straight idiom\nsmooth something away\nsmoothen\nsort\nsort something out\ntinker\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIndustrial processing\nMaking things better\nAdd to word list\nAdd to word list\nto make a substance pure by removing unwanted material: Sugar and oil are refined before use.\nTo refine something also means to improve it by making small changes: We haven’t finished refining the plan yet.\nAdd to word list\nAdd to word list\nPRODUCTION to improve something or to make it pure, especially by removing material that is not wanted: Crude oil is industrially refined to purify it.\nto improve an idea, a method, a system, etc. by making small changes: Engineers spent many months refining the software."}