{"id":305386,"name":"refix","type":"verb","us_sound":"ˌriːˈfɪks","us_link":"../audio/r/cdo0623usrefi3314.mp3","uk_sound":"ˌriːˈfɪks","uk_link":"../audio/r/cdo0623ukrefi3337.mp3","content":"refix verb\n(fasten)\nAdd to word list\nAdd to word list\n[ T ] to fasten something in position again so that it cannot move: While the plumber was there, he refixed the toilet seat as it kept getting loose. Removing and refixing the street sign should solve the problem.\nMore examplesFewer examplesRefix loose brackets with new screws.At the end of the tenancy, you will be required to refix the fence on the original boundary.Move the bracket slightly to one side and refix.The roof tiles were stripped off and refixed, or replaced with new tiles.She was sitting at the table, refixing the broken sunglasses with tape.\nSMART Vocabulary: related words and phrases\nFastening and tying\nanchor\nbale\nbe locked together idiom\nbelay\nboard something up\nbolt\nbound\nbowline\nhalf hitch\nharness\nhobble\nhogtie\nknotted\nstake\nstrap something up\nstrop\ntack\ntape something up\ntether\ntie someone down\nSee more results »\nrefix verb\n(arrange)\n[ I or T ] to arrange or agree something such as a time, place, or price for a second, third, etc. time: The final, originally arranged for next Saturday, is expected to be refixed. I'm completely booked up for the rest of the day, but why don't we refix for the end of next week? The price band has been refixed considering the developments in the financial markets globally.\nMore examplesFewer examplesThe match has been refixed for this Wednesday.Many homeowners are re-fixing mortgages at significantly higher rates.The weather has interfered with the football tournament dates, and the semi-finals are now refixed for New Year's Day.The meeting was called off yesterday afternoon and has been refixed to take place next week.\nSMART Vocabulary: related words and phrases\nDecisions and deciding\nascription\nbalance\nbe make or break for someone/something idiom\nbe on the horns of a dilemma idiom\nchoose\nclinch\nconclusion\nfix\nget it together idiom\nget something into your head idiom\nhammer something out\nhave a, some, etc. say in something idiom\nif/when it comes to the crunch idiom\nresolution\nsleep\ntightrope\ntilt\ntilt the balance/scales idiom\ntop-down\ntoss up\nSee more results »"}