{"id":305377,"name":"refire","type":"verb","us_sound":"ˌriːˈfaɪr","us_link":"../audio/r/cdo0623usrefi3313.mp3","uk_sound":"ˌriːˈfaɪər","uk_link":"../audio/r/cdo0623ukrefi3336.mp3","content":"refire verb\n(shoot)\nAdd to word list\nAdd to word list\n[ I or T ] to cause a weapon to shoot bullets, arrows, or missiles for a second, third, etc. time: It took, on average, five minutes for the gun crews to reload and refire. In no case will the gun be re-fired.\nMore examplesFewer examplesLaunchers can be reloaded and refired if more missiles are available in nearby storage.\nSMART Vocabulary: related words and phrases\nDetonation & bombardment\naerial bombardment\naerial photograph\nair raid\nairstrike\nblanket bombing\ndetonate\ndetonation\ndetonator\ndirect hit\ndive-bomb\ngo off\nguidance\npepper something with something\npetrol bomb\nprime\nsaturation bombing\nshell\nshelling\nshoot\nshooting\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGuns\nrefire verb\n(start machine)\n[ I or T ] to start an engine or a machine for a second, third, etc. time, or to start for a second, third, etc. time: The train runs out of steam every now and again, but generally gets re-fired. On one occasion, the motor stalled, but quickly refired.\nMore examplesFewer examplesShe re-entered the car, re-fired its noisy engine, and backed up.The ovens were allowed to go cold, and none were ever refired.As he tried to refire his Chevrolet, the other cars continued racing.\nSMART Vocabulary: related words and phrases\nMachines - Functioning\naction\nactuator\ndeactivation\nengaged\nfaultily\nfire someone up\nfunction as something/someone\nin commission idiom\nlight\noperate\noperative\npeg\npeg out\nplay something up\npower\npower (something) up\nreset\nroad\nself-driving\ntick\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOperating computers\nrefire verb\n(excite)\n[ T ] to cause someone to have a particular feeling for a second, third, etc. time: Recent research projects have refired my interest in this subject. The two goals re-fired her competitive urge.\nMore examplesFewer examplesWhen he won the race, it refired his determination.The decision by the two US giants to merge has re-fired speculation about other potential corporate deals.\nSMART Vocabulary: related words and phrases\nInspiring feelings in others\namuse\narousal\narouse\nemotive\nenthuse\nfill\nfire\nfreak\ninspirational\ninspirationally\ninspire\ninspirer\ninvocation\ninvoke\nkindle\nmove\nstirringly\ntouching\ntouchingly\nunmoving\nSee more results »\nrefire verb\n(remove from job)\n[ T ] to remove someone from their job for a second, third, etc. time, either because they have done something wrong or badly, or as a way of saving the cost of employing them: She has reorganised her staff members and even refired some. He has been hired and fired and re-hired and re-fired numerous times.\nMore examplesFewer examplesThree months after hiring me, he fired me. Then, a month later, he rehired me. Two months after that, he refired me.\nSMART Vocabulary: related words and phrases\nFiring staff\narse\naxe\nbe out on your ear idiom\ncast someone adrift idiom\nchop\nconstructive dismissal\ndecertification\nfiring\nget the push idiom\ngive someone the heave-ho idiom\nheave-ho\ninvalid someone out\nrelieve\nrelieve someone of something\nremoval\nremove\nrightsize\nrightsizing\nterminate\ntermination\nSee more results »\nrefire verb\n(heat)\n[ I or T ] to heat objects made of clay in a kiln (= a special oven) for a second, third, etc. time: Grind off the excess enamel and re-fire. Refired ceramics, collage, and found objects all figure in the show of 21 artists.\nMore examplesFewer examplesThe pots are fired at a high temperature and then dipped into glaze and re-fired at a higher temperature.It is possible to refire the mug at a low temperature using a semi precious metal such as silver gold to bond the cracks.During the re-firing, the silver migrates through the surface into the body of the glass.\nSMART Vocabulary: related words and phrases\nCeramics & pottery\namphora\nbiscuit ware\nbisque\nbisqueware\nbone china\nchina\nchinoiserie\nearthen\nearthenware\nfire\nglaze\nkaolin\nkiln\nporcelain\npotter\npotter's wheel\nterracotta\nthrow\nware\nSee more results »"}