{"id":305405,"name":"reflect","type":"verb","us_sound":"rɪˈflekt","us_link":"../audio/r/reflect.mp3","uk_sound":"rɪˈflekt","uk_link":"../audio/r/ukrefit008.mp3","content":"reflect verb\n(RETURN)\nAdd to word list\nAdd to word list\nB2 [ I or T ] If a surface reflects light, heat, sound, or an image, it sends the light, etc. back and does not absorb it: He saw himself reflected in the water/mirror/shop window. The light reflected off the surface of the water.\nMore examplesFewer examplesThe candlelight reflected on his gold wristwatch.Her black hair reflected the light from the garden as if it were a lantern.The whole place was aglow, with amber light reflected off teak veneer.The shiny brass reflected the light like a mirror.I could see my face reflected in his glasses.\nSMART Vocabulary: related words and phrases\nPhysics: optics, microscopy & lasers\nanti-reflection\nanti-reflective\nchromatic aberration\nconcentrator\nconverging lens\nelectron microscope\neyepiece\nfield glasses\nlaser\nlens\nmagnification\nmagnifying glass\nopera glasses\noptics\npolarization\npolarize\npolarized\npolarizer\nreflecting telescope\nreflection\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysical & chemical processes\nreflect verb\n(SHOW)\nB2 [ T ] to show, express, or be a sign of something: The statistics reflect a change in people's spending habits.\nMore examplesFewer examplesDoes television adequately reflect the ethnic and cultural diversity of the country?This poem reflects the poet's love of nature and his religious beliefs.The results of the survey reflect a considerable shift in attitudes towards the legal profession.The sombre atmosphere in the changing room reflected the mood of the team after its defeat in the final.They argue that the membership of the Council does not reflect the racial make-up of the city.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensive\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nreveal\nspeak\nunwrap\nvent\nvirtue signalling\nvisualization\nSee more results »\nreflect verb\n(THINK)\nB2 [ I ] formal to think carefully, especially about possibilities and opinions: The manager demanded time to reflect (on what to do). [ + that ] She reflected that this was probably the last time she would see him.\nThesaurus: synonyms, antonyms, and examples\nto think carefully about somethingconsiderDon't make any decisions before you've considered the matter.contemplateHe lay in a hospital bed contemplating his future.ponderShe sat back for a minute to ponder her next move in the game.mull overI need a few days to mull things over before I decide.reflectI spent a lot of time reflecting on what he'd said.agonizeShe agonized for days before agreeing to take the job.\nSee more results »\nMore examplesFewer examplesIt provides one with a chance to reflect on spiritual matters in solitude.The writer reflects on human injustice and iniquity.In many of his poems the poet reflects on the quietude of the countryside.He paused for a moment and reflected on the work in front of him.He spent the evening reflecting on the day's events.\nSMART Vocabulary: related words and phrases\nThinking and contemplating\na brown study idiom\nagonize\nagonize over/about something\nbeard-stroking\nbethink\ngrapple\nharbour\nin the cold light of day idiom\nintrospect\nintrospection\njoined-up thinking\nlateral thinking\nnavel\nreckon\nreweigh\nrumination\nrun through someone's mind/head idiom\nscratch your head idiom\nself-contemplation\nweigh\nSee more results »\nPhrasal verb\nreflect on someone/something\nreflect verb\n(SEND BACK)\nAdd to word list\nAdd to word list\n[ I/T ]\n&#160; physics to send back light, heat, energy, or sound from a surface: [ T ] Light-colored clothing reflects the sun’s heat rather than absorbing it. [ I ] Moonlight reflected off the surface of the lake.\nreflect verb\n(SHOW)\n[ T ] to show, express, or be a sign of something: His blank face reflected his boredom.\nreflect verb\n(THINK)\n[ I ] to think carefully: She felt she needed time to reflect on what to do next.\nreflector noun [ C ] us\nYour browser doesn't support HTML5 audio\n/rɪˈflek·tər/\nHis new lighting system uses lamps and reflectors. Idiom\nreflect on someone/something"}