{"id":305454,"name":"reflexivity","type":"noun","us_sound":"rɪ.fleksˈɪv.ə.t̬i","us_link":"../audio/r/cdo0318usrefl4074.mp3","uk_sound":"rɪ.fleksˈɪv.ə.ti","uk_link":"../audio/r/cdo0318ukrefl1173.mp3","content":"reflexivity noun [U]\n(IN THOUGHT)\nAdd to word list\nAdd to word list\nsocial science the fact of someone being able to examine their own feelings, reactions, and motives (= reasons for acting) and how these influence what they do or think in a situation: I had in that time developed a degree of reflexivity unusual for a teenager.\nMore examplesFewer examplesIn other words reflexivity counters the biases the researcher brings to her research.By reflexivity I mean the ability to stand back and look at your thinking and realise hey, maybe my view of reality is tainted by my desires.He said that much of what passes for theoretically informed research lacks any sense of critical distance or reflexivity about its own production and procedures.The agents' competence is assessed on the basis of their capacity for reflexivity and rationalisation of their actions.\nSMART Vocabulary: related words and phrases\nKnowledge and awareness\nacquaintance\nalertness\nas every schoolboy/schoolchild knows idiom\nastuteness\nat/in the back of your mind idiom\nfamiliarity\nfirsthand\ngeneral knowledge\ngnostic\ngrounding\nlived experience\nmetacognition\nnescience\nnescient\noff someone's radar idiom\nsensibility\nstreet smarts\ntheory of mind\nvisual literacy\nwitting\nSee more results »\nreflexivity noun [U]\n(GRAMMAR)\nlanguage (of words) the fact of being reflexive (= showing that the person who does the action is also the person who is affected by it) : The use of \"herself \" instead of \"her\" enforces syntactic reflexivity. The paper examines the way reflexivity is expressed in verbs in different languages. See\nreflexive (GRAMMAR)\nMore examplesFewer examplesThere is a lot of literature on the topic of reflexivity.How do different languages express reflexivity relations?Lust et al. 2000 give an overview of reflexivity markings in several Indian languages.\nSMART Vocabulary: related words and phrases\nLinguistics: verb forms, tenses & types of verbs\naccusative\nart\nbare infinitive\nbent\ncontinuous\ngerund\ninfinitive\nmodality\nnon-finite\nnon-progressive\npassive\npassivization\nperfective\npresent participle\nprogressive\nsubjunctive\nthe active voice\nthe future perfect\nthe past continuous\nthe past tense\nSee more results »"}