{"id":305416,"name":"reflection","type":"noun","us_sound":"rɪˈflek.ʃən","us_link":"../audio/r/reflection.mp3","uk_sound":"rɪˈflek.ʃən","uk_link":"../audio/r/ukrefit009.mp3","content":"reflection noun\n(IMAGE)\nAdd to word list\nAdd to word list\nB2 [ C or U ] the image of something in a mirror or on any reflective surface: In Greek mythology, Narcissus fell in love with his own reflection in a pool of water. He put silver foil around the fire to increase heat reflection.\nMore examplesFewer examplesShe was looking at her reflection in the mirror.She could see her reflection in the water, shimmering in the moonlight.She checked her reflection in the mirror.She caught sight of her reflection in the mirror on the door.He smiled at his reflection in the mirror.\nSMART Vocabulary: related words and phrases\nPhysics: optics, microscopy & lasers\nanti-reflection\nanti-reflective\nchromatic aberration\nconcentrator\nconverging lens\nelectron microscope\neyepiece\nfield glasses\nlaser\nlens\nmagnification\nmagnifying glass\nopera glasses\noptics\npolarization\npolarize\npolarized\npolarizer\nreflect\nreflecting telescope\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysical & chemical processes\nreflection noun\n(SENDING BACK)\n[ U ]\n&#160; physics\n&#160; specialized the return of light, heat, sound, or energy from a surface: He put silver foil around the fire to increase heat reflection. angle of reflection\nthe angle that a beam of light or other energy that is reflected from a surface makes with a line vertical to that surface: This is only visible at certain angles of reflection.\nSee more\nSMART Vocabulary: related words and phrases\nPhysical & chemical processes\nabsorbable\nabsorptive\nabsorptive capacity\nabsorptivity\nacidification\ndegradable\nexcitability\nexcitation\nexcite\nexergonic\nexothermic\nexothermic reaction\nimpregnate\nre-emission\nre-emit\nreabsorb\nreact\nreboil\nscald\nvaporize\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysics: optics, microscopy & lasers\nreflection noun\n(SIGN)\nC1 [ C usually singular ] a sign or result of something: The fact that soldiers are on the streets is a reflection of how terrified the government is.\nMore examplesFewer examplesThe film is a reflection of the violence that pervades American culture.Her novel is an accurate reflection of life in post-war Spain.I don't believe these exam results are a true reflection of your abilities.His poor job performance is a reflection of his lack of training.The grief after her death was a reflection of the great love that people felt for her.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensive\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nreflect\nspeak\nunwrap\nvent\nvirtue signalling\nvisualization\nSee more results »\nreflection noun\n(THOUGHT)\nC2 [ C or U ] formal serious and careful thought: On reflection (= after considering it), I decided I had been wrong. After 30 years as a judge, her reflections on/about justice were well worth listening to.\nSMART Vocabulary: related words and phrases\nThinking and contemplating\na brown study idiom\nagonize\nagonize over/about something\nbeard-stroking\nbethink\ngrapple\nharbour\nin the cold light of day idiom\nintrospect\nintrospection\njoined-up thinking\nlateral thinking\nnavel\nreckon\nreweigh\nrumination\nrun through someone's mind/head idiom\nscratch your head idiom\nself-contemplation\nweigh\nSee more results »\na reflection on someone/something\nsomething that makes other people have a particular opinion about someone or something, especially a bad opinion: Low test scores are a sad reflection on our school system.\nSee more\nreflection noun\n(SHOW)\nAdd to word list\nAdd to word list\n[ C ] something that shows, expresses, or is a sign of something: Their finely decorated home is a reflection of their good taste. The team’s losses of late seem to be a reflection on the coaching.\nreflection noun\n(SEND BACK)\n[ C/U ]\n&#160; physics the return of light, heat, sound, or energy from a surface\n[ C/U ] A reflection is also an image seen in a mirror or other shiny surface: Standing on the dock, we could see the reflection of the sky in the still water. angle of reflection physics\nThe angle of reflection is the angle that a beam of light or other energy that is reflected from a surface makes with a line vertical to that surface.\nreflection noun\n(THINKING)\n[ C/U ] careful thoughts: [ C ] Her reflections on life are recorded in her journal. [ U ] After much reflection, he decided to return to teaching."}