{"id":305450,"name":"reflexive","type":"adjective","us_sound":"rɪˈflek.sɪv","us_link":"../audio/r/reflexive.mp3","uk_sound":"rɪˈflek.sɪv","uk_link":"../audio/r/ukrefit014.mp3","content":"reflexive adjective\n(GRAMMAR)\nAdd to word list\nAdd to word list\nlanguage Reflexive words show that the person who does the action is also the person who is affected by it: In the sentence \"She prides herself on doing a good job\", \"prides\" is a reflexive verb and \"herself\" is a reflexive pronoun.\nSMART Vocabulary: related words and phrases\nLinguistics: grammatical terms\nablative\napposition\nappositive\nappositively\nattributively\ncollocate\nconcord\ndative\nfeminine\ngenitive\ninflected\nparticle\npost-modifier\npostposition\npostpositional\npostpositive\npostpositively\nquantifier\nsingular\nsyntax\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: reflexive forms\nreflexive adjective\n(MOVEMENT)\ndone because of a physical reaction that you cannot control: I hadn't meant to answer her, it was simply reflexive.\nSMART Vocabulary: related words and phrases\nReacting and responding\nact on something\nadverse reaction\nbacklash\nbat\nbat something back\nbite\nnon-responsive\non your toes idiom\noverreact\noverreaction\npearl-clutching\nreaction\nrespond\nstrike while the iron is hot idiom\nsupersensitivity\nticklish\nticklishly\ntoe\nultra-sensitive\nwake\nSee more results »\nGrammar\nPronouns: reflexive (myself, themselves, etc.)Reflexive pronouns end in -self or -selves. They refer back to the subject forms of personal pronouns (underlined in the example below): …\nReflexive pronouns for same subject and objectWe often use reflexive pronouns when the subject and the object of the verb refer to the same person or thing: …\nReflexive pronouns for emphasisWe can use reflexive pronouns for emphasis: …\nReflexive pronouns + by meaning aloneWe often use reflexive pronouns with by to mean ‘alone’ or ‘without any help’: …\nReflexive pronouns for politenessWe sometimes use reflexive pronouns instead of personal pronouns for politeness, but not as the subject of a clause: …\nAdd to word list\nAdd to word list\ngrammar showing that the action of the verb is directed back on the subject: In the sentence \"He hurt himself,\" \"hurt\" is a reflexive verb and \"himself\" is a reflexive pronoun."}