{"id":305548,"name":"reformat","type":"verb","us_sound":"ˌriːˈfɔːr.mæt","us_link":"../audio/r/cdo0623usrefo3317.mp3","uk_sound":"ˌriːˈfɔː.mæt","uk_link":"../audio/r/cdo0623ukrefo3340.mp3","content":"reformat verb [T or I]\n(COMPUTER DISK)\nAdd to word list\nAdd to word list\nto prepare a computer disk for use with a particular type of computer for a second, third, etc. time: I had to re-format my hard disk and reinstall everything. If you don't have the skill to fix your PC, the best idea is to re-format and start fresh.\nMore examplesFewer examplesDo not panic, therefore, if you accidentally reformat a disk that has useful data.Before you reformat your device, it is recommended that you back up your phone memory.Pages written in XML can automatically re-format themselves for convenient access by computer, telephone, or other devices.\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\ndrill down\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntoolbar\nvectorize\nvirtualization\nvirtualize\nwake word\nwhite hat\nzip file\nSee more results »\nreformat verb [T or I]\n(TEXT)\nto organize or arrange text according to a chosen pattern for a second, third, etc. time, especially on a computer: The app re-formats the pages to look good and save paper when printed out. If the text isn't quite right, I can always reformat.\nMore examplesFewer examplesYou can also use auto-fill to re-format a paragraph after you've edited some text in it and it is no longer nicely filled out.You may have to completely reformat some documents if the documents you are creating are very complex.I did some reformatting of the proposal and a spelling check.\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\ndrill down\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntoolbar\nvectorize\nvirtualization\nvirtualize\nwake word\nwhite hat\nzip file\nSee more results »\nthe preparation of a computer disk for use with a particular type of computer for a second, third, etc. time: Since this reformat, my laptop is working like new. A re-format will wipe everything off the drive.\nMore examplesFewer examplesHe found a successful way to remove the virus without a complete reformat of the hard drive. A clean re-format eradicates all the problems and brings your computer back to a \"healthy\" state.It took me another two reformats to get everything running well.\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\ndrill down\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntoolbar\nvectorize\nvirtualization\nvirtualize\nwake word\nwhite hat\nzip file\nSee more results »"}