{"id":305541,"name":"reform","type":"verb","us_sound":"rɪˈfɔːrm","us_link":"../audio/r/reform.mp3","uk_sound":"rɪˈfɔːm","uk_link":"../audio/r/ukrefit019.mp3","content":"reform verb [I or T]\n(improve)\nAdd to word list\nAdd to word list\nC2 uk\nYour browser doesn't support HTML5 audio\n/rɪˈfɔːm/ us\nYour browser doesn't support HTML5 audio\n/rɪˈfɔːrm/ to make an improvement, especially by changing a person's behaviour or the structure of something: Who will reform our unfair electoral system? For years I was an alcoholic, but I reformed when the doctors gave me six months to live.\nMore examplesFewer examplesHe was given licence to reform the organization.The president is preparing for a showdown with his advisers over his plans to reform the economy.He was credited with having reformed the education system.The government is in the process of reforming the benefits system.On leaving jail, Joe determined to reform.\nSMART Vocabulary: related words and phrases\nMaking things better\nadd salt to something idiom\nallay\nalleviate\nalleviation\nameliorate\ncultivate\nleavening\nlevelling up\nlighten\nliven (something) up\nlubricate\nmake a difference idiom\nrectify\nremedial\nrepair\nrepolish\nrestructure\nrevamp\nrevitalize\nsharpen\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming better\nRelated word\nreformationSee also\nre-form\nC2 an improvement, especially in a person's behaviour or in the structure of something: Some reforms of/to the system will be necessary. The education system was crying out for reform.\nMore examplesFewer examplesPolitical reform and economic liberalization don't always go together.An avowed traditionalist, he is against reform of any kind.The education system in Britain was crying out for reform.The reform process was put in train in 1985, by the Liberal government.The political reforms have led to major structural changes in the economy.\nSMART Vocabulary: related words and phrases\nBecoming better\nalive\nblossom\nblossom into something\nbounce\nby/in leaps and bounds idiom\ncome alive idiom\ncome along\ncorrective\nheal\nlook up\nmake a man (out) of someone idiom\nmarginal\nmend\nmend your ways idiom\nself-improvement\nshape up\nshape up or ship out! idiom\nsharpen (something) up\nsharpen up your act idiom\nwipe\nSee more results »\nAdd to word list\nAdd to word list\nsocial studies to become better, or to make something better by making corrections or removing any faults: [ T ] As governor, he reformed election procedures. [ I ] She insists that she has finally reformed. reform noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/rɪˈfɔrm/\n[ U ] The administration is proposing welfare reform. reformation noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/ˌref·ərˈmeɪ·ʃən/\n[ U ] reformation of the health care system reformed adjective us\nYour browser doesn't support HTML5 audio\n/rɪˈfɔrmd/\nI’m a reformed guy – I eat a low-fat diet and exercise every day.\nAdd to word list\nAdd to word list\nan improvement or set of improvements made to a system, law, organization, etc. in order to make it more modern or effective: reform of sth Essential reform of the banking sector is under way.reforms in sth He has called for reforms in the retirement system for years.banking/economic/tax reform Corporate tax reform has left companies uncertain about future tax bills. Market reforms have opened the doors to greater competition. fundamental/major/radical reforms\nto make an improvement to a system, a law, an organization, etc., in order to make it more modern or effective: reform the economy/the tax system, etc. Corporation tax will be reformed to raise more revenue."}