{"id":305583,"name":"reformulation","type":"noun","us_sound":"ˌriː.fɔːr.mjəˈleɪ.ʃən","us_link":"../audio/r/cdo0623usrefo3319.mp3","uk_sound":"ˌriː.fɔː.mjəˈleɪ.ʃən","uk_link":"../audio/r/cdo0623ukrefo3342.mp3","content":"reformulation noun [C or U]\n(PLAN/IDEA)\nAdd to word list\nAdd to word list\na change to a plan or idea, or the act of changing it: How do we know whether the particular reformulations of a given piece of research are valid or not? The government ran into such fierce opposition that it withdrew the plan for reformulation. Solutions in science often arise from a subtle re-formulation of the question, not from the collection of new information.\nMore examplesFewer examplesThey are calling for a fundamental re-formulation of the law.The paper contributes a minor reformulation of familiar points, and a specific approach to dealing with them.On June 21 he returned his campaign to policy specifics, with a detailed reformulation of his economic proposals.\nSMART Vocabulary: related words and phrases\nChanging\nabout-face\nabout-turn\nalterable\naltered\nalternate\ndisturb\ndrip\nmeta\nmetamorphose\nmodulate\nmodulation\nmorph\nmove on\npervert\nrewrite\nsemi-domesticated\nshake someone out of something\nshake someone up\nstead\nsteepness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlanning, expecting and arranging\nreformulation noun [C or U]\n(PRODUCT)\na change in what a product contains, or the act of changing what a product contains: Few companies are highlighting their trans fat reformulations on their packaging. Her efforts have led to the re-formulation of products, and meaningful warnings about possible ill effects. Only 10% to 12% of the consumers tested appeared upset by the reformulation of the drink.\nMore examplesFewer examplesReformulation of existing drugs is a tactic long employed by the big pharmaceuticals for extending patent protection and pricing.The head of the bread division led a re-formulation of the recipe to reverse a fall in the loaf's performance in taste tests.The company hasn't unveiled a reformulation of its famous cookie yet.\nSMART Vocabulary: related words and phrases\nChanging\nabout-face\nabout-turn\nalterable\naltered\nalternate\ndisturb\ndrip\nmeta\nmetamorphose\nmodulate\nmodulation\nmorph\nmove on\npervert\nrewrite\nsemi-domesticated\nshake someone out of something\nshake someone up\nstead\nsteepness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNew\nreformulation noun [C or U]\n(STATEMENT)\nthe act of saying or writing something in a different way, or something that is said or written in this way: If the students do not understand your question, translation or reformulation can be helpful. Good language teaching involves lots of repetitions and re-formulations.\nMore examplesFewer examplesBreakdowns in communication can be repaired by repetition or reformulation of an utterance with no change in language.Adult re-formulations indicate to children that they have made an error, and the adult wants to make sure they have understood what their children intend to convey.Transformations or reformulations are another useful technique in exploring literary language.\nSMART Vocabulary: related words and phrases\nWays of speaking\naccented\naccentual\naccentuation\naitch\narticulate\nasperity\nasyndetic\nasyndetically\nbray\nfluent\nintone\nnon-verbal\nnon-verbally\northoepy\nparalanguage\nplummy\npragmatics\npronounce\nsingsong\ntoned\nSee more results »"}