{"id":305824,"name":"regard","type":"verb","us_sound":"rɪˈɡɑːrd","us_link":"../audio/r/regard.mp3","uk_sound":"rɪˈɡɑːd","uk_link":"../audio/r/ukrefre024.mp3","content":"Add to word list\nAdd to word list\nB2 to consider or have an opinion about something or someone: Environmentalists regard GM technology with suspicion. Her parents always regarded her as the smartest of their children. He is generally/widely regarded as the father of international law.\nformal to look carefully at something or someone: The bird regarded me with suspicion as I walked up to its nest. as regards B2 formal\nin connection with: There is no problem as regards the financial arrangements.\nMore examplesFewer examplesThe rebels regard the official parliament as illegitimate.He regards e-commerce as an indivisible part of modern retail.He rarely used taxis, which he regarded as extravagant.Private education is often regarded as socially divisive.He regards the political process with disdain.\nSMART Vocabulary: related words and phrases\nImagining and conceiving\nassume\nbeyond your wildest dreams idiom\nblue-sky\nconceivable\nconceivably\nguess\nimagine\nin your mind's eye idiom\ninconceivably\nlay the foundation(s) of/for idiom\nlook on/upon someone/something as something\nmanifest\nreach\nretheorize\nrevisualization\nriot\nrun riot idiom\ntheorize\nthrow\nvision\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUsing the eyes\nRegarding and concerning\nGrammar\nConsider or regard?Consider and regard can both mean ‘believe’ or ‘realise’ or ‘understand’. When they mean ‘believe’ or ‘realise’ or ‘understand’, we don’t often use the continuous forms. …\nC1 respect or admiration for someone or something: The company holds her in high regard. He has no regard for other people's feelings.\nThesaurus: synonyms, antonyms, and examples\nto admire someone or somethingadmireI've always admired her for her generous spirit.respectI respect her for what she has achieved, but I would have approached it very differently.think highly ofEveryone thinks highly of him.hold someone in high esteemHer colleagues in Washington hold her in very high esteem.hold someone in high regardHe contributed much to the life of York, and was held in high regard there.look up toShe was my older sister and I looked up to her.\nSee more results »\nin/with regard to\nB2 in connection with: I am writing to you with regard to your letter of 15 March.\nThesaurus: synonyms, antonyms, and examples\naboutaboutWe always seem to talk about money.regardingI wrote to them regarding the new contract.concerningWhat is your letter concerning?in/with regard toComplaints have been made with regard to your behaviour in the office.in connection withShe is wanted for questioning in connection with the disappearance of their child.onShe’s writing a book on feminism in the 21st century.\nSee more results »\nin this/that regard\nin this particular way: The union is the largest in the country and in this/that regard is best placed to serve its members. regards B1 [ plural ] formal\ngreetings: Please give/send/convey my regards to your mother if you see her.\nMore examplesFewer examplesHer reply was typical of her constant regard for self.We employ people without regard to their political or sexual orientation.He showed scant regard for the truth.The players held their captain in high regard.Each of the designs is unique in this regard.\nSMART Vocabulary: related words and phrases\nShowing respect and admiration\nadmiration\nadmire\nadmiring\nadmiringly\napproving\napprovingly\nforelock\nfreedom\nfulsome\nfulsomely\nfulsomeness\nglorify\ngrovelling\npay your respects idiom\nphilogyny\nput someone on a pedestal idiom\nregild\nrespectfully\nretire a number idiom\nworshipful\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRegarding and concerning\nParticular and individual\nWelcoming, greeting & greetings\nWritten greetings\nAdd to word list\nAdd to word list\nto consider or think about something in a particular way, or to look carefully at someone or something: Laura is highly regarded by her colleagues. The dog regarded me with suspicion as I approached the door.\nregards [ plural ]\nAdd to word list\nAdd to word list\nCOMMUNICATIONS used to send good wishes to someone at the end of a letter or an email, or to ask someone to give greetings to another person who is not present: I look forward to hearing from you. With kind regards, David Price. Please convey my regards to your boss.\nin/with regard to sb/sth\nin connection with someone or something: I am writing to you with regard to your letter of 15 March."}