{"id":305879,"name":"regeneration","type":"noun","us_sound":"rɪˌdʒen.əˈreɪ.ʃən","us_link":"../audio/r/eus73903.mp3","uk_sound":"rɪˌdʒen.ərˈeɪ.ʃən","uk_link":"../audio/r/ukregen003.mp3","content":"regeneration noun [U]\n(IMPROVEMENT)\nAdd to word list\nAdd to word list\nthe act of improving a place or system, especially by making it more active or successful: The council is committed to a programme of urban regeneration.\nMore examplesFewer examplesOur \"historic heritage\" is an important ingredient in the regeneration of 21st-century Britain.A key goal for Madrid is urban regeneration, including environmentally conscious developments.The hope is that, with regeneration, tourists will again be attracted to Abkhazia.The investment was made knowing that Las Vegas is one of the country's fastest-growing cities and that a regeneration plan was under way throughout downtown.\nSMART Vocabulary: related words and phrases\nMaking things better\nadd salt to something idiom\nallay\nalleviate\nalleviation\nameliorate\ncultivate\nleavening\nlevelling up\nlighten\nliven (something) up\nlubricate\nmake a difference idiom\nrectify\nremedial\nrepair\nrepolish\nrestructure\nrevamp\nrevitalize\nsharpen\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRestoring and reviving\nregeneration noun [U]\n(GROWTH)\nbiology, medical\n&#160; specialized the act of something growing or being grown again: The treatment promotes regeneration of nerve cells in the spinal cord. Natural forest regeneration on deforested land exerts a controlling influence on carbon dioxide emissions.\nMore examplesFewer examplesThe cells are difficult to harvest, and often require damage to the host organ, which is awkward if they are to be used clinically for regeneration of the same organ.There was some tissue regeneration, and neurons, axons, and dendrites may also be reconnecting.In the area of spinal cord regeneration, we are certainly among the elite. Not since the summer of 1990 has a drought exposed this much of Lake Okeechobee's marshes, allowing regeneration of native plant life.\nSMART Vocabulary: related words and phrases\nAnimal & plant biology - general words\nabiotic\nanatomical\nanatomically correct\nanti-Darwinian\nanti-Darwinism\nbiologist\nDarwinian\nDarwinism\nDarwinist\nentomological\nentomologist\nmorph\nnaturalist\npoisonous\npolymorphism\nprimary producer\nprimitively\nprokaryote\npseudopod\nzoology\nSee more results »\nSee\nregenerate"}