{"id":305880,"name":"regenerative","type":"adjective","us_sound":"rɪˈdʒen.ə.rə.t̬ɪv","us_link":"../audio/r/usregal006.mp3","uk_sound":"rɪˈdʒen.ə.rə.tɪv","uk_link":"../audio/r/ukregen004.mp3","content":"regenerative adjective\n(GROWING)\nAdd to word list\nAdd to word list\nbiology, medical\n&#160; specialized relating to something growing or being grown again: Scientists hope to transform the cells into replacement parts for damaged organs, heralding a new age of regenerative medicine. On his wheat farm he saw firsthand the regenerative powers of fire on cropland.\nMore examplesFewer examplesThe cells participated in a regenerative process that restored the injured muscle almost back to complete health.We believe in the potential for regenerative science to advance substantially in the next 100 years.We need to understand the mechanisms of regenerative medicine for repair of diseased or degenerated cells and tissue. UC Berkeley scientists are a step closer to understanding how a series of molecular switches can turn on or off the regenerative power of stem cells that normally build new muscle tissue after it has been damaged.\nSMART Vocabulary: related words and phrases\nAnimal & plant biology - general words\nabiotic\nanatomical\nanatomically correct\nanti-Darwinian\nanti-Darwinism\nbiologist\nDarwinian\nDarwinism\nDarwinist\nentomological\nentomologist\nmorph\nnaturalist\npoisonous\npolymorphism\nprimary producer\nprimitively\nprokaryote\npseudopod\nzoology\nSee more results »\nregenerative adjective\n(IMPROVING)\nrelating to the improvement of a place or system, especially by making it more active or successful, or to making a person feel happier and more positive: These programmes were identified by the government as central to urban regenerative strategies. She found soaking in warm salt water very regenerative.\nMore examplesFewer examplesLarger complexes will offer a wider range of leisure facilities, which will have a regenerative effect on local communities.I'm told the new building is already having a regenerative effect on previously underused parkland nearby.Of course art can be \"accessible\", \"regenerative\", and \"life-enhancing\", but those characteristics can only come about within a free culture.But there are reasons to be optimistic, beginning with the irrepressible spirit, energy, and regenerative power of jazz itself.\nSMART Vocabulary: related words and phrases\nMaking things better\nadd salt to something idiom\nallay\nalleviate\nalleviation\nameliorate\ncultivate\nleavening\nlevelling up\nlighten\nliven (something) up\nlubricate\nmake a difference idiom\nrectify\nremedial\nrepair\nrepolish\nrestructure\nrevamp\nrevitalize\nsharpen\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRestoring and reviving\nSee\nregenerate"}