{"id":305964,"name":"register","type":"verb","us_sound":"ˈredʒ.ə.stɚ","us_link":"../audio/r/register.mp3","uk_sound":"ˈredʒ.ɪ.stər","uk_link":"../audio/r/ukregen017.mp3","content":"register verb\n(PUT ON LIST)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to put information, especially your name, into an official list or record: I registered the car in my name. Within two weeks of arrival all foreigners had to register with the local police. Students have to register for the new course by the end of April.\nMore examplesFewer examplesThey always register their ships under a flag of convenience.Ships were registered abroad to circumvent employment and safety regulations.Increasingly, the unmarried father of a child in Europe registers his paternity at the baby's birth.You will need proof of identity to register at the library.Customers who register on-line will receive a ten percent discount.\nSMART Vocabulary: related words and phrases\nWriting & typing\nannotate\nasemic\nbang\nbang something out\nbash something out\nborrow\nborrow something from something\nchart\ndot\ninscribe\nkeyboard\nre-registration\nreadability\nrecompose\nreformulate\nrekey\nsemiotics\nspeller\ntab\ntranscribe\nSee more results »\nregister verb\n(SHOW)\nC2 [ I or T ] to record, show, or express something: The Geiger counter registered a dangerous level of radioactivity. The earthquake was too small to register on the Richter scale.formal His face registered extreme disapproval of what he had witnessed.\nSMART Vocabulary: related words and phrases\nMeasuring & weighing\ncost-of-living index\ncountable\ngage\ngravimetric\ngravimetrically\nhypsometric\nmeasure\nmeasurement\nnon-quantifiable\nnon-quantitative\npace\npace something off/out\nplanimetric\nponderable\nproof\nshortish\ntimer\nunquantifiable\nunsounded\nweigh something out\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShowing and demonstrating\nregister verb\n(REALIZE)\n[ I or T ] informal If something registers, someone realizes it and if someone registers something, they realize it: I did mention the address but I'm not sure that it registered (with him). I scarcely registered the fact that he was there.\nSMART Vocabulary: related words and phrases\nApparent and obvious\n(from) under your nose idiom\napparent\nbe (as) plain as the nose on your face idiom\nbe (right) under your nose idiom\nbe etched somewhere idiom\nbe writ large idiom\nflagrantly\nforegone conclusion\nglaringly\nI need hardly do something idiom\nobtrude\novertly\npalpable\npalpably\nparallax\npatently\nsqueaky\nstand/stick out a mile idiom\nwonder\nwritten all over someone's face idiom\nSee more results »\nregister verb\n(MAIL)\n[ T ] If you register a letter or parcel, you send it using a special postal service, so that it will be dealt with in a special way and not be lost: a registered letter\nSMART Vocabulary: related words and phrases\nDelivering and despatching\nair bridge\nair corridor\nair-dash\nbox scheme\nconsign\ncourier\ndispatch\ndrop off\nmisaddress\nmisdirect\nmisdirection\nmisroute\nnon-delivery\nsend something out\nship\nshipment\nshipper\nshoot\nshoot something off\ntruck\nSee more results »\nregister noun\n(LIST)\n[ C ] a book or record containing a list of names: Guests write their names in the (hotel) register. Is your name on the register of voters?\n[ C ] a book used to record if a child is present at school: If a child is absent, the teacher notes it down in the (class) register.\n[ U ] in school, the period at the start of the morning and afternoon when a teacher records on an official list that children are present\nSMART Vocabulary: related words and phrases\nLists and catalogues\nagenda\narchivist\nbibliographical\nbibliographically\nbirthday honours\nglycaemic index\nhit list\nhonor roll\nhonours list\nindices\nquestionnaire\nrecital\nregistrable\nroll of honour\nroster\nthe White Pages\nunregistered\nwait list\nwaiting list\nwedding list\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSchools in general\nregister noun\n(LANGUAGE STYLE)\nC1 [ C or U ]\n&#160; language\n&#160; specialized the style of language, grammar, and words used for particular situations: People chatting at a party will usually be talking in (an) informal register.\nSMART Vocabulary: related words and phrases\nLinguistic terms & linguistic style\naccentual\naffricate\nallophone\nallophony\nanaphor\ncontextualize\ndowntoner\neasy read\nemphatic\nentailment\netymological\nidiomatic\ninflected language\nparatactically\nparataxis\nphilological\nphilologically\nphilology\npolysemy\nstylistics\nSee more results »\nregister noun\n(SOUNDS)\n[ C ] all the notes that a musical instrument or a person's voice can produce, from the highest to the lowest: music written mainly for the lower/higher register of the clarinet\nSMART Vocabulary: related words and phrases\nNotes of the musical scale\nB, b\nC, c\nD, d\ndoh\nE, e\nflat\nhigh doh\nla\nlah\nmajor\nmi\nmiddle C\nminor\nnote\nscale\nsemitone\nsoh\nsol\nsol-fa\nte\nSee more results »\nregister noun\n(MONEY)\n[ C ] mainly US (UK usually till) the drawer in a cash register (= a machine which records sales in a shop, and in which money is kept) or the cash register itself: Next time you have the register open, could you give me some change? I think these items have been rung up wrongly on the register.\nAndyL/ E+/GettyImages Grammar\nRegisterWe use the term ‘register’ to refer to particular varieties or styles of speaking and writing. Registers vary because the language is used for different purposes, in different contexts and for different audiences. For example, there is a legal register, a register of advertising, registers of banking and a register of weather forecasting. We commonly recognise registers because of their specialised vocabulary but also because of particular uses of grammar. We also use the term register to refer to whether language is being used formally or informally: …\nregister verb\n(RECORD)\nAdd to word list\nAdd to word list\n[ I/T ] to record someone’s name or ownership of property on an official list: [ T ] I registered the car in my name. [ + to infinitive ] Voters have until February 16 to register to vote in the primary. [ I ] Students are currently registering for summer courses.\n[ I/T ] If you register a letter or package when you mail it, you pay extra to have it recorded and receive special care in delivery.\nregister verb\n(MEASURE)\n[ I/T ] (of an instrument) to measure and record an amount: [ T ] The thermometer registered 79°F. [ I ] The tremor barely registered on the Richter scale.\nregister verb\n(SHOW)\n[ T ] to show an emotion by the expression on your face: Her face registered shock at the news.\nregister verb\n(HAVE EFFECT)\n[ I ] to have some effect: The loss of her home has not really registered on her yet.\nregister noun [C]\n(RANGE)\nall the notes that a voice or musical instrument can produce, from the highest to the lowest\nregister noun [C]\n(MONEY)\nshort form ofcash register\nregister noun [C]\n(DEVICE)\na device that controls the flow of air from a heating or cooling system through an opening into a room\nregister noun [C]\n(RECORD)\na book containing an official list or record: The American Film Institute drew up a register of the 100 greatest American films ever made.\nAdd to word list\nAdd to word list\n[ I or T ] to put information, especially the name of someone or something, on an official list or record: Bids may be registered 24 hours a day. to register a car/company/domain nameregister as sth Investment advisers may need to register as brokers. In the UK, a business is required to register for VAT.register (sb/sth) with sth Hedge-fund managers must register the commission under the terms of the 1940 Investment Advisers Act.\n[ I or T ] to record or show a measurement, an amount, etc.: The built-in telephone line has registered 50 calls daily. During the period under review, the company registered a 30% decline in gross profit.\n[ T ]\n&#160; COMMUNICATIONS when you register a letter or package, you send it by mail using a special service, so that it will be dealt with in a special way and not be lost: I'd like to register this parcel, please. a registered letter\n[ T ] to show your opinion or interest formally or officially: The engineering arm of the company is said to have registered an interest by the bid deadline.\na book or record containing an official list of names, items, etc.: a central/national registerguest/visitors' register All visitors to the company are asked to sign the visitors' register. Issuing companies keep a register of bondholders.\nCOMMERCE\n&#160; US →\ncash register\nSee also\ncash register\ncharges register\ncompanies register\ndirectors' register\nLand Charges Register\nLloyd's Register\nmembers' register\nproperty register\nproprietorship register\nregister of charges\nView all\nregister of companies\nregister of directors\nregister of directors' interests\nregister of members\nregister of transfers\nshare register\nshareholders' register\ntransfers register"}