{"id":305947,"name":"region","type":"noun","us_sound":"ˈriː.dʒən","us_link":"../audio/r/region.mp3","uk_sound":"ˈriː.dʒən","uk_link":"../audio/r/ukregen014.mp3","content":"Add to word list\nAdd to word list\nB1 a particular area or part of the world, or any of the large official areas into which a country is divided: one of China's autonomous regions the Nordic/Asia-Pacific region the Basque region\nan area of a country, especially one that has a particular characteristic or is known for something: a wine/farming region mountainous/coastal regions There's a shortage of cheap housing in the region.\na particular part of someone's body: He said he had sharp pains in the stomach region/the region of the stomach. in the region of\nC1 approximately: They estimate that the temperature yesterday was (somewhere) in the region of -30°C.\nSee more\nMore examplesFewer examplesThe war is threatening to engulf the entire region.Grapes from this region are freighted all over the world.There's a shortage of cheap housing in the region.The army has been brought in to maintain order in the region.There's a clear distinction between the dialects spoken in the two regions.\nSMART Vocabulary: related words and phrases\nTowns & regions: parts of countries\nat local/national level phrase\nbicoastal\nBreton\ncity state\ncollectorate\ncountywide\neasterner\ngreen belt\nmetropolitan borough\nmetropolitan county\nmulti-county\nnon-county\nnon-metropolitan county\nnortherner\nnorthwest\nprovince\nregionalism\nsector\nsoutherner\nterritory\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeography: areas of land in general\nRelating to particular parts of the body\nGrammar\nNationalities, languages, countries and regionsWhen we refer to a nation or region, we can use: …\nAdd to word list\nAdd to word list\na particular area or part of a state, country, or the earth’s surface: Wheat is the major crop of this region.\nA region is also a particular area or part of the body: He’s complaining of pain in the lower abdominal region. regional adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈri·dʒə·nəl/\na regional trade and rail center regionally adverb us/ˈri·dʒə·nəl·i/Idiom\n(somewhere) in the region of\nAdd to word list\nAdd to word list\na particular area or part of the world, or one of the areas into which a country is divided: the less-developed regions of the world Coastal regions of the country have much better infrastructure and many more Internet users than others. The retailer plans to open eight stores in the Baltimore region in the next two months.\nin the region of\nused to show that a number is only approximate: cost/earn/pay in the region of sth A comparable system would cost somewhere in the region of 300,000 euros. They made us an offer in the region of $25,000."}