{"id":305983,"name":"registration","type":"noun","us_sound":"ˌredʒ.əˈstreɪ.ʃən","us_link":"../audio/r/registration.mp3","uk_sound":"ˌredʒ.ɪˈstreɪ.ʃən","uk_link":"../audio/r/ukregen020.mp3","content":"registration noun\n(LIST)\nAdd to word list\nAdd to word list\nB1 [ U ] the act of recording a name or information on an official list: voter registration\nMore examplesFewer examplesAnyone not paying the registration fee by 31 March will be deemed to have withdrawn from the scheme.I'm a bit chary of using a travel agency that doesn't have official registration.New members are required to pay a registration fee.Registration for the course will take place a week before the start of term.He was asked to fill in a registration form.\nSMART Vocabulary: related words and phrases\nWriting & typing\nannotate\nasemic\nbang\nbang something out\nbash something out\nborrow\nborrow something from something\nchart\ndot\ninscribe\nkeyboard\nre-registration\nreadability\nrecompose\nreformulate\nrekey\nsemiotics\nspeller\ntab\ntranscribe\nSee more results »\nregistration noun\n(CAR)\n[ C ] (also registration number); (UK informal reg); (US usually license plate number) the official set of numbers and letters shown on the front and back of a road vehicle: Police are looking for a small blue car with the registration number B34-ACS.\nSMART Vocabulary: related words and phrases\nThe exterior of vehicles\narticulated\ncab\ncoachwork\ncrumple zone\nfifth wheel\nfinny\nfog light\nfootboard\nfrunk\nhigh beams\nL-plate\nnearside\nrear light\nrunner\nsidelight\nsunroof\ntailgate\ntire\ntow bar\nturn signal\nSee more results »\nAdd to word list\nAdd to word list\na record of someone's name on an official list: [ C ] Keep your car registration with the vehicle. [ U ] With an election approaching, both political parties are encouraging voter registration.\nAdd to word list\nAdd to word list\n[ C or U ] the act of making an official record of names and other information, or a document that shows these details: registration fee/form/process The investor registration fee for the conference is $395.registration as sth The FDA recently revoked his registration as a manufacturer. Figures on car sales showed that new registrations fell 4.9% last month. There has been a recent increase in the number of registrations of new domain names.\n[ C or U ]\n&#160; FINANCE, STOCK MARKET in the US, the process of a company giving documents to the Securities and Exchange Commission asking if it can offer shares for sale on a stock market: The move resulted in an increase in registration of securities offerings in the US by foreign private issuers. See also\nshelf registration\n[ C ]\n&#160; TRANSPORT\n&#160; (also registration number); ( abbreviation reg.) the official set of numbers and letters shown on the front and back of a road vehicle: What's the registration of the car?"}