{"id":306101,"name":"regressive","type":"adjective","us_sound":"rɪˈɡres.ɪv","us_link":"../audio/r/usregal010.mp3","uk_sound":"rɪˈɡres.ɪv","uk_link":"../audio/r/ukregen024.mp3","content":"regressive adjective\n(RETURNING TO PREVIOUS STATE)\nAdd to word list\nAdd to word list\nreturning to a previous and less advanced or worse state or way of behaving: Incinerating waste rather than recycling it would be a regressive step. Vigilance is needed to overcome the natural regressive tendency to become complacent.\nmedical\n&#160; specialized (of an illness or its effects) becoming less severe: 18 patients had active leprosy, and in 27 the disease was regressive.\npsychology\n&#160; specialized returning to a previous way of reacting to something: Regressive behaviour - bed-wetting, throwing tantrums, waking in the night - is common. Separation anxiety, regressive symptoms, and psychosomatic manifestations are frequently associated with PTSD .\npsychology\n&#160; specialized used to refer to a type of autism (= a brain condition that affects the development of social and communication skills in ways that can be severe or slight, and that can make someone's behaviour and interests different from people without the condition) that develops between the ages of around 15 to 30 months, after a child has been developing in the usual way : Most autism is regressive. An association was found between regressive autism and bowel problems.\nSMART Vocabulary: related words and phrases\nDeteriorating and making worse\nadd\nadmin\naggravate\nbackslide\nbe (all) downhill idiom\ndebase\ndeterioration\ndevaluation\ndevalue\ndisintegrate\ndog\ndowngrade\none step forward, two steps back idiom\nregress\nregression\nregressively\nrelapse\nretrograde\nworse\nworsen\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRecovering from illness\nMedical treatment: symptoms & diagnosis of medical problems\nThe brain & nervous system\nMind and personality\nregressive adjective\n(TAX)\nfinance &amp; economics\n&#160; specialized (of tax) lower on large amounts of money, so that the rich are less affected: Regressive taxation means that poor people wind up paying a larger percentage of their income in tax than rich people do. The single most regressive tax is the tax on food because everyone has to eat.\nSMART Vocabulary: related words and phrases\nTaxation\namortizable\nanti-dumping\nanti-progressive\nanti-tax\nat source phrase\nfinancial year\nfiscal year\nflat tax\ngas tax\nHMRC\nregressively\nroad tax\nsales tax\nself-assessment\nshelter\ntaxpayer\ntithe\ntop rate\nunprogressive\nuntaxed\nSee more results »\nAdd to word list\nAdd to word list\nused to describe ideas or systems that are old-fashioned and do not encourage change or development: The movement will defeat the autocratic and regressive regime.\nECONOMICS, TAX used to describe an economic or tax system in which there are advantages for rich people and disadvantages for poor people: Economists generally regard sales taxes as regressive, since the poor spend a greater part of their income than the rich.regressive policy/subsidy/measure Two decades of regressive policies have doubled the numbers living in poverty. Compare\nprogressive"}