{"id":306098,"name":"regression","type":"noun","us_sound":"rɪˈɡreʃ.ən","us_link":"../audio/r/regression.mp3","uk_sound":"rɪˈɡreʃ.ən","uk_link":"../audio/r/ukregen023.mp3","content":"regression noun [C or U]\n(TO PREVIOUS STATE)\nAdd to word list\nAdd to word list\nformal a return to a previous and less advanced or worse state, condition, or way of behaving: A regression has occurred in the overall political situation. regression to childhood\nMore examplesFewer examplesThis is simply a regression to outdated attitudes.She claims to be able to induce a past-life regression through hypnosis.Virtually no regime was immune from the economic regression of the early 1980s.\nSMART Vocabulary: related words and phrases\nDeteriorating and making worse\nadd\nadmin\naggravate\nbackslide\nbe (all) downhill idiom\ndebase\ndeterioration\ndevaluation\ndevalue\ndisintegrate\ndog\ndowngrade\none step forward, two steps back idiom\nregress\nregressive\nregressively\nrelapse\nretrograde\nworse\nworsen\nSee more results »\nregression noun [C or U]\n(ILLNESS)\nmedical\n&#160; specialized the fact of an illness or its symptoms (= effects) becoming less severe: The treatment was more effective than tamoxifen, which causes complete regression in only about 30% of cases. In this group there was a significant regression in artery wall thickness.\nMore examplesFewer examplesIt is hoped that this regimen will result in clinical tumour regression in patients with metastatic melanoma.Histological measurements performed at 3 months were striking, with signs of disease regression in all patients in the trial.The frequency of such regressions in cancer is not yet known; however, it is generally accepted that they are extremely rare.\nSMART Vocabulary: related words and phrases\nRecovering from illness\nclear (something) up\ncolour\ncorrect\ncurability\ncurably\ncurative\nget over something/someone\ngranulate\nhold\nrecovery\nrehabilitate\nrehabilitation\nrehydrate\nremedial\nremission\nresponsive\nresponsiveness\nself-healing\nsleep\ntherapeutic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical treatment: symptoms & diagnosis of medical problems\nSee\nregress\nAdd to word list\nAdd to word list\na situation in which things get worse rather than better: There's been a recent rise in nurses' wages after a decade of stagnation or even regression. The past years have seen a regression in the march of economic progress."}