{"id":306094,"name":"regress","type":"verb","us_sound":"rɪˈɡres","us_link":"../audio/r/eus73907.mp3","uk_sound":"rɪˈɡres","uk_link":"../audio/r/ukregen022.mp3","content":"regress verb [I]\n(RETURN TO WORSE STATE)\nAdd to word list\nAdd to word list\nto return to a previous and less advanced or worse state, condition, or way of behaving: She suffered brain damage from the car accident and regressed to the mental age of a five-year-old. He says the city has regressed in terms of participation in recycling. Compare\nprogress noun\nMore examplesFewer examplesIt's almost like we've regressed to the 1950s.When he stopped playing sports he regressed to old habits and became more distant.In some areas, such as writing skills among middle school students, performance seriously regressed.\nSMART Vocabulary: related words and phrases\nDeteriorating and making worse\nadd\nadmin\naggravate\nbackslide\nbe (all) downhill idiom\ndebase\ndeterioration\ndevaluation\ndevalue\ndisintegrate\ndog\ndowngrade\none step forward, two steps back idiom\nregression\nregressive\nregressively\nrelapse\nretrograde\nworse\nworsen\nSee more results »\nregress verb [I]\n(GET BETTER)\nmedical\n&#160; specialized (of an illness or its symptoms (= effects)) to become less severe: Following removal of the tumour, all the symptoms regressed. The disease may regress if the patient stops smoking.\nMore examplesFewer examplesAt this stage, her clinical symptoms had regressed, her convulsions had stopped and her activity level, muscle tone, and reflexes were normal.The lipoma regressed relatively rapidly until symptoms had completely disappeared.They will be treated as long as their disease is stable or regressing.\nSMART Vocabulary: related words and phrases\nRecovering from illness\nclear (something) up\ncolour\ncorrect\ncurability\ncurably\ncurative\nget over something/someone\ngranulate\nhold\nrecovery\nrehabilitate\nrehabilitation\nrehydrate\nremedial\nremission\nresponsive\nresponsiveness\nself-healing\nsleep\ntherapeutic\nSee more results »\nRelated word\nregression\nAdd to word list\nAdd to word list\nto return to a previous and less advanced or worse state: Our team improved in the second half, while our opponents regressed. regression noun [ U ] us\nYour browser doesn't support HTML5 audio\n/rɪˈɡreʃ·ən/\nLearning a language requires regression to childlike simplicity."}