{"id":306107,"name":"regret","type":"noun","us_sound":"rɪˈɡret","us_link":"../audio/r/regret.mp3","uk_sound":"rɪˈɡret","uk_link":"../audio/r/ukregen025.mp3","content":"Add to word list\nAdd to word list\nB2 a feeling of sadness about something sad or wrong or about a mistake that you have made, and a wish that it could have been different and better: I left school at 16, but I've had a great life and I have no regrets. The manager expressed deep regret at/for the number of staff reductions. We think, much to our regret (= and we are very sorry about this), that we will not be able to visit you next year.\nThesaurus: synonyms, antonyms, and examples\nto apologize for somethingapologizeUK I apologise for the error.say sorryHe didn't even say sorry.sorryI forgot your name, sorry.make an apologyThe president made an apology to the people of Japan in a public speech.express regretHe later expressed regret for portraying sharks as creatures that target human beings.\nSee more results »\nsend (someone) your regrets\nto send a polite message that you cannot go to a party, etc.: We did have an invitation, but we had to send Graham our regrets.\nSee more\nMore examplesFewer examplesA funeral can amplify the feelings of regret and loss for the relatives.I have a tinge of regret that I didn't accept her offer.There was an overtone of regret in his farewell speech.She left her job with no regrets.Do you have any regrets about the way things worked out?\nSMART Vocabulary: related words and phrases\nSadness and regret\naw\nbe/weigh on your conscience idiom\nbitter\nblack dog\nbreastbeating\ncry\ndistress\nfeel bad idiom\ngloominess\nglumness\ngroan\nguilt\nprick\nprick someone's conscience idiom\nregretful\nregretfully\nremorse\nrepentant\nwrench\nwretchedness\nSee more results »\nB1 to feel sorry about a situation, especially something sad or wrong or a mistake that you have made: Is there anything you've done in your life that you regret? [ + -ing verb ] I have always regretted not having studied harder at school. [ + (that) ] formal The council regrets (that) the money to subsidize the youth club is no longer available. [ + to infinitive ] formal British Airways regret to announce the cancellation of flight BA205 to Madrid.\nMore examplesFewer examplesCome Monday morning you'll regret staying up all night.I greatly regret not having told the truth.Please don't get mixed up with him. You'll regret it if you do.I regret any anxiety or concern which I may, unwittingly, have caused.After careful consideration of your proposal, I regret to say that we are unable to accept it.\nSMART Vocabulary: related words and phrases\nSadness and regret\naw\nbe/weigh on your conscience idiom\nbitter\nblack dog\nbreastbeating\ncry\ndistress\nfeel bad idiom\ngloominess\nglumness\ngroan\nguilt\nprick\nprick someone's conscience idiom\nregretful\nregretfully\nremorse\nrepentant\nwrench\nwretchedness\nSee more results »\nAdd to word list\nAdd to word list\nto feel sorry or unhappy about something you did or were unable to do: [ T ] He regretted his decision to leave school. [ + (that) clause ] I regret (that) I didn’t buy more when they were on sale. [ T ] I’m going to regret eating all those nachos.\nfml Regret is also used to express in a polite way that you feel sorry about something: [ + (that) clause ] My husband regrets (that) he couldn’t be here tonight. [ + to infinitive ] The weather, I regret to say, is getting worse."}