{"id":306063,"name":"regraft","type":"noun","us_sound":"ˈriː.ɡræft","us_link":"../audio/r/cdo0623usregr3334.mp3","uk_sound":"ˈriː.ɡrɑːft","uk_link":"../audio/r/cdo0623ukregr3357.mp3","content":"Add to word list\nAdd to word list\na second, third, etc. graft (= an occasion when a piece of healthy skin or bone is cut from one part of a person's body and used to repair another damaged part, or when a piece is cut from one living plant and attached to another plant so that it grows there): Two regrafts were necessary as the primary grafts did not heal. No difference in the overall yield appeared to exist between new grafts and re-grafts.\nMore examplesFewer examplesThe long-term prognosis for a regraft is lower than it was for the original graft.The re-graft was performed for a graft failure that occurred 11 months after surgery.This second regraft has remained clear in the 6-month follow-up.\nSMART Vocabulary: related words and phrases\nMedical treatment: surgery\nablate\nadrenalectomy\namputation\namputee\nanaesthesiology\nanaesthetize\nharvesting\nhave something out\nimplantable\nimplantation\nincision\ninteroperative\nlaughing gas\nliposuction\nresected\nresection\nrhino\nrhinoplasty\nsex change\ntransfusion\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGardening - general words\nto take and put in place a second, third, etc. piece of healthy skin or bone cut from one part of a person's body and use it to repair another damaged part, or to take a second, third, etc. piece cut from one living plant and attach it to another plant so that it grows there: The cornea may need to be regrafted. The subtree is then pruned again and re-grafted in another position.\nMore examplesFewer examplesThe complication ratio was high, and some patients required regrafting.It may ramify, but it will never be regrafted on the parent stem.The pruned edge is adjacent to the edge on which the subtree is re-grafted.\nSMART Vocabulary: related words and phrases\nMedical treatment: surgery\nablate\nadrenalectomy\namputation\namputee\nanaesthesiology\nanaesthetize\nharvesting\nhave something out\nimplantable\nimplantation\nincision\ninteroperative\nlaughing gas\nliposuction\nresected\nresection\nrhino\nrhinoplasty\nsex change\ntransfusion\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGardening - general words"}