{"id":306161,"name":"regular","type":"adjective","us_sound":"ˈreɡ.jə.lɚ","us_link":"../audio/r/regular.mp3","uk_sound":"ˈreɡ.jə.lər","uk_link":"../audio/r/ukregen030.mp3","content":"regular adjective\n(OFTEN)\nAdd to word list\nAdd to word list\nB1 happening or doing something often: a regular customer/churchgoer/reader/user Professional athletes make regular appearances on TV.\nMore examplesFewer examplesShe goes to her doctor for regular check-ups.He paid regular amounts of money to a charity.If you don't sort out the papers on your desk on a regular basis they just keep on accumulating.There is a regular train service between Glasgow and Edinburgh.I'll need regular updates on your progress.\nSMART Vocabulary: related words and phrases\nFrequency & regularity - general words\n(as) regular as clockwork idiom\n-ly\nclockwork\nendemically\nerratic\nerratically\nfitful\nirregularity\nirregularly\nlike clockwork idiom\nmany\non and off idiom\non-off\nperiodic\nperiodically\nprevalence\nreligiously\nstatedly\nunsynchronized\nwould\nSee more results »\nregular adjective\n(EVEN)\nB2 existing or happening repeatedly in a fixed pattern, with equal or similar amounts of space or time between one and the next; even: Her heartbeat was regular. The gardeners planted the trees at regular intervals. I suggest that we have regular meetings/meet on a regular basis.\nSomeone who is regular empties their bowels often enough, and a woman who is regular always has her period at approximately the same time: The doctor asked if I was regular/if my bowel movements were regular.\nMore examplesFewer examplesIs she paid a regular wage or is it on commission only?Many companies operate regular job appraisals, often on an annual basis.We see each other at regular intervals - usually about once a month.The bells ring at regular intervals through the day.If you don't sort out the papers on your desk on a regular basis they just keep on accumulating.\nSMART Vocabulary: related words and phrases\nStandard and routine\naverage\naverage Joe\nbog-standard\nconformance\nconformity\nconventionalized\ndefault\ngiven\ninstitutionalize\nmainline\northodox\nquotidian\nregularity\nregularization\nregularize\nround\nstock\nthe/your average bear idiom\nunchallenging\nunspectacular\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFrequency & regularity - general words\nAnimal physiology: excrement & its excretion\nregular adjective\n(USUAL)\nA2 mainly US usual or ordinary: Her regular secretary was off sick for a week. I couldn't see my regular dentist. You can use low-fat or regular cream cheese. Do you want large fries or regular fries with that?\nB1 language\n&#160; specialized A regular verb, noun, or adjective follows the usual rules in the structure of its various forms: \"Talk\" is a regular verb but \"be\" is not. a regular guy US\na normal man who is liked and trusted: He just seemed like a regular guy - like one of us.\nSee more regular army, soldier, etc.\nan army that exists all the time, or a soldier in such an army: The following year she enlisted in the regular army.\nSee more\nMore examplesFewer examplesI'm not her regular secretary - I'm just filling in.All the networks pre-empted their regular schedules to broadcast news of the hijacking.This is not my regular lipstick.Do you have these pants in a regular length?He seems like a regular guy.\nSMART Vocabulary: related words and phrases\nStandard and routine\naverage\naverage Joe\nbog-standard\nconformance\nconformity\nconventionalized\ndefault\ngiven\ninstitutionalize\nmainline\northodox\nquotidian\nregularity\nregularization\nregularize\nround\nstock\nthe/your average bear idiom\nunchallenging\nunspectacular\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistic terms & linguistic style\nregular adjective\n(SIMILAR)\nthe same on both or all sides: He's very handsome, with regular features and deep brown eyes. A square is a regular quadrilateral.\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\nadjacent\naffinity\nakin\nalike\nallied\nballpark\ncongruent\nditto\nequivalent\nequivalently\nevenly\nevery inch idiom\nnon-distinctive\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\nrespecter\nsynonymous\nSee more results »\nregular adjective\n(COMPLETE)\n[ before noun ] informal real; complete: The situation here now is becoming a regular disaster.old-fashioned That child is a regular charmer/little nuisance.\nSMART Vocabulary: related words and phrases\nComplete and whole\n(all) in one piece idiom\nabsolute\naggregate\nall or nothing idiom\nall told idiom\nall-in-one\nall-inclusive\nfell\nfibre\nfull strength\nfull-fledged\nfull-length\nfully\nfully fledged\nthorough\nthoroughgoingly\nthoroughly\nthrough and through idiom\nto the last idiom\ntotality\nSee more results »\nRelated word\nregularityGrammar\nVerbs: basic formsMain verbs have three basic forms: the base form, the past form and the -ed form (sometimes called the ‘-ed participle’): …\nVerbs: the three basic formsMain verbs have three basic forms: the base form, the past form and the -ed form (sometimes called the ‘-ed participle’): …\nRegular verbsMost verbs in English are regular. Regular verbs add -ing to the base form to make the -ing form, and -ed to the base form to make the past simple and the -ed form. …\nIrregular verbsIrregular verbs follow the same rules as regular verbs for the present simple but have different forms for the past simple and the -ed form. …\nIdiom\n(as) regular as clockwork\nregular noun [C]\n(CUSTOMER)\nsomeone who often goes to a particular event or place, such as a shop or restaurant: He's one of the regulars at the pub.\nSMART Vocabulary: related words and phrases\nVisiting\nattraction\nbeard the lion (in his/her den) idiom\nbeen\ncall (in) on someone\ncall by\ncome round\nexchange\nhappen along/by (somewhere)\nhaunt\nhave access to someone/something\nhomestay\nhouse-to-house\npay\npop\nstomping ground\nstop\nstop by (somewhere)\nstop in\nstop off somewhere\nstop over\nSee more results »\nregular noun [C]\n(SOLDIER)\na soldier whose permanent job is being a soldier\nSMART Vocabulary: related words and phrases\nSoldiers & people who fight in wars\nanti-guerrilla\nAnzac\nberserker\ncapability\ncavalryman\ncombat engineer\ncomrade\nex-serviceman\nex-servicewoman\nfoot soldier\nheadhunter\nparamilitary\nraider\nrecruit\nscout\nskirmisher\nsoldier of fortune\nunsoldierly\nvassal\nwar party\nSee more results »\nregular noun [C]\n(SPORT)\na player who usually plays in most of a team's competitive matches: They rested several of their first-team regulars. Young players are eager to become regulars in the team.\nSMART Vocabulary: related words and phrases\nCompetitors & participants in sports & games\nback four\nballer\nballplayer\nbase jumper\nbenchwarmer\nchallenger\njumper\nkeeper\nlogroller\nlong-jumper\nlongboarder\nmajor league\nmid-table\nracer\nretire\ntrampolinist\ntrialist\ntriathlete\ntriple jumper\ntriple threat\nSee more results »\nregular adjective\n(REPEATED)\nAdd to word list\nAdd to word list\nhappening repeatedly in a fixed pattern, with equal or similar amounts of space or time between one and the next: a regular heartbeat working regular hours Trees were planted at regular intervals along the avenue.\nregular adjective\n(USUAL)\nusual or ordinary; normal: He drove his regular route to work. Her regular assistant is on vacation.\nRegular also means of an average or standard size: That minivan is longer than a regular station wagon.\nThe regular army is the permanently organized army of a country.\ngrammar A regular verb, noun, adjective, or other type of word follows the usual rules in the language for changing word endings.\nIf you describe a man as a regular guy, you mean that he is an ordinary, likable person: He wanted to prove he was a regular guy by going fishing.\nregular adjective\n(OFTEN)\ndoing the same thing or going to the same place often: a regular contributor to the magazine a regular customer\nregular adjective\n(EQUAL)\nshaped equally on all sides: Her teeth are small and regular.\nregular noun [C]\n(FREQUENT PERSON)\nsomeone who goes to the same place or does the same thing often: He’s one of the regulars at the club.\nAdd to word list\nAdd to word list\nhappening at the same time each day, week, month, etc. and usually fairly often: All staff make regular payments to the pension fund. I need a job with a regular income. I would like a job with more regular hours. Discussions about the direction of the company take place on a regular basis.\n[ before noun ]\n&#160; COMMERCE used to describe someone who often uses something or buys something from the same organization: We have a special offer for our regular customers. The service has over 70,000 regular users.\n[ before noun ]\n&#160; HR used to describe someone who is employed permanently by a company, etc.: Temporary workers do not get the same benefits as regular employees. Compare\ntemporary\n[ before noun ]\n&#160; HR used to describe work that is permanent: She has had plenty of jobs but never been in regular employment. He gave up his regular job to play in a rock band. Compare\ntemporary\nCOMMERCE ordinary or typical in size or quality: Do you want a small, regular, or large coffee? Try substituting soy milk for regular milk. The price of regular gasoline has risen steeply. See also\nregularly\nCOMMERCE a customer who goes to the same store, restaurant, etc. very often: He's a regular at all the fashionable clubs."}