{"id":306173,"name":"regularly","type":"adverb","us_sound":"ˈreɡ·jə·lər·li","us_link":"../audio/r/regularly.mp3","uk_sound":"-li","uk_link":"../audio/r/ukregul004.mp3","content":"regularly adverb\n(OFTEN)\nAdd to word list\nAdd to word list\noften: She regularly appears on TV talk shows. Accidents regularly occur on this street. Experts say that the product, if eaten regularly, could be harmful.\nMore examplesFewer examplesPolish your shoes regularly to protect the leather.The airline regularly offers last-minute bookings at bargain prices.Clean the seal around the fridge door regularly so that it remains airtight.The working life of most vehicles can be increased if they are serviced regularly.Which newspaper do you read regularly?\nSMART Vocabulary: related words and phrases\nFrequency & regularity - general words\n(as) regular as clockwork idiom\n-ly\nclockwork\nendemically\nerratic\nerratically\nfitful\nirregular\nirregularity\nirregularly\nlike clockwork idiom\nmany\non and off idiom\non-off\nperiodic\nperiodically\nprevalence\nreligiously\nunsynchronized\nwould\nSee more results »\nregularly adverb\n(EVENLY)\nwith equal or similar amounts of space or time between one and the next: We meet regularly to discuss progress on the project. The competitors set off at regularly spaced intervals. The best advice is to eat regularly and get plenty of sleep.\nregularly adverb\n(REPEATEDLY)\nAdd to word list\nAdd to word list\nat repeated times, with equal or similar amounts of time between one time and the next: We meet regularly each morning for coffee.\nregularly adverb\n(OFTEN)\nby doing the same thing or going to the same place often: She appears regularly on national TV.\nAdd to word list\nAdd to word list\nat the same time each day, week, month, etc. and usually fairly often: Sales managers regularly compare the performance levels of their sales force with performance forecasts. The US is hoping to use the regularly scheduled talks to push for better access to European markets."}