{"id":306177,"name":"regulate","type":"verb","us_sound":"ˈreɡ.jə.leɪt","us_link":"../audio/r/regulate.mp3","uk_sound":"ˈreɡ.jə.leɪt","uk_link":"../audio/r/ukregul005.mp3","content":"Add to word list\nAdd to word list\nC1 to control something, especially by making it work in a particular way: You can regulate the temperature in the house by adjusting the thermostat. [ + question word ] Her mother strictly regulates how much TV she can watch. Synonym\ncontrol Opposite\nderegulate\nMore examplesFewer examplesPolice can invoke the law of trespass to regulate access to these places.This valve regulates the flow of water into the tank.The travel industry is regulated by a set of guidelines.The switch is used to regulate the speed at which the machine operates.The government has introduced new laws to regulate the sale of firearms.\nSMART Vocabulary: related words and phrases\nControlling and being in charge\naggrandize\nassert your authority\nassume\nassumption\nauthoritative\ncommanding\ncynical\nget the better of someone idiom\nget your hooks into someone/something idiom\nget/fall into the wrong hands idiom\ngovern\nguiding principle\npaternalistic\npaternalistically\nperemptorily\nperemptory\nplay God idiom\ntame\nwrangle\nwrangler\nSee more results »\nAdd to word list\nAdd to word list\nto control an activity or process by rules or a system: A computer system regulates production. [ + question word ] Their parents regulate how much TV the children can watch.\nRegulate also means to adjust something to a desired level or standard: As a diabetic, she regulates her sugar intake carefully. regulation adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˌreɡ·jəˈleɪ·ʃən/\nSoldiers wear a regulation uniform.\nAdd to word list\nAdd to word list\nto check that the activities of a business or organization are legal and follow official rules or laws: Congress has the power to regulate interstate commerce. The agency regulates the financial services industry. This government does not trust the public sector to regulate itself. Compare\nderegulate"}