{"id":306165,"name":"regularity","type":"noun","us_sound":"ˌreɡ.jəˈler.ə.t̬i","us_link":"../audio/r/eus73909.mp3","uk_sound":"ˌreɡ.jəˈlær.ə.ti","uk_link":"../audio/r/ukregul001.mp3","content":"regularity noun\n(OFTEN)\nAdd to word list\nAdd to word list\n[ U ] the fact of something happening or being done often: The same familiar faces reappear in the law courts with depressing regularity. Large projects fail with monotonous regularity.\nMore examplesFewer examplesThis is a city where clubs open and close with alarming regularity.They protested about the postal service where credit cards, parcels, and letters have disappeared with frightening regularity.Attacks on highways and bridges have occurred with increasing regularity in recent months.\nSMART Vocabulary: related words and phrases\nFrequency & regularity - general words\n(as) regular as clockwork idiom\n-ly\nclockwork\nendemically\nerratic\nerratically\nfitful\nirregular\nirregularity\nirregularly\nlike clockwork idiom\nmany\non and off idiom\non-off\nperiodic\nperiodically\nprevalence\nreligiously\nunsynchronized\nwould\nSee more results »\nregularity noun\n(EVENLY SPACED)\n[ U ] the fact of something existing or happening repeatedly in a fixed pattern, with equal or similar amounts of space or time between one and the next: The amounts and regularity of payments are set in the membership agreement.\n[ U ] the fact of someone emptying their bowels often enough, or of a woman having her periods with approximately the same time between them: Bulk-forming laxatives can be used on a daily basis to restore regularity. Reducing stress levels can help your menstrual cycle to revert to regularity.\nMore examplesFewer examplesThey found that regularity of contraceptive use is related to socioeconomic status.He was credited with bringing order and regularity to the procedure of the House of Lords.The regularity of the seasons matches the regularity of the great Christian festivals of Christmas, Easter, and Pentecost.\nSMART Vocabulary: related words and phrases\nFrequency & regularity - general words\n(as) regular as clockwork idiom\n-ly\nclockwork\nendemically\nerratic\nerratically\nfitful\nirregular\nirregularity\nirregularly\nlike clockwork idiom\nmany\non and off idiom\non-off\nperiodic\nperiodically\nprevalence\nreligiously\nunsynchronized\nwould\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStandard and routine\nAnimal physiology: excrement & its excretion\nAnimal physiology: fit & healthy\nregularity noun\n(USUAL)\n[ C or U ] something that happens in the usual way, or the fact of something doing this: Sociology stresses the patterns and the regularities of social life which is, most of the time, orderly and largely predictable.\n[ C or U ]\n&#160; language\n&#160; specialized the fact of a verb, noun, or adjective following the usual rules of a language in its various forms, or a form that follows the usual rules: Our research looks at verb regularity in a historical corpus of English. Researchers in language acquisition have shown that children play an active role in extracting regularities from the language around them.\nMore examplesFewer examplesWhen we look in depth at our materials we soon realize that certain patterns, certain regularities, certain trends can be discerned.The theory does explain the empirical regularities in the CEO labour market.Most of us never doubt the value of regularity and stability as essential cogwheels in the clockwork of daily life.We conclude that students could benefit from explicit instruction in gender-ending regularities. This study examines the effect of regularity and inflectional entropy on the production of Greek verbs.\nSMART Vocabulary: related words and phrases\nStandard and routine\naverage\naverage Joe\nbog-standard\nconformance\nconformity\nconventionalized\ndefault\ngiven\ninstitutionalize\nmainline\northodox\nquotidian\nregularization\nregularize\nround\nroutinely\nstd\nstock\nthe/your average bear idiom\nunspectacular\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: grammatical terms\nregularity noun\n(EVEN)\n[ C or U ] the fact of being the same on both or all sides: Symmetry and regularity in the shape and size of facial features is universally recognized as being beautiful.\nMore examplesFewer examplesThe building should be governed by the abstract principles of regularity, symmetry, and harmony.Her striking clothes emphasized the strength and regularity of her strong features.\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\nadjacent\naffinity\nakin\nalike\nallied\nballpark\nditto\nequivalent\nequivalently\nevenly\nevery inch idiom\nnon-distinctive\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\nrespecter\nsnap\nsynonymous\nSee more results »\nSee\nregular\nregularity noun [U]\n(REPEATED PATTERN)\nAdd to word list\nAdd to word list\nthe state or condition of having a fixed pattern, with equal or similar amounts of space or time between one and the next: The regularity of the design gets boring after a while.\nregularity noun [U]\n(ACTION DONE OFTEN)\nthe action of doing the same thing often: She watches those shows with amazing regularity."}