{"id":306181,"name":"regulation","type":"noun","us_sound":"ˌreɡ.jəˈleɪ.ʃən","us_link":"../audio/r/regulation.mp3","uk_sound":"ˌreɡ.jəˈleɪ.ʃən","uk_link":"../audio/r/ukregul006.mp3","content":"Add to word list\nAdd to word list\nB2 an official rule or the act of controlling something: safety/health/traffic/fire/security regulations The correct procedure is laid down in the rules and regulations. government regulation of inflation\nMore examplesFewer examplesThe Social Democrats are still wedded to the concepts of high taxation and regulation.New safety regulations have been brought in.I have acted strictly in accordance with the regulations at all times.The correct procedure is laid down in the rules and regulations.Safety regulations are being ignored by company managers in the drive to increase profits.\nSMART Vocabulary: related words and phrases\nRules & laws\nadministrative\nadmiralty\nanti-bribery\nanti-regulatory\nanti-sodomy\nbinding\nblue law\ncivil law\nhumanitarian law\ninvocation\njuridical\njuridically\njuristic\nland tenure\nlegislation\nprovision\nRafferty's rules\nthe rule of law\nuncanonical\nunenforceable\nSee more results »\naccording to the rules or the usual way of doing things: businessmen in their regulation pinstripe suits It's regulation to wear suits at the office. a regulation football pitch\nSMART Vocabulary: related words and phrases\nHabitual and customary\naccustomed\nall in a day's work idiom\nas a (general) rule idiom\nas a matter of course idiom\nas per usual/normal idiom\ninveterate\ninveterately\nknee-jerk\nmainstream\nmainstreaming\nmake it a rule idiom\nmechanical\nninety\noften\nordinarily\nper\nprevail\npro forma\nsurprise, surprise idiom\nterritory\nSee more results »\nAdd to word list\nAdd to word list\n[ U ]\n&#160; biology the chemical and nerve processes that allow people to adjust to changes in themselves and their environment so that they can continue to live\nthe rules or systems that are used by a person or organization to control an activity or process, or the action of controlling the activity or process: [ C ] federal safety regulations [ U ] She favors government regulation of health-care systems.\nAdd to word list\nAdd to word list\n[ C ]\n&#160; LAW, GOVERNMENT an official rule or law: They are introducing new policies and regulations for e-commerce. environmental/safety/ import regulations There are far too many rules and regulations.\n[ U ]\n&#160; LAW, GOVERNMENT the activity of checking that a business is following official rules or laws: This affects the operation and regulation of the accounting profession. They are looking at the replacement of government regulation by self-regulation and market mechanisms. Compare\nbuilding regulations\nused to describe official clothes or equipment used by people in a particular type of work: All flight attendants are required to wear regulation uniform. Security staff are issued with regulation kit."}