{"id":306251,"name":"rehash","type":"noun","us_sound":"ˈriː.hæʃ","us_link":"../audio/r/rehash.mp3","uk_sound":"ˈriː.hæʃ","uk_link":"../audio/r/ukregul011.mp3","content":"Add to word list\nAdd to word list\na book, film, piece of music, etc. that is very similar to previous ones and has no new ideas or improvements: His new book is just a rehash of his previous ones. The information in the report is a rehash of old discussions and misconceptions.\nMore examplesFewer examplesThe actor does not feel bad about doing a rehash of an old movie.A sequel doesn't mean a rehash of a previous plot. This is just a wordy rehash of the standard textbook view.\nSMART Vocabulary: related words and phrases\nSaying again\ndin something into someone\ndrill\ndrum\ndrum something into someone\nflog\nflog yourself to death idiom\nhammer\ninculcate\niterate\nlabour\nreaffirm\nrecap\nreiteration\nrelay\nrepetitively\nrephrase\nrestate\nrestatement\nretell\nretread\nSee more results »\nto write, say, do, etc. something again with no new ideas or improvements: Some students merely rehash what they've heard in lectures. We could simply rehash the published facts - but that would be dull.\nMore examplesFewer examplesThis post is not about rehashing the arguments of both sides.I’m not going to bore anyone by rehashing old tales or defending against every misinformed accusation.Cut off from his inspiration, he endlessly rehashes songs from his American era.\nSMART Vocabulary: related words and phrases\nSaying again\ndin something into someone\ndrill\ndrum\ndrum something into someone\nflog\nflog yourself to death idiom\nhammer\ninculcate\niterate\nlabour\nreaffirm\nrecap\nreiteration\nrelay\nrepetitively\nrephrase\nrestate\nrestatement\nretell\nretread\nSee more results »\nAdd to word list\nAdd to word list\nto present something old in a new way or form without any real change or improvement: The kids keep rehashing the same old argument about whose turn it is. rehash noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈriˌhæʃ/\nThe new season’s fashions seem like a rehash of last year’s."}