{"id":306316,"name":"rehire","type":"verb","us_sound":"ˌriːˈhaɪr","us_link":"../audio/r/cdo0123usrehi2072.mp3","uk_sound":"ˌriːˈhaɪər","uk_link":"../audio/r/cdo0123ukrehi2412.mp3","content":"Add to word list\nAdd to word list\nof a company, etc., to employ someone who is a former employee : They rehired a pharmacist who had worked for them in the past. The banks had to rehire some of the workers they had made redundant.\nMore examplesFewer examplesMost of the rehired employees received a pay rise.The company would lay off workers when prices were low and rehire them when prices rose.Some of the teachers know that they won't be rehired after the summer.The college was accused of limiting lecturers' contracts to 12 weeks or less - firing and rehiring them if necessary - in order to avoid having to cough up holiday pay.\nSMART Vocabulary: related words and phrases\nApplying for a job\nacqui-hire\nadvertisement\nanoint\nanointed\napplicant\nassign\nelect\nemploy\nemployable\nemployment\nemployment agency\nequality, diversity and inclusion\nnomination\nprospect\nreinstatement\nrelocation expenses\nresume\nretain\nrope\ntestimonial\nSee more results »\n[ U ] the act of a particular company employing a former employee again: More than twenty employees signed a letter opposing the rehire. All members of the staff are eligible for rehire.\n[ C ] mainly US a former employee of a company who is employed again by the same company: The airline recruited 150 flight attendants, although some were rehires. Not all of the rehires have signed the new agreements. Related word\nhire\nMore examplesFewer examplesHe authorized the rehire of thirty highly paid consultants.I am a bit surprised at the rehire, but not shocked.I had to go and see the boss to ask for a rehire.\nSMART Vocabulary: related words and phrases\nApplying for a job\nacqui-hire\nadvertisement\nanoint\nanointed\napplicant\nassign\nelect\nemploy\nemployable\nemployment\nemployment agency\nequality, diversity and inclusion\nnomination\nprospect\nreinstatement\nrelocation expenses\nresume\nretain\nrope\ntestimonial\nSee more results »\nAdd to word list\nAdd to word list\nHR, MANAGEMENT to employ someone again: They may be obliged to rehire the two workers they fired. Companies will start to rehire as we pull out of the recession."}