{"id":306301,"name":"rehydrate","type":"verb","us_sound":"ˌriːˈhaɪ.dreɪt","us_link":"../audio/r/cdo0318usrehy4091.mp3","uk_sound":"ˌriː.haɪ.ˈdreɪt","uk_link":"../audio/r/cdo0318ukrehy1174.mp3","content":"Add to word list\nAdd to word list\n[ I or T ] to drink water or other liquids because you do not have enough water in your body, or to put water or liquids into another person's or animal's body: The experts say that if you don't rehydrate completely, subsequent runs can be affected. The syringe delivered saline solution to rehydrate the animal.\nThesaurus: synonyms, antonyms, and examples\nto cover in or fill with liquidwetWet the flannel before you wipe the child's face.moistenHe licked his lips to moisten them.dampenUse a dampened paper towel to clean the cooker. saturateFully saturate the ground after planting seeds. soakSoak the clothes with detergent overnight.\nSee more results »\n[ T ] If you rehydrate something that has had water removed from it or is too dry, you make it absorb water: Cover the mushrooms with water and rehydrate them for 10 minutes.\nMore examplesFewer examplesIf you wake up with a pounding headache, rehydrate with water and with drinks that contain fructose.You may not be thirsty, but your body needs to rehydrate as soon as possible.First the astronauts have to force themselves to drink a salty solution to rehydrate.At the facility, workers and veterinarians examine and rehydrate the oil victims. Use a deep conditioner once a week to rehydrate hair.Rehydrate dried apples and bananas by cooking them in water until they are soft.\nSMART Vocabulary: related words and phrases\nRecovering from illness\nclear (something) up\ncolour\ncorrect\ncurability\ncurably\ncurative\nget over something/someone\ngranulate\nhold\nrecovery\nregressive\nrehabilitate\nrehabilitation\nremedial\nremission\nresponsive\nresponsiveness\nself-healing\nsleep\ntherapeutic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExercising & training\nDrinking\nPreparing food\nPhysical & chemical processes"}