{"id":306443,"name":"reimport","type":"verb","us_sound":"ˌriː.ɪmˈpɔːrt","us_link":"../audio/r/cdo0123usreim2084.mp3","uk_sound":"ˌriː.ɪmˈpɔːt","uk_link":"../audio/r/cdo0123ukreim2424.mp3","content":"Add to word list\nAdd to word list\nto buy or bring back products after they have been sent to another country: The shipment went to Germany and was than re-imported into Denmark. A surprising amount of America's exports are later re-imported.\ncomputing\n&#160; specialized to copy information onto a computer for a second time: Why don't you delete that file and then reimport it from the original source? The data can be exported and then re-imported in another application. Related word\nimport\nMore examplesFewer examplesIt is illegal to reimport these goods to the United States from Europe.We cannot re-import the cars unless we pay an import tax.The country sends its oil abroad to be refined and then re-imports it.\nSMART Vocabulary: related words and phrases\nBuying\nacquirable\nacquire\nacquisition\nacquisitiveness\napproval\nbidding\nbidding war\ninvest\nload up on something\nmisorder\nmoney-off\norder form\norder something in\npurchasing power\nretail therapy\nROBO\nROPO\nsend\nsend (off/away) for/to something\nslate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOperating computers\nsomething that is brought back into a country after it has been sent to another country: We can reduce the cost of the drugs by allowing reimports from overseas. Germany and France were major destinations for re-imports.\nMore examplesFewer examplesThis Hallowe'en tradition originated in Britain and is actually a re-import.\nSMART Vocabulary: related words and phrases\nBuying\nacquirable\nacquire\nacquisition\nacquisitiveness\napproval\nbidding\nbidding war\ninvest\nload up on something\nmisorder\nmoney-off\norder form\norder something in\npurchasing power\nretail therapy\nROBO\nROPO\nsend\nsend (off/away) for/to something\nslate\nSee more results »\nAdd to word list\nAdd to word list\nCOMMERCE to import goods back into the country where they were made, or from which they were previously exported: What percentage of cars produced in the UK for foreign companies were reimported for sale in the UK?\nIT to copy back into a computer program something that you previously removed : To solve the problem we need to export the images and then reimport them into the document.\n[ C ] something that was exported from a country and and then brought back in: There's a growing flow of reimports to the EU.\n[ U ] the process of bringing back into a country something that was previously exported from there: 20% of these goods are intended for reimport."}