{"id":306678,"name":"reinstallation","type":"noun","us_sound":"ˌriː.ɪn.stəˈleɪ.ʃən","us_link":"../audio/r/cdo0123usrein2112.mp3","uk_sound":"ˌriː.ɪn.stəˈleɪ.ʃən","uk_link":"../audio/r/cdo0123ukrein2452.mp3","content":"reinstallation noun [C or U, usually singular]\n(EQUIPMENT/FURNITURE)\nAdd to word list\nAdd to word list\ncomputing\n&#160; specialized the act of putting a computer program back onto a computer: The problem was resolved by a reinstallation of the original operating system. I backed up the database and completed a reinstallation without any problems.\nthe act of putting furniture, a machine, a piece of equipment, etc. back into the position that it was in before and making it ready for use: This piece was composed to celebrate the reinstallation of the church organ. She supervised the reinstallation of the gallery's permanent collection.\nMore examplesFewer examplesAn infected system may require a complete reinstallation of software.The reinstallation process takes several hours to complete.The objects are now awaiting reinstallation in the local museum.\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\ndrill down\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntoolbar\nvectorize\nvirtualization\nvirtualize\nwake word\nwhite hat\nzip file\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlacing and positioning an object\nreinstallation noun [C or U, usually singular]\n(JOB)\nthe act of putting someone back into an important job or position: Her reinstallation as the country's foreign minister is designed to restore credibility to the government. The president insisted on the re-installation of his trusted ally as head of security. Related words\nreinstall\ninstallation\nMore examplesFewer examplesThe international community supported Mr Hassan's reinstallation as head of state.\nSMART Vocabulary: related words and phrases\nPromoting staff\naggrandizement\nanointment\nascend\nascension\ncareer-limiting\nelevation\nexalt\nfast track\nfree transfer\nglass cliff\nhand off\npromote\npromotion\nreinstall\nrelegate\nsecondment\nsticky floor\nsubordinate\nvault\nwilderness\nSee more results »"}