{"id":306469,"name":"rein","type":"noun","us_sound":"reɪn","us_link":"../audio/r/rain.mp3","uk_sound":"reɪn","uk_link":"../audio/r/ukraffl025.mp3","content":"Add to word list\nAdd to word list\na long, thin piece of material, especially leather, that helps you to control and direct a horse: You pull on both reins to stop or slow a horse, but only the left rein to turn left.\nUK a strap that is put around a small child's body or wrist and held at the other end by an adult so that the adult can stop the child running away: I always put my son on reins when we go shopping.\nSMART Vocabulary: related words and phrases\nHorse riding\nbridle\ncanter\ncinch\ncurry\nendurance rider\nendurance riding\nequestrianism\neventer\ngirth\nhigh-spirited\nhorseman\njib\njodhpurs\nmounted\npony trekking\nsaddle-sore\nsidesaddle\nsilk\nsnaffle\nwhip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCords, ropes, cables & string\nChildren & babies\nIdioms\nfree rein\nkeep a tight rein on someone/something\ntake over/up the reins\nAdd to word list\nAdd to word list\na long thin piece of material, esp. leather, used to control a horse\nthe reins [ plural ]\nAdd to word list\nAdd to word list\npower and control of a business or other activity: These are the councillors who hold the reins of power. He handed the reins to his successor. I am retiring, and someone else can take over the reins.\nfree rein\nthe freedom to do what you want to do: have free rein We were told we had free rein on questions of design. give sb/sth free rein (to do sth) She was given free rein to make all the changes she wanted.\ngive/allow sth full rein (also give/allow full rein to sth)\nto allow something to happen freely and completely: This is a post which will give your talents full rein. It's a task that requires you to allow full rein to your imagination.\nkeep a tight rein on sth\nto control something very carefully: We need to keep a tight rein on the advertising budget."}