{"id":306775,"name":"reinvent","type":"verb","us_sound":"ˌriː.ɪnˈvent","us_link":"../audio/r/uscld01196.mp3","uk_sound":"ˌriː.ɪnˈvent","uk_link":"../audio/r/ukcld01196.mp3","content":"Add to word list\nAdd to word list\nto produce something new that is based on something that already exists: The story of Romeo and Juliet was reinvented as a Los Angeles gangster movie. reinvent yourself\nto change your job and/or the way you look and behave so that you seem very different: reinvent yourself as He's one of those sportsmen who reinvent themselves as TV presenters. Having reinvented herself as a country singer, she then went on tour with her band. In the same decade, she reinvented herself as a talk show host. I wanted to go somewhere where no one knew me and reinvent myself. He reinvented himself as a journalist-novelist. His attempts to reinvent himself as a politician failed.\nSMART Vocabulary: related words and phrases\nCopying and copies\nanti-counterfeiting\nanti-piracy\nape\nbiomimicry\nblueprint\nfacsimile\nforge\nforgery\nhijack\nhijacking\nimaging\nmail merge\nmimetic\nphotostat\nphotostatic\npiracy\npirate\npirated\ntranscript\nXerox\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChanging\nIdiom\nreinvent the wheel\nAdd to word list\nAdd to word list\nto change someone or something so much that the person or thing seems completely new: He promised to reinvent government if elected. Idiom\nreinvent the wheel\nAdd to word list\nAdd to word list\nto change something in a basic way so that it works differently: It's all about reinventing the way we do business. They must face reality and reinvent their failing systems.\nreinvent yourself\nto change the way you behave or look so that people think of you differently: In marketing parlance, the company has reinvented itself with a new brand. After going bankrupt she reinvented herself as an artist.\nreinvent the wheel\nto waste time and money in developing something that already exists: I'm afraid we've wasted six years reinventing the wheel."}