{"id":306596,"name":"reinforce","type":"verb","us_sound":"ˌriː.ɪnˈfɔːrs","us_link":"../audio/r/reinforce.mp3","uk_sound":"ˌriː.ɪnˈfɔːs","uk_link":"../audio/r/ukregul024.mp3","content":"Add to word list\nAdd to word list\nC2 to make something stronger: The pockets on my jeans are reinforced with double stitching.\nC1 If something reinforces an idea or opinion, it provides more proof or support for it and makes it seem true: The final technical report into the accident reinforces the findings of initial investigations. His behaviour merely reinforced my dislike of him.\nto provide an army with more soldiers or weapons to make it stronger: The garrison is to be reinforced with/by another two battalions of soldiers.\nMore examplesFewer examplesThe foundations will have to be reinforced to prevent the house from sinking further into the ground.The wooden beam is reinforced with a metal plate.Caring for animals is not sentimentality - it reinforces our respect for life.The builders used metal rods to reinforce the walls of the building.He used hand gestures to reinforce what he was saying.\nSMART Vocabulary: related words and phrases\nBecoming and making stronger\naggrandize\nboil up\nbolster\ncement\ncharacter-building\ndeepen\nharden\nhardening\ninvigoration\njell\npower (something) up\nreinforcement\nrestoke\nrestrengthen\nsharpen\nsolidification\nsolidify\nsoup\nsoup something up\nwired\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBacking, supporting & defending\nProviding weapons or taking weapons away\nAdd to word list\nAdd to word list\nto make something stronger, usually by adding more material or another piece: Building codes in California required that steel rods be used to reinforce cinder-block construction.\nSomething that reinforces an idea or opinion provides proof or support: But let me just cite one other fact to reinforce what you’re saying.\nTo reinforce an army is to provide it with more soldiers or weapons.\nAdd to word list\nAdd to word list\nPRODUCTION to make a material or structure stronger by adding something to it: The containers have been reinforced with steel bands. reinforced concrete\nto make an idea or belief stronger: reinforce the message/idea/view that The huge support given to big business by politicians has reinforced the message that the pursuit of wealth is the only thing that matters. They recommended that we reinforce our new brand identity with an advertising campaign.\nto increase the power of something, especially by making it bigger: We need to reinforce our sales capacity."}