{"id":306887,"name":"rejection","type":"noun","us_sound":"rɪˈdʒek.ʃən","us_link":"../audio/r/uszzzzd101.mp3","uk_sound":"rɪˈdʒek.ʃən","uk_link":"../audio/r/ukzzzze101.mp3","content":"Add to word list\nAdd to word list\nC2 [ C or U ] the act of refusing to accept, use, or believe someone or something: The government's rejection of the plans is a setback for us.\nC2 [ C ] a letter, etc. that tells you that you have not been successful in getting a job, a place on a course of study, etc.: I've applied for ten jobs, but I've had ten rejections/rejection letters.\nC2 [ U ] the act of not giving someone the love and attention they want and expect: He never asked her to marry him out of fear of rejection.\nMore examplesFewer examplesThe minister has issued an emphatic rejection of the accusation.This amounts to a rejection of the whole proposal.Most people find rejection hard to deal with.An actor takes so much rejection.Children can suffer from a sense of rejection when a parent leaves the home.\nSMART Vocabulary: related words and phrases\nRefusing & rejecting\nabjuration\nabnegate\nabnegation\nbar\nbat something/someone away\nbrush\ndemur\njettison\nmiss a chance/opportunity idiom\nopt out\npass something up\npunt on something\nquit\nquit on someone\nreact\nrebuff\nresistant\nspurn\nturn your nose up idiom\nwild horses wouldn't drag me idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLetters, notes and cards\nAdd to word list\nAdd to word list\nthe act or process of rejecting someone or something: [ U ] fear of rejection [ C ] I applied for ten jobs and got ten rejections.\nAdd to word list\nAdd to word list\nthe act of refusing to accept an idea, suggestion, proposal, etc.: The company's rejection of the proposal came as a total surprise.\nHR, WORKPLACE the act of deciding not to accept someone for a job, course of study, etc. or the fact of not being accepted: I've applied for loads of jobs and had a string of rejections. It's difficult to be unemployed and face rejection again and again."}