{"id":306874,"name":"reject","type":"verb","us_sound":"rɪˈdʒekt","us_link":"../audio/r/reject_01_00.mp3","uk_sound":"rɪˈdʒekt","uk_link":"../audio/r/ukrejec002.mp3","content":"Add to word list\nAdd to word list\nB2 to refuse to accept, use, or believe something or someone: The appeal was rejected by the court. Coin-operated machines in England reject euros. The prime minister rejected the suggestion that it was time for him to resign. I applied for a job as a mechanic in a local garage, but I was rejected (= I was not offered the job). The coach rejected him for the first team (= he was not offered a place).\nB2 to not give someone the love and attention they want and are expecting from you: When she was sent to boarding school, she felt as though her parents had rejected her.\nmedical\n&#160; specialized If your body rejects an organ that has been put in during a medical operation, it fails to accept it and tries to attack and destroy it.\nMore examplesFewer examplesThe programme makers reject the notion that seeing violence on television has a harmful effect on children.Modernism seeks to find new forms of expression and rejects traditional or accepted ideas.She rejected his unwelcome advances.It will not surprise anyone to learn that the offer has been rejected.The steelworkers' leader rejected the 2% pay-rise saying it was an insult to the profession.\nSMART Vocabulary: related words and phrases\nRefusing & rejecting\nabjuration\nabnegate\nabnegation\nbar\nbat something/someone away\nbrush\ndemur\njettison\nmiss a chance/opportunity idiom\nopt out\npass something up\npunt on something\nquit\nquit on someone\nreact\nrebuff\nresistant\nspurn\nturn your nose up idiom\nwild horses wouldn't drag me idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTreating people or animals badly\nMedical treatment: surgery\na product that is damaged or not perfectly made\na person who has not been accepted by an organization or by society: He considered himself to be one of life's rejects.\nSMART Vocabulary: related words and phrases\nRefusing & rejecting\nabjuration\nabnegate\nabnegation\nbar\nbat something/someone away\nbrush\ndemur\njettison\nmiss a chance/opportunity idiom\nopt out\npass something up\npunt on something\nquit\nquit on someone\nreact\nrebuff\nresistant\nspurn\nturn your nose up idiom\nwild horses wouldn't drag me idiom\nSee more results »\nAdd to word list\nAdd to word list\nto refuse to accept, use, or believe something or someone: The school rejects a third of all applicants.\nTo reject someone is also to treat someone in a way that shows you do not feel affection for that person: As a child, she had felt rejected by her mother.\nmedical If your body rejects tissue or an organ that comes from another person, your body has a dangerous physical reaction to it.\na damaged or faulty object, or a person who has had many jobs because of not being successful at any of them: In desperation the hockey team picked up a 35-year-old reject as a backup goalie.\nAdd to word list\nAdd to word list\nto refuse to accept an idea, suggestion, etc.: The committee will decide whether to accept or reject the offer. reject a suggestion/proposal/argument reject a claim/criticism/allegationreject sth as sth The board rejected the idea as being too risky.\nHR, WORKPLACE to decide not to choose someone for a job or for a place on a course of study, etc.: We rejected ten candidates in the first round of interviews. 25% of applicants are rejected because of lack of experience.\nCOMMERCE to decide that goods cannot be accepted because they are of low quality: Three shipments of beans were rejected because they had traces of illegal pesticides.\nCompare\naccept\nCOMMERCE something that cannot be accepted because it is of low quality: a factory reject Most of the crowd control drugs tested by the US military were rejects from the pharmaceutical industry."}