{"id":307058,"name":"relativist","type":"noun","us_sound":"ˈrel.ə.tɪ.vɪst","us_link":"../audio/r/cdo0318usrela4099.mp3","uk_sound":"ˈrel.ə.tɪ.vɪst","uk_link":"../audio/r/cdo0318ukrela1175.mp3","content":"Add to word list\nAdd to word list\nsocial science\n&#160; specialized someone who believes that truth and right and wrong can only be judged in relation to other things and that nothing can be true or right in all situations: He confesses to being a moral relativist. I do not think one can be a complete relativist in art. See\nrelativism\nMore examplesFewer examplesRelativists hold that religious texts written centuries ago must be interpreted within the cultural and historical context of their times.They conduct their affairs as practical relativists.She was a relativist who believed truth was dispensable.\nSMART Vocabulary: related words and phrases\nComparing and contrasting\nanalogy\nantithesis\napple\nas against idiom\nbalance something against something\ncomparative\ncompetitive\ncompetitively\ncontradistinction\ncontrast\ncontrastive\nmeasure\nmutatis mutandis\nnext\nnonrelative\nperspective\nrelative\nshame\nstack\nstack up\nSee more results »\nsocial science\n&#160; specialized based on the belief that truth and right and wrong can only be judged in relation to other things and that nothing can be true or right in all situations: Postmodernism supports a relativist concept of truth. We evaluate behaviour from a relativist perspective. See\nrelativism\nMore examplesFewer examplesBut we have not done well, even by that relativist standard.The adoption of a relativist position may lead to contradictions.These three arguments have a relativist tendency, in the sense that they question our capacity to achieve total and final truth.\nSMART Vocabulary: related words and phrases\nComparing and contrasting\nanalogy\nantithesis\napple\nas against idiom\nbalance something against something\ncomparative\ncompetitive\ncompetitively\ncontradistinction\ncontrast\ncontrastive\nmeasure\nmutatis mutandis\nnext\nnonrelative\nperspective\nrelative\nshame\nstack\nstack up\nSee more results »"}