{"id":307054,"name":"relatively","type":"adverb","us_sound":"ˈrel.ə.t̬ɪv.li","us_link":"../audio/r/relatively.mp3","uk_sound":"ˈrel.ə.tɪv.li","uk_link":"../audio/r/ukrejec020.mp3","content":"relatively good, bad, etc.\nAdd to word list\nAdd to word list\nB2 quite good, bad, etc. in comparison with other similar things or with what you expect: He's a relatively good squash player. There was relatively little violence.\nMore examplesFewer examplesThese people are living on relatively low incomes.It is relatively easy for newcomers to pick off the most lucrative business and ignore the rest.These beautiful old towns have remained relatively untouched by tourism.The third candidate for the party leadership is a relatively unknown quantity.The country's great influence in the world is disproportionate to its relatively small size.\nrelatively speaking\nsaid when you are judging one thing in comparison with other things: Relatively speaking, it's a fairly poor country.\nSMART Vocabulary: related words and phrases\nComparing and contrasting\nanalogy\nantithesis\napple\nas against idiom\nbalance something against something\ncomparative\ncompetitive\ncompetitively\ncontradistinction\ncontrast\ncontrastive\nmeasure\nmutatis mutandis\nnext\nnonrelative\nperspective\nrelative\nshame\nstack\nstack up\nSee more results »\nAdd to word list\nAdd to word list\nin comparison with other similar things or with what you expect: A few states across the country have remained in relatively good shape.relatively few/little Scottish businesses have relatively few problems with skill levels in the workforce compared to the rest of Britain.relatively low/high/weak Interest rate levels are expected to remain relatively low.relatively cheap/inexpensive Phone calls are relatively cheap, with a mix of monthly packages and pay-as you-go services.relatively easy/simple Online sales are relatively easy to track.relatively new/recent Wireless internet radio is still a relatively new product category.relatively large/small Investments that generally go up or down in value in relatively small amounts are considered \"low volatility\" investments.\nrelatively speaking\nused to say that your opinion or description of something is true when it is compared to other things of a similar type: The payout was, relatively speaking, a cheap solution."}