{"id":307059,"name":"relativistic","type":"adjective","us_sound":"ˌrel.ə.t̬əˈvɪs.tɪk","us_link":"../audio/r/cdo0623usrela3351.mp3","uk_sound":"ˌrel.ə.tɪˈvɪs.tɪk","uk_link":"../audio/r/cdo0623ukrela3375.mp3","content":"relativistic adjective\n(RELATIVE)\nAdd to word list\nAdd to word list\nsocial science\n&#160; specialized based on the belief that truth and right and wrong can only be judged in relation to other things and that nothing can be true or right in all situations: Like the majority of people, they take a relativistic view of the world. People with religious beliefs often have a desire for certainty in a society that they consider too relativistic. Synonym\nrelativistRelated word\nrelativism\nMore examplesFewer examplesRelativistic philosophies reject the idea of objective truth.If you believe that a pluralistic society is a good thing, then that society must inevitably also be relativistic.When writing dictionary definitions about religious beliefs, compilers need to take a relativistic viewpoint.\nSMART Vocabulary: related words and phrases\nOpinions, beliefs and points of view\nAfrocentric\nagnosticism\nanti-ideological\narticle of faith\nascription\nbubble\ncreed\nhelicopter view\nheretical\nheretically\nhot take\nidea\noutlook\npole\npolitics\nposture\npretension\nprism\nredistributionist\ntick\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTrue, real, false, and unreal\nComparing and contrasting\nrelativistic adjective\n(IN PHYSICS)\nphysics\n&#160; specialized relating to relativity (= either of two theories of physics giving the relationship between space, time, and energy, especially for two objects moving in different ways): A number of scientists made contributions to the relativistic theory of gravity. The paper includes special relativistic accounts of thermodynamics. Related word\nrelativity\nMore examplesFewer examplesHe became extremely interested in relativistic physics and decided to specialize in this discipline.The relativistic dependence of time on velocity is an important concept to grasp.In this equation, p represents the relativistic linear momentum.\nSMART Vocabulary: related words and phrases\nPhysics: particular theories & concepts\naphelion\nazimuth\nchaos theory\nconservation\ncryogenics\ndark matter\nDoppler effect\ndynamics\nelement\nlibration\nmomentum\nperihelion\nPlanck's constant\nquantum\nrefraction\nrelativity\nspatio-temporal\nspatiotemporally\ntime dilation\nwormhole\nSee more results »"}