{"id":307050,"name":"relationship","type":"noun","us_sound":"rɪˈleɪ.ʃən.ʃɪp","us_link":"../audio/r/relationship.mp3","uk_sound":"rɪˈleɪ.ʃən.ʃɪp","uk_link":"../audio/r/ukrejec018.mp3","content":"relationship noun [C]\n(CONNECTION)\nAdd to word list\nAdd to word list\nB2 the way in which two things are connected: Scientists have established the relationship between lung cancer and smoking.\nMore examplesFewer examplesHer relationship isn't good with her father, but she's very close to her mother.Lack of trust is very destructive in a relationship.The relationship was never going to work, but it was fun while it lasted.What do you look for in a relationship?She knew he fancied her, but preferred to keep their relationship platonic.\nSMART Vocabulary: related words and phrases\nLinking and relating\naffiliated\nAL\nappertain to something\napplicable\naround\ncollateral\necosystem\nequation\nincestuously\ninterconnect\ninterconnected\ninterconnectedness\ninterconnection\nrecoupling\nrelatability\nrelatable\nrelate\nrelate to someone/something\nrelatedly\ntar\nSee more results »\nrelationship noun [C]\n(FRIENDSHIP)\nB1 the way in which two or more people feel and behave towards each other: He has a very good relationship with his uncle.\nB1 a close romantic friendship between two people, often a sexual one: Have you had any serious relationships in the past year? a love/hate relationship\na relationship in which you have feelings of love and hate for someone or something\nSMART Vocabulary: related words and phrases\nRelationships: general words\naffiliative\nbromance\ncommunion\ndalliance\ndate night\ninterpersonal\ninterpersonally\nintimate\nintimately\ninvolved\nkinship\nplatonic\nplatonically\nprivity\nre-establish\nreconnect\nsocial life\nsteady\nunromantic\nwell connected\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMarriage, cohabitation & other relationships\nrelationship noun [C]\n(FAMILY CONNECTION)\nthe family connection between people: The judge asked the witness what the relationship was between her and the victim.\nSMART Vocabulary: related words and phrases\nFamily: relations in general\nanti-family\naunt\nauntie\nbaby daddy\nbiologically\nfatherhood\nfilial\nfilially\nfirst cousin\nfraternal\nkinsman\nkinswoman\nkith and kin\nlong-lost\nloved one\nrelationally\nrelative\nremoved\nsecond cousin\nsib\nSee more results »\nAdd to word list\nAdd to word list\nthe way in which things are connected or work together: Write an essay on the economic relationship between farming and transportation.\nA relationship is the way two or more people are connected, or the way they behave toward each other: \"What is your relationship to the soloist?\" \"She's my daughter.\" The two men have a good working relationship.\nA relationship is also a close romantic friendship between two people.\nAdd to word list\nAdd to word list\nthe way in which two or more companies, countries, or people behave towards each other: Creating lasting relationships is vital for success in business. We have an excellent working relationship with the university. We have established long-lasting business relationships with a wide range of clients.relationship between sb (and sb) The relationship between labor and management was strained beyond breaking point.build/develop/establish a relationship Many telecom companies are building relationships in developing countries. a good/close relationship a business/personal relationship\na connection between two or more facts, events, etc.: relationship between sth (and sth) This research shows that the relationship between globalization and e-commerce is complex and varied. There is a direct relationship between the two announcements. See also\ncustomer relationship\nemployment relationship"}