{"id":307053,"name":"relative","type":"noun","us_sound":"ˈrel.ə.t̬ɪv","us_link":"../audio/r/eus73920.mp3","uk_sound":"ˈrel.ə.tɪv","uk_link":"../audio/r/ukrejec019.mp3","content":"Add to word list\nAdd to word list\nB1 a member of your family: I don't have many blood relatives (= people related to me by birth rather than by marriage). All her close/distant relatives came to the wedding.\nThesaurus: synonyms, antonyms, and examples\nyour relativesrelativeAll my relatives gather every year for a family reunion.extended familyHe has a very large extended family.relationShe is a distant relation of his, though I don't quite remember how.kinHe remained true to his kin.mother's/father's side (of the family)I have aunts and uncles on my mother's side of the family.\nSee more results »\nMore examplesFewer examplesThe children are being cared for by a relative.There weren't many people at the funeral - just close family relatives.I live in Cambridge, but my relatives live up north in Manchester.It is women who mainly shoulder responsibility for the care of elderly and disabled relatives.Sundry distant relatives, most of whom I hardly recognized, turned up for my brother's wedding.\nSMART Vocabulary: related words and phrases\nFamily: relations in general\nanti-family\naunt\nauntie\nbaby daddy\nbiologically\nfatherhood\nfilial\nfilially\nfirst cousin\nfraternal\nkinsman\nkinswoman\nkith and kin\nlong-lost\nloved one\nrelationally\nrelationship\nremoved\nsecond cousin\nsib\nSee more results »\nrelative adjective\n(COMPARING)\nC1 being judged or measured in comparison with something else: We weighed up the relative advantages of driving there or going by train.\ntrue to a particular degree when compared with other things: Since I got a job, I've been living in relative comfort (= more comfort than before).\nMore examplesFewer examplesThe relative cheapness of foreign travel means that more people are going abroad than ever before.We've lived here for 15 years, but we're relative newcomers to the village.Now that the civil war is over, relative normality has returned to the south of the country.He rose from relative obscurity to worldwide recognition.There is a chart on the classroom wall showing the relative heights of all the children.\nSMART Vocabulary: related words and phrases\nComparing and contrasting\nanalogy\nantithesis\napple\nas against idiom\nbalance something against something\ncomparative\ncompetitive\ncompetitively\ncontradistinction\ncontrast\ncontrastive\nmeasure\nmutatis mutandis\nnext\nnonrelative\nperspective\nrelatively\nshame\nstack\nstack up\nSee more results »\nrelative adjective\n(CONNECTED)\nrelative to\nC2 If something is relative to something else, it changes according to the speed or level of the other thing: The amount of petrol a car uses is relative to its speed.\nIf something is relative to a particular subject, it is connected with it: Are these documents relative to the discussion?\nSMART Vocabulary: related words and phrases\nLinking and relating\naffiliated\nAL\nappertain to something\napplicable\naround\ncollateral\necosystem\nequation\nincestuously\ninterconnect\ninterconnected\ninterconnectedness\ninterconnection\nrecoupling\nrelatability\nrelatable\nrelate\nrelate to someone/something\nrelatedly\ntar\nSee more results »\nrelative adjective [not gradable]\n(COMPARED WITH)\nAdd to word list\nAdd to word list\nas judged or measured in comparison with something else: We considered the relative merits of flying to Washington or taking the train. Relative to (= Considering) birthweight, the newborns were doing well. relatively adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈrel·ə·t̬ɪv·li/\nThe stereo was relatively inexpensive.\nrelative noun [C]\n(FAMILY)\na member of your family: All her relatives came to the wedding.\nAdd to word list\nAdd to word list\nhaving a particular characteristic or value compared to other things of a similar type: The Chancellor of the Exchequer talked about the UK's relative growth performance compared with \"core\" Europe. relative importance/strength/sizerelative cost/price International borrowers have seen the relative cost of their loans rise slightly in the past six months.a relative newcomer/unknown The firm is a relative newcomer to the world of futures trading.\nrelative to sth\ncompared to something else: Official figures probably understate Europe's growth relative to America. Pay in many white-collar jobs has been stagnating relative to inflation.relative to earnings/income/sales Motoring costs are forecast to increase even further over the next ten years relative to income.relative to sb's competitors/peers Steps taken now to address climate change can improve a company's competitive position relative to its peers."}