{"id":307017,"name":"relapse","type":"verb","us_sound":"rɪˈlæps","us_link":"../audio/r/eus73918.mp3","uk_sound":"rɪˈlæps","uk_link":"../audio/r/ukrejec013.mp3","content":"Add to word list\nAdd to word list\nto become ill or start behaving badly again, after making an improvement: She managed to stop using drugs for a month, but then relapsed. He looked happy for a brief while, before relapsing into silent misery.\nSMART Vocabulary: related words and phrases\nDeteriorating and making worse\nadd\nadmin\naggravate\nbackslide\nbe (all) downhill idiom\ndebase\ndeterioration\ndevaluation\ndevalue\ndisintegrate\ndog\ndowngrade\none step forward, two steps back idiom\nregress\nregression\nregressive\nregressively\nwear thin idiom\nworse\nworsen\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBeing & falling ill\nIf someone who is getting better after an illness has a relapse, they become ill again: She was looking quite healthy on Friday, but she had/suffered a relapse over the weekend and was taken back into hospital.\nSMART Vocabulary: related words and phrases\nNot fit & healthy\nbe a shadow/shell of your former self idiom\nbe at death's door idiom\nbed\nclinically obese\ncomplain of something\ncritical list\nfrailty\ngaunt\nhollow\nhollow-eyed\ninfirm\nrough\nsick\nsickly\ntake to your bed idiom\nundernourishment\nunhealthily\nunthrifty\nunwholesomeness\nwan\nSee more results »\nAdd to word list\nAdd to word list\nto return to a previous bad condition or a worse way of life after making an improvement: She briefly relapsed twice after being released from the hospital.\nthe return of an illness suffered previously\nAdd to word list\nAdd to word list\nto get worse after a successful period or after increasing in value: A leading commodities analyst said it thought economic conditions in the US would relapse in the coming months. If interest rates are set too high, the country may well relapse into recession.\na situation in which something gets worse after a successful period or in which prices go down after increasing in value: Shares of the UK's leading chemicals manufacturer have suffered another relapse in the past week."}