{"id":307031,"name":"related","type":"adjective","us_sound":"rɪˈleɪ.t̬ɪd","us_link":"../audio/r/related.mp3","uk_sound":"rɪˈleɪ.tɪd","uk_link":"../audio/r/ukrejec015.mp3","content":"related adjective\n(CONNECTED)\nAdd to word list\nAdd to word list\nB2 connected: We discussed unemployment and related issues. Experts believe that the large number of cancer cases in the area are directly related to the new nuclear power station.\nMore examplesFewer examplesEvery new job that is created spins off three or four more in related fields.Platinum combines with phosphorus and arsenic and is seldom found without an admixture of related metals.The lecturer temporarily digressed from her subject to deal with a related theory.They're distantly related.English and German are closely related.\nSMART Vocabulary: related words and phrases\nLinking and relating\naffiliated\nAL\nappertain to something\napplicable\naround\ncollateral\necosystem\nequation\nincestuously\ninterconnect\ninterconnected\ninterconnectedness\ninterconnection\nrecoupling\nrelatability\nrelatable\nrelate\nrelate to someone/something\nrelatedly\nweld\nSee more results »\nrelated adjective\n(FAMILY)\nB2 If people are related, they belong to the same family: She claims she is related to royalty. Jim and I are related by marriage.\nIf different types of animal are related, they come from the same type of animal: The cat and the lion are related species.\nSMART Vocabulary: related words and phrases\nFamily: relations in general\nanti-family\naunt\nauntie\nbaby daddy\nbiologically\nfatherhood\nfilial\nfilially\nfirst cousin\nfraternal\nkinsman\nkinswoman\nkith and kin\nlong-lost\nloved one\nrelationally\nrelationship\nrelative\nremoved\nsecond cousin\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSpecies & genders\nAdd to word list\nAdd to word list\nbelonging to the same family: Of course Elise and Linda are related – they’re cousins. José and Alfonso are related by marriage.\nrelated adjective [not gradable]\n(CONNECT)\nconnected: We discussed inflation, unemployment, and related issues. They invested in technology-related companies.\nAdd to word list\nAdd to word list\nconnected to, influenced by, or caused by something: related costs/expenses Customers will be responsible for repaying the entire loan amount as well as all related costs and fees.related products/services We currently have around 300 job openings in sales and related services.related activities/changes/causes Mining and related activities remain at the centre of the South African economy.be related to sth Overall financial performance has been adversely affected by a slowdown in demand that is related to a cooling economy. Cutting the emergency-loan rate will not be enough to solve all of the problems related to current conditions in the credit markets.\n-related\nused to describe what something is connected with: Stocks fell as the US dollar's plunge against the yen sent export-related issues tumbling. profit-related bonuses See also\nbusiness-related\nearnings-related\nemployment-related\njob-related\nperformance-related\ntax-related\nwork-related"}