{"id":307076,"name":"relax","type":"verb","us_sound":"rɪˈlæks","us_link":"../audio/r/relax.mp3","uk_sound":"rɪˈlæks","uk_link":"../audio/r/ukrejec022.mp3","content":"relax verb\n(PERSON)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to (cause someone to) become less active and more calm and happy: After work she relaxed with a cup of tea and the newspaper. By and large, cooking relaxes me.\nThesaurus: synonyms, antonyms, and examples\nto relaxrelaxAfter a long day in the office, I love nothing more than relaxing on the sofa.chill outWe spent the whole week chilling out on the beach.chillaxHey, man, just chillax.unwindMusic helps me to unwind.wind downOur daughter knows that when we read a story at the end of the day, it's time to wind down and get ready for bed. take it easyYou'll need to spend a few days taking it easy after the operation.\nSee more results »\n[ I or T ] to (cause a part of the body) to become less stiff: A good massage will relax your tired muscles. Muscles in the throat relax during sleep, causing shallow or obstructed breathing.\nMore examplesFewer examplesShe lay back in the dentist's chair and tried to relax.I was relaxing in the bath, having toiled away in the garden all afternoon.After work, they relaxed by going to the pub.Don't tense your shoulders, just relax.I like to relax with a pipe of an evening.\nSMART Vocabulary: related words and phrases\nCalming and relaxing\nappease\nassuage\nballs-to-the-wall\nbask\nbread\nchill\ncompose\nkick back\nlet/blow off steam idiom\nlie down\nlighten something up\nlull\nmelt\nplacebo\nrelaxation\nrelaxing\nself-soothe\nsettle down\nshirt\nsimmer\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFlexible, loose and yielding\nrelax verb\n(RULE)\n[ T ] to make a rule or control less severe: Two weeks after the police relaxed security at the airports, there was a bomb attack.\nSMART Vocabulary: related words and phrases\nLiberating, relaxing and releasing\nbreathe\nbreathe easier idiom\ncathartic\ncathartically\nchillax\ndecontrol\ndischarge\nlet someone loose idiom\nlet/set something loose idiom\nliberalization\nliberate\nliberated\nloose\nrelax your grip/hold idiom\nrelease\nturn someone/something loose idiom\nunbeholden\nunbind\nunconfined\nwalk free idiom\nSee more results »\nrelax verb\n(HAIR)\n[ T ] to make curly hair straight or less tightly curled using a special chemical: The same applies if your hair has been permed or relaxed. Cut styling time in half by relaxing the bottom layers of hair.\nSMART Vocabulary: related words and phrases\nStraight, even and level\nbe (as) flat as a pancake idiom\nclean\nclean-cut\ncleanly\nconsistency\nflat\nflatness\nplane\nrhythm\nseamless\nsleek\nsleekly\nsleekness\nsmooth\nstraight\nstraight edge\nstraightness\nsuper-smooth\ntrue\nultra-smooth\nSee more results »\nIdiom\nrelax your grip/hold\nAdd to word list\nAdd to word list\nto become or cause someone to become calm and comfortable, and not worried or nervous, or to become or cause a muscle or the body to become less tight: [ I ] She saw a need for a downtown club where women could relax. [ T ] This exercise will help you to relax your neck muscles. [ T ] He relaxed his grip on my arm (= held it less tightly).\nWhen rules or controls are relaxed, they are made less severe. relaxation noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌriˌlækˈseɪ·ʃən/\nThe senator and his family flew to West Palm Beach for golf and relaxation.\nrelax rules/laws/restrictions, etc.\nAdd to word list\nAdd to word list\nto make rules, laws, etc. less severe: The government is to relax restrictions on companies and individuals holding foreign currencies."}