{"id":307068,"name":"relaunch","type":"noun","us_sound":"ˈriː.lɑːntʃ","us_link":"../audio/r/cdo0123usrela2131.mp3","uk_sound":"ˈriː.lɔːntʃ","uk_link":"../audio/r/cdo0123ukrela2471.mp3","content":"relaunch noun [C]\n(EVENT)\nAdd to word list\nAdd to word list\nthe act of introducing something again as though it were something new, or an event at which this happens : The relaunch of the restaurant was an embarrassing flop. The show will undergo a re-launch next year with a new presenter.\nMore examplesFewer examplesThe newspaper's relaunch has been hugely successful.Industry experts are sceptical about the relaunch of the brand.There was an expensive advertising campaign to accompany the relaunch.\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ncustomer relationship management\ndetoxify\ndifferentiator\ndogfooding\nflyer\no.n.o.\noff-brand\non-brand\noverexpose\noverexposure\ntout\nunadvertised\nunbilled\nunbranded\nunmarketable\nSee more results »\nrelaunch noun [C]\n(LEAVING LAND)\nan occasion when a boat is put into the water again, or a spacecraft is sent into space again: A large crowd gathered to watch the relaunch of the liner. The relaunch of the rocket was delayed because of bad weather.\nMore examplesFewer examplesWe had been invited to the relaunch of the ship.\nSMART Vocabulary: related words and phrases\nSpace travel\naerospace\nastronautics\nautopilot\nbiosatellite\nblast\nbooster\ncapsule\nearthbound\nescape velocity\nEVA\nflyby\nlauncher\nnose cone\nshuttle\nspace capsule\nspace probe\nspace tourism\nspace tourist\nspacefarer\nspaceman\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArriving & departing by boat or ship\nRelated word\nlaunch noun\nrelaunch verb [I or T]\n(START AGAIN)\nto start again, or introduce something again as though it were something new: We need to come up with a better design before the website is relaunched. The former pop star is planning to relaunch himself as an actor. The show will relaunch early next year.\nMore examplesFewer examplesThe singer struggled for years to relaunch her career.The site was relaunched this month with new features.Detectives have relaunched their investigation into the ten-year-old mystery.\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ncustomer relationship management\ndetoxify\ndifferentiator\ndogfooding\nflyer\no.n.o.\noff-brand\non-brand\noverexpose\noverexposure\ntout\nunadvertised\nunbilled\nunbranded\nunmarketable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInventing, designing and innovation\nrelaunch verb [I or T]\n(LEAVE LAND)\nto put a boat into the water again, or send a spacecraft into space again: We needed six people to turn the vessel around and relaunch it. At high tide we were finally able to relaunch the boat. Related word\nlaunch verb\nMore examplesFewer examplesThe cruise line relaunched its flagship vessel last year.We re-launched the boat today after its winter overhaul.\nSMART Vocabulary: related words and phrases\nSpace travel\naerospace\nastronautics\nautopilot\nbiosatellite\nblast\nbooster\ncapsule\nearthbound\nescape velocity\nEVA\nflyby\nlauncher\nnose cone\nshuttle\nspace capsule\nspace probe\nspace tourism\nspace tourist\nspacefarer\nspaceman\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArriving & departing by boat or ship\nAdd to word list\nAdd to word list\na new attempt to sell a product or service, often by advertising it in a different way or making it available in a different form: The cinema complex marked its relaunch after a £50 million redevelopment. The retailer plans a high-profile relaunch later this month.relaunch of sth BMW's relaunch of the classic Mini received much positive buzz.\nMARKETING to make a new attempt to sell a product or service, often by advertising it in a different way or making it available in a different form: The charity relaunched its credit card last week.relaunch sth as sth The Daily Mail was relaunched as a mid-market tabloid, aimed at the emerging market of younger women. We will be restructuring and relaunching next year."}