{"id":307104,"name":"release","type":"verb","us_sound":"rɪˈliːs","us_link":"../audio/r/release.mp3","uk_sound":"rɪˈliːs","uk_link":"../audio/r/ukrejec028.mp3","content":"release verb [T]\n(MAKE FREE)\nAdd to word list\nAdd to word list\nB2 to give freedom or free movement to someone or something: He was released from prison after serving two years of a five-year sentence. She was arrested for shoplifting but was released on bail (= after paying a sum of money to the court).figurative The surgery released him from years of pain.\nto move a device from a fixed position to allow it to move freely: He released the handbrake and the car jumped forwards.\nto fire a bomb or a missile (= flying weapon), or to allow it to fall: The plane released its bombs at 10,000 feet.\nC1 to allow a substance to flow out from somewhere: Coal power stations release sulphur dioxide into the atmosphere. Hormones are released from glands into the bloodstream.\nto express a feeling that you have been trying not to show: He punched the pillow in an effort to release his anger.\nMore examplesFewer examplesTheir appeals to release the hostages fell on deaf ears.Note how easy it is to release the catch quickly.The prisoner has been released for humanitarian reasons.He held out an olive branch to the opposition by releasing 42 political prisoners.Highly toxic dioxins were released into the air.\nSMART Vocabulary: related words and phrases\nLiberating, relaxing and releasing\nbreathe\nbreathe easier idiom\ncathartic\ncathartically\nchillax\ndecontrol\ndischarge\nlet someone loose idiom\nlet/set something loose idiom\nliberalization\nliberate\nliberated\nloose\nrelax\nrelax your grip/hold idiom\nturn someone/something loose idiom\nunbeholden\nunbind\nwalk\nwalk free idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnfastening and opening\nDetonation & bombardment\nEmitting and ejecting\nShowing and demonstrating\nrelease verb [T]\n(MAKE PUBLIC)\nC1 to allow something to be shown in public or to be available for use: Police have released a picture of the man they want to question. The mayor has released a statement explaining the reasons for his resignation.\nB2 If a company releases a film or musical recording, it allows the film to be shown in cinemas, or makes the musical recording available for the public to buy: The band's latest album will be released next week.\nIndian English to make a product, for example a book, available for the public to buy, often with a celebration; launch: The new edition of the dictionary will be released by the education minister later this month.\nMore examplesFewer examplesThe information has been released in dribs and drabs.A new mix of their hit single is due to be released early next month.We cannot release the names of the soldiers who were killed until we have informed their next of kin.Police blundered by not releasing more details about the case to focus public interest.They've just released a CD of their greatest hits.\nSMART Vocabulary: related words and phrases\nLiberating, relaxing and releasing\nbreathe\nbreathe easier idiom\ncathartic\ncathartically\nchillax\ndecontrol\ndischarge\nlet someone loose idiom\nlet/set something loose idiom\nliberalization\nliberate\nliberated\nloose\nrelax\nrelax your grip/hold idiom\nturn someone/something loose idiom\nunbeholden\nunbind\nwalk\nwalk free idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAvailable and accessible\nCinema - general words\nrelease noun\n(MAKING FREE)\nC1 [ S or U ] an occasion when someone is allowed to leave prison, etc.: Her early release from prison led to a demonstration.\nC1 [ U ] the act of flowing out from somewhere: The accident caused the release of radioactivity into the atmosphere.\n[ S or U ] a feeling that you are free from something unpleasant: I noticed a release of tension when he left the room. After years of suffering, his death came as a merciful release.\nMore examplesFewer examplesImmured in a dark airless cell, the hostages waited six months for their release.After such a long illness, her death came as a merciful release.This decision has removed the last obstacle to the hostages' release.He killed the man just a month after his release from a secure mental hospital.The pending releases of the prisoners are meant to create a climate for negotiation.\nSMART Vocabulary: related words and phrases\nLiberating, relaxing and releasing\nbreathe\nbreathe easier idiom\ncathartic\ncathartically\nchillax\ndecontrol\ndischarge\nlet someone loose idiom\nlet/set something loose idiom\nliberalization\nliberate\nliberated\nloose\nrelax\nrelax your grip/hold idiom\nturn someone/something loose idiom\nunbeholden\nunbind\nwalk\nwalk free idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEmitting and ejecting\nRelieved and thankful\nrelease noun\n(MAKING PUBLIC)\n[ U ] the act of making something public or available for use: There are strict rules on the release of official information.\n[ C ] a written statement that gives information to be broadcast or published: The company issued a press release announcing the appointment of a new CEO.\nB2 [ C ] a musical recording that is made available for the public to buy: Her latest release, a song about doomed love, she wrote herself. be on general release UK\nIf a film is on general release, it is available to be shown in cinemas: The latest Disney film goes on general release next month.\nSee more\nMore examplesFewer examplesAn e-fit of the man prompted hundreds of calls after its release on Tuesday.She's been in the limelight recently, following the release of her controversial new film.Her latest release is an album of cover versions.The film's release has been delayed.The magazine reviews all the latest releases.\nSMART Vocabulary: related words and phrases\nLiberating, relaxing and releasing\nbreathe\nbreathe easier idiom\ncathartic\ncathartically\nchillax\ndecontrol\ndischarge\nlet someone loose idiom\nlet/set something loose idiom\nliberalization\nliberate\nliberated\nloose\nrelax\nrelax your grip/hold idiom\nturn someone/something loose idiom\nunbeholden\nunbind\nwalk\nwalk free idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAvailable and accessible\nInformation and messages\nRecording sounds and images\nrelease verb [T]\n(MAKE FREE)\nAdd to word list\nAdd to word list\nto give freedom to someone: Agents questioned the men, then released them because they had done nothing wrong.\nIf you release a device, you move it from a locked position and allow it to move freely: She released the brake and the car rolled forward.\nrelease verb [T]\n(STOP HOLDING)\nto drop, or to stop carrying, holding, or containing something: The dog brought the ball back to us but wouldn’t release it. The company was charged with releasing toxic gases into the atmosphere.\nrelease verb [T]\n(MAKE PUBLIC)\nto let something be shown in public or made available for use: The police released a drawing of the suspect.\nrelease noun [C usually sing]\n(MAKING FREE)\nthe act of giving freedom to someone: Diplomatic efforts were underway to secure the release of the two journalists.\nrelease noun [C usually sing]\n(MAKING PUBLIC)\nthe act of letting something be shown in public or be made available for use: The release of the movie was delayed for several months.\nAdd to word list\nAdd to word list\nCOMMUNICATIONS to make information available to the public: According to a study released last week, nearly 250,000 Britons emigrated last year.release a statement/document/report The conservation group released a report accusing petroleum companies of causing widespread pollution.release details/figures/findings Figures released by the Council of Mortgage Lenders show that fixed-rate products accounted for 78% of mortgages in August. Copies of the correspondence between the attorneys have now been released to the media.\nCOMMERCE to start to sell a new product: Only a very small percentage of the software games released each year actually make money.release a CD/DVD/movie The record company has just released a CD that brings together the artist's solo and collaborative work.\nFINANCE to make money available to be spent: A spokesman for the transport group said new debt arrangements would release €500 million. Selling their home to release the equity is some people's only way of funding their living expenses in old age.\nPRODUCTION to produce gases or chemical substances as part of a manufacturing or industrial process: Many industrial processes are still releasing great quantities of carbon dioxide.\nto officially say that someone no longer has a job, position, or responsibility: release sb from sth The club has agreed to release three of its players from contract.\n[ S or U ]\n&#160; COMMERCE the act of making a new product available to buy or a new film available to see: The album sold more than 200,000 copies in the week following its June 12 release. The movie's release date has been pushed back six weeks. Sales peak when retailers time their promotion campaigns with the release of a box-office hit like Star Wars. Throughout the country, people have been queuing outside stores as they anticipate the commercial release of the new phone.after/on/since release Customers purchasing new computers have been offered a free upgrade to the latest operating system on its release.be/go on release A Blu-Ray version of the movie is now on general release.\n[ C ]\n&#160; COMMERCE a new product that is made available to buy, especially a CD, DVD, or a piece of software: new/recent/latest release Three of the major Hollywood film studios agreed to sell their older movies - but not new releases - through iTunes™.\n[ S or U ]\n&#160; COMMUNICATIONS the act of making information available to the public: The report's release resulted in share prices dropping dramatically. A temporary order was granted by the judge preventing the release of about 900 pages of e-mails.the release of information/reports/figures The rand lost ground again after the release of worse-than-expected gold and foreign exchange figures.\n[ C ]\n&#160; COMMUNICATIONS an official statement or document that is made available to the public: The city's GDP, down 5% to $48.86 billion, reflected the blow struck by the earthquake, the bureau said in a release. a news/press releaseissue/put out a release We will not be issuing a release on any tax increases until work on the state budget for the next fiscal year is complete.\n[ C or U ]\n&#160; PRODUCTION a process in which gases or chemical substances are produced as part of manufacturing or industrial processes: The company said its level of air emissions would stay about the same under the new permit, although it did acknowledge that the permit would allow larger releases. Any breach of safety regulations and resulting damage within a reactor could lead to a release of radiation.\n[ S or U ]\n&#160; FINANCE the act of making money available to be spent: release of sth Stock market indexes have recorded a steady growth in anticipation of early release of funds by the international donor agencies.\n[ S or U ] the act of making something available to be used: release of sth Crude oil prices edged up to $29.66 amid disappointment that Europe has postponed any release of oil from its strategic reserves.\nSee also\nblock release\nday release\npress release"}