{"id":307113,"name":"releasing","type":"verb","us_sound":"rɪˈliːs","us_link":"../audio/r/release.mp3","uk_sound":"rɪˈliːs","uk_link":"../audio/r/ukrejec028.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nrelease\nrelease verb [T]\n(MAKE FREE)\nB2 to give freedom or free movement to someone or something: He was released from prison after serving two years of a five-year sentence. She was arrested for shoplifting but was released on bail (= after paying a sum of money to the court).figurative The surgery released him from years of pain.\nto move a device from a fixed position to allow it to move freely: He released the handbrake and the car jumped forwards.\nto fire a bomb or a missile (= flying weapon), or to allow it to fall: The plane released its bombs at 10,000 feet.\nC1 to allow a substance to flow out from somewhere: Coal power stations release sulphur dioxide into the atmosphere. Hormones are released from glands into the bloodstream.\nto express a feeling that you have been trying not to show: He punched the pillow in an effort to release his anger.\nMore examplesFewer examplesTheir appeals to release the hostages fell on deaf ears.Note how easy it is to release the catch quickly.The prisoner has been released for humanitarian reasons.He held out an olive branch to the opposition by releasing 42 political prisoners.Highly toxic dioxins were released into the air.\nSMART Vocabulary: related words and phrases\nLiberating, relaxing and releasing\nbreathe\nbreathe easier idiom\ncathartic\ncathartically\nchillax\ndecontrol\ndischarge\nlet someone loose idiom\nlet/set something loose idiom\nliberalization\nliberate\nliberated\nloose\nrelax\nrelax your grip/hold idiom\nturn someone/something loose idiom\nunbeholden\nunbind\nwalk\nwalk free idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnfastening and opening\nDetonation & bombardment\nEmitting and ejecting\nShowing and demonstrating\nrelease verb [T]\n(MAKE PUBLIC)\nC1 to allow something to be shown in public or to be available for use: Police have released a picture of the man they want to question. The mayor has released a statement explaining the reasons for his resignation.\nB2 If a company releases a film or musical recording, it allows the film to be shown in cinemas, or makes the musical recording available for the public to buy: The band's latest album will be released next week.\nIndian English to make a product, for example a book, available for the public to buy, often with a celebration; launch: The new edition of the dictionary will be released by the education minister later this month.\nMore examplesFewer examplesThe information has been released in dribs and drabs.A new mix of their hit single is due to be released early next month.We cannot release the names of the soldiers who were killed until we have informed their next of kin.Police blundered by not releasing more details about the case to focus public interest.They've just released a CD of their greatest hits.\nSMART Vocabulary: related words and phrases\nLiberating, relaxing and releasing\nbreathe\nbreathe easier idiom\ncathartic\ncathartically\nchillax\ndecontrol\ndischarge\nlet someone loose idiom\nlet/set something loose idiom\nliberalization\nliberate\nliberated\nloose\nrelax\nrelax your grip/hold idiom\nturn someone/something loose idiom\nunbeholden\nunbind\nwalk\nwalk free idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAvailable and accessible\nCinema - general words"}