{"id":307167,"name":"reliability","type":"noun","us_sound":"rɪˌlaɪ.əˈbɪl.ə.t̬i","us_link":"../audio/r/eus73924.mp3","uk_sound":"rɪˌlaɪ.əˈbɪl.ə.ti","uk_link":"../audio/r/ukrelen007.mp3","content":"Add to word list\nAdd to word list\nC1 the quality of being able to be trusted or believed because of working or behaving well: Rolls-Royce cars are famous for their quality and reliability. The entire office is dependent on her reliability and competence. See\nreliable\nMore examplesFewer examplesWe aim to further improve the reliability of the electric power grid.Some experts have questioned the reliability of the test.There are issues with punctuality and reliability of bus services across the region.\nSMART Vocabulary: related words and phrases\nLoyal, faithful & dependable\na safe pair of hands idiom\nallegiance\naudaciously\nbe as good as your word idiom\nbe here for someone idiom\nbe there for someone idiom\nfaithful\nfaithfully\nfaithfulness\nfealty\nfidelity\nfiduciary\nreliable\nreliably\nself\nstalwart\nstalwartly\nultra-reliable\nundependable\nunto thine own self be true idiom\nSee more results »\nAdd to word list\nAdd to word list\nhow well a machine, piece of equipment, or system works: Consumers complained about a variety of problems, including call charges and poor network reliability.reliability of sth While design is important, the reliability of the company's products is far more valuable to most users. German vehicle manufacturers have built up a reputation for reliability. system/engine reliabilityaccuracy/quality/safety and reliability Consumers who avoided particular brands cited concerns about quality and reliability.improve/increase reliability Manufacturers are looking at ways of improving the car's reliability.\nhow accurate or able to be trusted someone or something is considered to be: Competence and reliability are prerequisites for any job. Public confidence in the reliability of a company's financial statements depends on investors perceiving the company's auditors as being independent from the company.reliability of information/data We have made significant improvements in the reliability of the information held on our database."}