{"id":307197,"name":"relief","type":"noun","us_sound":"rɪˈliːf","us_link":"../audio/r/relief.mp3","uk_sound":"rɪˈliːf","uk_link":"../audio/r/ukrelen013.mp3","content":"relief noun\n(HAPPINESS)\nAdd to word list\nAdd to word list\nB2 [ S or U ] a feeling of happiness that something unpleasant has not happened or has ended: [ + to infinitive ] It was such a relief to hear that Marta was found safe and well. After the exam, I felt an incredible sense of relief. \"James can't come tonight.\" \"Well, that's a relief!\" to seek/find/provide relief from the heat/cold/pain/noise\nMore examplesFewer examplesWe both heaved a sigh of relief when she left.To the bride's relief, the wedding ceremony went off without a hitch.She gave an audible sigh of relief.The holiday was a welcome relief.There was manifest relief among the workers yesterday at the decision not to close the factory.\nSMART Vocabulary: related words and phrases\nRelieved and thankful\na load/weight off your mind idiom\nappreciate\nappreciative\nappreciative of something\nappreciatively\nbeholden\nbless\nbless you! idiom\ncount\ngratitude journal\nI owe you (one) idiom\nin acknowledgment of something\nindebtedness\nmind\nrelease\nthank your lucky stars idiom\nthankful\nthankfully\nthankfulness\nthanks\nSee more results »\nrelief noun\n(HELP)\nC2 [ C or U ] food, money, or services that provide help for people in need: an international relief operation relief agencies/supplies Musicians have raised millions of dollars for famine relief in Africa. Synonyms\naid\nassistance\nhelp\nsuccour UK literary\nsupport (HELP)\nMore examplesFewer examplesIn spite of the scale of the famine, the relief workers struggled on with dauntless optimism and commitment.Campaigning to change government policy is ancillary to the charity's direct relief work.The continuing civil war is frustrating the efforts of relief agencies to feed thousands of famine victims.Charities are non-profit-making organizations and get tax relief.Our organization is just one of many charities that are providing famine relief in the region.\nSMART Vocabulary: related words and phrases\nHelping and co-operating\nabet\naccommodative\naid\nany port in a storm idiom\nassist\nassist with something\nbridge\ncarry\nfacilitate\nfacilitation\nfinancial assistance\ngive someone a leg up idiom\ngive/lend someone a helping hand idiom\nrecourse\nrun errands idiom\nshare a platform idiom\nsolid\nsponsor\nstart (something) off\nsuccour\nSee more results »\nrelief noun\n(RAISED AREA)\n[ U ] a method of raising shapes above a flat surface so that they appear to stand out slightly from it: Coins have pictures on them in relief.\n[ C ]\n&#160; art\n&#160; specialized a sculpture made from a flat surface in which the forms are raised above the surface: stone reliefs\nMoritz Wolf/GettyImages\nSMART Vocabulary: related words and phrases\nSculpture\nbas-relief\ncarve\ncarving\ncherub\ncupid\ngesso\nhew\ninstallation\nkore\nmaquette\nmould\nsculpt\nsculptor\nsculptural\nsculpturally\nsculpture\nsphinx\ntiki\ntorso\nwaxwork\nSee more results »\nIdioms\nbe on relief\nstand (out) in relief\nrelief noun\n(HAPPINESS)\nAdd to word list\nAdd to word list\n[ U ] a feeling of happiness that something unpleasant has not happened or has ended: She breathed a sigh of relief when she finished her exams.\n[ U ] Relief also means the reduction or end of pain: Aspirin may give you some relief.\nrelief noun\n(HELP)\n[ U ] food, money, or services for people in need: disaster relief\nrelief noun\n(WORK OF ART)\n[ C/U ] the building up of parts of a surface to form a picture or design that can be seen above the background, or a work of art made by this method: [ C ] the reliefs of the Parthenon\nAdd to word list\nAdd to word list\nFINANCE financial help that is given to people, companies, or countries that cannot pay their taxes or debts: All of the more than 3 million people who file income taxes in Virginia will be eligible for the $100 relief when they file their returns for the last fiscal year. Congress must reach consensus quickly on the issue of economic relief for the airline industry. Satellite-television subscribers should get relief from some of the taxes on their monthly bills under new legislation.give/offer/provide relief (to sb) Tax-cut proposals could offer relief to homeownersget/obtain relief (from sth) Because of the Fed's move to cut interest rates, people whose mortgages are adjusting may get some relief. relief packages/measures\nGOVERNMENT, FINANCE\n&#160; US financial help that the government gives to people who are poor, unemployed, etc.: grant/give/provide relief (to sb) Lawmakers are being lobbied by pressure groups, urging them to grant additional relief to seniors.\nSOCIAL RESPONSIBILITY money, food, and clothing that is sent to people who are in a difficult situation because of a war, flood, very bad storm, etc.: How can we be sure that relief will help those who are most in need? In the last five days we have undertaken a massive relief effort to bring water, medicine, and food to the refugees. disaster/emergency/flood relief a relief agency/organization/worker\nSee also\ndebt relief\ndouble taxation relief\nmortgage relief\nrate relief\ntax relief"}