{"id":307205,"name":"relieve","type":"verb","us_sound":"rɪˈliːv","us_link":"../audio/r/relieve.mp3","uk_sound":"rɪˈliːv","uk_link":"../audio/r/ukrelen014.mp3","content":"relieve verb\n(MAKE BETTER)\nAdd to word list\nAdd to word list\nC2 [ T ] to make an unpleasant feeling, such as pain or worry, less strong: She was given a shot of morphine to relieve the pain. She relieved her boredom at home by learning how to type.\n[ T ] to improve an unpleasant situation: New toll roads could help relieve congestion on other routes.\nMore examplesFewer examplesRubbing dock leaves on nettle stings helps to relieve the pain.The routine was the same every day, with nothing to relieve the monotony.There must be some way you can relieve the pain.This cream relieves the swelling caused by insect stings.They removed the blood clot in order to relieve the pressure on her brain.\nSMART Vocabulary: related words and phrases\nBecoming and making less strong\nabate\nabatement\nadulterate\nadulterated\nadulteration\ndecline\nenervate\nenervating\nenervatingly\nenfeeble\nenfeebled\nfade\nhedge\nmelt\nsink\nturn to jelly idiom\nundimmed\nunsubdued\nwane\nwaste away\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking things better\nrelieve verb\n(HELP)\n[ T ] to provide relief for a bad situation or for people in need: emergency food aid to help relieve the famine\n[ T ] to take the place of someone and continue doing their job or duties: I'm on duty until 2 p.m. and then Peter is coming to relieve me.\n[ T ] formal to free a place that has been surrounded by an enemy army by military force: An armoured battalion was sent to relieve the besieged town.\nSMART Vocabulary: related words and phrases\nMaking things better\nadd salt to something idiom\nallay\nalleviate\nalleviation\nameliorate\ncultivate\nleavening\nlevelling up\nlighten\nliven (something) up\nlubricate\nmake a difference idiom\nrationalize\nrectify\nremedial\nreorganize\nrepair\nrepolish\nrestructure\nrevamp\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReplacing and exchanging\nAttacking & invading\nrelieve verb\n(URINATE)\nrelieve yourself\npolite word for\nurinate : He proceeded to relieve himself against a tree. I had to relieve myself behind a bush. She excused herself to the bathroom so she could relieve herself. There are no facilities for miles and people have to relieve themselves somewhere.\nSMART Vocabulary: related words and phrases\nAnimal physiology: urine & urinating\naccident\nbathroom\nbodily function\nexcrete\nexcretion\ngenitourinary\ngo to the bathroom idiom\nleak\npass\npass water idiom\npiddle\nslash\ntake a leak/have a leak idiom\ntinkle\nuric\nwater\nwaterworks\nwazz\nwee\nwet your pants idiom\nSee more results »\nPhrasal verb\nrelieve someone of something\nrelieve verb [T]\n(LESSEN PAIN)\nAdd to word list\nAdd to word list\nto make something bad or painful less severe: The addition to the school will relieve overcrowding. She was given morphine to relieve the pain.\nTo relieve yourself is to excrete urine.\nrelieve verb [T]\n(REPLACE)\nto arrive or come in order to take the place of another person: The guard is relieved at 6 p.m. by the night watchman. Phrasal verb\nrelieve someone of something\nAdd to word list\nAdd to word list\nto take action to improve a difficult situation: If China and other Asian economies let their currencies rise, this will relieve pressure on the euro. The campaign has fallen short of its goal of relieving the burden of unsustainable debt on the poorest countries. relieve a burden/strainrelieve congestion/overcrowding Opening the route to truckers would relieve congestion on other roadways. Phrasal verb\nrelieve sb of sth"}