{"id":307353,"name":"reluctant","type":"adjective","us_sound":"rɪˈlʌk.tənt","us_link":"../audio/r/reluctant.mp3","uk_sound":"rɪˈlʌk.tənt","uk_link":"../audio/r/ukrelen024.mp3","content":"Add to word list\nAdd to word list\nC1 not willing to do something and therefore slow to do it: [ + to infinitive ] I was having such a good time I was reluctant to leave. Many parents feel reluctant to talk openly with their children. She persuaded her reluctant husband to take a trip to Florida with her.\nThesaurus: synonyms, antonyms, and examples\nnot wanting to do somethingunwillingShe was unwilling to hand over the money.loathI was loath to spend all the money at once.balkThe MP balked at a proposal to raise council tax.reluctantI was reluctant to leave because I was having such a good time.disinclinedI am disinclined to take on the extra work without more pay.\nSee more results »\nMore examplesFewer examplesThe United Nations was reluctant to get its forces embroiled in civil war.I'm a bit reluctant to get involved.The government was reluctant to sanction intervention in the crisis.The government is understandably reluctant to do anything which might spoil the harmonious relations between the country's ethnic groups.A mother was coaxing her reluctant child into the water.\nSMART Vocabulary: related words and phrases\nUnwilling and reluctant\narsed\nbaulk\nbe blowed if... idiom\nbe in no mood for something/to do something idiom\nbegrudge\ncompassion fatigue\ndeign\ndisinclination\ndisinclined\ndisobliging\nfag\nindisposed\nindisposition\nnot have the heart to do something idiom\nnot have the stomach for something idiom\nrather you than me idiom\nreluctance\nreluctantly\nwilly-nilly\nwouldn't\nSee more results »\nRelated word\nreluctantly\nAdd to word list\nAdd to word list\nnot wanting to do something and therefore slow to do it: [ + to infinitive ] She had trouble sleeping but was reluctant to take sleeping pills. reluctance noun [ U ] us\nYour browser doesn't support HTML5 audio\n/rɪˈlʌk·təns/\nThe poll also showed a reluctance to accept higher taxes, particularly at the local level. reluctantly adverb us\nYour browser doesn't support HTML5 audio\n/rɪˈlʌk·tənt·li/\nHe reluctantly resigned."}