{"id":307399,"name":"remake","type":"verb","us_sound":"ˌriːˈmeɪk","us_link":"../audio/r/remake_01_00.mp3","uk_sound":"ˌriːˈmeɪk","uk_link":"../audio/r/ukremak002.mp3","content":"Add to word list\nAdd to word list\nto produce something again: The skirt was too big so I had to remake it to fit. We remade the dough and froze it.\nto make a new film that has a story and title similar to an old one: The French film \"Trois Hommes et un Couffin\" was remade in Hollywood as \"Three Men and a Baby\". Remaking a classic film is a risky business.\nSMART Vocabulary: related words and phrases\nCreating and producing\nanti-creative\nartefact\nattribute\nattribute something to someone\nbang something out\nbash\ngenerative\ngenerativity\ngrind something out\nhandmade\nknock\nmint\nrig\nrig something up\nroll (something) out\nrollout\nrun something up\nrush something out\nspin\nyield\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema - general words\nremake a bed\nto pull up and tidy the covers on a bed after it has been slept in, for a second time: I took a nap this afternoon, and didn't want to bother remaking the bed so I slept on top of the covers.\nto put clean sheets and covers on a bed: You can sleep in Luke's room - then I don't have to remake a bed.\nSee more\na film that has a story and title similar to an old one: Do you prefer the remake of \"King Kong\" to the original? Here we usually see English-language remakes of foreign films.\nSMART Vocabulary: related words and phrases\nCinema - general words\n12A\nanimation\nanimator\naudio described\naudio description\nfade\nfilmic\nfilmically\nfilming\nfilmstrip\nflick\nfootage\nprojection\nRambo\nrerelease\nrescreen\nreshoot\nreshow\nsting\ntheatrical\nSee more results »\nAdd to word list\nAdd to word list\nto make something again as new: The President is slipping in the polls and he is trying to remake his image. Hollywood studios often remake foreign films remake noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈri·meɪk/\nHave you seen the remake of \"King Kong\"?"}