{"id":307385,"name":"remainder","type":"noun","us_sound":"rɪˈmeɪn.dɚ","us_link":"../audio/r/remainder.mp3","uk_sound":"rɪˈmeɪn.dər","uk_link":"../audio/r/ukrelen028.mp3","content":"remainder noun\n(PART LEFT)\nthe remainder [ S ]\nAdd to word list\nAdd to word list\nthe part of something that is left after the other parts have gone, been used, or been taken away: I ate most of it and gave the remainder to the dog. It rained the first day but the remainder of the trip was fine.\nSMART Vocabulary: related words and phrases\nThings remaining\n(and) all the rest idiom\nbalance\nbastion\nbe left phrase\ncremains\ncutpiece\ndeposit\nground\nredoubt\nrelic\nremains\nremnant\nresidual\nresidually\nrest\nthrowback\ntime capsule\nunallocated\nuneaten\nvestige\nSee more results »\nremainder noun\n(MATHEMATICS)\n[ U ]\n&#160; mathematics\n&#160; specialized in mathematics, the amount that is left when one number cannot be exactly divided by another: 9 divided by 4 is 2, remainder 1.\nSMART Vocabulary: related words and phrases\nTerms for numbers\nadditive inverse\naliquot\ncommon denominator\ncommon factor\ncommon multiple\nexponent\nfold\nfortyfold\nfourfold\nGCF\nhundredfold\nimaginary number\nodd\nreciprocal\nrecurring\nrecurring number\nresponse variable\nresultant\ntwofold\nweighting\nSee more results »\nto sell a book cheaply because it has not sold well and no more copies of it will be produced: His autobiography never sold very well and was soon remaindered.\nSMART Vocabulary: related words and phrases\nSelling\nauction\nBlack Friday\nbundle\nbundling\nchain of production\nconcession\noversell\npanic selling\npeddle\npile\npile it high and sell it cheap idiom\npoint of sale\nsell out\nsellout\nshift\nsoft sell\nsold\nspecial offer\nsting\nsupersize\nSee more results »\nAdd to word list\nAdd to word list\nthe part that is left after the other parts are gone, used, or taken away: It rained the first day but was sunny for the remainder of the trip.\nmathematics A remainder is the amount left when one number cannot be exactly divided by another.\nthe remainder (of)\nAdd to word list\nAdd to word list\nthe part of something that is not included in a total or amount, or that is left after the rest has gone: Venezuela is able to sell three-quarters of its OPEC quota as refined products, with the heavy crude oil making up most of the remainder.the remainder of sth The remainder of its business, plastic packaging, makes up 20% of group sales. Inflation could remain at 3% or above for the remainder of the year.\n[ C ]\n&#160; COMMERCE a book, CD, or DVD that is sold at a reduced price, often because it has not sold as well as expected: All our remainders have been discounted by more than 50%.\nCOMMERCE to sell a book, CD, or DVD at a reduced price, often because it has not sold as well as expected: Copies of his autobiography are now being remaindered."}