{"id":307439,"name":"remark","type":"verb","us_sound":"rɪˈmɑːrk","us_link":"../audio/r/remark.mp3","uk_sound":"rɪˈmɑːk","uk_link":"../audio/r/ukremak004.mp3","content":"Add to word list\nAdd to word list\nB2 to give a spoken statement of an opinion or thought: [ + (that) ] Dr Johnson once remarked (that) \"When a man is tired of London, he is tired of life.\" [ + that ] He remarked that she was looking thin.\nThesaurus: synonyms, antonyms, and examples\nto say somethingsayWhen I say your name, raise your hand.utterShe barely uttered a word all morning.they sayThey say the house is haunted.it is saidIt is said that a chain is only as strong as its weakest link.stateUnion members stated that they were unhappy with the proposal.remarkHe remarked that she was looking thin.\nSee more results »\nMore examplesFewer examplesThe judge remarked that ignorance was not a valid defence.Sydney Smith, a notable wit, once remarked that he never read a book before he reviewed it because it might prejudice his opinion of it.I was remarking on the recent profusion of books and articles on the matter.I was just remarking on how well you two normally get on with each other.She remarked that the award was more than she was expecting.\nSMART Vocabulary: related words and phrases\nExpressing and asking opinions\namirite\napothegm\ncouch\nday\neditorialize\nexpress\nfar\nmind\nput something across\nput something over/across\nput your head over/above the parapet idiom\nre-poll\nrun something by someone\nsound\nstatement\nultracrepidarian\nventilate\nventilation\nvocalize\nvociferous\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRemarks & remarking\nPhrasal verb\nremark on something\nB2 something that you say, giving your opinion about something or stating a fact: Her remarks on the employment question led to a heated discussion. The children made rude remarks about the old man. Synonyms\ncomment\ndeclaration (ANNOUNCEMENT)\nobservation (NOTICING) formal\nstatement\nutterance formal or specialized\nThesaurus: synonyms, antonyms, and examples\nsomething you say or write that expresses an opinioncommentThe MP could not be reached for comment.remarkHis controversial remarks about race were widely reported.statementIn a statement released earlier today, the team denied allegations of cheating.declarationThe sovereign made a formal declaration of war. observationShe makes some interesting observations about human nature in her book. commentaryI love that sports announcer's commentary - it's always so funny!\nSee more results »\nMore examplesFewer examplesHe made some derogatory remark about her appearance.It was an innocent remark, I didn't mean to hurt his feelings.I don't think she intended me to hear the remark.Unkind remarks are one of his specialities.He addressed a few introductory remarks to the audience.\nSMART Vocabulary: related words and phrases\nRemarks & remarking\nair\nannotate\nannotation\nannotator\nbackbite\nbackbiting\nbarb\ncommentary\ndog whistle\nfelicity\ninnuendo\nlast word\nline\nmalediction\nmention\nmot juste\nplatitude\nprofundity\nsideswipe\nthrowaway\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExpressing and asking opinions\nAdd to word list\nAdd to word list\nto give a spoken statement of an opinion or thought: [ + (that) clause ] She remarked (that) she’d be home late.\nIf you remark on something, you notice it and say something about it: [ I ] All his friends remarked on the change in him. remark noun [ C ] us\nYour browser doesn't support HTML5 audio\n/rɪˈmɑrk/\nI think if you read his remarks, you’ll find them very fair."}