{"id":307499,"name":"remedy","type":"noun","us_sound":"ˈrem.ə.di","us_link":"../audio/r/remedy.mp3","uk_sound":"ˈrem.ə.di","uk_link":"../audio/r/ukremak007.mp3","content":"Add to word list\nAdd to word list\nB2 a successful way of curing an illness or dealing with a problem or difficulty: an effective herbal remedy for headaches The best remedy for grief is hard work. legal remedy law\n&#160; specialized\na way of solving a problem or ordering someone to make a payment for harm or damage they have caused, using a decision made in a law court: legal remedy for We have exhausted all possible legal remedies for this injustice.\nSee more\nMore examplesFewer examplesYou can buy most cold remedies over the counter.homeopathic remediesThere is a whole panoply of remedies and drugs available to the modern doctor.Do you know of any remedies for sinus problems?Love is a great remedy for unhappiness.\nSMART Vocabulary: related words and phrases\nMedicine in different forms\nblister pack\nbolus\nCaplet\nchemotherapy\ndosage\ndose\nelixir\nenema\ninjectable\ninjection\njab\njag\nknockout drops\nmedication\nmixture\npatent medicine\npharmaceutical\nphial\nprescription\nwonder drug\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSolving and solutions\nto do something to correct or improve something that is wrong: This mistake must be remedied immediately. Synonym\nremediate formal\nSMART Vocabulary: related words and phrases\nCorrecting and mending\ncalibration\nclean (someone/something) up\ncorrection\nfiddle\nfiddle (around) with something\nfine-tune\nmess\nrecondition\nreconstruct\nreconstruction\nrectifiable\nrectification\nrevise\nscratch\nservicing\nset/put the record straight idiom\nsmooth something away\nsmoothen\nsort\ntinker\nSee more results »\nAdd to word list\nAdd to word list\na substance or method for curing an illness, or a way of dealing with a problem or difficulty: cold remedies remedy verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈrem·əd·i/\nWe’re working to remedy these shortcomings.\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; LAW a method of legally solving a problem or disagreement: The company is asking for the commission's remedies to be suspended while the appeal is underway.provide/seek/obtain (a) remedy The court has the power to provide a remedy by way of judicial review. See also\nlegal remedy\n[ C ] a way of dealing with a difficult situation or solving a problem: Fiscal, not monetary, policy should be the preferred remedy.remedy for sth Senators have proposed hugely different remedies for the growing healthcare crisis."}