{"id":307645,"name":"remit","type":"verb","us_sound":"rɪˈmɪt","us_link":"../audio/r/eus73925.mp3","uk_sound":"rɪˈmɪt","uk_link":"../audio/r/ukremak020.mp3","content":"remit verb [T]\n(REDUCE)\nAdd to word list\nAdd to word list\nlaw\n&#160; UK specialized to reduce a period of time that someone must spend in prison: She has had part of her sentence remitted. His prison sentence was remitted to two years.\nSMART Vocabulary: related words and phrases\nNot punishing & reducing punishment\nabsolve\namnesty\nclemency\ncommutation\ndiplomatic immunity\ndischarge\ndiversion\nget away with murder idiom\nget off\nget off lightly phrase\nhook\nimpunity\nlet someone off\noff the hook idiom\nprivilege\nroyal pardon\nscot-free\nspare\nunpunished\nunsanctioned\nSee more results »\nremit verb [T]\n(SEND)\nformal to send money to someone: He worked as a builder in Chicago and remitted half his monthly wage to his family in the Philippines.\nformal to refer a matter to someone in authority to deal with: She remitted the case to a new tribunal for reconsideration.\nSMART Vocabulary: related words and phrases\nDelivering and despatching\nair bridge\nair corridor\nair drop\nair-dash\nbox scheme\nconsign\ncourier\ndrop off\nmisaddress\nmisdirect\nmisdirection\nmisroute\nnon-delivery\nship\nshipment\nshipper\nshoot\nshoot something off\nteleport\ntruck\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOffice practices\nthe area that a person or group of people in authority has responsibility for or control over: The remit of this official inquiry is to investigate the reasons for the accident.\nSMART Vocabulary: related words and phrases\nDuty, obligation and responsibility\naccountable\naccountable to someone\naccountably\nanswer for something\nbear\nbrother\nfail\nfall to someone\nfiefdom\ngotta\nhad better/best do something idiom\nhat\nought to\nowe someone a living idiom\npass the buck idiom\npay your dues idiom\nportfolio\nsomeone's answer to someone/something idiom\nstick\nthe onus\nSee more results »\nAdd to word list\nAdd to word list\nto send money to someone: Please remit payment by the 15th of the month.\nAdd to word list\nAdd to word list\nthe types of activity that a person or organization has responsibility for: The Treasury's remit has never been more wide-ranging than it is now. As independent broadcasters, it is part of our remit to cater for minority audiences and promote diversity. Her appointment to the board comes with a remit to focus on its corporate social responsibility. a narrow/wide remithave a/no remit to do sth The Commission had the remit to consider how small companies could compete in the public-sector market.be/fall outside sb's remit Where a case falls outside the ombudsman's remit, the aggrieved customer has no alternative but to take the company involved to court.be/fall within/under sb's remit Many such cases will fall within the remit of the small claims court. His remit includes strategy development, and pricing and packaging issues, as well as regulatory affairs.\nFINANCE to send money to someone, especially as a payment for something: remit sth to sb/sth The British parent company of a multinational group may need to remit profits from its foreign subsidiaries to Britain, so that it has enough money to pay its own dividends.remit taxes/proceeds/funds Legislation requires businesses to collect and remit sales tax on a six-monthly basis.\nLAW to order a legal case to be dealt with in a different court of law: be remitted to the court/tribunal The case will be remitted to the tribunal for reconsideration.\nLAW to state legally that someone does not have to do something, for example pay a debt: The fine was calculated at £3,500 but was subsequently remitted."}