{"id":307762,"name":"remoteness","type":"noun","us_sound":"rɪˈmoʊt.nəs","us_link":"../audio/r/usremin008.mp3","uk_sound":"rɪˈməʊt.nəs","uk_link":"../audio/r/ukremor004.mp3","content":"remoteness noun [U]\n(DISTANCE)\nAdd to word list\nAdd to word list\nthe fact of being far away in distance: Space enthusiasts will marvel at the beauty and remoteness of Pluto. The advantages of equatorial sea launches include remoteness from populated areas.\nthe fact of being far from any towns or cities: Getting medicine to them is difficult due to the remoteness of the villages affected by the quake. The area is not likely to attract too many visitors because of its remoteness.\nthe fact of being far away in time: The past perfect tense emphasizes the remoteness of the action from the present moment.\nMore examplesFewer examplesThanks to its physical remoteness, Jefferson felt the US was safe from Napoleon's cannons and muskets.Washington County's remoteness has traditionally been an obstacle to economic development.She appreciates her posting in Antarctica. She likes the remoteness.It depends on the nearness or remoteness of those instants of time which we compare.\nSMART Vocabulary: related words and phrases\nDistant in space and time\n(in) the middle of nowhere idiom\nafar\nafield\nall/the four corners of the world/earth idiom\nanywhere\nas far as the eye can/could see idiom\neye\nfar\nfarthest\nfrom afar\nfurther\nfurthermost\nlight years away idiom\nmiddle\nremote\nremotely\nultra\nultra-distant\nvirtually\nwide\nSee more results »\nremoteness noun [U]\n(DIFFERENCE)\nthe fact of not being closely related to something: Charlotte felt a numb remoteness from the wider world. The popular association with modern art is its remoteness from the symbols and values of the majority of people.\nMore examplesFewer examplesHe criticized the party for what he saw as its remoteness from ordinary people's concerns, condescension, and sense of entitlement.The general theory of relativity was a field that had been moribund because of its remoteness from laboratory experiment.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanother\nanything\ndisparity\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\nnon-comparability\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nvariant\nSee more results »\nremoteness noun [U]\n(BEHAVIOUR)\nbehaviour that is not very friendly and shows little interest in other people: Fame and success only heightened his angry remoteness. Liv's remoteness and Will's absorption in his work combine to put a strain on their marriage.\nMore examplesFewer examplesShe greeted them with cool remoteness.He lived in a hilltop Italianate mansion with a half-mile-long driveway that seems to symbolise his remoteness.\nSMART Vocabulary: related words and phrases\nNot being friendly\nabrasive\nabrasively\nabrasiveness\nabruptly\nabruptness\naloof\nantagonistic\nestranged\nestrangement\nflintily\nforbidding\nforbiddingly\nfrigid\ngruff\nremote\nreserved\nreservedly\nself-contained\nself-containment\nwintry\nSee more results »\nSee\nremote"}