{"id":307778,"name":"removal","type":"noun","us_sound":"rɪˈmuː.vəl","us_link":"../audio/r/removal.mp3","uk_sound":"rɪˈmuː.vəl","uk_link":"../audio/r/ukremor007.mp3","content":"removal noun [U]\n(TAKING AWAY)\nAdd to word list\nAdd to word list\nthe act of taking something or someone away from somewhere or something: stain removal furniture removal removals [ plural ] UK\nthe business of transporting furniture and other possessions when people move to a new home: Does your firm do removals?\nSee more\nMore examplesFewer examplesThe kidney plays a vital role in the removal of waste products from the blood.The company charged him for the removal of the vehicle.He was ordered to assist in the removal of the graffiti.The company specializes in the removal of pianos.The product offers unbeatable stain removal.\nSMART Vocabulary: related words and phrases\nTaking things away from someone or somewhere\nappropriate\nbear away\nconfiscate\nconfiscation\ncream something/someone off\ndebug\ndrain\nexpropriate\nexpropriation\nextract\nextractive\nget off\nimpound\nrout someone out\nseize\nshelf\nstripping\nsuck\nsuck someone/something dry idiom\nsweep\nSee more results »\nremoval noun [U]\n(ENDING JOB)\nformal the act of forcing someone to leave an important position or job: There have been calls for the president's removal.\nSMART Vocabulary: related words and phrases\nFiring staff\narse\naxe\nbe out on your ear idiom\ncast someone adrift idiom\nchop\nconstructive dismissal\ndecertification\nfiring\nget the push idiom\ngive someone the heave-ho idiom\nheave-ho\ninvalid someone out\nrefire\nrelieve\nrelieve someone of something\nremove\nrightsize\nrightsizing\nterminate\ntermination\nSee more results »\nAdd to word list\nAdd to word list\n[ C or U ] the process of removing or getting rid of something, often something that is considered to be harmful: the removal of sth The removal of duties and taxes on trade within the EU has created an environment in which competition can flourish. Government advisers have requested the drug's removal from the market for safety reasons. toxic waste removal\n[ C or U ]\n&#160; HR, WORKPLACE the process of forcing someone to leave their job or position: A special meeting was called to discuss the removal of the chairman. She faced removal from office almost two years into her four-year term.\n[ C or U ]\n&#160; PROPERTY\n&#160; UK the process of moving furniture, equipment, and other possessions from one office, home, etc. to another: a removal company/firm removal costs/expenses\nremovals UK\nPROPERTY the business of moving furniture, equipment, and other possessions from one office, home, etc. to another: a removals company/firm"}