{"id":307790,"name":"removing","type":"verb","us_sound":"rɪˈmuːv","us_link":"../audio/r/remove.mp3","uk_sound":"rɪˈmuːv","uk_link":"../audio/r/ukremor010.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nremove\nremove verb [T]\n(TAKE AWAY)\nB1 to take something or someone away from somewhere, or off something: The men came to remove the rubbish from the backyard. This detergent will remove even old stains. It got so hot that he removed his tie and jacket. They decided to remove their son from the school.\nThesaurus: synonyms, antonyms, and examples\nto take something somewheretakeAre you allowed to take your phone to school?bringCould someone bring me a cup of coffee?takeSomeone's taken my pen.removeCan someone please remove this ugly plant?take awayWhen you've finished your meal, the waiter takes the plates away.take outShe opened her bag and took out a small notebook.\nSee more results »\nto make a negative feeling disappear: Hearing your opinion has removed my last doubts/suspicions about her.\nMore examplesFewer examplesThe water is filtered to remove any impurities.You can remove a red wine stain from a carpet by sprinkling salt over it.The plaster on the walls has been removed to expose the original bricks underneath.The protestors had to be physically removed from the room.You can immobilize the car by removing the spark plugs.\nSMART Vocabulary: related words and phrases\nTaking things away from someone or somewhere\nappropriate\nbear away\nconfiscate\nconfiscation\ncream something/someone off\ndebug\ndrain\nexpropriate\nexpropriation\nextractive\nget off\nimpound\nrelieve\nroot something/someone out\nrout someone out\nseize\nshelf\nstripping\nsuck\nsweep\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRemoving and extracting\nForgetting and forgetfulness\nremove verb [T]\n(END JOB)\nC2 formal to force someone to leave an important job or a position of power because they have behaved badly or not in a way you approve of: The company's shareholders have voted to remove the executive board. Several opposition groups are fighting to remove the president from power. She has been removed from her post/position as director.\nSMART Vocabulary: related words and phrases\nFiring staff\naxe\nbe out on your ear idiom\ncast someone adrift idiom\nchop\nconstructive dismissal\ndecertification\nget the push idiom\ngive someone the heave-ho idiom\nheave-ho\ninvalid someone out\nlay someone off\npension\nrelieve\nremoval\nremove\nretire\nrightsize\nrightsizing\nsack\ntermination\nSee more results »\nIdiom\nbe far removed from something"}