{"id":307781,"name":"remove","type":"verb","us_sound":"rɪˈmuːv","us_link":"../audio/r/remove.mp3","uk_sound":"rɪˈmuːv","uk_link":"../audio/r/ukremor010.mp3","content":"remove verb [T]\n(TAKE AWAY)\nAdd to word list\nAdd to word list\nB1 to take something or someone away from somewhere, or off something: The men came to remove the rubbish from the backyard. This detergent will remove even old stains. It got so hot that he removed his tie and jacket. They decided to remove their son from the school.\nThesaurus: synonyms, antonyms, and examples\nto take something somewheretakeAre you allowed to take your phone to school?bringCould someone bring me a cup of coffee?takeSomeone's taken my pen.removeCan someone please remove this ugly plant?take awayWhen you've finished your meal, the waiter takes the plates away.take outShe opened her bag and took out a small notebook.\nSee more results »\nto make a negative feeling disappear: Hearing your opinion has removed my last doubts/suspicions about her.\nMore examplesFewer examplesThe water is filtered to remove any impurities.You can remove a red wine stain from a carpet by sprinkling salt over it.The plaster on the walls has been removed to expose the original bricks underneath.The protestors had to be physically removed from the room.You can immobilize the car by removing the spark plugs.\nSMART Vocabulary: related words and phrases\nTaking things away from someone or somewhere\nappropriate\nbear away\nconfiscate\nconfiscation\ncream something/someone off\ndebug\ndrain\nexpropriate\nexpropriation\nextract\nextractive\nget off\nimpound\nrout someone out\nseize\nshelf\nstripping\nsuck\nsuck someone/something dry idiom\nsweep\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRemoving and extracting\nForgetting and forgetfulness\nremove verb [T]\n(END JOB)\nC2 formal to force someone to leave an important job or a position of power because they have behaved badly or not in a way you approve of: The company's shareholders have voted to remove the executive board. Several opposition groups are fighting to remove the president from power. She has been removed from her post/position as director.\nSMART Vocabulary: related words and phrases\nFiring staff\narse\naxe\nbe out on your ear idiom\ncast someone adrift idiom\nchop\nconstructive dismissal\ndecertification\nfiring\nget the push idiom\ngive someone the heave-ho idiom\nheave-ho\ninvalid someone out\nrefire\nrelieve\nrelieve someone of something\nremoval\nrightsize\nrightsizing\nterminate\ntermination\nSee more results »\nIdiom\nbe far removed from something\nAdd to word list\nAdd to word list\nto take something away from an object, group, or place: Please remove your books from the counter. Club soda will remove that stain. He was removed from office (= forced to leave an official position). Space flight is pretty far removed from (= not part of) most people’s experience. removal noun [ U ] us\nYour browser doesn't support HTML5 audio\n/rɪˈmu·vəl/\nHe ordered the immediate removal of the troops. remover noun [ U ] us\nYour browser doesn't support HTML5 audio\n/riˈmu·vər/\npaint remover\nAdd to word list\nAdd to word list\nto take something or someone away from somewhere or off something: remove sth/sb from sth He asked the company to remove him from their database. The store removed all canned food from the shelves as soon as they heard about the recall.remove barriers/obstacles/restrictions The government failed to remove legal obstacles to the transfer of ownership of assets.\nto take away or stop a charge or a cost: Surcharges on fruit and vegetables will be removed by the end of the year. This measure removes a layer of cost which could bring down prices. The commodity market price plunged late on Friday after Brazil removed export taxes.\nHR, WORKPLACE to force someone to leave an important job or a position of power, usually because they have behaved badly, or in a way that you do not approve of: They initiated the procedure for him to be removed from office. The City Controller was removed after a failure to list sources of income including rental properties. Directors are appointed and removed by shareholders."}