{"id":307755,"name":"remortgage","type":"verb","us_sound":"ˌriːˈmɔːr.ɡɪdʒ","us_link":"../audio/r/eus73930.mp3","uk_sound":"ˌriːˈmɔː.ɡɪdʒ","uk_link":"../audio/r/ukremor001.mp3","content":"Add to word list\nAdd to word list\nto change the conditions of a mortgage (= agreement by which you borrow money to buy property), usually by increasing the amount you borrow: Many borrowers remortgage every three or five years to take advantage of cheap fixed rates. Robin decided to remortgage his house to pay off his debts.\nMore examplesFewer examplesHe advised me to remortgage with a lender with a lower standard rate.She remortgaged her £123,000 one-bed flat over the summer and had it valued at £126,000. It is never a good idea to remortgage your house to pay off other creditors.\nSMART Vocabulary: related words and phrases\nMortgages & real estate\nblockbusting\nbrick\nbricks and mortar idiom\nBTL\nbuy-to-let\nchain\nequity\nfirst-time buyer\nlandlady\nletting\nmortgagee\nplanning blight\nreal estate broker\nreal estate office\nRealtor\nrealty\nrealty office\nrefinance\nrepo\nrepossession\nSee more results »\na mortgage (= an agreement by which you borrow money to buy property) that has different conditions to a previous one, usually by being for a larger amount: The building society will arrange a remortgage for a fee of £100.\nMore examplesFewer examplesMake sure you arrange the remortgage before leaving your job because you will have difficulty once you become self-employed.Some borrowers could have got a remortgage deal elsewhere.Twenty per cent of remortgage applications were to release equity to buy a second home.\nSMART Vocabulary: related words and phrases\nMortgages & real estate\nblockbusting\nbrick\nbricks and mortar idiom\nBTL\nbuy-to-let\nchain\nequity\nfirst-time buyer\nlandlady\nletting\nmortgagee\nplanning blight\nreal estate broker\nreal estate office\nRealtor\nrealty\nrealty office\nrefinance\nrepo\nrepossession\nSee more results »\nAdd to word list\nAdd to word list\nto replace a mortgage that you already have with a new mortgage, for example one with lower interest rates: Fears that interest rates might increase before the end of the year spurred homeowners to remortgage.remortgage your home/house/property They remortgaged the family home in order to finance the business.\na financial arrangement in which someone replaces a mortgage that they already have with a new mortgage, for example one with lower interest rates: 340,000 loans and remortgages were granted to buy-to-let landlords in 2007. Our deal offers free valuation and free legal work on remortgages. remortgage deals/packages/schemes"}