{"id":307862,"name":"render","type":"verb","us_sound":"ˈren.dɚ","us_link":"../audio/r/render.mp3","uk_sound":"ˈren.dər","uk_link":"../audio/r/ukremor020.mp3","content":"render verb [T]\n(CAUSE)\nAdd to word list\nAdd to word list\nC2 formal to cause someone or something to be in a particular state: [ + adj ] His rudeness rendered me speechless. New technology has rendered my old computer obsolete.\nformal to change words into a different language or form: She is rendering the book into English from French.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nseed\nspark\nspell\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUsing other languages\nrender verb [T]\n(GIVE)\nC1 formal to give something such as a service, a personal opinion or expression, or a performance of a song or poem, etc. to people: The singers rendered the song with enthusiasm. We see that freight railroads make good profits while rendering excellent service.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nspare\nSee more results »\nrender verb [T]\n(BUILDING)\narchitecture\n&#160; specialized to put a first layer of plaster or cement on a wall\nSMART Vocabulary: related words and phrases\nBuilding: plastering\nfiller\nmortar\nplaster\nplasterboard\nplasterer\nplastering\nreplaster\nroughcast\nSheetrock\nstucco\nstuccoed\nwallboard\nYou can also find related words, phrases, and synonyms in the topics:\nCovering and adding layers\nPhrasal verb\nrender something down\nrender verb [T]\n(CAUSE)\nAdd to word list\nAdd to word list\nto cause someone or something to be in a particular state: New technology renders a computer obsolete in a year.\nrender verb [T]\n(REPRESENT)\nto represent something in a work of art or a performance: The drawing was rendered in muted pastels.\nrender verb [T]\n(GIVE)\nfml to give something to someone: An employee is someone who renders his or her services in exchange for pay.\nAdd to word list\nAdd to word list\nto cause something or someone to be in a particular state: Regulation should be shifted from the sales process to the products themselves, effectively rendering financial advisors surplus to requirements. Billions have been spent, but not one gallon of the estimated 54m gallons of waste has been rendered harmless.\nformal to provide or give something such as help or a service to people: render aid/assistance/help They liaise between companies that want to buy insurance and the insurers that sell it, taking a commission for services rendered.\nACCOUNTING, FINANCE, TAX to officially prepare financial records, bills, etc. and give them to someone or make them available: The company had failed to render accounts to its shareholders two years in a row. We shall render invoices to you monthly in respect of work done by the firm. Thousands evade tax by not rendering returns.\nto officially announce a decision or judgment about something: render a decision/verdict The Council is expected to render a decision soon.render judgment The court's duty is to hear a matter and render judgment or direction.\nIT to make an image on a computer screen appear solid and like a real object: The software greatly accelerates the production of high-quality rendered images of products."}