{"id":307930,"name":"renewal","type":"noun","us_sound":"rɪˈnuː.əl","us_link":"../audio/r/renewal.mp3","uk_sound":"rɪˈnjuː.əl","uk_link":"../audio/r/ukremor028.mp3","content":"renewal noun\n(CONTINUE)\nAdd to word list\nAdd to word list\n[ C or U ] the act of making an official document, agreement, or rule continue for more time: Do you deal with season-ticket renewals here?\nMore examplesFewer examples144 employees were laid off and 189 employees did not receive contract renewals. They are facing higher rates, less coverage and more hassles when policies come up for renewal. The state is seeking the renewal of a tax levy that generates $65.2 million annually for schools.To renew your licence or for more information about the online renewal process, visit our website.\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\nmake up for something\nname\nnovate\npart exchange\npinch-hit\nrefresh\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitution\nsubstitutive\nsucceed\nsuccession\nsupersede\nSee more results »\nrenewal noun\n(START AGAIN)\n[ U ] the act of starting again or starting to do something again: They fear the renewal of hostilities if an agreement is not reached soon.\nMore examplesFewer examples His central thesis is that the trauma of war and its aftermath amounted to a renewal of the revolution.The talks are intended to pave the way to a renewal of peace negotiations. It gave him the go-ahead for a renewal of their earlier pursuits.\nSMART Vocabulary: related words and phrases\nStarting again\nback to square one idiom\ncontinue\nget back to someone\ngo back to someone\ngo on\nre-entrant\nreboot\nreborn\nrecommence\nrecommencement\nrecreation\nreinitiate\nreoccur\nreoccurrence\nreopen\nreset\nrestart\nslate\nstart\nwith the slate wiped clean idiom\nSee more results »\nrenewal noun\n(IMPROVEMENT)\n[ U ] a process in which something improves or is improved after being in a bad condition : urban renewal projects See\nrenew\nMore examplesFewer examplesA newly formed organization is spearheading the area's renewal.This area is charred by last year's wildfires but wildflowers already in bloom offer proof of the forest's speedy renewal.Look around the country and you'll see signs of renewal. They see in Cleveland a model for renewal they could take to other cities.\nSMART Vocabulary: related words and phrases\nPreserving and saving\naspic\nco-processing\nconserve\ndeliverer\ndocumentalist\ndocumentarily\nreclaim\nrecycle\nrecycled\nreprieve\nrescue\nrescuer\nreusable\nrewild\nsustain\nunappropriated\nunassigned\nundesignated\nupcycle\nupcycling\nSee more results »\nAdd to word list\nAdd to word list\nthe act of making an agreement continue for an extra period of time after it has come to an end: contract/licence renewals The purchases are subject to annual renewal.be due for renewal If your car tax is due for renewal, do it before Budget day.\nthe act or process of making changes to something in order to improve it so that it becomes more successful: economic renewal\na situation in which something begins again after having stopped for a period of time: Pharmaceutical shares also benefited from the renewal of interest in growth stocks.\nbe/come up for renewal\nif an agreement is up for renewal, it will soon end, and an arrangement needs to be made if you want to continue it for an extra period of time: 30% of retailers were thinking of pulling out when contracts come up for renewal. See also\ncorporate renewal\nurban renewal"}