{"id":308054,"name":"rent","type":"noun","us_sound":"rent","us_link":"../audio/r/rent.mp3","uk_sound":"rent","uk_link":"../audio/r/ukrenni007.mp3","content":"rent noun\n(PAYMENT)\nAdd to word list\nAdd to word list\nA2 [ C or U ] a fixed amount of money that you pay regularly for the use of a room, house, car, television, etc. that someone else owns: I pay a higher rent/more rent than the other tenants because my room is bigger. Rents here are ridiculously high/low. for rent\noffered by the owner for someone else to use in exchange for money: We have three fully refurbished bungalows for rent.\nSee more\nMore examplesFewer examplesThe rent is due at the end of the month.Tenants who fall behind in their rent risk being evicted.We're really struggling to find enough money to pay the rent at the moment.My rent is $800 a month inclusive of bills.She withheld her rent until the landlord agreed to have the repairs done.\nSMART Vocabulary: related words and phrases\nRenting property\nabsentee landlord\nBTL\nco-tenant\nfiefdom\nflatshare\nkey money\nlease\nleasehold\nlessee\nletting\nlodge\nlodger\npeppercorn rent\nrent strike\nrenter\nsitting tenant\nsubtenant\ntenancy\ntenanted\nuntenanted\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRenting & hiring\nrent noun\n(HOLE)\n[ C ] formal a large hole torn in a piece of material: There was a large rent in his parachute.\nSMART Vocabulary: related words and phrases\nHoles, hollows and dips\nanti-crack\naperture\nblistered\nchink\ncranny\ncratering\ngouge\nhatch\nhollow\nimpression\nimprint\ninterstice\nladder\nleak\nleaky\nnook\npinprick\nshaft\nspyhole\nvoid\nSee more results »\nrent verb\n(PAY TO USE)\nA2 [ T ] to pay or receive a fixed amount of money for the use of a room, house, car, television, etc.: I rented a car from a garage so that I could get about. [ + two objects ] The old lady rented me her spare bedroom for £200 a week. My Dad has a villa that he rents (out) to tourists. Compare\nhire\nMore examplesFewer examplesPersonnel will help you find a flat to rent.She rented a room above a shop.We're renting a cottage in Wales for the summer.We scoped out the local shops and facilities to see if it would be a good place to rent a flat.The landlord rents the flat out through a letting agency.\nSMART Vocabulary: related words and phrases\nRenting property\nabsentee landlord\nBTL\nco-tenant\nfiefdom\nflatshare\nkey money\nlease\nleasehold\nlessee\nletting\nlodge\nlodger\npeppercorn rent\nrent strike\nrenter\nsitting tenant\nsubtenant\ntenancy\ntenanted\nuntenanted\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRenting & hiring\nrent verb\n(TORN)\npast simple and past participle of\nrend old use or literary\nSMART Vocabulary: related words and phrases\nTearing and breaking into pieces\napart\nasunder\nbobble\nbobbly\nbreak into pieces\nchip\ncrack\ndismantle\nfall apart\nfall to pieces idiom\nfragment\nfragmentation\nfragmented\nrip\nsnag\nsplinter\nsplit\nsunder\ntear something apart\ntear something up\nSee more results »\nrent noun [C/U]\n(PAYMENT)\nAdd to word list\nAdd to word list\na fixed amount of money paid or received regularly for the use of usually an apartment, house, or business space: [ C ] Rents in this building are ridiculously high. [ U ] How much rent do you pay? [ U ] Are there any apartments for rent (= available) there? rent verb [ T ] us\nYour browser doesn't support HTML5 audio\n/rent/\nI rented a car for the trip to Boston.\nrent\n(TORN)\npast simple and past participle of rend\nAdd to word list\nAdd to word list\nPROPERTY, COMMERCE an amount of money that you pay for the use of something, especially that you pay regularly for the use of a room, house, office, etc. that someone else owns: a fair/high/low rent annual/monthly rent commercial/office rentspay (the) rent The company is renegotiating its finances after struggling to pay the rent on its properties.charge/collect rent Managing the property generally means collecting rent and carrying out maintenance.\nCOMMERCE\n&#160; US →\nrental noun : You will pay no line rent on this phone deal.\nfor rent\noffered by the owner for someone else to use in exchange for money: The restaurant was open 24 hours a day and also had rooms for rent.\nSee also\nground rent\nnet rent\npeppercorn rent\nrack rent\n[ I or T ]\n&#160; PROPERTY to pay a fixed amount of money regularly for the use of a room, house, office, etc.: Researchers said there was a growing divide between the home-owning majority and people who rent. Regardless of the boom in UK property prices, it is still cheaper to buy rather than rent a house.rent sth from sb She has been renting an apartment from a private landlord through a letting agent. A surprising number of storage units are rented by salesmen.\n[ T ]\n&#160; PROPERTY\n&#160; (also rent sth out) to receive an amount of money from somebody for the use of something, especially a room, house, office, etc. that you own: rent sth to sb She runs a commercial real estate company that rents office space to businesses.rent sth for sth She rents out one of her rooms to students. He renovated the three-storey building and rents it out as apartments. Each of these centres rents out farm machinery to local farmers at low cost.\n[ T ]\n&#160; COMMERCE\n&#160; ( UK usually hire) to pay to use something for a short period of time: rent a car/an automobile I rented a car at Millennium Park and headed off to explore the island.\n[ I ]\n&#160; PROPERTY\n&#160; US to be available for someone to use for a particular amount of money: rent at/for sth The rooms rented at a premium of $25 to $35 over regular rates.rent for sth Rooms that regularly rent for $59 a night suddenly cost $300 a night."}