{"id":308058,"name":"rental","type":"noun","us_sound":"ˈren.t̬əl","us_link":"../audio/r/eus73935.mp3","uk_sound":"ˈren.təl","uk_link":"../audio/r/ukrenni008.mp3","content":"Add to word list\nAdd to word list\n[ C or U ] an arrangement to rent something, or the amount of money that you pay to rent something: Property rental is quite expensive here. DVD rentals have decreased this year. a car rental company\n[ C ] mainlyUS something such as a house, car, or bike that you rent: Because larger rentals are the hardest to find, tenants snap them up quickly. Is that your car or is it a rental?\nSMART Vocabulary: related words and phrases\nRenting property\nabsentee landlord\nBTL\nco-tenant\nfiefdom\nflatshare\nkey money\nlease\nleasehold\nlessee\nletting\nlodge\nlodger\npeppercorn rent\nrent strike\nrenter\nsitting tenant\nsubtenant\ntenancy\ntenanted\nuntenanted\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRenting & hiring\nAdd to word list\nAdd to word list\nthe act of renting, an amount paid in rent, or something rented: [ U ] boat/car rental\nAdd to word list\nAdd to word list\n[ C or U ] an arrangement to rent something for a period of time, or the act of renting something: equipment rental a car rental business/company/firm The company has recently seen a decline in DVD rentals. The regulation applies to contracts for the sale or rental of goods or services.\n[ C or U ] ( US also rent) the amount of money that you pay to rent something for a period of time: an annual/monthly/weekly rental of ... Office rentals start at about $800 dollars per month for one room. Although the price of calls has fallen, telephone line rentals continue to increase.\n[ C ] US something such as a house or a car that you can rent: The car turned out to be a rental from DFW Airport. A number of properties are available as short-term rentals.\nSee also\nfleet -rental\nrelating to rent, to renting something, or to something that has been rented: the rental market a rental agreement They also own a commercial property that provides rental income. a rental car"}