{"id":308157,"name":"reopen","type":"verb","us_sound":"ˌriːˈoʊ.pən","us_link":"../audio/r/usb01270.mp3","uk_sound":"ˌriːˈəʊ.pən","uk_link":"../audio/r/ukb01270.mp3","content":"Add to word list\nAdd to word list\nIf a place or business, etc. reopens or is reopened, it begins to operate, or it becomes open for people to use, after being closed for a period of time: The museum has reopened after nearly two years of reconstruction. He hung a sign on the door of the shop which said it would reopen at 11.00.\nIf a formal process or activity reopens or is reopened, it begins again or starts to be dealt with again after a period of time: to reopen an enquiry/investigation to reopen a debate/discussion to reopen a legal case/file\nSMART Vocabulary: related words and phrases\nUnfastening and opening\nbreak something open\nbreaker\nbroach\ngape\nlet/set something loose idiom\nloose\nloosen\ntease\ntease something out\nthe earth/ground/floor opens idiom\nunbolted\nunbuckle\nunbutton\nunfold\nunlace\nunlock\nunpick\nunplug\nunroll\nunzip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStarting again\nAdd to word list\nAdd to word list\nto open something again after it has been closed for a period of time: [ I ] Restaurant and hotel owners were wondering when they could reopen. [ T ] He said he would reopen the road during morning and evening rush hours.\nIf a process or discussion reopens, it begins again after it has stopped for a period of time: [ T ] This may present an opportunity to reopen peace talks.\nAdd to word list\nAdd to word list\n[ I or T ]\n&#160; COMMERCE, WORKPLACE if a place or a business reopens or is reopened, it begins to operate, or it becomes open for people to use, after being closed for a period of time: Strikers will return to their jobs Friday, allowing the company to reopen all of the plants. We need to analyse investment prospects in light of how stock prices have behaved since the markets reopened. The store closed for renovations last autumn, and is due to reopen in the summer.\n[ I or T ] to begin or to begin something again, after a period of time: reopen discussions/negotiations/talks The two companies have reopened talks about a possible merger or alliance.debate/discussions reopen Debate has reopened over the 35-hour week. Shares in the company, suspended at 6.5p, could reopen at a premium this week.\n[ I or T ]\n&#160; LAW if a formal process or a legal case reopens or is reopened, it begins again because new facts have appeared and the decision made originally may not have been correct: reopen a case/inquiry/investigation The case was reopened in 2010 after new evidence came to light.\n[ T ]\n&#160; FINANCE to offer an additional amount on an existing bond, etc., at the same interest rate and with the same maturity date (= date on which it becomes ready to be paid): Kenya plans to reopen its 25-year bond this month and aims to raise as much as 15 billion shillings. reopening noun [ S or U ]\nthe grand reopening of the Royal Opera House the reopening of contract negotiations"}