{"id":308278,"name":"repair","type":"verb","us_sound":"rɪˈper","us_link":"../audio/r/repair.mp3","uk_sound":"rɪˈpeər","uk_link":"../audio/r/ukrenni014.mp3","content":"Add to word list\nAdd to word list\nA2 to put something that is damaged, broken, or not working correctly, back into good condition or make it work again: to repair (the surface of) the road to repair a roof after a storm The garage said the car was so old it wasn't worth repairing. I really must get my bike repaired this weekend.\nThesaurus: synonyms, antonyms, and examples\nto repair somethingrepairHe asked if she could repair the broken lamp.fixI must get my bike fixed.mendCan you mend that hole in my trousers?do upNick loves doing up old cars.serviceI'm taking the car to the garage to have it serviced this afternoon.patch upI patched up the old bike and got it working.\nSee more results »\nC2 If you repair something wrong or harmful that has been done, you do something to make it right: to repair a broken friendship Is it too late to repair the damage we have done to our planet?\nMore examplesFewer examplesIt'll cost almost as much to repair it as it would to buy a new one.You should disconnect the power before attempting to repair electrical equipment.Your shoes will be repaired and ready for you to collect on Thursday.The drugs stimulate the damaged tissue into repairing itself.The car was damaged to such an extent that it couldn't be repaired.\nSMART Vocabulary: related words and phrases\nCorrecting and mending\ncalibration\nclean (someone/something) up\ncorrection\nfiddle (around) with something\nfine-tune\nmess\nrecondition\nreconstruct\nreconstruction\nrectifiable\nrectification\nremedy\nrevise\nscratch\nset/put the record straight idiom\nsmooth something away\nsmoothen\nsort\nsort something out\ntinker\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking things better\nPhrasal verb\nrepair to somewhere\nB1 the act of fixing something that is broken or damaged: My car is in the garage for repairs. The repairs to the roof will be expensive. The mechanic pointed out the repair (= repaired place) on the front of my car.\nMore examplesFewer examplesI've had to dip into my savings to pay for the repairs.There will be extensive repairs to the motorway.Following the repairs to the roof, church funds are now seriously depleted.The repairs to our car cost much more than we were expecting.The plumber made rather a bad job of the repairs.\nSMART Vocabulary: related words and phrases\nCorrecting and mending\ncalibration\nclean (someone/something) up\ncorrection\nfiddle (around) with something\nfine-tune\nmess\nrecondition\nreconstruct\nreconstruction\nrectifiable\nrectification\nremedy\nrevise\nscratch\nset/put the record straight idiom\nsmooth something away\nsmoothen\nsort\nsort something out\ntinker\nSee more results »\nIdioms\nin good, bad, etc. repair\nunder repair\nAdd to word list\nAdd to word list\nto put something damaged, broken, or not working correctly back into good condition or make it work again: Surgeons repaired the severed artery.\nAdd to word list\nAdd to word list\nto get something that is damaged or broken back into good condition, or to make something that is not working correctly work again: He recommended a local company that repairs computers.get/have sth repaired Breakdown cover is not expensive, if you compare the cost of getting your car repaired and possibly shipped back home. It is going to cost $5,000 to repair the damage caused by the storm.\nto do something to make a bad situation better: The industry is still struggling to repair the damage of repeated scandals.\nthe act of doing something to put something that is broken or damaged back into good condition or to make it work again: emergency/essential/necessary repairs extensive/major/minor repairs a repair bill/repair costs a car repair shopcarry out/do/make repairs They have a garage where mechanics change oil, perform tune-ups and do repairs.repairs to sth The landlord failed to carry out the necessary repairs to the apartment.\nbeyond repair\nsomething that is beyond repair is damaged so much that it cannot be repaired or that nothing can be done to help: The public image of the brand may be damaged beyond repair. The carpet was beyond repair, so the insurance company paid for a new one.\nin good/bad, etc. repair (also in a good/bad, etc. state of repair)\nin good/bad, etc. condition: The fences on either side of the track were in poor repair.\nunder repair\nbeing repaired: This section of the road will be under repair until January.\nSee also\ncredit repair\nhome repair\nrunning repairs"}