{"id":308529,"name":"replacement","type":"noun","us_sound":"rɪˈpleɪs.mənt","us_link":"../audio/r/eus75916.mp3","uk_sound":"rɪˈpleɪs.mənt","uk_link":"../audio/r/ukrepen014.mp3","content":"Add to word list\nAdd to word list\nC1 [ U ] the process of replacing something with something else: the replacement of existing computer equipment replacement windows\n[ C or U ] a medical operation in which a part of the body, especially a hip or knee, is replaced with an artificial one: A lot of ex-athletes need knee or hip replacements. After ankle replacement surgery, the pain was gone.\nB2 [ C ] someone who does a job instead of someone else, or something that you use instead of something else: The agency sent a replacement for the secretary who resigned.\n[ C ] in sports, a player who is used for part of a game instead of another player Synonym\nsubstitute\nMore examplesFewer examplesIf the product doesn't work, you are given the choice of a refund or a replacement.Our babysitter's just moved away, so we're asking around for a replacement.He raged at us for forgetting to order a replacement.The hardest part will be to find a replacement.We had to send off to Ireland for a replacement part.\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\nmake up for something\nname\nnovate\npart exchange\npinch-hit\nrefresh\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitution\nsubstitutive\nsucceed\nsuccession\nsupersede\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical treatment: surgery\nCompetitors & participants in sports & games\nAdd to word list\nAdd to word list\n[ C ] a thing or person that takes the place of something or someone else: a replacement for sb/sth We now use LEDs as replacements for conventional light bulbs.a permanent/temporary replacement She has agreed to take on the role of chairman until a permanent replacement is found. He remained on the board until his replacement arrived in mid-March.\n[ U ] the act of replacing one thing or person with another: replacement of sth Water prices will go up to pay for the replacement of a crumbling pipe network. They make replacement parts for tractors. The company has hired 42 replacement workers."}