{"id":308595,"name":"reply","type":"verb","us_sound":"rɪˈplaɪ","us_link":"../audio/r/reply.mp3","uk_sound":"rɪˈplaɪ","uk_link":"../audio/r/ukrepen023.mp3","content":"Add to word list\nAdd to word list\nB1 to answer: [ + speech ] \"Where are you going?\" I asked. \"Home,\" he replied. [ + that ] I replied that it was twelve o'clock. I try to reply to letters the day I receive them.\nThesaurus: synonyms, antonyms, and examples\nto answer someoneanswer\"Thank you\", she answered.replyThe man replied that something was missing.respondWe aim to respond to all enquiries within five working days.reactHe reacted positively to the proposal.get back toI'll look into it and get back to you.explain\"What happened?\" she asked. - \"There's no time to explain!\" he said.\nSee more results »\nto react to an action by someone else: She replied to the threats by going to the police. France took an early lead before Spain replied with three goals in 14 minutes.\nMore examplesFewer examplesSince they refuse to reply, I think we've won the argument by default.He was angry but managed, with great self-restraint, to reply calmly.Do you think it's significant that he hasn't replied to my letter yet?Six people have confirmed that they will be attending and ten haven't replied yet.The bank was expeditious in replying to my letter.\nSMART Vocabulary: related words and phrases\nAnswering & responding\nacknowledgment\naffirmative\naffirmatively\nanswer\nclap back\nclapback\ncounter\ncounterattack\ncrickets idiom\ndefensively\nfield\ninterview\nnon-responder\nnon-response\nnon-responsive\nrejoin\nrespondent\nresponse\nRSVP\nwhataboutism\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReacting and responding\nB1 an answer: I asked why, but he made/gave no reply. There were very few replies to our advertisement. In reply to their questions, she just shrugged.\nThesaurus: synonyms, antonyms, and examples\nan answeranswerWe're still waiting for an answer.reply \"How far?\" asked Nigel. \"Not far,\" was the mumbled reply.answer105 is the correct answer.responseThank you for your swift response.reactionWhat was her reaction when she was asked for her resignation?retortAlan snapped back with a witty retort.\nSee more results »\nMore examplesFewer examplesI was a little disconcerted by his reply.His reply to my question was somewhat ambiguous.His reply dashed our hopes.I'm afraid the reply was definitely in the negative.He was shocked at the sheer venom of her reply.\nSMART Vocabulary: related words and phrases\nAnswering & responding\nacknowledgment\naffirmative\naffirmatively\nanswer\nclap back\nclapback\ncounter\ncounterattack\ncrickets idiom\ndefensively\nfield\ninterview\nnon-responder\nnon-response\nnon-responsive\nrejoin\nrespondent\nresponse\nRSVP\nwhataboutism\nSee more results »\nAdd to word list\nAdd to word list\nto answer a question: [ I ] She asked him how old he was but he didn’t reply. [ + that clause ] He replied that he wasn’t interested.\nAdd to word list\nAdd to word list\n[ I or T ] to give a spoken or written answer: 'Your comments have been noted,' he replied.reply to sb/sth He did not reply to a message left for him. 36 applicants replied to our advert.reply that 55% of respondents replied that they are confident in their companies' leaders.\n[ I ] to react to something that someone has done: The voters replied by voting 80% in favour.reply with sth After criticism for being slow to respond to changes in the market, the company replied with a major restructuring.\na spoken or written answer: get/have/receive a reply We had more than 100 replies.a reply to sb/sth We received no reply to our query.await a reply The letter, dated December 17, awaits a reply. You will receive a written reply once your complaint has been looked into.\nin reply (to sth)\nas an answer or reaction to something: He didn't really say anything in reply. In reply to a question about piracy, he said that there was over 90% piracy of software.\nin reply to formal\nCOMMUNICATIONS used to begin a formal letter that is answering another letter: In reply to your letter of October 7th, I would like to offer you compensation of €100."}