{"id":308525,"name":"replace","type":"verb","us_sound":"rɪˈpleɪs","us_link":"../audio/r/replace.mp3","uk_sound":"rɪˈpleɪs","uk_link":"../audio/r/ukrepen012.mp3","content":"replace verb [T]\n(CHANGE FOR)\nAdd to word list\nAdd to word list\nB1 to take the place of something, or to put something or someone in the place of something or someone else: The factory replaced most of its workers with robots. Tourism has replaced agriculture as the nation's main industry.\nB1 If you replace something broken, damaged, or lost, you provide a new one: I promised to replace the plate that I'd dropped.\nMore examplesFewer examplesDo a global search for 'organise' and replace it with 'organize'.The Council plans to knock the library down and replace it with a hotel complex.Imperial units have in many cases been replaced by metric ones in Britain.Doctors have replaced the top of his hip bone with a metal sphere.He's bought me a smart new camera to replace my old one.\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\nmake up for something\nname\nnovate\npart exchange\npinch-hit\nrefresh\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitution\nsubstitutive\nsucceed\nsuccession\nsupersede\nSee more results »\nreplace verb [T]\n(PUT BACK)\nC2 to put something back where it was before: The librarian replaced the books correctly on the shelves.\nSMART Vocabulary: related words and phrases\nGiving, bringing or getting back\nbring\nbring something back\nchargeback\nclaw something back\ngiver\nput\nrecovery\nrefund\nregain\nregrow\nreintroduce\nreintroduction\nrestore\nsend something back\nsyndication\ntake something back\nturn\nturn in\nturn something over to someone\nuncollectable\nSee more results »\nRelated word\nreplaceable\nreplace verb [T]\n(CHANGE FOR)\nAdd to word list\nAdd to word list\nto take the place of something or put in the place of something or someone else: We replaced our old air conditioners. The ailing actress was replaced by her understudy.\nreplace verb [T]\n(PUT BACK)\nto put something back where it was before: After dusting the vase, she replaced it on the shelf. replacement noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/rɪˈpleɪs·mənt/\n[ U ] The replacement of typewriters by computers happened quickly.\nAdd to word list\nAdd to word list\nto take the place of something or someone else: The single farm payment will replace all subsidy schemes in January. Four people have left the DA's office and not been replaced.replace sth with sth The majority of British people are opposed to replacing the pound sterling with the euro.replace sb as sth He'll be replaced as undersecretary by Kate Michael.\nto change something that is old, damaged, lost, etc. for something newer or better: The machines were too expensive to replace. A lot of technology in this hospital is ancient and needs to be replaced. The company guarantees to replace a stolen handset within 24 hours."}