{"id":308717,"name":"repost","type":"verb","us_sound":"ˌriːˈpoʊst","us_link":"../audio/r/cdo1121usrepo3639.mp3","uk_sound":"ˌriːˈpəʊst","uk_link":"../audio/r/cdo1121ukrepo3663.mp3","content":"Add to word list\nAdd to word list\nto put one of your previous posts (= messages, pictures, etc.) on a website or on social media again: I thought I would repost the ground rules. I'll have to search my files and see if I can find it and repost it.\nto put something on a website or on social media that someone else previously posted: Would you mind if I repost this on Facebook? If you repost any material from this blog, please give credit by including a link back to me.\nMore examplesFewer examplesI truly believe that you should repost a lot of what you wrote way back.I will repost in the next week to update on my success.Please do not repost our stuff elsewhere.If over 100,000 people repost it, he will renew the contract.I'd repost but do not have access to the screenshots from here.\nSMART Vocabulary: related words and phrases\nInternet terminology\n2FA\n2SV\nabove/below the fold idiom\naddress bar\naffiliate link\nhybrid\ninternet café\ninternet-enabled\ninterweb\nIP\nkeyboard warrior\nlanding page\nping\npodcast\nservice provider\ntweetstorm\ntwitterati\nTwitterer\ntwittering\ntwitterstorm\nSee more results »\nsomething such as a message or picture that you put on a website or on social media again: This is a repost of one of my earlier comments but it's relevant. I posted this question about a year ago, and am trying a repost in the hope that someone can help.\na message, picture, etc. originally posted by someone else that you put on a website or on social media : The system will calculate popularity by a Tweet's number of reposts and the general influence of the user who posted it. Any party who intends to use photographs or contents for a repost, please request prior permission.\nMore examplesFewer examplesThis is a repost of the post I lost when Blogger went down the other day.These thoughts are just simply reposts from a thread I initiated in this forum.This is one of the most interesting reposts I've ever read on the boards.\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\npostscript\nprospectus\nPSA\npush notification\nradiogram\nreadout\ntelemetry\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternet terminology"}