{"id":308667,"name":"report","type":"verb","us_sound":"rɪˈpɔːrt","us_link":"../audio/r/report.mp3","uk_sound":"rɪˈpɔːt","uk_link":"../audio/r/ukrepen025.mp3","content":"report verb\n(TELL)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to give a description of something or information about it to someone: We called the insurance company to report the theft. The assassination was reported in all the newspapers. I want you to report (to me) on progress (= on what you have done) every Friday. [ + -ing verb ] Spies reported seeing a build-up of soldiers. [ + obj + adj ] He was reported missing in action. The inquiry reports (= will officially make its results known) next week.\nThesaurus: synonyms, antonyms, and examples\nto tell someone somethingtellMy friend told me you were looking for me.let someone knowLet me know if you'd like to come.giveCan you give the message to Jo?communicateA 60-second TV commercial isn't always the best way to communicate a complex medical message.informThe relatives of the injured have been informed of the accident.notifyThe school has to notify parents if their children do not arrive at school.\nSee more results »\nbe reported to be/do something\nto be described by people as being or doing a particular thing although there is no real proof: The storm is reported to have killed five people.\nSee more\n[ T ] to make a complaint to a person in authority about something or someone: My neighbours reported me to the police for firing my rifle in the garden.\nMore examplesFewer examplesWitnesses reported seeing a huge orange fireball as the oil refinery exploded.Shortly before the crash the pilot had reported a malfunction of the aircraft's navigation system.Her disappearance was reported to the police department's Missing Persons Bureau.Do you have anything to report?Several journalists have been killed or injured by stray bullets while reporting on the civil war.\nSMART Vocabulary: related words and phrases\nDescribing & telling stories\ndream sequence\nframing\ngriot\nnarrate\nnarrative\nnarratively\nnarrator\nomniscient narrator\npaint\npaint a picture (of something) idiom\npersonalize\npersonification\npersonify\nrecitation\nrecount\nrelate\nretell\nspin\nteller\nworld-building\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComplaining\nreport verb\n(GO)\n[ I usually + adv/prep ] to go to a place or a person and say that you are there: I report for (= am ready for and at) work/duty at 8 a.m. every morning.\nSMART Vocabulary: related words and phrases\nArriving, entering and invading\nannex\nannexation\nbe on the scene idiom\nbeen\nbreak\nbreak someone in\nhit\ningress\ninterloper\nintrude\nintrusion\ninvade\njump\nrock up\nroll up! idiom\nscene\nset foot in somewhere idiom\nshow up\ntrespass\nturn\nSee more results »\nPhrasal verbs\nreport back\nreport to someone\nreport noun [C]\n(DESCRIPTION)\nA2 (also school report); (US also report card) a teacher's written statement to parents about a child's ability and performance at school\nB1 a description of an event or situation: a news/weather report a company's financial/annual report I gave/made/submitted a report of the theft to the insurance company. She sent in weekly reports on the situation. reports [ plural ]\nstories for which you do not yet have real proof: get reports of We're getting reports of a plane crash in Paris.\nSee more\nMore examplesFewer examplesThe report contains numerous demonstrable errors.The prime minister issued a denial of the report that she is about to resign.The content of her report is shrouded in secrecy.We file these reports under country of origin.The newspaper reports of the discussion only roughly approximated to what was actually said.\nSMART Vocabulary: related words and phrases\nJudgments and analyses\nanalysis\nanatomy\nappraisal\nappraisee\nassessment\ncognizable\nconstruction\nforensics\nimpact assessment\nimpact statement\ninterpretation\njob evaluation\nprognosticate\nprognostication\nrap\nrating\nre-evaluation\nre-review\nvalue judgment\nverdict\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMarks & results\nAccounts and stories\nInformation and messages\nreport noun [C]\n(NOISE)\nformal the loud noise of a shot: We heard the loud/sharp report of a rifle.\nThesaurus: synonyms, antonyms, and examples\na sudden loud soundbangShe slammed the door with a bang.slamThe window closed with a slam.clashI can still hear the clash of metal against metal during the car crash.clankMy mechanic asked me to describe the clanks that my engine makes.clangThe jail door closed with a resounding clang.thumpHe dropped his suitcase with a loud thump and sprinted up the steps.\nSee more results »\nSMART Vocabulary: related words and phrases\nSounds made by objects, movement or impact\nbang around\nbong\nburble\nchoo-choo\nchuff\nclick away\nclicker\nclinking\ncrunch\nplop\nresonance\nspit\nsplat\nsputter\nsqueak\nswoosh\ntinkly\ntintinnabulation\nunsounded\nwhirr\nSee more results »\nreport verb\n(TELL)\nAdd to word list\nAdd to word list\n[ T ] to give a description of something or information about something to someone: We called the police to report the theft. The accident was reported in all the newspapers. [ + that clause ] The crew reported that the situation was normal.\nreport verb\n(GO SOMEWHERE)\n[ I always + adv/prep ] to go to a place and say that you are there or inform someone about what you are doing: I report for work/duty at 8 a.m. every morning. In this job you’ll be reporting directly to (= working for) the president.\nreport noun [C]\n(TELL)\ninformation about something: a financial report I have to write a report on immigration. According to reports there has been an earthquake in Los Angeles.\nAdd to word list\nAdd to word list\na spoken or written description of an event or situation: give/make a report I think it is good practice for companies to make a proper report to shareholders.write a report She wrote a simple no-nonsense report.a report on sth Can you give us a report on what happened at the meeting? an employment/inflation/market report\na statement that may or may not be true: a report (that) Its shares have risen 33p over the past 10 days after reports it had received more than one approach. According to reports from the US, details of the deal were leaked on internet message boards.\nACCOUNTING, FINANCE\n&#160; (also annual report) a report by a company each year with its audited (= officially examined) accounts, and information on how its management thinks it will do in the future: In last year's annual report we set a goal to double our revenue within the next five years.\nan official document made by someone who has examined a particular subject: The panel's report said that governments are not spending enough on research.a report on sth The task force published a scathing report on the impact of regulation on hotels and restaurants. In a report, he said investors still face risks with this company if a merger does not occur.\nIT a search for a particular type of information in a large amount of data, or the results of a search like this: run/generate a report You may need to run a report for a meeting from your laptop at home.\nCOMMUNICATIONS an article in a newspaper or on television about a particular situation or event: The statement was in response to a Dallas Morning News report.a report on sth The evening news featured a special report on the banking crisis.\nHR, WORKPLACE, MANAGEMENT someone who works for a particular manager: He has 15 direct reports. See also\nauditor's report\ncredit report\ndirectors' report\nearnings report\nemployment report\nfinancial report\nlaw report\nprogress report\nstatutory report\n[ T ]\n&#160; COMMUNICATIONS, ACCOUNTING to make a public statement about something: report a rise/fall/drop They reported a 5.7% drop in sales.report a profit/loss Their chief executive reported pre-tax profits of £489m. The government reported the worst job losses in more than four years.\n[ I or T ]\n&#160; COMMUNICATIONS to give information about something or a description of something: Dealers reported some extreme price movements among some of the biggest companies. Small traders reported long waits to contact internet-based stockbrokers.report that Staff members reported that morale had reached new lows.report on sth The task force is due to report on its findings from the industry later this year.report sth to sb That board has 30 days to report its findings to the President.\n[ I or T ] to make an official complaint or statement about someone or something to a person in authority: report sb/sth to sb She threatened me, and I reported her to the manager.report sb for sth She reported him for benefit fraud.report sth stolen/missing/lost 66 vehicles have been reported stolen during the month of April.\n[ I ] to go to a place or person and say that you are there: Anyone entering the building must report to the office.report to sb He must report daily to a pretrial services officer in San Diego. She reported for work right on time as usual. Phrasal verbs\nreport back\nreport to sb"}