{"id":308808,"name":"representing","type":"verb","us_sound":"ˌrep.rɪˈzent","us_link":"../audio/r/represent.mp3","uk_sound":"ˌrep.rɪˈzent","uk_link":"../audio/r/ukrepos006.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nrepresent\nrepresent verb\n(ACT FOR)\nC2 [ T ] to speak, act, or be present officially for another person or people: They chose a famous barrister to represent them in court. Union officials representing the teachers met the government today. I sent my husband to represent me at the funeral. Women were well/poorly represented at the conference (= there were many/few present).\n[ T ] to be the Member of Parliament, or of Congress, etc. for a particular area: Ed Smythe represents Barnet.\nC2 [ T ] to be the person from a country, school, etc. that is in a competition: She was chosen to represent France at the Olympics.\nformal to express or complain about something, to a person in authority: We represented our grievances/demands to the boss.\nMore examplesFewer examplesAll the local churches were represented at the memorial service.All the nations of the world will be represented at the conference.A group of four teachers were delegated to represent the school at the union conference.They purport to represent the wishes of the majority of parents at the school.A friend of the victim was subpoenaed as a witness by lawyers representing the accused.\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\ncompensation\nmake up for something\nname\nnovate\npart exchange\npinch-hit\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitutable\nsubstitution\nsubstitutive\nsucceed\nsuccession\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSuccessful (things or people)\nCompetitors & participants in sports & games\nComplaining\nrepresent verb\n(DESCRIBE)\nC2 [ T ] to show or describe something or someone: [ + -ing verb ] The statue represents St. George killing the dragon. This new report represents the current situation in our schools. He represents himself as an expert, but he knows nothing.\nB2 [ T ] to be a sign or symbol of something: To many people the White House represents the identity of the United States.\nMore examplesFewer examples¼ and 0.25 are different ways of representing the same fraction.The wild cards are represented here by asterisks.The decimal system represents numbers in terms of groups of ten.Each number on the scale represents twice the speed of the preceding number.Writers of realist novels try to represent life as it is.\nSMART Vocabulary: related words and phrases\nRepresentation in art & in general\nanti-realism\nanti-realist\nCalvary\ncomplementary\nconfederate\nmimesis\nnaturalistically\nnon-figurative\nnon-representational\nnon-symbolic\nportray\nportrayal\nrealism\nrealist\nrepresentation\nsmellscape\nstylized\nsymbolic\nsymbolism\nsymbolization\nSee more results »\nrepresent verb\n(BE)\nB2 [ L only + noun ] to be the result of something, or to be something: This book represents ten years of thought and research. The new offer represented an increase of 10 percent on the previous one.\nMore examplesFewer examplesThe course represents excellent value for money.This huge, unfinished building represents the last hurrah of the former regime.The new price represents a saving of more than 40 percent.This new policy represents a change of direction for the government.Her father's blessing represented a bestowal of consent upon her marriage.\nSMART Vocabulary: related words and phrases\nExisting and being\naccount for something\nalive\nbe\nbe a thing idiom\nbeen\nestate\nexistentially\nextant\nfound\nhave legs idiom\nhood\nlie in\nliving\nrun\nspring up\nthey're\nthing\nthingness\nviability\nwe're\nSee more results »"}