{"id":308788,"name":"representation","type":"noun","us_sound":"ˌrep.rɪ.zenˈteɪ.ʃən","us_link":"../audio/r/representation.mp3","uk_sound":"ˌrep.rɪ.zenˈteɪ.ʃən","uk_link":"../audio/r/ukrepos007.mp3","content":"representation noun\n(ACTING FOR)\nAdd to word list\nAdd to word list\nC2 [ U ] a person or organization that speaks, acts, or is present officially for someone else: Can he afford legal representation?\nMore examplesFewer examplesDefendants have a right to legal representation and must be informed of that right when they are arrested.The farmers demanded greater representation in parliament.The main opposing parties have nearly equal representation in the legislature.The scheme is intended to increase representation of minority groups.The members are chosen by a system of proportional representation.\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\ndiminished responsibility\nextrajudicial\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\npleading\npower of attorney\nprecedent\npretrial\nprobate\nthe Webster ruling\nwitness to something\nwobbler\nSee more results »\nrepresentation noun\n(DESCRIPTION)\nC2 [ U ] the way that someone or something is shown or described: He gave a talk on the representation of women in 19th-century art.\n[ C ] a sign, picture, model, etc. of something: This statue is a representation of Hercules.\nSMART Vocabulary: related words and phrases\nRepresentation in art & in general\nanti-realism\nanti-realist\nCalvary\ncomplementary\nconfederate\nmimesis\nnaturalistically\nnon-figurative\nnon-representational\nnon-symbolic\nportray\nportrayal\nrealism\nrealist\nrepresentational\nstylized\nsymbolic\nsymbolism\nsymbolization\nultrarealism\nSee more results »\nrepresentation noun\n(INCLUDING ALL)\n[ C or U ] the fact of including different types of people, for example in films, politics, or sport, so that all different groups are represented: They explore complex and delicate issues of race, diversity, and representation in the news business. There has been a small representation of Latin American players in the NBA for decades.\nSMART Vocabulary: related words and phrases\nVariety and mixtures\nall manner of something idiom\nalphabet soup\nassorted\nassortment\nbiodiverse\nhotchpotch\nhybridize\nhybridized\nit takes all sorts (to make a world) idiom\njumble\nnon-segregated\nodds and ends\nof every stripe/of all stripes idiom\npanoply\npatchwork\nplurality\nthis\nthis and that idiom\nvariety is the spice of life idiom\nvariously\nSee more results »\nIdiom\nmake representations/a representation to someone/something\nAdd to word list\nAdd to word list\n[ U ] people who will speak and act for you in an official situation, or the fact of someone speaking and acting for you: More American workers are demanding union representation. These employees need legal representation to protect them against administrative abuse.\n[ U ] if a type of person has representation in a group, there are people of that type in the group: The committee has equal representation from employers and employees. What is the reason for the lack of female representation on top boards? They are monitoring the gender representation on public committees.\nmake representations to sb\nto make an official statement to an organization about something, especially as a way of complaining : We are making representations to the relevant authorities about this unprofessional behaviour.\nSee also\nboard representation\nemployee representation\nfalse representation\nproportional representation"}