{"id":308799,"name":"representative","type":"noun","us_sound":"ˌrep.rɪˈzen.t̬ə.t̬ɪv","us_link":"../audio/r/uscld01842.mp3","uk_sound":"ˌrep.rɪˈzen.tə.tɪv","uk_link":"../audio/r/ukrepos009.mp3","content":"Add to word list\nAdd to word list\nB2 someone who speaks or does something officially for another person or group of people: The firm has representatives in every major city. Representative\nsomeone who has been elected to the US House of Representatives\nMore examplesFewer examplesA representative from the tour company will meet you at the check-in.He visited China in his official capacity as America's trade representative.We have representatives operating in most countries.In order to increase the number of female representatives, the selection committee decided to discriminate in favour of women for three years.We elected him as our representative.\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\nmake up for something\nname\nnovate\npart exchange\npinch-hit\nrefresh\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitution\nsubstitutive\nsucceed\nsuccession\nsupersede\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternational relations: United States politics & government\nrepresentative adjective\n(TYPICAL)\ntypical of, or the same as, others in a larger group of people or things: Are your views/opinions representative of all the workers here? a representative sample/cross-section/selection\nSMART Vocabulary: related words and phrases\nTypifying, illustrating and exemplifying\nanalogy\narchetypal\narchetypically\nbe someone all over idiom\nbetoken\ninstance\ninstantiate\nmirror\nMr\nMrs\nsum\nsum (something/someone) up\nsummation\nsymbolic\nsymbolization\nsymbolize\nsymptom\nterritory\ntoken\ntranslate\nSee more results »\nrepresentative adjective\n(ACTING FOR)\nA representative system of government is one in which people vote for politicians to represent them.\nSMART Vocabulary: related words and phrases\nTypifying, illustrating and exemplifying\nanalogy\narchetypal\narchetypically\nbe someone all over idiom\nbetoken\ninstance\ninstantiate\nmirror\nMr\nMrs\nsum\nsum (something/someone) up\nsummation\nsymbolic\nsymbolization\nsymbolize\nsymptom\nterritory\ntoken\ntranslate\nSee more results »\nAdd to word list\nAdd to word list\npolitics &amp; government\n&#160; (also Representative) (abbreviation Rep.) a member of the US House of Representatives; a congressman or congresswoman\nrepresentative noun [C]\n(ACT FOR)\na person who represents another person or a group: The company has representatives in most European capitals.\npolitics &amp; government A representative is also a member of a law-making group.\nrepresentative adjective [not gradable]\n(DESCRIBE)\nserving to describe, esp. a larger group of the same type: A good political poll is based on a representative sampling of voters.\nAdd to word list\nAdd to word list\nCOMMERCE\n&#160; (also sales representative); (also informal rep) someone whose job is to sell a company's products or services, especially by visiting or phoning customers: We'll increase our team of representatives to help meet sales targets. All shops are visited regularly by one of our sales representatives.\na person who is chosen to speak or act for other people: Staff have been invited to elect a representative to attend management meetings. A representative of the oil company made a press statement. See also\ncustomer representative\nemployee representative\npersonal representative\nunion representative\ntypical of a large group of people or things: How representative are the views of these customers? representative of sth These remarks are not representative of the views of management.\na representative sample (of sth)\nMARKETING a small group that contains the same mixture of people or things that is found in a bigger group, so that it is able to provide useful information about the bigger group : The survey was sent to a representative sample of US households."}