{"id":308930,"name":"reproduction","type":"noun","us_sound":"ˌriː.prəˈdʌk.ʃən","us_link":"../audio/r/reproduction.mp3","uk_sound":"ˌriː.prəˈdʌk.ʃən","uk_link":"../audio/r/ukrepos027.mp3","content":"reproduction noun\n(PRODUCING YOUNG)\nAdd to word list\nAdd to word list\nC2 [ U ] the process of having babies, producing young, or producing new plants: human/sexual reproduction We are researching reproduction in elephants/the reproduction of elephants.\nMore examplesFewer examplesasexual reproductionIn human reproduction, one female egg is usually fertilized by one sperm.Sexual reproduction serves to create genetic variety.I'm no expert on human reproduction.They are calling for a ban on reproduction for human cloning.\nSMART Vocabulary: related words and phrases\nAnimal reproduction\nandrogen\nanti-oestrogen\nasexual reproduction\nasexuality\nasexually\nbarrenness\ncalve\nfertile\nfetal\nimpregnate\nnonreproductive\noestrogen\nout-reproduce\npanmictic\npanmixia\nprocreation\nsemen\nspawn\nsterile\nzygote\nSee more results »\nreproduction noun\n(COPY)\nC1 [ C or U ] a copy of something, especially a painting, or the process of copying something: The book contains excellent colour reproductions of Monet's paintings. This system has excellent sound reproduction.\nSMART Vocabulary: related words and phrases\nCopying and copies\nanti-counterfeiting\nanti-piracy\nape\nbiomimicry\nblueprint\nfacsimile\nforge\nforgery\nhijack\nhijacking\nimaging\nmimetic\nphotostat\nphotostatic\npiracy\npirate\npirated\ntranscript\nwarmed-over\nXerox\nSee more results »\nreproduction noun\n(PRODUCE NEW LIFE)\nAdd to word list\nAdd to word list\n[ U ] the act or process of producing new life\nAdd to word list\nAdd to word list\n[ C ]\n&#160; COMMERCE a copy of something, especially a work of art or a piece of furniture: The museum sells cheap reproductions of some of its key artefacts.\n[ U ] the process of copying something such as a book, document, or photograph: Allow plenty of time for the physical typing and reproduction of your report. They used a new photo reproduction technique. Digital reproduction methods make the task much easier.\nused to describe something that is not original but a copy of something else: They supply reproduction furniture to high-class hotels. We sell reproduction beams and wood panelling."}