{"id":309100,"name":"repurchase","type":"noun","us_sound":"","us_link":"../audio/r/usbp0990.mp3","uk_sound":"ˌriːˈpɜː.tʃəs","uk_link":"../audio/r/cdo0622ukrepu1624.mp3","content":"Add to word list\nAdd to word list\nan occasion when a company buys back shares, bonds , etc. (= financial products) that it previously sold: The family owned 41% of the stock until the repurchase. Whether the company spends the money on acquisitions or share repurchases, the result could be a boost to future earnings.\nMore examplesFewer examplesThe company was bought out by the principal shareholders and through company stock repurchases.The yearly rate of share repurchases by companies fell from £1 trillion last year to £800 billion this year.Short-term funds can be obtained through repurchase agreements.\nSMART Vocabulary: related words and phrases\nBuying\nacquirable\nacquire\nacquisition\nacquisitiveness\napproval\nbidding\nbidding war\ninvest\nload up on something\nmisorder\nmoney-off\norder form\norder something in\npurchasing power\nretail therapy\nROBO\nROPO\nsend\nsend (off/away) for/to something\nslate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStock markets\nto buy back something that you previously sold: The company was accused of selling defective vehicles that it had previously repurchased from customers. They are hoping to raise funds to repurchase the yacht.\nto buy the same type of product again: Name a brand that you would definitely repurchase and that you would not hesitate to recommend to others.\nMore examplesFewer examplesBy repurchasing shares, a company signals that it feels its shares are undervalued.Management opted to borrow the necessary funds to repurchase the securities and restore the assets to its balance sheet.\nSMART Vocabulary: related words and phrases\nBuying\nacquirable\nacquire\nacquisition\nacquisitiveness\napproval\nbidding\nbidding war\ninvest\nload up on something\nmisorder\nmoney-off\norder form\norder something in\npurchasing power\nretail therapy\nROBO\nROPO\nsend\nsend (off/away) for/to something\nslate\nSee more results »\nAdd to word list\nAdd to word list\nto buy back shares, bonds, etc. that you previously sold: Our objective is to use surplus cash to repurchase shares.\nthe buying back of shares, bonds, etc. that you previously sold: The company's board authorized the repurchase of up to $3 billion of its common shares. a securities/stock/share repurchase"}