{"id":309125,"name":"reputation","type":"noun","us_sound":"ˌrep.jəˈteɪ.ʃən","us_link":"../audio/r/reputation.mp3","uk_sound":"ˌrep.jəˈteɪ.ʃən","uk_link":"../audio/r/ukrepro016.mp3","content":"Add to word list\nAdd to word list\nB2 the opinion that people in general have about someone or something, or how much respect or admiration someone or something receives, based on past behaviour or character: The company has a worldwide reputation for quality. She has the reputation of being a good doctor. His reputation was destroyed when he was caught stealing some money. The hotel has a bad/good reputation. He earned/established/gained/acquired a reputation as an entertaining speaker.\nMore examplesFewer examplesRecent discoveries about corruption have done serious damage to the company's reputation.The government's reputation has already been harmed by a series of scandals.The newspaper has a reputation for being littered with spelling mistakes.She has a reputation for open-mindedness and original thinking.Actors' reputations have been made and unmade on this London stage.\nSMART Vocabulary: related words and phrases\nReputation\nby reputation idiom\ncred\ncredibility\ndetoxify\ndisreputable\nhonourable\nhonourably\ninfamous\ninfamously\ninfamy\nmud\nnotoriety\nnotorious\nnotoriously\nrep\nreputable\nreputably\nsmoke\nTeflon\nthere's no smoke without fire idiom\nSee more results »\nIdiom\nby reputation\nAdd to word list\nAdd to word list\nthe general opinion that people have about someone or something: a good/bad reputation His work in Congress won him a reputation as reliable and industrious.\nAdd to word list\nAdd to word list\nthe opinion that people have of someone or something, based on past behaviour or character: The bank's professional reputation was badly damaged by the affair.have a good/bad reputation He had a very good reputation in the industry.have a reputation as sth She has a reputation as a tough negotiator.have a reputation for (doing) sth The company has a reputation for excellent customer care. earn/gain/build/develop a reputation enhance/damage sb's reputation\nknow sb/sth by reputation\nto know someone or something because of what people say about them, rather than by having direct experience of them: He knew Hindman by reputation before interviewing him for the post."}