{"id":309164,"name":"require","type":"verb","us_sound":"rɪˈkwaɪr","us_link":"../audio/r/require.mp3","uk_sound":"rɪˈkwaɪər","uk_link":"../audio/r/ukrepro022.mp3","content":"Add to word list\nAdd to word list\nB1 to need something or make something necessary: Please call this number if you require any further information. Skiing at 80 miles per hour requires total concentration. [ + obj + to infinitive ] Bringing up children often requires you to put their needs first. You are required by law to stop your car after an accident. [ + that ] The rules require that you bring only one guest to the dinner.\nThesaurus: synonyms, antonyms, and examples\nnecessarynecessaryDo you have the necessary skills for the job?needDoes she have the skills needed for work of that sort?requireWill you require a wake-up call in the morning?mustThe meat must be cooked thoroughly.essentialClean water is essential for a society's health.fundamentalSome understanding of grammar is fundamental to learning a language.\nSee more results »\nMore examplesFewer examplesStudents at this level require a lot of help.Children under 17 require an accompanying parent or guardian to see this film.It requires a few minor adjustments.Students are required to undertake simple experiments.This is a very sensitive case requiring extreme circumspection.\nSMART Vocabulary: related words and phrases\nLacking things\nbankrupt\nbankruptcy\nbe hard up (for something) idiom\nbereft\ncry out for something\nhole\ninappeasable\nlack\nlacking\nminus\nneed\nneed something like you need a hole in the head idiom\nscrape\nscream\nshy\nskimpily\nstarve someone/something of something\ntaken\nunaccompanied\nunappeased\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEssential or necessary\nrequire verb\n(NEED)\nAdd to word list\nAdd to word list\n[ T ] to need something, or to make something necessary: If you require assistance with your bags, I’ll be glad to get someone to help you. This game requires total concentration.\nrequire verb\n(ORDER)\nto order or demand something, or to order someone to do something, esp. because of a rule or law: [ + to infinitive ] We’re required to check your identification before letting you in. [ T ] A building permit is required.\nAdd to word list\nAdd to word list\nto make it officially necessary for someone do something: require sb to do sth Health and safety regulations require all staff to wear protective clothing. require that The contract requires that we notify our sponsors of all changes in project specification. The company is required by law to make regular tax returns.\nto need something: This project will require massive investment. The proposed new measures require approval by the board."}