{"id":309145,"name":"request","type":"noun","us_sound":"rɪˈkwest","us_link":"../audio/r/request.mp3","uk_sound":"rɪˈkwest","uk_link":"../audio/r/ukrepro020.mp3","content":"Add to word list\nAdd to word list\nB1 [ C or U ] the act of politely or officially asking for something: They received hundreds of requests for more information. [ + to infinitive ] The boss refused our request to leave work early. The clause was added to the contract at Carlos's request (= because Carlos asked for this). An application form will be sent to you on request (= if you ask). Compare\norder noun (INSTRUCTION)\nThesaurus: synonyms, antonyms, and examples\nthe act of asking for somethingrequestHer request for information was denied.applicationHis application for bail was granted.appealThe leader made an appeal for unity.callWith calls for action mounting, policymakers are beginning to pay attention.demandWe will never give in to terrorists’ demands.\nSee more results »\n[ C ] a song or something similar that someone has asked to be included in a show or on the radio: The next song is a request from/for Roz in Oxford.\nMore examplesFewer examplesHer request for time off work was denied.He graciously acceded to our request.My request for help was met with silence.We have been inundated with requests for help.The management has adopted a more pliant position, and has agreed to listen to the staff's requests.\nSMART Vocabulary: related words and phrases\nMaking appeals & requests\nadjuration\nappellate\napply for something\napply to\nappreciate\nask a lot\nbesiege\ncar wash\ncry\nentreat\nentreaty\nimportunately\nimportunity\ninvocation\nleech\nout with it! idiom\npush\nscrounge\nseek\nticket\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBroadcasting: programmes & other broadcasts\nGrammar\nRequestsWhen we make a request, we ask someone for something, or we ask someone to do something. …\nAsking for somethingThere are different ways of asking for something. We usually ask for something in a polite and indirect way, for example, using can, could, would you mind if and may: …\nAsking someone to do somethingThere are a number of ways of asking someone to do something in a polite and indirect way. We often use please to make our requests more polite: …\nB1 to ask for something politely or officially: [ + that ] We requested that the next meeting be held on a Friday. [ + obj + to infinitive ] Visitors are requested not to walk on the grass. I requested a taxi for eight o'clock.\nThesaurus: synonyms, antonyms, and examples\nto ask for somethingask forI asked the waiter for another glass.requestThe department has requested permission to spend money on new equipment.apply forWe applied for planning permission to build an extension.demandPeople are demanding the right to return to their homes.appeal forThe prime minister appealed for calm.call forA group of religious leaders are calling for an end to racism and injustice in the city.\nSee more results »\nMore examplesFewer examplesAdditionally , we request a deposit of $200 in advance.Passengers are requested to check in two hours before the flight.Hotel guests are requested to vacate their rooms by twelve noon.One regular customer always requests a plate of chips with his sandwich.The couple have requested a special dispensation from the Church to allow them to marry.\nSMART Vocabulary: related words and phrases\nMaking appeals & requests\nadjuration\nappellate\napply for something\napply to\nappreciate\nask a lot\nbesiege\ncar wash\ncry\nentreat\nentreaty\nimportunately\nimportunity\ninvocation\nleech\nout with it! idiom\npush\nscrounge\nseek\nticket\nSee more results »\nAdd to word list\nAdd to word list\nan act of asking for something, or the thing asked for: [ C ] The library gets a lot of requests for books about new babies. [ U ] An application will be sent to you upon request (= if you ask). request verb [ T ] us\nYour browser doesn't support HTML5 audio\n/rɪˈkwest/\n[ + that clause ] The caller requested that his name not be mentioned on the air.\nAdd to word list\nAdd to word list\nto ask for something: They've requested a formal meeting to discuss the issue. Here are the documents you requested. We need to request permission to use these photos in the ad.request that The CEO has requested that all senior staff attend the reception.\na question in which you ask for something: They have not yet responded to our request for information.make a request (for sth) They have made a formal request for access to our financial records.at the request of sb/at sb's request Changes were made to the contract at the request of our partners. decline/turn down a request receive a request respond to a request\non request\nif something is available on request, you have to ask for it if you want it: A schedule of fees is available on request."}