{"id":309166,"name":"requirement","type":"noun","us_sound":"rɪˈkwaɪr.mənt","us_link":"../audio/r/requirement.mp3","uk_sound":"rɪˈkwaɪə.mənt","uk_link":"../audio/r/ukrepro023.mp3","content":"Add to word list\nAdd to word list\nB2 something that you must do, or something you need: A good degree is a minimum requirement for many jobs. [ + that ] It is a legal requirement that you have insurance for your car. Students who fail to meet the requirements (of the course) will fail. Synonyms\nessential\nprerequisite formal\nrequisite formal\nMore examplesFewer examplesThere is a residency requirement for obtaining citizenship.The government estimates that its borrowing requirement this year could reach £150 billion, subject to a wide margin of error.Do you have any special dietary requirements?One of the requirements of the job is fluency in two or more African languages.We haven't yet been able to find a house that meets our requirements.\nSMART Vocabulary: related words and phrases\nLacking things\nbankrupt\nbankruptcy\nbe hard up (for something) idiom\nbereft\ncry out for something\nhole\ninappeasable\nlack\nlacking\nminus\nneed\nneed something like you need a hole in the head idiom\nscrape\nscream\nshy\nskimpily\nstarve someone/something of something\ntaken\nunaccompanied\nunappeased\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEssential or necessary\nAdd to word list\nAdd to word list\nsomething needed or necessary: Previous experience is one of the requirements for the job.\nAdd to word list\nAdd to word list\n[ usually plural ] what is wanted or needed by someone: I've been asked to estimate our budget requirements for next year.meet/suit sb's requirements The design has been adapted to meet customer requirements.\nan official rule about something that it is necessary to have or to do: I am afraid the safety system fails to meet minimum requirements. It is a requirement that an announcement be made at each stage of any possible venture. a legal/necessary requirement a visa/work/graduation requirement\nbe surplus to requirements\nif someone or something is surplus to requirements, they are not needed: The company have said 3,000 managers are surplus to requirements.\nSee also\ncapital requirement\ncentral government borrowing requirement\nthe public sector borrowing requirement\nthe public sector net cash requirement\nreserve requirement"}