{"id":309380,"name":"rescue","type":"verb","us_sound":"ˈres.kjuː","us_link":"../audio/r/rescue.mp3","uk_sound":"ˈres.kjuː","uk_link":"../audio/r/ukrerun005.mp3","content":"Add to word list\nAdd to word list\nB1 to help someone or something out of a dangerous, harmful, or unpleasant situation: The lifeboat rescued the sailors from the sinking boat. The government has refused to rescue the company from bankruptcy.\nMore examplesFewer examplesThe management are putting together a plan to rescue the company.They shouted for help, but nobody came to rescue them.Six people were rescued by helicopter from a fishing boat in distress off the Cornish coast.She showed enormous courage when she rescued him from the fire.A goal just before half-time rescued the match from mediocrity.\nSMART Vocabulary: related words and phrases\nPreserving and saving\naspic\nco-processing\nconserve\ndeliverer\ndocumentalist\ndocumentarily\nreclaim\nrecycle\nrecycled\nrenewal\nreprieve\nrescuer\nreusable\nrewild\nsustain\nunappropriated\nunassigned\nundesignated\nupcycle\nupcycling\nSee more results »\nRelated word\nrescuer\nB1 the act of helping someone out of a dangerous or unpleasant situation: Lifeboats carry out many rescues every month. We huddled together on the cliff ledge, waiting for rescue. I didn't know anybody at the party, but the hostess came to my rescue (= helped me out of a difficult situation) by introducing me to a few people.\nMore examplesFewer examplesThey were decorated for their part in the rescue.We watched scenes of the dramatic rescue on the news.Weather conditions have moderated, making a rescue attempt possible.The central bank has pulled off one of the biggest financial rescues of recent years.One man sustained severe burns during the rescue.\nSMART Vocabulary: related words and phrases\nPreserving and saving\naspic\nco-processing\nconserve\ndeliverer\ndocumentalist\ndocumentarily\nreclaim\nrecycle\nrecycled\nrenewal\nreprieve\nrescuer\nreusable\nrewild\nsustain\nunappropriated\nunassigned\nundesignated\nupcycle\nupcycling\nSee more results »\nA rescue animal is one that has been taken from a situation where it was not cared for or was treated badly and has been given a home: I'm determined our next dog is going to be a rescue animal. We encourage people to consider taking an older rescue cat.\nA rescue animal is one that is trained to help people out of dangerous situations: Supplies and rescue dogs were prevented from reaching the earthquake-hit region. Vets treated rescue animals for pain and exhaustion during the search.\nMore examplesFewer examplesTheir household also includes two rescue dogs and a stray cat.She loves her terrier, who was a rescue dog.If there is hope of finding someone alive in the rubble, rescue dogs are used.He worked with rescue dogs during the 1988 Calgary Olympics and is considered one of North America's foremost authorities on service dog training.\nSMART Vocabulary: related words and phrases\nPreserving and saving\naspic\nco-processing\nconserve\ndeliverer\ndocumentalist\ndocumentarily\nreclaim\nrecycle\nrecycled\nrenewal\nreprieve\nrescuer\nreusable\nrewild\nsustain\nunappropriated\nunassigned\nundesignated\nupcycle\nupcycling\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTreating people or animals badly\nEmergency services in general\nAdd to word list\nAdd to word list\nto save someone or something from a dangerous, harmful, or difficult situation: Medical teams immediately rushed in to rescue persons trapped in buildings and give medical aid. rescue noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/ˈres·kju/\n[ U ] Rescue workers arrived at the scene within minutes. rescuer noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈres·kju·ər/\nRescuers in helicopters and on foot continued their search for survivors.\nAdd to word list\nAdd to word list\nto save a person, company, economy, etc. from financial failure: The government is under pressure to rescue people who lost their pensions in the banking crisis. These are desperate measures aimed at rescuing a sinking economy.rescue sb/sth from sth The company was rescued from administration by the Government two years ago.\nthe saving of someone or something from financial failure : The rescue of the banks by government will work only if it restores economic growth. An Indian company came to the rescue with a ten million dollar investment. a rescue plan/strategy a rescue effort/attempt"}