{"id":309523,"name":"reservation","type":"noun","us_sound":"ˌrez.ɚˈveɪ.ʃən","us_link":"../audio/r/reservation.mp3","uk_sound":"ˌrez.əˈveɪ.ʃən","uk_link":"../audio/r/ukrerun017.mp3","content":"reservation noun\n(THING KEPT)\nAdd to word list\nAdd to word list\nB1 [ C or U ] an arrangement in which something such as a seat on an aircraft or a table at a restaurant is kept for you: I'd like to make a table reservation for two people for nine o'clock. Please confirm your reservation in writing by Friday.\nThesaurus: synonyms, antonyms, and examples\nan appointmentappointmentI made a dentist's appointment for Monday morning.reservationI have a reservation for 8 pm.bookingUK I have a booking in the name of Smith.commitmentI have no commitments tomorrow, so let’s meet up in the morning.\nSee more results »\n[ C ] an area of land made available for a particular group of people to live in: The family lives on a Native American reservation.\n[ C ] (also reserve); (US also preserve) an area of land in which wild animals are protected: He's the chief warden of a big-game reservation.\nMore examplesFewer examplesThe US government forcibly resettled the Native Americans in reservations.The restaurant is so popular it's almost impossible to get a reservation.Please let us know if you wish to cancel your reservation.The concierge can make dinner or theatre reservations for you.Many campsites require reservations, especially during the summer holiday season.\nSMART Vocabulary: related words and phrases\nMaking bookings & reservations\nadvance booking\nbook\nbook in/book into somewhere\nbooker\nbooking\ndouble-book\noverbook\npre-booked\nrebook\nreserve\nride-hailing\nseason\nunreserved\nvacancy\nYou can also find related words, phrases, and synonyms in the topics:\nTowns & regions: parts of countries\nZoology: zoos & wildlife reserves\nreservation noun\n(DOUBT)\nC2 [ C usually plural, U ] a doubt or feeling of not being able to agree with or accept something completely: Workers and employees shared deep reservations about the wisdom of the government's plans for the industry. He accepted my advice without reservation.\nSMART Vocabulary: related words and phrases\nSuspecting & questioning\nask questions of someone/something idiom\ncall into question idiom\nchallenge\nchallengingly\ncynic\ncynical\ncynically\ncynicism\ndoubt\ndoubter\nfisking\nmisgiving\nquery\nreserve\nsceptical\nskeptic\nskeptically\nsuspected\nsuspiciously\nunchallengeable\nSee more results »\nAdd to word list\nAdd to word list\n[ C/U ] a doubt or reason for not accepting or agreeing with something completely: [ C ] We have reservations about letting the children stay home alone.\n[ C ] an arrangement to have something kept for a person or for a special purpose: I made a reservation at the restaurant for 7 o’clock.\n[ C ] A reservation is also an area of land set apart for a particular group of people to live on, esp. American Indians.\nAdd to word list\nAdd to word list\nan arrangement to have something kept for you, for example, a seat on an aircraft or a table at a restaurant: Do you have a reservation? It is advisable to make a reservation several days in advance. They prefer not to take reservations because it's less efficient if a table sits empty while they wait for a party to show up. hotel/dinner/travel reservations a reservation system"}