{"id":309394,"name":"research","type":"noun","us_sound":"ˈriː.sɝːtʃ","us_link":"../audio/r/research.mp3","uk_sound":"rɪˈsɜːtʃ","uk_link":"../audio/r/ukrerun007.mp3","content":"Add to word list\nAdd to word list\nB1 a detailed study of a subject, especially in order to discover (new) information or reach a (new) understanding: scientific/medical research a research student/assistant/laboratory They are carrying out/conducting/doing some fascinating research into/on the language of dolphins.UK His researches in the field of disease prevention produced unexpected results.\nMore examplesFewer examplesHe has dedicated his life to scientific research.He emphasized that all the people taking part in the research were volunteers.The state of Michigan has endowed three institutes to do research for industry.I'd like to see the research that these recommendations are founded on.It took months of painstaking research to write the book.\nSMART Vocabulary: related words and phrases\nInventing, designing and innovation\nabsorptive capacity\narchitect\nartificer\nbionics\nblueprint\ndesign\ndesigner\ndevise\ndream something up\nergonomic\nlead time\nmodularization\nnanotechnology\nnon-imitative\noperational research\nthink outside the box idiom\nthink something up\ntrailblaze\nwhole cloth\nwind tunnel\nSee more results »\nB2 to study a subject in detail, especially in order to discover new information or reach a new understanding: She's researching into possible cures for AIDS. Journalists were frantically researching the new prime minister's background, family, and interests.\nThesaurus: synonyms, antonyms, and examples\nto study somethingstudyWhat do you plan on studying at university?majorUS She majored in philosophy at Harvard.cramShe's cramming for her history exam.reviseUK I'm revising for tomorrow's test.reviewUS We're going to review for the test tomorrow night. researchScientists are researching possible new treatments for cancer.\nSee more results »\nMore examplesFewer examplesThe amount of time and money being spent on researching this disease is pitiful.We are researching the reproduction of elephants.She researched a wide variety of jobs before deciding on law.He researches heart disease.The internet has reduced the amount of time it takes to research these subjects.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\ndive\nenquiry\ngauge\ngo through\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\nreinspect\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nthe acid test\nweigh\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInventing, designing and innovation\nRelated word\nresearcher\nAdd to word list\nAdd to word list\na detailed study of a subject in order to discover information or achieve a new understanding of it: medical/scientific research The US government has funded some research on high-speed trains. I like doing research. research verb [ I/T ] us\nYour browser doesn't support HTML5 audio\n/rɪˈsɜrtʃ, ˈri·sɜrtʃ/\n[ T ] Obviously they didn’t research it and get enough information. researcher noun [ C ] us\nYour browser doesn't support HTML5 audio\n/rɪˈsɜr·tʃər, ˈriˌsɜr-/\nAdd to word list\nAdd to word list\ndetailed study of a subject, especially in order to discover new information or understand the subject better: research into/on sth He is conducting detailed research into the effects of advertising on children.carry out/do/conduct research The doctor has carried out extensive research on the superbug. We'll need to do some research into the market before we commit ourselves. It was a useful piece of research.scientific/medical research He doesn't believe the scientific research. a research assistant/student a research grant See also\nattitude research\naudience research\nconsumer research\ncredit research\ndesk research\ninvestment research\nmarket research\nmotivational research\noperations research\nproduct research\nqualitative research\nto study a subject carefully or in detail, especially in order to discover new information or understand the subject better: research into sth She researches into the effects of climate change."}