{"id":309528,"name":"reserve","type":"verb","us_sound":"rɪˈzɝːv","us_link":"../audio/r/reserve.mp3","uk_sound":"rɪˈzɜːv","uk_link":"../audio/r/ukrerun018.mp3","content":"Add to word list\nAdd to word list\nB1 to keep something for a particular purpose or time: I reserve Mondays for tidying my desk and answering letters. These seats are reserved for the elderly and women with babies. I reserve judgment on this issue (= I won't give an opinion on it now) until we have more information.\nB1 If you reserve something such as a seat on an aircraft or a table at a restaurant, you arrange for it to be kept for your use: I reserved a double room at the Lamb Hotel. [ + two objects ] If you get there early, reserve me a seat/reserve a seat for me.\nMore examplesFewer examplesI'm awfully sorry, but we've forgotten to reserve you a table.Could I reserve two seats for tomorrow evening's performance?I've come to collect my tickets - I reserved them by phone yesterday in the name of Tremin.\"Had you forgotten about our anniversary?\" \"Certainly not! I've reserved a table at Michel's restaurant for this evening.\"The worst of her criticism was reserved for journalists, photographers and others of their ilk.\nSMART Vocabulary: related words and phrases\nKeeping and storing things\nappropriate\naside\nbank\nbogart\nbuffer\ncapacitance\ncling\ndump\nkeep (something/someone) back\nkept\nlay something aside\nlay something down\nlay something in\nlodge\nstandby\nstash\nstockpile\nstockpiling\nstorage\ntrap\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking bookings & reservations\nreserve noun\n(SHY BEHAVIOUR)\n[ U ] the habit of not showing your feelings or thoughts: I took her out for a drink and tried to break through her reserve.\nSMART Vocabulary: related words and phrases\nNot being friendly\nabrasive\nabrasively\nabrasiveness\nabruptly\nabruptness\naloof\nestranged\nestrangement\nflintily\nforbidding\nforbiddingly\nfrigid\ngruff\nremote\nremoteness\nreserved\nreservedly\nsaturnine\nself-contained\nwintry\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNot showing or feeling emotions\nreserve noun\n(KEEPING)\nC2 [ C or U ] the act of keeping something or a supply of something until it is needed, or a supply that you keep: She keeps a little money in reserve (= for use if and when needed). The librarian has put the book on reserve for me (= will keep it for me when it becomes available). We still have a reserve of food/food reserves in case of emergency.\nSMART Vocabulary: related words and phrases\nKeeping and storing things\nappropriate\naside\nbank\nbogart\nbuffer\ncapacitance\ncling\ndump\nkeep (something/someone) back\nkept\nlay something aside\nlay something down\nlay something in\nlodge\nstandby\nstash\nstockpile\nstockpiling\nstorage\ntrap\nSee more results »\nreserve noun\n(SUPPLY)\n[ plural ] a supply of something such as money or fuel that you are not using, but that is available if you need it: Government reserves include a £1.3 billion \"rainy day\" fund set aside for emergencies. Cash reserves on June 30 stood at about £950 million, giving them some protection against future shocks. Maybe, when the Earth's oil reserves finally run dry, we'll all get back on our bikes.\nSMART Vocabulary: related words and phrases\nInterest & capital\nannualized\nAPR\nbank rate\ncapital intensive\ncoffer\ncompound\nconcessional\nfinance\ninterest\ninterest rate\ninterest-bearing\nlending rate\nnon-derivative\nPremium Bond\nsimple interest\nsinking fund\nstock\nthe purse strings idiom\nvested interest\nworking capital\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGiving, providing and supplying\nreserve noun\n(AREA OF LAND)\nB2 [ C ] (also reservation); (US also preserve) an area of land kept in its natural state, especially for wild animals to live in and be protected: a nature/game/wildlife reserve\nSMART Vocabulary: related words and phrases\nZoology: zoos & wildlife reserves\nAONB\naquarium\nArea of Outstanding Natural Beauty\nconservancy\necologically\nfeeding station\ngreen\nnational park\nnature reserve\npetting zoo\npreserve\nranger station\nsafari park\nsanctuary\nSSSI\nsustainability\nsustainable\nwildlife corridor\nzoo\nzookeeper\nSee more results »\nreserve noun\n(EXTRA PERSON)\n[ C ] in sports, an extra player who is ready to play if needed: We had two reserves in case anyone was injured. the reserves [ plural ]\na football team consisting of players who are not in the first team, but who play in a league against reserve teams from other clubs: Frank was a prolific scorer for the reserves before he graduated to the first team.\nSee more\nSMART Vocabulary: related words and phrases\nCompetitors & participants in sports & games\nback four\nballer\nballplayer\nbase jumper\nbenchwarmer\nchallenger\njumper\nkeeper\nlogroller\nlong-jumper\nlongboarder\nmajor league\nmid-table\nracer\nretire\ntrampolinist\ntrialist\ntriathlete\ntriple jumper\ntriple threat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReplacing and exchanging\nthe reserves [ plural ]\na group of people who are not permanently in the armed forces but are used only if needed: call up the reserves They will call up the reserves.\nSee more\nreserve noun\n(DOUBT)\n[ U ] formal a feeling of doubt about someone or something: I can recommend him to you without reserve.\nSMART Vocabulary: related words and phrases\nSuspecting & questioning\nask questions of someone/something idiom\ncall into question idiom\nchallenge\nchallengingly\ncynic\ncynical\ncynically\ncynicism\ndoubt\ndoubter\nfisking\nmisgiving\nquery\nsceptical\nskeptic\nskeptically\nsuspect\nsuspected\nsuspiciously\nunchallengeable\nSee more results »\nreserve noun\n(LOWEST PRICE)\n[ C usually singular ] (also reserve price) the lowest amount of money the owners will accept for something being sold, especially at auction (= public sale): A rare Stradivarius violin failed to reach its reserve price (= no one offered to pay it) when put up for auction on Tuesday. We set/put a reserve of €500 on the picture.\nSMART Vocabulary: related words and phrases\nCosts & expenses\nairfare\naliment\nall in\nblue book value\nbook value\ncarriage\ncarrying charge\nexpenditure\nfee\nflat rate\ngate money\npurchasing power\nSP\nspecial offer\nstarting price\nsticker price\nsunk cost\nsurcharge\ntime is money idiom\ntransfer fee\nSee more results »\nAdd to word list\nAdd to word list\nto keep something for a particular purpose or time: [ T ] He reserved the right to veto any future plans.\nIf you reserve something such as a table in a restaurant or a room in a hotel, you arrange for it to be kept for your use at a later time: [ I ] It’s a popular restaurant, and you’ll have to reserve well in advance. [ T ] I’m sorry, this seat is reserved.\nsomething kept for a particular purpose or time, or the state of being kept for future use by someone: [ C ] I have a reserve of food in case of emergency. [ U ] The book is on reserve and can’t be checked out. She keeps a little money in reserve (= for use if and when needed).\nA reserve (also (also preserve)) is also an area of land kept for the protection of animals and plants: [ C ] a nature/game reserve\nThe reserves are a part of a country’s armed forces that are not always on active duty but are available in an emergency.\nAdd to word list\nAdd to word list\nto keep something for a particular purpose or time: reserve sth for sb/sth The plan would reserve $1 billion for \"long-term capacity improvements\".\nCOMMERCE to arrange for something to be kept for you, for example, a seat on an aircraft or a table at a restaurant: He's reserved a table for 8pm.\nreserve the right to do sth\nto state, especially in a written agreement, that you may change something in the future: I reserve the right to disagree to any future changes in the company structure.\nreserve judgement\nto not decide on something immediately: I thought I'd reserve judgement until he'd finished his presentation.\n[ C ] a supply of something that you have available to use if you need to: You will need a reasonable reserve of cash to start the process. coal/oil/fuel reserves\nin reserve\nkept in order to use later if needed: They do not have money in reserve like many of the bigger companies. Land should be kept in reserve at the airport for a second runway which could be built by the mid-2020s.\n[ C ]\n&#160; COMMERCE\n&#160; (also reserve price) the lowest amount of money that the owner will accept for something that is being sold, especially at an auction: I set the reserve price at $50 in the hope that it would sell for much more.\nreserves [ plural ]\nBANKING, FINANCE the amount of foreign currency or gold that a central bank has at a particular time: It has around 8bn dollars in foreign currency reserves. No country has limitless reserves of gold.\nACCOUNTING money kept by a company for a particular use, for example, a future project or emergency: use/dip into reserves It became necessary for the company to dip into its reserves. cash/money reserves See also\nbank reserves\ncapitalization of reserves\ncash reserves\nforeign exchange reserves\nhidden reserves\nlegal reserves\nproven reserves"}