{"id":309615,"name":"reshoot","type":"verb","us_sound":"","us_link":"","uk_sound":"ˌriːˈʃuːt","uk_link":"../audio/r/cdo0622ukresh1660.mp3","content":"Add to word list\nAdd to word list\nto record part of a film again, usually in a different way: The TV channel had to reshoot parts of the production after receiving hundreds of complaints from viewers. You won't reach your market by simply re-shooting the English-language commercials in Spanish.\nMore examplesFewer examplesThey had to reshoot scenes of Roman soldiers marching because the chink-chink sound of the armour couldn't be heard.The film's creators had to reshoot nearly half of the film, according to published rumours.It has been reported that the brothers were brought in to reshoot some of the action sequences.\nSMART Vocabulary: related words and phrases\nCinema - general words\n12A\nanimation\nanimator\naudio described\naudio description\nfade\nfilmic\nfilmically\nfilming\nfilmstrip\nflick\nfootage\nprojection\nRambo\nremake\nrerelease\nrescreen\nreshow\nsting\ntheatrical\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema & theatre: production, direction & recording\nan occasion when part of a film is recorded again in a different way: Failure to notice an imperfection could mean an expensive re-shoot later. The actor said she would only shave her head again for re-shoots if she got a bonus payment.\nMore examplesFewer examplesWe're doing some reshoots to add more fight scenes.The news reports told of a production involving delays and reshoots.The film's editors eliminate the need for expensive reshoots by using after-effect software to change lighting and background.\nSMART Vocabulary: related words and phrases\nCinema & theatre: production, direction & recording\nacquire\nacquisition\narmourer\naudition\nauteur\ncanister\ncomputer-animated\nfilmmaking\nfog machine\nframing\nframing device\ngreen screen\nlinear\nprop\nrecut\nrestage\nrun through something\nscreen test\nSFX\nspecial effect\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema - general words"}