{"id":309646,"name":"residence","type":"noun","us_sound":"ˈrez.ə.dəns","us_link":"../audio/r/residence.mp3","uk_sound":"ˈrez.ɪ.dəns","uk_link":"../audio/r/ukrerun027.mp3","content":"Add to word list\nAdd to word list\nC2 a home: the Governor's official residence in residence\nofficially staying or living somewhere: The Queen is in residence at the Palace this week.\nSee more author/poet/artist in residence\nan author (= writer), poet, or artist who is employed at a school or college, etc. for a short period: During this period, she was artist in residence at Harvard.\nSee more take up residence/residency somewhere\nto go to live somewhere: take up residence/residency in She took up residence in Canada.\nSee more\nMore examplesFewer examplesThe premier left his residence with almost indecent haste following his resignation.Number Ten Downing Street is the British prime minister's official residence.The council was hoping to turn a children's home into a residence for adolescent girls.The estate agent described the flat as a bijou residence.She has managed to obtain a temporary residence permit.\nSMART Vocabulary: related words and phrases\nHome\nabode\naccommodation\nan Englishman's home is his castle idiom\nbolthole\ncrib\ndomestically\nfold\ngaff\ngive something/someone houseroom phrase\nhabitation\nhangout\nlodging\nnest\nnon-domestic\nnon-home\npad\npremises\nrabbit hutch\nresidential\nroof\nSee more results »\nAdd to word list\nAdd to word list\nthe place where someone lives, or the condition of living somewhere: [ C ] That big building is the Governor’s official residence (= home). [ U ] She took up residence in Boston (= began living there).\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; PROPERTY a home, or the fact of living in a particular home: The property will be used as her main residence. Many banks require proof of residence to open an account. someone's place of residence\n[ U ]\n&#160; LAW\n&#160; (also residency) permission to live in a particular country that you were not born in: apply for/seek residence An estimated 60% of the workers intend to seek permanent residence.offer sb/give sb residence A 1997 law offered legal residence to many Nicaraguan expatriates See also\nprimary residence"}