{"id":309714,"name":"resilient","type":"adjective","us_sound":"rɪˈzɪl.jənt","us_link":"../audio/r/resilient.mp3","uk_sound":"rɪˈzɪl.i.ənt","uk_link":"../audio/r/ukresid009.mp3","content":"Add to word list\nAdd to word list\nable to be happy, successful, etc. again after something difficult or bad has happened: She's a resilient girl - she won't be unhappy for long. Optimists argue that the economy may prove more resilient.\nThesaurus: synonyms, antonyms, and examples\nhaving a lot of physical or mental strengthstrongHe is a big, strong man.strongTwo thirds of voters see him as a strong leader.powerfulHe is the most powerful fighter I have seen in a boxing ring.muscularHe is tall with a muscular body.muscledShe has worked hard to achieve that muscled body.\nSee more results »\nC2 able to quickly return to its usual shape after being bent, stretched, or pressed: This rubber ball is very resilient and immediately springs back into shape. resilient materials\nMore examplesFewer examplesWe realised how resilient these women and children had to be.In the study, resilient people were easily comforted by positive memories of their deceased partner.Even my doctors were surprised at how resilient I was during and after treatment. The exercise had helped make the company resilient to bad luck.\nSMART Vocabulary: related words and phrases\nPower and intensity\nascendant\nbe (as) solid as a rock idiom\nbeef\nbrunt\ncast iron\nclout\ngrunt\nintensity\ninvincibility\ninvulnerability\njuggernaut\nkeenness\nkick-ass\nrichness\nripely\nrobustness\nstridency\nsturdiness\nvirulence\nvividness\nSee more results »\nRelated word\nresilience\nAdd to word list\nAdd to word list\nable to improve quickly after being hurt or being ill: Life is hard there, but the people are resilient. resilience noun [ U ] us\nYour browser doesn't support HTML5 audio\n/rɪˈzɪl·jəns/ (also resiliency, us/rɪˈzɪl·jən·si/)\nAdd to word list\nAdd to word list\nable to return quickly to a previous good condition after problems: The US economy remains amazingly resilient.resilient to sth The portfolio is designed to be resilient to stock market troubles."}