{"id":309692,"name":"resignation","type":"noun","us_sound":"ˌrez.ɪɡˈneɪ.ʃən","us_link":"../audio/r/resignation.mp3","uk_sound":"ˌrez.ɪɡˈneɪ.ʃən","uk_link":"../audio/r/ukresid004.mp3","content":"resignation noun\n(JOB)\nAdd to word list\nAdd to word list\nC2 [ C or U ] the act of telling your employer that you are leaving your job: There have been calls for his resignation. I handed in/gave in/sent in my resignation this morning.\nMore examplesFewer examplesHer resignation came as quite a shock.The book discusses his illness and subsequent resignation from the government.There is no truth in the reports of his resignation.We must take action to stem the tide of resignations.A series of apparently unconnected events led to his resignation.\nSMART Vocabulary: related words and phrases\nRetiring & resigning\nabdicate\nabdication\nattrition\nbow\nbow out\nchuck\nchuck something in\nget off\ngolden handcuffs\ngolden handshake\ngolden parachute\nhand in your notice phrase\npension\nretd\nretire\nretired\nretiree\nretirement\nretiring\nturnover\nSee more results »\nresignation noun\n(ACCEPTING)\nC2 [ U ] a sad feeling of accepting something that you do not like because you cannot easily change it: They received the news with resignation.\nThesaurus: synonyms, antonyms, and examples\nacceptance of somethingacceptanceThe idea was slow to find general acceptance.acknowledgmentWe still await an acknowledgment of the fact that our case was handled improperly.recognitionThere was no recognition of having done anything wrong.resignationShe sighed in weary resignation.\nSee more results »\nSMART Vocabulary: related words and phrases\nTolerating and enduring\nbear with someone\nbearable\nbearably\nbide\ncome to terms with something idiom\nput up with something/someone\nresign\nresign yourself to something\nresignedly\nride something out\nrough\nsit\nstruggle\nsweat it out idiom\ntolerance\ntough\ntough something out\nwait\nwait something out\nweather the storm idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccepting & agreeing reluctantly\nresignation noun\n(LEAVING POSITION)\nAdd to word list\nAdd to word list\n[ C/U ] the act of leaving a job or position and making a statement that you are doing this: [ U ] a letter of resignation [ C ] Protesters took to the streets in massive numbers to demand the president's resignation.\nresignation noun\n(ACCEPTING DIFFICULTY)\n[ U ] the attitude of accepting something unpleasant because you cannot change it: She received the disappointing news with resignation.\nAdd to word list\nAdd to word list\nHR, WORKPLACE the act of telling your employer that you have decided to leave your job: give in/hand in/offer your resignation I resolved to hand in my resignation on Tuesday. accept sb's resignation If you say you're leaving, I won't accept your resignation. The cuts triggered a wave of resignations. a resignation letter/letter of resignation\n[ U ] the feeling of having to accept something that you do not like because you cannot easily change it: An experienced investor would accept these minor disappointments with resignation."}