{"id":309655,"name":"residential","type":"adjective","us_sound":"ˌrez.əˈden.ʃəl","us_link":"../audio/r/residential.mp3","uk_sound":"ˌrez.ɪˈden.ʃəl","uk_link":"../audio/r/ukrerun030.mp3","content":"Add to word list\nAdd to word list\nB2 A residential road, area, etc. has only private houses, not offices and factories. Compare\nnon-residential\nA residential building is one in which people live: Behind the beach are high-rise hotels and residential buildings. The architect's tallest building is a 75 storey residential tower. Compare\nnon-residential\nC2 A residential job, position, course, etc. is one for which you live at the same place where you work or study: The college runs residential courses throughout the summer. Compare\nnon-residential\nrelating to where you live or have lived: You must satisfy the residential qualifications to get a work permit.\nMore examplesFewer examplesIt was not safe to locate the chemicals factory in a residential area.Rents in residential areas are lower than in the business district.The agency deals with residential and commercial property.The residential course for writers takes place in August.\nSMART Vocabulary: related words and phrases\nTowns & regions: areas in towns & cities\nanti-development\narrondissement\nbackstreet\nbackstreets\nborough\nbotanic garden\nbusiness park\nChinatown\nhousing estate\nindustrial estate\nmarketplace\nold town\non skid row idiom\nouter ring\nplaza\nshantytown\nskid\nslummy\nsubdivision\nWimbledon\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBuildings in general\nHome\nLiving or sleeping somewhere\nAdd to word list\nAdd to word list\nof or relating to houses where people live rather than to places where they work: Glen Oaks is a residential neighborhood.\nAdd to word list\nAdd to word list\nPROPERTY a residential area or building is where people live: The business was disturbing people in the usually quiet residential area. There were 681 residential units available for rent in that area alone. Compare\ncommercial adjective\nCOMMERCE relating to homes, rather than businesses: The average annual bill for residential customers fell by $5. They are the state's second largest residential insurer. Compare\ncommercial adjective\ninvolving living in a place, as well as studying or working there: residential course"}