{"id":309652,"name":"resident","type":"noun","us_sound":"ˈrez.ə.dənt","us_link":"../audio/r/resident.mp3","uk_sound":"ˈrez.ɪ.dənt","uk_link":"../audio/r/ukrerun029.mp3","content":"resident noun [C]\n(HOME)\nAdd to word list\nAdd to word list\nB2 a person who lives or has their home in a place: a resident of the UK/Australia The local residents were angry at the lack of parking spaces. The hotel bar was only open to residents (= to people staying at the hotel).\nMore examplesFewer examplesHe entered the United States in 1988 as a permanent resident because of his marriage to a U.S. citizen.Most local residents strenuously object to the building proposals.This pool is for the use of hotel residents only.Do these parking restrictions cover residents as well as visitors?All the furniture is the work of residents here.\nSMART Vocabulary: related words and phrases\nPeople who live or settle somewhere\nasylum seeker\nboarder\nbrain drain\ncity slicker\nco-resident\nfrontiersman\nGeorgian\nguest worker\nhabitant\nillegal alien\nlodger\noccupier\nOrcadian\noutflow\noverspill\nrepeople\ntroglodyte\nvillager\nwelcome wagon\nyear-rounder\nSee more results »\nresident noun [C]\n(MEDICAL)\nUS Australian a doctor who is still training, and who works in a hospital: She's a first-year resident in oncology at Boston General Hospital. See also\nhouseman UK\nSMART Vocabulary: related words and phrases\nMedical treatment: doctors & health workers generally\nacupuncturist\naid worker\nambulanceman\nambulancewoman\nbrain surgeon\ncandy striper\ncare navigator\ncasualty officer\ndentist\nmedico\nministering angel\nNP\nnurse consultant\nnurse practitioner\nnurse specialist\nnurse's aide\noccupational therapist\nstaff nurse\nstretcher-bearer\nsurgeon\nSee more results »\nC1 living or staying in a place: She's resident abroad/in Moscow.\n[ before noun ] used to refer to someone who has a special skill or quality in a group or organization: She is the university's resident expert on Italian literature.humorous Tony is the company's resident clown.\nSMART Vocabulary: related words and phrases\nLiving or sleeping somewhere\nabide\nco-resident\nco-residential\ndomiciled\ndwell\ninhospitable\ninhospitably\nlive in\nlive in sin idiom\nlive out\npopulate\nreoccupation\nrepopulate\nrepopulation\nreside\nresidence\nsettle\nslum\ntenancy\nwarehousing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExperts and specialists\nAdd to word list\nAdd to word list\nsomeone who lives in a place: The local residents were angry at the lack of parking spaces.\nA resident is also a doctor who is working, usually in a hospital, to get practical experience and training in a special area of medicine.\nAdd to word list\nAdd to word list\nsomeone who lives in a particular building or area: The park is a popular meeting place for local residents.\nsomeone who stays in a hotel: The hotel bar was only open to residents.\nLAW a person who has the legal right to live in a particular country that they were not born in: You will be considered a US resident for tax purposes.\na doctor who is still training, and who works in a hospital: She's a senior resident on the hospital's medicine ward.\nliving or staying in a place: resident in France/Michigan/London, etc. If you want to take a British driving test you must be resident in the UK."}