{"id":309669,"name":"residual","type":"adjective","us_sound":"rɪˈzɪdʒ.ju.əl","us_link":"../audio/r/residual.mp3","uk_sound":"rɪˈzɪd.ju.əl","uk_link":"../audio/r/ukresid001.mp3","content":"Add to word list\nAdd to word list\nremaining after most of something has gone: The scanner checks travel documents for residual traces of explosives. I still felt some residual bitterness ten years after my divorce.\nMore examplesFewer examplesLocal villagers bring their evening meals to be cooked in the ovens' residual heat.Plaque is a grubby coating of bacterial film that survives on the residual sugars left over in your mouth.They clearly have some residual guilt about their treatment of their son.\nSMART Vocabulary: related words and phrases\nStaying and remaining\nabrupt halt\nbe left phrase\ncloseted\nhalt\nhang\nhold\nnon-migrant\nnon-rotating\nnon-tenured\noutstay\noverstay\nsit\nspot\nstay in\nstay on\nstay put idiom\nstick\nstick around\nsticky\nstop in\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThings remaining\na payment made to an actor, singer, writer, etc. for repeated uses of their work: He makes $60 million a year from \"Seinfeld\" residuals alone. The movie studios had wanted to exclude the Hollywood writers from residuals on its income from digital revenue. Compare\nroyalty (PAYMENT)\nMore examplesFewer examplesReagan won the right of actors to residuals when their films were shown on television.Actors held out for residuals, repeat payments made every time a commercial is shown. A cruel irony of bankruptcy law is that courts regard future residuals as assets.\nSMART Vocabulary: related words and phrases\nEarning money\nassessable\nbank\nbase pay\nbasic\nbasic income\ndisposable income\nhand over fist idiom\nin arrears idiom\nline your pocket(s) idiom\nlivelihood\nmake an honest living idiom\npro rata\nprofit from something\nprorate\npull\npull something down\nraise\nrake something in\nrevenue\nsick pay\nSee more results »\nAdd to word list\nAdd to word list\nresulting or left from something that was previously present: Residual oil has to be cleaned up.\nAdd to word list\nAdd to word list\nremaining after most of something has gone: It's a great project to work on, and will have residual benefits for years to come.\nACCOUNTING used to describe an amount of money that is left after some other payments have been made: The $60,000 to complete the project is to come from residual funds."}