{"id":309790,"name":"resistance","type":"noun","us_sound":"rɪˈzɪs.təns","us_link":"../audio/r/resistance.mp3","uk_sound":"rɪˈzɪs.təns","uk_link":"../audio/r/ukresid013.mp3","content":"Add to word list\nAdd to word list\nC2 [ U ] the act of fighting against something that is attacking you, or refusing to accept something: resistance to disease Government troops offered no resistance (to the rebels). There's a lot of resistance (= opposition) to the idea of a united Europe.\n[ U ] a force that acts to stop the progress of something or make it slower: The car's speed was reduced by air/wind resistance.\n[ C or U ]\n&#160; physics\n&#160; specialized the degree to which a substance prevents the flow of an electric current through it: Copper has (a) low resistance.\nMore examplesFewer examplesThe army is reported to be encountering considerable resistance.Bacteria are evolving resistance to antibiotics.He was famed for his stubborn resistance and his refusal to accept defeat.There has been strong resistance to the proposed tax increases.Following a determined resistance in the east, there was eventually a popular uprising in the capital.\nSMART Vocabulary: related words and phrases\nResponding to an attack\nbeat\nbeat someone off\nbeat someone/something back\ncapitulate\ncounter-assault\ncounterattack\ncountercharge\nfend someone off\nfight\nhold\npull\npull back\nrefight\nrepel\nrepulse\nresist\nstrike\nward\nward someone/something off\nwhite flag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nElectricity & electronics\nIdiom\nthe path of least resistance\nan organization that secretly fights against an enemy that has taken control of its country\nSMART Vocabulary: related words and phrases\nTaking action against people in power\nanarchist\nangry young man\nanti-apartheid\nanti-state\nbring\ninsurgency\ninsurrection\nlevel up\nmutineer\nmutinous\nred flag\nrevolt\nrevolution\nrevolutionarily\nrevolutionary\nsubversively\nsubversiveness\ntopple\ntroublemaker\nungovernable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nResponding to an attack\nAdd to word list\nAdd to word list\nscience, physics Resistance is the degree to which a substance prevents the flow of electricity through it: Copper has low resistance.\nAdd to word list\nAdd to word list\na situation in which people or organizations fight against something or refuse to accept or be changed by something: resistance to sth The government faces resistance to the bill. There should be no resistance to the new management structure\na force which acts to stop the progress of something or make it slower: The car is designed with wind resistance that cuts down gas mileage. See also\nconsumer resistance\ninvestor resistance\nsales resistance"}