{"id":309907,"name":"resolving","type":"verb","us_sound":"rɪˈzɑːlv","us_link":"../audio/r/resolve.mp3","uk_sound":"rɪˈzɒlv","uk_link":"../audio/r/ukresid023.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nresolve\nresolve verb\n(SOLVE)\nC1 [ T ] to solve or end a problem or difficulty: Have you resolved the problem of transport yet? The couple resolved their differences and made an effort to get along.\nMore examplesFewer examplesThe dispute over the song rights proved impossible to resolve.A mediator has been called in to resolve the crisis.They had an awful row several years ago, but now they've resolved their differences.The president is predisposed towards negotiation and favours a peaceful way of resolving the crisis.I'm sure these problems can be satisfactorily resolved.\nSMART Vocabulary: related words and phrases\nSolving and solutions\nband-aid solution\nbe at the bottom of something idiom\nbottom\nclear (something) up\nclue\nconquer\nfix\nholding operation\ninsolvable\niron\niron something out\nirresolvable\nit will (all) come out in the wash idiom\nkill\nresolution\nsolvable\nsolve\nsurmountable\ntalk something out\nunsolvable\nSee more results »\nresolve verb\n(DECIDE)\n[ I ] formal to make a decision formally or with determination: [ + that ] She resolved that she would never speak to him again. [ + adv/prep ] After hours of argument, they resolved against taking legal action. [ + to infinitive ] The company resolved to take no further action against the thieves.\nThesaurus: synonyms, antonyms, and examples\nto decidedecideI've decided to move to Sweden.fixUK The price has been fixed at £10.setHave you set a date for the wedding?finalizeWe've chosen a venue for the wedding, but we haven't finalized the details yet.settleOK then, we're going to Spain. That's settled.settle on/uponHave you settled on a place to live yet?\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto promise someone somethingpromiseI promise that I'll be home before dark.guaranteeI can't guarantee that the operation will be successful.give (someone) your wordHe gave me his word that the job would be finished on time.assure\"Don't worry, your car will be ready tomorrow\", the mechanic assured him.swearI didn't know what happened, I swear.pledgeWe are asking people to pledge their support for our campaign.\nSee more results »\nSMART Vocabulary: related words and phrases\nDecisions and deciding\nascription\nbe make or break for someone/something idiom\nbe on the horns of a dilemma idiom\nchoose\nclinch\nconclusion\nfix\nget it together idiom\nget something into your head idiom\nhammer something out\nhave a, some, etc. say in something idiom\nif/when it comes to the crunch idiom\njudge\nresolution\nsleep\ntake the plunge idiom\ntightrope\ntilt\ntilt the balance/scales idiom\ntop-down\nSee more results »\nPhrasal verb\nresolve something into something"}