{"id":309942,"name":"resort","type":"noun","us_sound":"rɪˈzɔːrt","us_link":"../audio/r/resort.mp3","uk_sound":"rɪˈzɔːt","uk_link":"../audio/r/ukresid029.mp3","content":"resort noun\n(PLACE)\nAdd to word list\nAdd to word list\nB1 [ C ] a place where many people go for rest, sport, or another stated purpose: a tourist resort a holiday resort a seaside/beach resort a ski resort\nMore examplesFewer examplesRimini is a thriving holiday resort on the east coast of Italy.The resort is easily accessible by road, rail and air.The resort is frequented by the rich and famous.The coastal resorts are deserted in winter.There has been an increase in outbound traffic leaving London airport for the Mediterranean resorts.\nSMART Vocabulary: related words and phrases\nTourism & holidays\nair bridge\nair corridor\namenity kit\naparthotel\nawayday\necotourism\nescape\nhigh season\nlayover\nmini-break\nphrase book\npost-holiday\nput something up\nranger station\nsightsee\nstopover\ntourism\ntourist trap\ntrailer park\nyouth hostel\nSee more results »\nresort noun\n(ACTION)\n[ U ] the fact that you have to do something because there is no other way of achieving something: He got hold of the money legally, without resort to violence.\nSMART Vocabulary: related words and phrases\nWays of achieving things\nactively\nanother\napproach\navenue\nbases\nbasis\ndevice\nformula\nmedia\nmethod\nmethodological\nmethodologically\nmethodologist\nstandard operating procedure\nstrategy\nstyleless\nstylistic\nstylistically\nthus\nvehicle\nSee more results »\nIdiom\nbe your last resort\nAdd to word list\nAdd to word list\na place where people can go on vacations to relax or for an activity they enjoy: a ski resort\nAdd to word list\nAdd to word list\n[ C ]\n&#160; COMMERCE a place where people go for a holiday: a tourist/holiday/vacation resort He developed popular tourist resorts, including Caneel Bay on St John and Mauna Kea Hotel in Hawaii. a seaside/beach/ski resort\n[ C or U ] the fact of doing something in a particular situation because there is no other way of achieving something: resort to sth A resort to more autocratic measures could be disastrous.\nfirst resort\nused for talking about the first thing that you think of doing or using in a situation: Diplomacy ought to be our first resort. I'm not advocating detention as a first resort.\nlast resort\nused for talking about something that you only think of doing or using if all other methods fail: As a last resort, savers could always open an ISA with their current bank or building society. Experts say warning labels are a last resort when a hazard can't be designed out of a product. See also\nlender of last resort"}