{"id":309956,"name":"resource","type":"noun","us_sound":"ˈriː.sɔːrs","us_link":"../audio/r/resource.mp3","uk_sound":"rɪˈzɔːs","uk_link":"../audio/r/ukresou003.mp3","content":"Add to word list\nAdd to word list\nB2 [ C usually plural ] a useful or valuable possession or quality of a country, organization, or person: The country's greatest resource is the dedication of its workers. Britain's mineral resources include coal and gas deposits.\n[ U ] formal for\nresourcefulness approving\nMore examplesFewer examplesThis book is an indispensable resource for researchers.The company is reconsidering the way in which it deploys its resources.The long war had drained the resources of both countries.Far more resources are needed to improve adult literacy.To conserve resources, please reuse this carrier bag.\nSMART Vocabulary: related words and phrases\nBelongings and possessions\naccoutrements\nasset\nbelongings\ncapital assets\nchattel\nestate\nfor\nin the name of something idiom\nlost property\nlost property office\nlost-and-found\nmaterially\npersonal property\npersonalty\npossession\nproperty\nstuff\nswag\nthing\ntoxic asset\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIntelligence\nIdiom\nhave inner resources\nto provide an organization or department with money or equipment: The school must be properly resourced with musical instruments and audio equipment.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nspare\nSee more results »\nRelated word\nresourced\nAdd to word list\nAdd to word list\nsomething that can be used to help you: The library was a valuable resource, and he frequently made use of it.\nResources are natural substances such as water and wood which are valuable in supporting life: [ pl ] The earth has limited resources, and if we don’t recycle them we use them up.\nResources are also things of value such as money or possessions that you can use when you need them: [ pl ] The government doesn’t have the resources to hire the number of teachers needed.\nAdd to word list\nAdd to word list\n[ C, usually plural ] a useful or valuable possession or quality that a person or organization has, for example, money, time, or skills: have the resources to do sth The company has the resources and infrastructure to manage a global brand. We lack the resources to do the job properly.limited/scarce resources The department has limited resources, and would struggle to cope in such a situation.pool/share resources When times are hard we are asked to pool our resources, but it doesn't always work. financial/capital resources IT/technical resources\n[ C, usually plural ]\n&#160; NATURAL RESOURCES a useful or valuable possession, such as oil or gas, that a country has and that can be sold: natural/energy/water resources All plastics that are created annually consume 2 to 4% of America's energy resources. Despite being rich in resources like timber and minerals, the country's outlook is bleak.\n[ U ] (also resourcefulness) the ability to make decisions and act on your own: He has great resource. See also\nhuman resource noun\nnatural resources\nto provide an organization or department with money or equipment: The department was chronically overstretched and seriously under-resourced."}