{"id":310085,"name":"responsible","type":"adjective","us_sound":"rɪˈspɑːn.sə.bəl","us_link":"../audio/r/responsible.mp3","uk_sound":"rɪˈspɒn.sə.bəl","uk_link":"../audio/r/ukrespo001.mp3","content":"responsible adjective\n(DUTY)\nbe responsible for someone/something/doing something\nAdd to word list\nAdd to word list\nB1 to have control and authority over something or someone and the duty of taking care of it, him, or her: Paul is directly responsible for the efficient running of the office. Her department is responsible for overseeing the councils.\nMore examplesFewer examplesThe city council is responsible for keeping the streets clean.Our practice is responsible for about five thousand patients in this part of Leeds.Council employees are responsible for the upkeep of the gardens.The Forestry Commission is responsible for preserving over 2 million acres of woodland.Nurseries are responsible for the children in their care.\nbe responsible to someone/something\nto be controlled by someone or something: In Australia, the prime minister and the Cabinet are responsible to the House of Representatives.\nSMART Vocabulary: related words and phrases\nDuty, obligation and responsibility\naccountable\naccountable to someone\naccountably\nanswer for something\nbear\nbrother\nfail\nfall to someone\nfiefdom\ngotta\nhad better/best do something idiom\nhat\nought to\nowe someone a living idiom\npass the buck idiom\npay your dues idiom\nportfolio\nsomeone's answer to someone/something idiom\nstick\nthe onus\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBeing based on or depending on something\nresponsible adjective\n(BLAME)\nbe responsible for something/doing something\nB2 to be the person who caused something to happen, especially something bad: Who is responsible for this terrible mess? Last month's bad weather was responsible for the crop failure.\nThesaurus: synonyms, antonyms, and examples\nto make something happencauseFirefighters determined that a campfire spark caused the wildfire.bring aboutMany illnesses are brought about by poor diet and lack of exercise.result inThe fire resulted in damage to their house.lead toReducing speed limits has led to fewer deaths on the motorways.makeThe heat is making me tired.arouseIt's a subject that has aroused a lot of interest.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nbe to blame for somethingbe to blameNo one can decide who is to blame.be at faultBoth the fans and the players were at fault.be someone's faultThis is all my fault.be responsibleWe're still trying to determine who was responsible for the attacks.the blame lies withSome of the blame lies with investors.the blame rests withMuch of the blame rests with the government, which has confused people with conflicting health messages\nSee more results »\nMore examplesFewer examplesThe company claims (that) it is not responsible for the pollution in the river.To some extent, she was responsible for the accident.Those responsible for these crimes must be brought to court and punished.The car is responsible for causing a lot of damage to our environment.The police seem certain (that) they will find the people responsible for the attack.\nhold someone/something responsible\nto blame someone or something: He held me personally responsible whenever anything went wrong in the project.\nThesaurus: synonyms, antonyms, and examples\nto blame someone for somethingblameHe blamed his wife for the error.lay the blame onThe bridge's architect was quick to lay the blame on the engineers.pin the blame onNo one should be looking to pin the blame on others.apportion blameWhen a company fails it isn't always possible to apportion blame.hold someone responsibleIf anything goes wrong, I will hold you responsible.take the blameIf we fail, I'll take the blame.\nSee more results »\nbe responsible for your actions\nto be in control of yourself so that you can fairly be blamed for your bad actions: The defendant was depressed and therefore not fully responsible for her own actions.\nSMART Vocabulary: related words and phrases\nGuilty\nadmission of guilt\nanswerable\nblameworthy\nblood\nconvict\nconvicted\nconviction\nculpable\nguilt\nguiltiness\nguilty\nguilty as charged idiom\nhave (someone's) blood on your hands idiom\nreconvict\nreconviction\nsuspect\nYou can also find related words, phrases, and synonyms in the topics:\nInnocent\nresponsible adjective\n(GOOD JUDGMENT)\nB2 having good judgment and the ability to act correctly and make decisions on your own: a hard-working and responsible employee Let's stay calm and try to behave like responsible adults. Many big companies are now becoming more responsible about the way they operate. Opposite\nirresponsible\nB2 A responsible job or position involves making important decisions or doing important things.\nMore examplesFewer examplesHe's grown into a fine, responsible young man.He seemed to be a responsible person, so I left him to his own devices.The company is currently trying to burnish its socially responsible image.The company is regarded as an extremely responsible employer.They were looking for someone responsible enough to be left alone with the children.\nSMART Vocabulary: related words and phrases\nWise and sensible\nbe a victory for common sense idiom\ncannily\ncanny\nclear-headed\nclear-headedly\njudicious\njudiciously\nlevel-headed\nlong-sightedness\nmethod\nreasoned\nresponsibility\nresponsibly\nright-minded\nsagacious\nvictory\nwell advised\nwily\nwisdom\nwise\nSee more results »\nRelated word\nresponsibly\nresponsible adjective\n(DUTY)\nAdd to word list\nAdd to word list\nhaving the duty of taking care of something: The government’s Energy Regulatory Board is responsible for nuclear safety.\nA responsible job/position is an important one involving control and authority over something.\nresponsible adjective\n(BLAME)\nbeing the cause of a particular action or situation, esp. a harmful or unpleasant one: We are not responsible for things getting lost in the mail.\nresponsible adjective\n(GOOD JUDGMENT)\nhaving good judgment and the ability to act correctly and make decisions on your own: We want to be responsible citizens.\nAdd to word list\nAdd to word list\nused to describe something, for example, a job, where you are able to act and make decisions on your own: It's a responsible job for which I've been well rewarded.\nbe responsible for sb/sth\nto have control and authority over someone or something and the duty to take care of them: He is responsible for the council's waste management department.\nto make something happen, especially something bad: She was responsible for causing the accident.\nbe responsible to sb/sth\nto be controlled by someone or something: Only our elected representatives, responsible to us, can make these big decisions.\nhold sb/sth responsible\nto blame someone or something for something bad that happened: He was held responsible for the accident.\nbe responsible for your actions\nto be able to be fairly blamed for bad things that you do or mistakes that you make: Although he was ill at the time, he was still responsible for his actions."}