{"id":309986,"name":"respect","type":"noun","us_sound":"rɪˈspekt","us_link":"../audio/r/respect.mp3","uk_sound":"rɪˈspekt","uk_link":"../audio/r/ukresou008.mp3","content":"respect noun\n(ADMIRATION)\nAdd to word list\nAdd to word list\nB1 [ U ] admiration felt or shown for someone or something that you believe has good ideas or qualities: I have great/the greatest respect for his ideas, although I don't agree with them. She is a formidable figure who commands a great deal of respect (= who is greatly admired by others). New teachers have to earn/gain the respect of their students. See also\nself-respect\nMore examplesFewer examplesHe inspired respect and devotion from his pupils.She won the grudging respect of her boss.You should show more respect to your parents.He has no respect for authority whatsoever.Certainly in our society teachers don't enjoy the respect that is accorded to doctors and lawyers.\nSMART Vocabulary: related words and phrases\nShowing respect and admiration\nadmiration\nadmire\nadmiring\nadmiringly\napproving\napprovingly\nforelock\nfreedom\nfulsome\nfulsomely\nfulsomeness\nglorify\ngrovelling\npay your respects idiom\nphilogyny\nput someone on a pedestal idiom\nregild\nrespectfully\nretire a number idiom\nworshipful\nSee more results »\nrespect noun\n(HONOUR)\nB1 [ U ] politeness, honour, and care shown towards someone or something that is considered important: You really should treat your parents with more respect. She has no respect for other people's property (= she does not treat it carefully).\n[ U ] a feeling that something is right or important and you should not attempt to change it or harm it: In their senseless killing of innocent people, the terrorists have shown their lack of respect for human life. She grumbled that young people today have/show no respect for the law.\n[ U ] the feeling you show when you accept that different customs or cultures are different from your own and behave towards them in a way that would not cause offence: She teaches the students to have respect for different races and appreciate the diversity of other cultures. someone's respects formal\npolite formal greetings: convey your respects to Please convey my respects to your parents.give your respects to Please give my respects to Mr Taylor when you see him. If you see Mrs Morris at the event, do convey my respects. I know my mother would want me to convey her respects. Klara asked me to give her respects to you.\nMore examplesFewer examplesThese days it goes against the grain to show respect for authority.Certainly in our society teachers don't enjoy the respect that is accorded to doctors and lawyers.Children need to be taught to have respect for other people's property.He has no respect for authority whatsoever.You should show your parents more respect.\nSMART Vocabulary: related words and phrases\nPolite and respectful\ncandy coat\ncandy-coated\nchivalric\nchivalrous\nchivalrously\ncourtliness\ncourtly\ncouth\ndeferential\ndeferentially\ngraciously\ngraciousness\nhyper-civilized\nkeep a civil tongue in your head idiom\nmanner\nrespectfully\nsugarcoat\nsuper-polite\ntactful\ntactfully\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccepting & agreeing\nMeeting people\nrespect noun\n(FEATURE)\nB2 [ C ] a particular feature or detail: This proposal differs from the last one in many important respects/one important respect. In most respects, the new film is better than the original.\nMore examplesFewer examplesThe new version is worse in every respect - I much preferred the original.It is arguable that the government has failed in this respect.His theory is deficient in several respects.It's essentially a dictionary but it differs in one or two respects.While I accept that he's not perfect in many respects, I do actually quite like the man.\nSMART Vocabulary: related words and phrases\nConditions and characteristics\n-ance\n-ibility\nability\nadverse conditions\nage\nambience\nappearance\naspect\ncharacter\ngood/bad karma idiom\nhave it in you idiom\nhood\nhumanity\npresentation\nshape\ntrait\ntrappings\nunaffiliated\nundercurrent\nvibe\nSee more results »\nIdioms\nin respect of something\npay your respects\nwith (all due) respect\nrespect verb [T]\n(ADMIRE)\nB1 to feel or show admiration for someone or something that you believe has good ideas or qualities: I deeply respect David for what he has achieved.\nThesaurus: synonyms, antonyms, and examples\nto admire someone or somethingadmireI've always admired her for her generous spirit.respectI respect her for what she has achieved, but I would have approached it very differently.think highly ofEveryone thinks highly of him.hold someone in high esteemHer colleagues in Washington hold her in very high esteem.hold someone in high regardHe contributed much to the life of York, and was held in high regard there.look up toShe was my older sister and I looked up to her.\nSee more results »\nrespect yourself\nto be proud of your own qualities or achievements: If you don't respect yourself, how can you expect others to respect you? I like to think I've raised my daughter to respect herself. I just knew that if I didn't take a stand and say something, I'd never be able to respect myself. He has a sense of his own worth - he respects himself. The whole experience has taught me to respect myself.\nMore examplesFewer examplesIt was a sane decision and one we all respected.All non-violent religious and political beliefs should be respected equally.Visitors are asked to respect the rules of the organization.We must respect the rights of sovereign nations to conduct their own affairs.David was brought up to respect authority.\nSMART Vocabulary: related words and phrases\nShowing respect and admiration\nadmiration\nadmire\nadmiring\nadmiringly\napproving\napprovingly\nforelock\nfreedom\nfulsome\nfulsomely\nfulsomeness\nglorify\ngrovelling\npay your respects idiom\nphilogyny\nput someone on a pedestal idiom\nregild\nrespectfully\nretire a number idiom\nworshipful\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nConfidence & self-assurance\nrespect verb [T]\n(HONOUR)\nto treat something or someone with kindness and care: to respect someone's feelings We should respect the environment and not pollute it.\nB2 to accept the importance of someone's rights or customs and to do nothing that would harm them or cause offence: The agreement will respect the rights of both nations. I would appreciate it if you would respect my privacy.\nto accept that something is right or important and not to attempt to change it or harm it: The president pledged to respect the existing frontiers between the two countries.\nto think that it is important to obey a law or rule: I was always taught to respect the law. respect someone's wishes\nB2 to do what someone has asked to have done: respect someone's last wishes His children respected his last wishes and held a simple funeral for him.\nSee more\nSMART Vocabulary: related words and phrases\nTreating someone well\nallowance\nbe spoilt for choice idiom\ncoddle\ncosset\ndo as you would be done by idiom\ndo someone proud idiom\nkid\nmake much/a lot of someone idiom\nmollycoddle\nmother\nnon-exploitative\npampered\npander to someone/something\nproud\nsee someone right idiom\nsmother\nspoil\ntreat\nwrap\nwrap someone (up) in cotton wool idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccepting & agreeing\nrespect noun\n(ADMIRATION)\nAdd to word list\nAdd to word list\n[ U ] admiration for someone or something that you believe has good ideas or qualities: I believe people had more respect for teachers back then.\nrespect noun\n(POLITE ATTITUDE)\n[ U ] the polite attitude shown toward someone or something that you consider important: Some drivers don’t have any respect for other motorists.\n[ U ] Respects are polite expressions of greeting or sympathy: [ pl ] Give my respects to your parents. [ pl ] We stopped by the funeral home to pay our respects.\nrespect noun\n(FEATURE)\n[ C ] a particular feature or detail: In some respects, I had to admit, I had behaved foolishly.\nrespectful adjective us\nYour browser doesn't support HTML5 audio\n/rɪˈspekt·fəl/\nThe protestors were respectful and polite. respectfully adverb us\nYour browser doesn't support HTML5 audio\n/rɪˈspekt·fə·li/\nMost old acquaintances address him respectfully as \"Governor.\"\nrespect verb [T]\n(ADMIRATION)\nto admire an ability or good quality, or to admire someone for the ability or qualities that person has: While I respected his deep knowledge of American history, he wasn’t a very effective teacher.\nin respect of\nAdd to word list\nAdd to word list\n(also with respect to) in connection with something: Legislation will be introduced in respect of the proposals in the Finance Bill.\nFINANCE in order to pay for something: I have arranged a bank transfer in respect of your invoice for January."}