{"id":310062,"name":"responded","type":"verb","us_sound":"rɪˈspɑːnd","us_link":"../audio/r/respond.mp3","uk_sound":"rɪˈspɒnd","uk_link":"../audio/r/ukresou027.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nrespond\nB2 to say or do something as a reaction to something that has been said or done: [ + speech ] To every question, he responded \"I don't know.\" I asked her what the time was, but she didn't respond. He responded by marching off and slamming the door behind him. How did she respond to the news? [ + that ] When the tax office wrote to me demanding unpaid income tax, I responded that I had been working abroad since 1998. The police respond to emergencies (= arrive and are ready to deal with emergencies) in just a few minutes.\nThesaurus: synonyms, antonyms, and examples\nto answer someoneanswer\"Thank you\", she answered.replyThe man replied that something was missing.respondWe aim to respond to all enquiries within five working days.reactHe reacted positively to the proposal.get back toI'll look into it and get back to you.explain\"What happened?\" she asked. - \"There's no time to explain!\" he said.\nSee more results »\nrespond to something\nIf diseases or patients respond to treatment, the treatment begins to cure them: It remains to be seen whether the cancer will respond to treatment. For patients who do not respond to drug treatment, surgery is a possible option.\nMore examplesFewer examplesThis disease doesn't generally respond to treatment.Terry was, as usual, slow to respond.She responded to his remarks with feigned amusement.The president responded angrily to the charge that she had lost touch with her country's people.She said how much she appreciated the overwhelming generosity of the public in responding to the appeal.\nSMART Vocabulary: related words and phrases\nAnswering & responding\nacknowledgment\naffirmative\naffirmatively\nanswer (someone) back\nclap\nclap back\nclapback\ncounter\ncrickets idiom\ndefensively\nfield\ngive\nknob\nnon-response\nnon-responsive\nreply\nrespondent\nRSVP\nthank you\nwhataboutism\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReacting and responding\nRecovering from illness"}