{"id":310102,"name":"respray","type":"verb","us_sound":"","us_link":"","uk_sound":"ˌriːˈspreɪ","uk_link":"../audio/r/cdo0622ukresp1680.mp3","content":"Add to word list\nAdd to word list\nto spray a substance (= force liquid out of a container in very small drops) onto something again: Cover the undersides of the leaves with soapy water and respray them after 10 days. Re-spray the pan, turn the heat to medium and return the pan to the hob.\n[ usually passive ] to put new paint on a vehicle by spraying it (= forcing the paint out of a container in very small drops): The old car had been resprayed in a shade of tangerine orange. He tried to cover up the accident by respraying his car and asking others to lie for him. The door will have to be replaced and the damaged bumper resprayed.\nMore examplesFewer examplesRepeat the process, re-spraying the frying pan when necessary.She was surrounded by helpers, endlessly re-spraying her hair and dabbing at her face.We are having the boat's deck professionally resprayed with a non-slip substance.The car was resprayed, and has since been in the hands of up to 20 different owners.\nSMART Vocabulary: related words and phrases\nMovement of liquids\nbacksplash\nbe dripping with something idiom\nbleed\ncounter-stream\ndecant\ndrainage\ndrip\nleakage\nreinjection\nripple\nrun a bath phrase\nrun someone/something over\nrunnel\nrunoff\nspate\nswill\nswirl\nswirling\ntop something up\ntrickle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPaints, dyes & pigments\nan occasion when a vehicle is sprayed with new paint (= has the paint put on by forcing it out of a container in very small drops): I ended up with a full car respray and two new tyres. I can't find the serial number, as the re-spray has covered it up.\nMore examplesFewer examplesAt the time of the accident, the car was already in need of a re-spray.I have just been organizing a respray of the car, so pictures should be available in the next few weeks.After sitting unused for two years at the airport, the aircraft had a respray in the new airline's colours.\nSMART Vocabulary: related words and phrases\nMovement of liquids\nbacksplash\nbe dripping with something idiom\nbleed\ncounter-stream\ndecant\ndrainage\ndrip\nleakage\nreinjection\nripple\nrun a bath phrase\nrun someone/something over\nrunnel\nrunoff\nspate\nswill\nswirl\nswirling\ntop something up\ntrickle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPaints, dyes & pigments"}