{"id":310083,"name":"responsibility","type":"noun","us_sound":"rɪˌspɑːn.səˈbɪl.ə.t̬i","us_link":"../audio/r/eus73963.mp3","uk_sound":"rɪˌspɒn.sɪˈbɪl.ə.ti","uk_link":"../audio/r/ukresou030.mp3","content":"responsibility noun\n(DUTY)\nAdd to word list\nAdd to word list\nB2 [ C or U ] something that it is your job or duty to deal with: [ + to infinitive ] It's her responsibility to ensure the project finishes on time. She takes her responsibilities as a nurse very seriously. Synonyms\ncare (PROTECTION)\ncharge (CONTROL)\ncustody (CARE)\nguardianship\nguidance\nkeeping\nprotection\ntutelage formal have responsibility\nto be in a position of authority over someone and to have a duty to make certain that particular things are done: Who has responsibility here? Jenny, you have responsibility for collecting up the books after the class. have a responsibility to someone\nto have a duty to work for or help someone who is in a position of authority over you: The company says it cannot cut its prices any more because it has a responsibility to its shareholders.\nMore examplesFewer examplesFatherhood is a lifelong responsibility.Colin Lamb has taken over responsibility for this project.The council denied that their decision represented any abdication of responsibility.We have the chance to build an outward-looking Europe that lives up to its global responsibilities.Your responsibilities will be mainly administrative.\nSMART Vocabulary: related words and phrases\nDuty, obligation and responsibility\naccountable\naccountable to someone\naccountably\nanswer for something\nbear\nbrother\nfail\nfall to someone\nfiefdom\ngotta\nhad better/best do something idiom\nhat\nought to\nowe someone a living idiom\npass the buck idiom\npay your dues idiom\nportfolio\nsomeone's answer to someone/something idiom\nstick\nthe onus\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPower to control\nresponsibility noun\n(BLAME)\nB2 [ U ] blame for something that has happened: Terrorists have claimed responsibility for (= stated that they caused) yesterday's bomb attack. The minister took/accepted full responsibility for (= admitted that he was to blame for) the disaster and resigned.\nMore examplesFewer examplesHe denied all responsibility for the rumours which have been circulating.We disclaim all responsibility for this disaster.The report exonerated the crew from all responsibility for the collision.I accept full responsibility for the failure of the plan.It's your decision - you must bear the responsibility if things go wrong.\nSMART Vocabulary: related words and phrases\nInnocent\naccuse\nacquit\nacquit someone of something\nacquittal\nbe above/beyond reproach idiom\nbe in the clear idiom\ncleared\ncome up/out smelling of roses idiom\nculpability\nculpably\nexculpate\nguiltless\nguiltlessly\ninculpable\ninnocence\ninnocency\nreproach\nsinless\nsinlessly\nsqueaky-clean\nSee more results »\nresponsibility noun\n(GOOD JUDGMENT)\n[ U ] good judgment and the ability to act correctly and make decisions on your own: He has no sense of responsibility. The job carries a lot of responsibility (= it involves making important decisions).\nSMART Vocabulary: related words and phrases\nWise and sensible\nbe a victory for common sense idiom\ncannily\ncanny\nclear-headed\nclear-headedly\njudicious\njudiciously\nlevel-headed\nlong-sightedness\nmethod\nreasoned\nresponsible\nresponsibly\nright-minded\nsagacious\nvictory\nwell advised\nwily\nwisdom\nwise\nSee more results »\nIdiom\nact/do something on your own responsibility\nresponsibility noun\n(DUTY)\nAdd to word list\nAdd to word list\n[ C/U ] a duty to take care of something: [ C ] With this promotion, Jorge’s responsibilities will be increased. [ U ] Parents must assume responsibility for their children.\nresponsibility noun\n(BLAME)\n[ U ] the cause of a particular action or situation, esp. a harmful or unpleasant one: The oil company has denied responsibility for the leak.\nAdd to word list\nAdd to word list\n[ C or U ] something that it is your job or duty to deal with: responsibility to do sth As a board member, I have a responsibility to ask questions.responsibility towards sb We have a special responsibility towards our employees.responsibility for sth She will now assume responsibility for the Logistics Division. take/delegate/share responsibility\n[ U ] blame for something that has happened: responsibility for sth I accept responsibility for the problems. The company denies responsibility for the disaster.\n[ plural ] the things you are in charge of in your job: Those who survive redundancy may feel compelled to take on increasing responsibilities. Employees' increased responsibilities are not always recognized. See also\ncorporate social responsibility\nenvironmental responsibility\nsocial responsibility"}