{"id":310091,"name":"responsive","type":"adjective","us_sound":"rɪˈspɑːn.sɪv","us_link":"../audio/r/responsive.mp3","uk_sound":"rɪˈspɒn.sɪv","uk_link":"../audio/r/ukrespo003.mp3","content":"Add to word list\nAdd to word list\nsaying or doing something as a reaction to something or someone, especially in a quick or positive way: a responsive engine a responsive audience She wasn't responsive to questioning.\nable to be improved or cured by a treatment: The disease has proved responsive to the new treatment. Opposite\nunresponsive\nMore examplesFewer examplesThe car's transmission is much smoother and more responsive than previous models.School leaders can to make their schools more responsive to diverse ethnic, linguistic, and religious student groups.The tablet has a good battery life and is very responsive to screen taps.We must develop more rapid, responsive systems for dealing with online messages.The therapy aims to make thyroid cancers more responsive to treatment with radioactive iodine.\nSMART Vocabulary: related words and phrases\nReacting and responding\nact on something\nadverse reaction\nbacklash\nbat\nbat something back\nbite\nnon-responsive\non your toes idiom\noverreact\noverreaction\npearl-clutching\nreaction\nrespond\nsupersensitivity\nticklish\nticklishly\ntoe\nultra-sensitive\nunsensitized\nwake\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRecovering from illness\nRelated words\nresponsively\nresponsiveness\nAdd to word list\nAdd to word list\nquick to act, esp. to meet the needs of someone or something: He had promised a government responsive to the people. responsiveness noun [ U ] us/rɪˈspɑn·sɪv·nəs/\nThis 5-minute procedure (= doing something to fix your computer)can let you keep more programs open and sharpen your PC's responsiveness.\nAdd to word list\nAdd to word list\nreacting quickly and well to something or someone: responsive to sth The most effective IT function is one that is responsive to the needs of the business it serves. The management offer an efficient and responsive service to local companies. responsively adverb\nThe organization is not responsively run."}