{"id":309990,"name":"respectable","type":"adjective","us_sound":"rɪˈspek.tə.bəl","us_link":"../audio/r/respectable.mp3","uk_sound":"rɪˈspek.tə.bəl","uk_link":"../audio/r/ukresou010.mp3","content":"Add to word list\nAdd to word list\nB2 considered to be socially acceptable because of your good character, appearance, or behaviour: a respectable young woman from a good family This part of the city has become quite respectable in the last ten years. I wore my boring, respectable suit to the interview.\nC2 A respectable amount or quality is large enough or of a good enough standard to be acceptable: She earns a respectable salary. The final score was a respectable 2–1.\nThesaurus: synonyms, antonyms, and examples\ngreater than the average size or amountbigThey live in a big house in the country.largeA large number of people were crowded into the room.greatThe party was a great success.enormousThey bought an enormous house in the suburbs.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\ngood enough but not excellentacceptableYour essay was acceptable, but I think you could have done better.reasonableThey have a reasonable chance of winning.adequateThe law provides adequate compensation for robbery victims.passableI speak passable Spanish. will doIt's not perfect, but it'll do.\nSee more results »\nMore examplesFewer examplesShe wrote dull, respectable articles for the local newspaper.He let out a torrent of abuse, none of it printable in a respectable daily newspaper.It's a perfectly respectable way to earn a living.She was from a very respectable family.I did the course in a respectable 45 minutes.\nSMART Vocabulary: related words and phrases\nSuitable and acceptable\nable\nacceptability\nacceptable\nacceptably\naccepted\nconvenience\nconveniently\ncorrectly\ncorrectness\ndecent\ndecently\nfelicity\nlegitimate\npractical\nre-eligibility\nre-eligible\nrelevance\nrelevant\nrelevantly\nticket\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnough\nIdiom\nmake yourself respectable\nAdd to word list\nAdd to word list\nsocially acceptable because of having a good character or appearance or behaving in a way that is approved of: It was hard to find a clean shirt that looked respectable enough to be seen in.\nRespectable also means large enough or good enough to be acceptable: a respectable income Her school has a respectable basketball program. respectability noun [ U ] us\nYour browser doesn't support HTML5 audio\n/rɪˌspek·təˈbɪl·ɪ·t̬i/\nEverything in the hotel had an air of old-time respectability."}