{"id":310320,"name":"restrict","type":"verb","us_sound":"rɪˈstrɪkt","us_link":"../audio/r/restrict.mp3","uk_sound":"rɪˈstrɪkt","uk_link":"../audio/r/ukrespo029.mp3","content":"Add to word list\nAdd to word list\nC1 to limit the movements or actions of someone, or to limit something and reduce its size or prevent it from increasing: measures to restrict the sale of alcohol The government has restricted freedom of movement into and out of the country. Having small children really restricts your social life.\nMore examplesFewer examplesThe government passed a law to restrict the sale of guns.The new guidelines have restricted opportunities for development on the edge of the city.Attempts to restrict parking in the city centre have further aggravated the problem of traffic congestion.These laws will restrict our ancient rights and liberties.This lever restricts the movement of the wheel.\nSMART Vocabulary: related words and phrases\nLimiting and restricting\nanti-libertarian\nboundary\nbox someone/something in\nchain\nchain someone to something\ncripplingly\ncrowd\ncurb\ncurtail\ncurtailment\nkeep (herself) to herself idiom\nkeep something down\nlimit\nlimitation\nlimitative\nstranglehold\nstunt\nsuffocatingly\ntempered\ntie someone down\nSee more results »\nPhrasal verb\nrestrict yourself to something\nAdd to word list\nAdd to word list\nto limit someone's actions or movement, or to limit the amount, size, etc., of something: The government has so sharply restricted his fishing that he can barely pay his crew. The state legislature voted to restrict development in the area. restricted adjective us\nYour browser doesn't support HTML5 audio\n/rɪˈstrɪk·tɪd/\nMany events are free, so families on restricted budgets can participate. restrictive adjective us\nYour browser doesn't support HTML5 audio\n/rɪˈstrɪk·tɪv/\nShe campaigned against restrictive immigration laws. restrictively adverb us\nYour browser doesn't support HTML5 audio\n/rɪˈstrɪk·tɪv·li/\nAdd to word list\nAdd to word list\nto limit something, reduce its size, or prevent it from increasing: If they want to restrict access to their pages, privacy controls are available.restrict the sale/supply/use of sth Georgia is one of 22 states that restrict the sale of raw milk for human consumption. Other recommendations included restricting the number of retail outlets that can sell tobacco.restrict sth to sb/sth They restrict these payments to employees who have been with the firm for more than a year.restrict the right of sb to do sth The Government has recently restricted the right of council tenants to buy their own homes.\nto limit someone's actions or movements: We are restricted from producing more than a certain quantity of air emissions, water effluent, or solid waste.restrict sb to sth Consumers with successful suits would be restricted to $1.5 million in damages. Phrasal verb\nrestrict yourself to sth"}