{"id":310127,"name":"rest","type":"verb","us_sound":"rest","us_link":"../audio/r/rest.mp3","uk_sound":"rest","uk_link":"../audio/r/ukrespo006.mp3","content":"rest verb\n(STOP)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to (cause someone or something to) stop doing a particular activity or stop being active for a period of time in order to relax and get back your strength: The doctor told him that he should rest for a few days. He looked away from the computer screen to rest his eyes. She promised that she would not rest (= would not stop looking) until the murderer of her son was caught and imprisoned. See also\nrest up be resting informal\nto be an actor who does not have any work: Over 90 percent of professional actors are resting at any given time. I rest my case law\n&#160; specialized (also my case rests)\nsaid by lawyers in a law court when they have finished the explanation of their case\nMore examplesFewer examples\"You look tired - you should go home and rest.\" \"I'm going to do precisely that.\"My doctor said I was looking run-down and ought to take some time to rest.We travelled by night and rested by day.She was told to stay in bed to rest her injured back.Feeling tired-out is Nature's way of telling you to rest.\nSMART Vocabulary: related words and phrases\nPassive and not working\nanywhere\nbreather\nbreathing space\nbum\nbum around\ndormancy\nidle\nlaze\nleave someone be idiom\nlie around\nmoribund\nnavel\nnon-physical\nrecharge\nsiesta\nsit on your hands idiom\nsit round\nslob\nslob around (something)\nslop around (something)\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of employment\nCinema & theatre: acting, rehearsing & performing\nLawyers & legal officials\nrest verb\n(SUPPORT)\n[ I or T, usually + adv/prep ] to lie or lean on something, or to put something on something else so that its weight is supported: She rested her head on my shoulder. The bicycle was resting against the wall.\nMore examplesFewer examplesShe sat behind the table, her chin resting in her hands.They rested the mirror against the wall.The dome rests on four marble columns.He rested his head on the cushion.The elephants were standing in a line with their front legs resting on each other's backs.\nSMART Vocabulary: related words and phrases\nReclining\ncrowd-surfing\nfetal position\nfoetal position\nfull-length\nlean\nlie\nlounge around (something)\nprone\nprone positioning\nproning\nprostrate\nprostration\nrepose\nsink\nsink into something\nsit back\nsprawl\nsprawled\nstretch\nsupine\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysical supports and supporting\nrest verb\n(REMAIN)\n[ I ] formal to remain in a particular state or place: We cannot allow the matter to rest here (= to remain as it is)- further action has to be taken.\nSMART Vocabulary: related words and phrases\nStaying and remaining\nabrupt halt\nbe left phrase\ncloseted\nhalt\nhang\nnon-migrant\nnon-rotating\nnon-tenured\noutstay\noverstay\nsit\nspot\nstay behind\nstay in\nstay on\nstay put idiom\nstick\nstick around\nsticky\nwait something out\nSee more results »\nIdioms\nlet something rest\nrest easy\nI rest my case\nrest in peace\nrest on your laurelsPhrasal verbs\nrest on someone/something\nrest on/upon something\nrest on/upon someone/something\nrest up\nrest with someone\nrest with someone/something\nrest noun\n(OTHER PART)\nthe rest [ S, + sing/pl verb ]\nA2 the other things, people, or parts that remain or that have not been mentioned: I've got two bright students, but the rest are average. I'll keep a third of the money and the rest is for you. Do you have anything planned for the rest of the day?\nMore examplesFewer examplesYou deposit 20% now and pay the rest when the car is delivered.He read her letter aloud to the rest of the family.He's a very good example to the rest of the class.It's a very nice sofa but it doesn't fit in with the rest of the room.One motorbike peeled away from the formation and circled round behind the rest.\nSMART Vocabulary: related words and phrases\nThings remaining\n(and) all the rest idiom\nbalance\nbastion\nbe left phrase\ncremains\ncutpiece\ndeposit\nground\nhangover\nredoubt\nrelic\nremainder\nremains\nremnant\nresidual\nsurvival\nthrowback\ntime capsule\nunallocated\nuneaten\nSee more results »\nrest noun\n(STOP)\nA2 [ C or U ] a period of time in which you relax, do not do anything active, or sleep: After they had carried the piano up the stairs, they stopped for a rest. The doctor prescribed some pills and told her to get/have a week's rest.\n[ C ]\n&#160; music\n&#160; specialized a period of silence between musical notes, or a symbol that represents this: a minim rest at rest\nnot doing anything active, or not moving: Her heartbeat is only 55 at rest.\nused as a polite way to say that someone is dead: Your father was a very troubled man, but he's at rest now. come to rest\nto stop, usually in a particular place: The car hit the kerb, rolled over and came to rest in a ditch.\nMore examplesFewer examplesIt's not a good idea to drive for hours without a rest.Chris phoned to say they'd arrived safely, so that really put my mind at rest.After six hours work in the garden, we sat down for a much-needed rest.I'm not tired at the moment but I will need a rest at some stage during the walk.The elderly generally need far less rest than the young, and tend to sleep in several short stretches.\nSMART Vocabulary: related words and phrases\nPeriods of time - general words\nage\nat/in one sitting idiom\nchapter\nday\ndigital age\nduration\nleeway\nlength\nlife cycle\nlifetime\nmaking\nme time\nperiod\nsession\nsleep\nspasm\ntide\ntime lag\ntime span\ntimescale\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBeats or lengths of musical notes\nPassive and not working\nImmobility\nDeath and dying\nStaying and remaining\nrest noun\n(SUPPORT)\n[ C ] an object that supports the weight of something: I used a pile of books as a rest for my telescope. See also\nheadrest\narmrest\nSMART Vocabulary: related words and phrases\nPhysical supports and supporting\nabutment\nbearing\nbolster\nbookend\nbuoy\nburden\nbuttress\ngroan\nmodillion\npier\npile\npillar\nprop\nprop something up\nrafter\nrunner\nscaffold\nsinew\nunderpin\nweight-bearing\nSee more results »\nIdioms\n(and) all the rest\nfor the rest\ngive it a rest\nthe rest is history\nrest verb\n(RELAX)\nAdd to word list\nAdd to word list\n[ I/T ] to stop being active for a period of time in order to relax and get back your strength, or to cause someone or something to stop doing an activity in order to get back strength: [ I ] We hiked for five miles and then rested for a while. [ T ] The coach decided to rest some of the team’s starters tomorrow night. [ T ] I just need to sit down and rest my legs.\nrest verb\n(STAY)\n[ I ] to be or stay under the control of a particular person or organization: The final decision rests with the City Council.\nrest verb\n(SUPPORT)\n[ I/T ] to lie or lean on something, or to put something on something else so that its weight is supported: [ T ] She rested her elbows on the table.\nIdioms\nrest assured\nrest in peace\nrest on your laurels\nrest noun\n(MUSIC)\n[ C ]\n&#160; music us/rest/ a mark in written music that shows when and for how long an instrument should not play\nrest noun\n(OTHER PART)\n[ U ] the other things, people, or parts that are left: I want to do something else with the rest of my life.\nrest noun\n(RELAX)\nat rest\nAt rest means not doing anything active or not moving: The cat seemed coiled to spring, even when it was at rest."}