{"id":310353,"name":"restructure","type":"verb","us_sound":"ˌriːˈstrʌk.tʃɚ","us_link":"../audio/r/eus75918.mp3","uk_sound":"ˌriːˈstrʌk.tʃər","uk_link":"../audio/r/ukrestr003.mp3","content":"Add to word list\nAdd to word list\nC2 to organize a company, business, or system in a new way to make it operate more effectively: The government restructured the coal industry before selling it to private owners.\nSMART Vocabulary: related words and phrases\nManaging and organizing\nadmin\nadminister\nadministration\nanti-bureaucracy\nbronze command\nfixer\nflabbily\nget up\nget your act together idiom\ngold command\nmobilize\nmount\npaperwork\nparty planner\nparty planning\nproject-manage\nrationalization\nrationalize\nscrum\nwieldy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking things better\nthe process of organizing a company, business, or system in a new way to make it operate more effectively: The department is currently undergoing a restructure. Some employees may be offered alternative employment following an organizational restructure. The restructure of the company is nearing completion and we are now in the final phase of this difficult process. Synonym\nrestructuring\nMore examplesFewer examplesThe airline has announced a major restructure of its operations.A management restructure saved the club from possible extinction.\nSMART Vocabulary: related words and phrases\nManaging and organizing\nadmin\nadminister\nadministration\nanti-bureaucracy\nbronze command\nfixer\nflabbily\nget up\nget your act together idiom\ngold command\nmobilize\nmount\npaperwork\nparty planner\nparty planning\nproject-manage\nrationalization\nrationalize\nscrum\nwieldy\nSee more results »\nAdd to word list\nAdd to word list\nto change the jobs and responsibilities within an organization, usually in order to make the organization operate more effectively: The commission developed guidelines for restructuring the city’s police department.\nAdd to word list\nAdd to word list\n[ I or T ]\n&#160; MANAGEMENT, WORKPLACE to organize a company, business, or system in a new way to make it operate more effectively: The price has gone up and down amid talk of restructuring the company. Retirees have had to accept drastically reduced retirement and health benefits as the industry has restructured. The company may also have to restructure the way it processes transactions.\n[ T ]\n&#160; FINANCE if a company restructures its debt, it arranges to pay back its debt in a different way or at a later time than was originally agreed: The merger will provide a means of restructuring the company's debt. Talks continue about restructuring a £220 million bond, which is due to be repaid in January."}