{"id":310279,"name":"restore","type":"verb","us_sound":"rɪˈstɔːr","us_link":"../audio/r/restore.mp3","uk_sound":"rɪˈstɔːr","uk_link":"../audio/r/ukrespo024.mp3","content":"Add to word list\nAdd to word list\nB2 to return something or someone to an earlier good condition or position: The badly neglected paintings have all been carefully restored. After a week in bed, she was fully restored to health (= she felt healthy again). The former leader was today restored to power in the first free elections for 20 years.\nC1 If you restore a quality or ability that someone has not had for a long time, you make it possible for them to have that quality or ability again: Doctors have restored his sight. The government is trying to restore public confidence in its management of the economy.\nto bring back into use something that has been absent for a period of time: Some people are in favour of restoring capital punishment for murderers.\nformal to give something that has been lost or stolen back to the person it belongs to: The painting was restored to its rightful owner.\nMore examplesFewer examplesThey want to restore the castle to its former glory.They're trying to restore the good name of the manufacturer.The church was recently restored after decades of disuse.The table had been lovingly restored.Ben's hobby is restoring vintage motorcycles.\nSMART Vocabulary: related words and phrases\nRestoring and reviving\nbalsam\nbounce\nbounce back\nfacelift\nflip\nlick your wounds idiom\nmodernization\nmodernize\nmove with the times idiom\nrecrudescence\nregeneration\nregenerative\nrejuvenate\nrejuvenation\nresurrect\nresurrection\nrevamp\nrevitalize\nrevival\nsnap\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGiving, bringing or getting back\nAdd to word list\nAdd to word list\nto return something or someone to an earlier condition or position, or to bring something back into existence: Power company crews were working yesterday to restore electrical service to homes in the area. Surgeons restored the sight in her right eye.\nAdd to word list\nAdd to word list\nto return something to an earlier good condition or position: The big unions want the historic link between basic state pensions and average earnings restored.restore sth to sth If you take totally abandoned land, you could restore it to profitability after about three years. The company was restored to financial health.\nto make it possible for someone to have a quality or ability again that they have not had for a long time: restore confidence/faith The move by the US Federal Reserve this week to cut interest rates has restored a lot of public confidence. The firm is battling to restore its reputation after the scandal.\nto give something that has been lost or taken, or money that is owed, back to the person it belongs to: The painting was restored to its rightful owner. The banks have restored the company's finances by deferring repayment of £588m of loans and interest. If the economy picks up, he expects to restore funding to road projects.\nto bring back into use something that has been absent for a period of time: We need to restore competition to the operating-system and browser markets. restore growth/profitability"}