{"id":310161,"name":"restart","type":"verb","us_sound":"ˌriːˈstɑːrt","us_link":"../audio/r/uscld01210.mp3","uk_sound":"ˌriːˈstɑːt","uk_link":"../audio/r/ukcld01210.mp3","content":"Add to word list\nAdd to word list\nC1 to start something again: Our car stalled and wouldn't restart. Please restart your computer to complete installation.\nMore examplesFewer examplesA freed inmate wants to restart his life.We can restart this case at any time.The plan was to restart nuclear reactors to make explosive tritium for weapons.\nSMART Vocabulary: related words and phrases\nStarting again\nback to square one idiom\ncontinue\nget back to someone\ngo back to someone\ngo on\nre-entrant\nreboot\nreborn\nrecommence\nrecommencement\nrecreation\nreinitiate\nreoccupy\nreoccur\nreoccurrence\nreopen\nreset\nslate\nstart\nwith the slate wiped clean idiom\nSee more results »\nan occasion when something is started again: The screen takes a moment to settle down after a restart. Jones, one of the original team members, was asked to lead the restart of the project.\nMore examplesFewer examplesPipeline restarts are not always smooth.I will not authorize a restart of any work activities until I'm absolutely convinced that each organization will not risk further compromise of safety.Then after many restarts, the game might finally start.\nSMART Vocabulary: related words and phrases\nStarting again\nback to square one idiom\ncontinue\nget back to someone\ngo back to someone\ngo on\nre-entrant\nreboot\nreborn\nrecommence\nrecommencement\nrecreation\nreinitiate\nreoccupy\nreoccur\nreoccurrence\nreopen\nreset\nslate\nstart\nwith the slate wiped clean idiom\nSee more results »\nAdd to word list\nAdd to word list\nto begin or start something again after it has stopped for a period of time: [ I ] Sometimes the computer wouldn't restart at all. [ T ] He offered to restart the talks which broke down last year.\nAdd to word list\nAdd to word list\nto start again or start something again: Shell outlined plans to restart production within six months. restart negotiations/talks. You should restart your computer. He will have to accept a massive wage cut to restart his career with them. Some of the North American assembly plants could restart on Saturday."}