{"id":310255,"name":"restless","type":"adjective","us_sound":"ˈrest.ləs","us_link":"../audio/r/restless.mp3","uk_sound":"ˈrest.ləs","uk_link":"../audio/r/ukrespo019.mp3","content":"Add to word list\nAdd to word list\nC1 unwilling or unable to stay still or to be quiet and calm, because you are worried or bored: He's a restless type - he never stays in one country for long. She spent a restless night (= she did not sleep well), tossing and turning. Synonym\nrestive formalCompare\nrestful\nThesaurus: synonyms, antonyms, and examples\nunhappy because nothing is interestingboredI’m so bored right now, I might as well just go to bed.bored stiffWe were bored stiff at Nan’s house.bored out of your mindI am bored out of my mind - give me a project to work on!be tired ofI'm tired of all her complaining.weary ofBoth countries are very weary of the conflict and wish for peace.\nSee more results »\nSMART Vocabulary: related words and phrases\nAnxious and worried\n(all) hot and bothered idiom\naflutter\nagitated\nangsty\nanxious\nfrightened\nfuss\nget in a sweat idiom\ngoosey\ngrim\npreoccupied\nprey\nprey on sb's mind idiom\nprey on something\nqueasily\nworried\nworriedly\nworrier\nworrywart\nwound up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBore and bored\nRelated words\nrestlessly\nrestlessness\nAdd to word list\nAdd to word list\nmoving because you are unable to relax, esp. because you are worried or bored, or (of an activity) having a lot of movement as a characteristic: He dozed off to a restless sleep. The audience began to get restless.\nRestless can also mean not satisfied with your situation and wanting a change: The opposition parties provide no clear alternative for restless voters. restlessly adverb us\nYour browser doesn't support HTML5 audio\n/ˈrest·ləs·li/\nI wandered restlessly around the apartment. restlessness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈrest·ləs·nəs/\nHe paced back and forth out of sheer restlessness."}