{"id":310215,"name":"restyle","type":"verb","us_sound":"","us_link":"","uk_sound":"ˌriːˈstaɪl","uk_link":"../audio/r/cdo0622ukrest1698.mp3","content":"Add to word list\nAdd to word list\nto change the style (= the shape or design) of something, especially so that it is more attractive: She can shorten hems, change buttons, take clothes in, or completely restyle them to suit you. The schedule will involve restyling train interiors in time for the launch of the high-speed rail link. Like many people who want to radically change their appearance, he restyled his hair.\nMore examplesFewer examplesThis type of hairspray keeps the hair smooth without fixing it in place, so you can easily restyle it between scenes.The artist Titian was engaged to restyle the painting, removing trees and adding the mountain in the background.The TV channel is attempting to restyle itself as a promoter of original British television.\nSMART Vocabulary: related words and phrases\nInventing, designing and innovation\nabsorptive capacity\narchitect\nartificer\nbionics\nblueprint\ndesign\ndesigner\ndevise\ndream something up\nergonomic\nlead time\nmodularization\nnanotechnology\nnon-imitative\noperational research\nthink outside the box idiom\nthink something up\ntrailblaze\nwhole cloth\nwind tunnel\nSee more results »\nan occasion when someone changes the style (= the shape or design) of something, or arranges it in a different way: I'll have to book myself in at the hairdresser's for a restyle. The car manufacturer has given the model a very appealing re-style.\nMore examplesFewer examplesFor the new decade, the Mustang received a restyle.Her hair needed a complete re-style.She has given the room a gorgeous restyle.\nSMART Vocabulary: related words and phrases\nChanging\nabout-face\nabout-turn\nalterable\naltered\nalternate\ndisturb\ndrip\nmeta\nmetamorphose\nmodulate\nmodulation\nmorph\nmove on\npervert\nrewrite\nsemi-domesticated\nshake someone out of something\nshake someone up\nstead\nsteepness\nSee more results »"}