{"id":310268,"name":"restoration","type":"noun","us_sound":"ˌres.təˈreɪ.ʃən","us_link":"../audio/r/restoration.mp3","uk_sound":"ˌres.tərˈeɪ.ʃən","uk_link":"../audio/r/ukrespo022.mp3","content":"Add to word list\nAdd to word list\nthe act or process of returning something to its earlier good condition or position, or to its owner: The first task following the disaster was the restoration of clean water supplies. Restoration work on the Sistine Chapel ceiling is now complete. A large majority of the population is demanding the restoration of the former government. Synonyms\nrestitution formal\nreturn (GIVING BACK)\nMore examplesFewer examplesSeveral famous alumni have agreed to help raise money for the school's restoration fund.A compromise has to be reached between all the powerful vested interests before any restoration work in the city can take place.The restoration of the building is expected to take up to five years to complete.It was cheaper to demolish the building than spend £1 million on its restoration.The restoration of the power supply to the village is expected to take a few more days.\nSMART Vocabulary: related words and phrases\nRestoring and reviving\nbalsam\nbounce\nbounce back\nfacelift\nflip\nlick your wounds idiom\nmodernization\nmodernize\nmove with the times idiom\nrecrudescence\nregeneration\nregenerative\nrejuvenate\nrejuvenation\nresurrect\nresurrection\nrevamp\nrevitalize\nrevival\nsnap\nSee more results »\nthe event in British history when Charles II was made king in 1660 after a period in which there was no king or queen\nSMART Vocabulary: related words and phrases\nRenaissance: 1501 to 1899\nancien régime\nbuccaneer\nbustle\nCarolean\nCaroline\nconquistador\nenlightenment\nIndustrial Revolution\nJacobean\nMarian\nPre-Raphaelite\nprivateer\nreformation\nregency\nrenaissance\nthe First Fleet\nthe Wild West\nVictorian\nVictoriana\nWhig\nSee more results »\nrelating to or from the Restoration: Restoration comedy/architecture/art\nMore examplesFewer examplesOne of the great themes of Shakespearean and Restoration drama is the contrast between the way things appear to be and what they really are.Honour and reputation are key themes in The Country Wife and all Restoration comedy. Heroic drama is a type of play popular during the Restoration era in England. If your dad was a coalminer or granddad came to Britain from the Caribbean in the 1950s, it might be hard to feel that an art-packed Restoration palace was part of your heritage.\nSMART Vocabulary: related words and phrases\nRenaissance: 1501 to 1899\nancien régime\nbuccaneer\nbustle\nCarolean\nCaroline\nconquistador\nenlightenment\nIndustrial Revolution\nJacobean\nMarian\nPre-Raphaelite\nprivateer\nreformation\nregency\nrenaissance\nthe First Fleet\nthe Wild West\nVictorian\nVictoriana\nWhig\nSee more results »\nAdd to word list\nAdd to word list\nthe act or the process of returning something to its original condition, or to a state similar to its original condition: [ U ] She is in charge of the restoration of paintings in the collection. [ C ] Elise has worked on a number of 19th-century building restorations.\nAdd to word list\nAdd to word list\nthe act or process of returning something to its earlier good condition or position: a restoration plan/program/project Workers have started restoration work on the two fountains. Pensioner groups have campaigned for the restoration of the link between basic pension and earnings."}