{"id":310305,"name":"restraint","type":"noun","us_sound":"rɪˈstreɪnt","us_link":"../audio/r/restraint.mp3","uk_sound":"rɪˈstreɪnt","uk_link":"../audio/r/ukrespo028.mp3","content":"Add to word list\nAdd to word list\n[ U ] calm and controlled behaviour: He showed admirable restraint, and refused to be provoked. The security forces exercised (= used) great restraint by not responding to hostile attacks and threats.\n[ C or U ] something that limits the freedom of someone or something, or that prevents something from growing or increasing: government spending restraints Lack of space is the main restraint on the firm's expansion plans. During the recession, the government opted for a policy of pay/wage restraint rather than a reduction in public investment. Synonyms\ncheck (LIMIT)\nconstraint\ncontrol (POWER)\ncurb (CONTROL)\ncurtailment\nlimit\nlimitation\nrein\nrestriction keep/place someone under restraint\nto keep a violent person in a way that prevents them from moving freely: The two prisoners were kept under restraint while they were transported between prisons.\nSee more\nSMART Vocabulary: related words and phrases\nSelf-control and moderation\nanti-pleasure\nascetically\nasceticism\nbe in command (of yourself) idiom\nboundary\ngo easy idiom\ngo steady on something idiom\ngrip\nimperviously\nmind over matter idiom\npuritanically\npuritanism\nrestrained\nrestrainedly\nrestrict\nstint\ntemperance\nundignified\nunsensational\nwillpower\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLimiting and restricting\nAdd to word list\nAdd to word list\ndetermined control over behavior in order to prevent the strong expression of emotion or any violent action: [ U ] You really have to show a lot of restraint to stay out of debt.\nA restraint is something that limits freedom of movement, action, or growth: [ C ] Social restraints seem to have become dangerously unrestrictive.\nAdd to word list\nAdd to word list\n[ C, usually plural ] a rule or an agreement that limits the freedom of a person, organization, or country, or that prevents something from growing or increasing: restraints on sth The bill urges the government to impose restraints on imports. export/import restraints budget restraints financial/fiscal/spending restraints\n[ U ] the act of preventing something from growing or increasing: The oil industry is exercising restraint.\nrestraint of trade\nCOMMERCE an illegal agreement that damages someone's ability to do business: Any contract which interferes with the free exercise of his trade or business is a contract in restraint of trade. See also\nprice restraint\nvoluntary export restraint\nwage restraint"}