{"id":310325,"name":"restriction","type":"noun","us_sound":"rɪˈstrɪk.ʃən","us_link":"../audio/r/restriction.mp3","uk_sound":"rɪˈstrɪk.ʃən","uk_link":"../audio/r/ukrestr001.mp3","content":"Add to word list\nAdd to word list\nC2 an official limit on something: import/export/currency restrictions speed/parking restrictions At the turn of the century, Congress imposed/placed a height restriction of 13 storeys on all buildings in Washington. The president urged other countries to lift the trade restrictions. Synonyms\ncheck (LIMIT)\nconstraint\ncontrol (POWER)\ncurb (CONTROL)\ncurtailment\nlimit\nlimitation\nrein\nrestraint\nMore examplesFewer examplesDo these parking restrictions cover residents as well as visitors?These restrictions infringe upon basic human rights.There are speed restrictions on this part of the road.New restrictions have been placed on the purchase of guns.A restriction on the amount of duty free that can be bought has been announced.\nSMART Vocabulary: related words and phrases\nLimiting and restricting\nanti-libertarian\nboundary\nbox someone/something in\nchain\nchain someone to something\ncripplingly\ncrowd\ncurb\ncurtail\ncurtailment\nkeep (herself) to herself idiom\nkeep something down\nlimit\nlimitation\nlimitative\nstranglehold\nstunt\nsuffocatingly\ntempered\ntie someone down\nSee more results »\nAdd to word list\nAdd to word list\nsomething that limits someone's actions or movement, or limits the amount, size, etc., of something: [ C ] You can get a discount fare, but some restrictions (= rules about limits) apply.\nAdd to word list\nAdd to word list\n[ C, usually plural ] an official limit or control on what people or companies are allowed to do, or on what can happen: impose/place/put restrictions on sth This practice imposes unneccessary restrictions on employment. ease/lift/tighten restrictions on sth Chinese officials called on the U.S. to ease restrictions on exporting high-tech goods to China. advertising/trade restrictions export/import restrictions financial/investment restrictions\n[ U ] the act of putting a limit or control on something: restriction of sth The concentration of retailing could lead to restriction of choice, higher prices, and reduced accessibility."}