{"id":310321,"name":"restricted","type":"adjective","us_sound":"rɪˈstrɪk.t̬ɪd","us_link":"../audio/r/cdo0123usrest2186.mp3","uk_sound":"rɪˈstrɪk.tɪd","uk_link":"../audio/r/ukrespo030.mp3","content":"Add to word list\nAdd to word list\nC1 limited, especially by official rules, laws, etc.: Building in this area of town is restricted. Membership is restricted to (= it is only for) chief executive officers. Our view of the stage was restricted (= objects prevented us from seeing the whole stage).\nA restricted area is one that you need official permission to enter because the police or the armed forces want to keep it secret, or because it is considered dangerous: Wellington Barracks is a restricted area and anyone who enters should have identification.\nA restricted document is one that you need official permission to read because the government wants to keep it secret. Opposite\nunrestricted\nMore examplesFewer examplesAccess to these buildings is restricted when school is in session.Job opportunities are severely restricted at the moment.Commercial sales are currently restricted.Food supplies are severely restricted.Progress has been considerable despite restricted resources.\nSMART Vocabulary: related words and phrases\nRange and limits\nall the way to idiom\nambit\nanywhere\nband\nbeyond the bounds of something\ncompass\nfinitude\ngamut\nglass ceiling\nlimit\nlimited\nparametrically\nproviso\nrealm\nscope\nspecialized\nspectrum\nspread\nstretch\nstring\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nForbidding and banning things\nOfficial documents\nAdd to word list\nAdd to word list\nlimited in amount or range: Job opportunities are severely restricted at the moment.restricted goods/service/supply Engineering work will also mean restricted services between London and the Midlands.restricted to sb/sth Access to the system is now restricted to authorized staff.\nSTOCK MARKET, WORKPLACE used to describe shares given to employees or sold to them at a reduced price, which they are then not allowed to sell for a particular period: The Company grants no restricted stock and has no long-term incentive plan. restricted shares/stock/securities"}