{"id":310436,"name":"resume","type":"verb","us_sound":"rɪˈzuːm","us_link":"../audio/r/eus73965.mp3","uk_sound":"rɪˈzjuːm","uk_link":"../audio/r/ukrestr009.mp3","content":"Add to word list\nAdd to word list\nC1 [ I or T ] If an activity resumes, or if you resume it, it starts again after a pause: Normal services will be resumed in the spring. [ + -ing verb ] He stopped to take a sip of water and then resumed speaking. The talks are due to resume today. See also\nresumption\n[ T ] If you resume a place or position that you have left for a period of time, you return to it: to resume your post/job Please resume your seats, as the performance will continue in two minutes.\nMore examplesFewer examplesThe company expects to resume production of the vehicle again after a two-month hiatus.Missile attacks on the capital resumed at dawn.Normal service resumes in ten minutes.The meeting will resume after lunch.After a short break for rain, the match resumed with both players seeking to attack.\nSMART Vocabulary: related words and phrases\nStarting again\nback to square one idiom\ncontinue\nget back to someone\ngo back to someone\ngo on\nre-entrant\nreboot\nreborn\nrecommence\nrecommencement\nrecreation\nreinitiate\nreoccupy\nreoccur\nreoccurrence\nreopen\nreset\nslate\nstart\nwith the slate wiped clean idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReturning to a place\na short statement of the important details of something: She gave us a brief résumé of the project so far.\nUS (UK CV) a short written description of your education, qualifications, previous jobs, and sometimes also your personal interests, that you send to an employer when you are trying to get a job: She sent her résumé to 50 companies, but didn't even get an interview.\nSMART Vocabulary: related words and phrases\nSummaries and summarizing\nabridgment\nabstract\nbiodata\ncatch-all\ncurriculum vitae\nexecutive summary\ngist\nhandout\nin short idiom\nrecapitulation\nshorthand\nshorthand for something idiom\nstory\nsum (something/someone) up\nsummarization\nthe long and the short of it idiom\nTLDR\nto cut a long story short idiom\ntrot\nupsum\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nApplying for a job\nAdd to word list\nAdd to word list\nto start something again after a pause or period of time: [ T ] The director hopes to resume filming next week. [ I ] Government officials hoped talks will resume.\na written statement of your educational and work experience: He looked at her résumé, asked her a few questions, and then offered her the job.\nAdd to word list\nAdd to word list\n[ I or T ] if an activity resumes, or if you resume it, it starts again after a pause: The agreement came on Saturday after talks resumed near the union's Washington headquarters. Businesses that had been disrupted also resumed normal operations.\n[ T ] to return to a position which you have left for a period of time: resume your job/post\nHR a short written description of your education, qualifications, and previous jobs which you send to an employer when you are trying to get a job: send/submit/write a résumé To apply, please submit a detailed résumé. Compare\ncurriculum vitae"}