{"id":309776,"name":"resynthesis","type":"noun","us_sound":"","us_link":"","uk_sound":"ˌriːˈsɪn.θə.sɪs","uk_link":"../audio/r/cdo0622ukresy1705.mp3","content":"resynthesis noun [U]\n(CHEMICAL PRODUCTION)\nAdd to word list\nAdd to word list\nchemistry\n&#160; specialized the process of producing a substance from simpler materials after a chemical reaction again: Calcium plays an important role in regulating the resynthesis of cGMP by guanylate cyclase. This process avoids the need for re-synthesis of many different compounds.\nMore examplesFewer examplesFollowing absorption, choline and cytidine are dispersed throughout the body, enter systemic circulation for utilization in various biosynthetic pathways, and cross the blood-brain barrier for re-synthesis into citicoline in the brain.\nSMART Vocabulary: related words and phrases\nPhysical & chemical processes\nabsorbable\nabsorptive\nabsorptive capacity\nabsorptivity\nacidification\ncorrode\ndegradable\nexcitability\nexcitation\nexcite\nexergonic\nexothermic\nexothermic reaction\nimpregnate\nre-emission\nre-emit\nreabsorb\nreact\nreboil\nscald\nSee more results »\nresynthesis noun [U]\n(SOUND PRODUCTION)\nphysics\n&#160; specialized the process of producing sound electronically again: The sound of the human voice is perceived as \"closed\" after resynthesis. the use of technology in the processes of sound analysis and resynthesis\nMore examplesFewer examplesThe task of resynthesis passes to the performer, who will use electronic or acoustic instrumental resources as they decide is appropriate.The same voices that were used for keying in the data are used for this resynthesis process.The pitch track of each source utterance was manipulated to produce, by resynthesis, two groups of five experimental utterances for each speaker.\nSMART Vocabulary: related words and phrases\nRecording sounds and images\nanalogue\naudiovisual\nbalance\ncut\ndeepfake\ndigitally\ndistort\ndistorted\nerase\nfast-forward\nmisrecord\nmix\nplay something back\npostproduction\nprerecord\nre-record\nresynthesize\nsample\nsampler\nvideotape\nSee more results »"}