{"id":310547,"name":"retailer","type":"noun","us_sound":"ˈriː.teɪ.lɚ","us_link":"../audio/r/retailer.mp3","uk_sound":"ˈriː.teɪ.lər","uk_link":"../audio/r/ukrestr019.mp3","content":"Add to word list\nAdd to word list\nC2 a person, shop, or business that sells goods to the public: a big electronics retailer\nThesaurus: synonyms, antonyms, and examples\na person who sells thingssellerWe'll need to talk to the seller and see if they'll accept your bid on the house.salespersonThe shop was so busy that it took me ages to get the salesperson's attention.salesmanHe was a used-car salesman.saleswomanShe was the company's top saleswoman.sales assistantUK Can you wave over a sales assistant? I have a question about this bracelet.\nSee more results »\nMore examplesFewer examplesRetailers have reported that consumer spending fell over the last 12 months.The clothes retailer has launched a take-over bid for its rival.Retailers have been attracted to the site by a range of incentives.The company is a retailer of office equipment and furniture.The food retailer is seeking to expand its business into clothes and electronics.\nSMART Vocabulary: related words and phrases\nPeople who sell things\nagent\nassistant\nauctioneer\nbarker\nbarrow boy\nflower girl\nfranchisee\ngallerist\nhaberdasher\nhawker\nreseller\nsales assistant\nsales force\nsales rep\nsalesclerk\ntout\ntradesman\ntradespeople\nvendor\nwholesaler\nSee more results »\nAdd to word list\nAdd to word list\na company that sells goods to the public in stores and on the internet, rather than to stores, other businesses, etc.: Manufacturers and retailers are responding to growing consumer demand. a big/large/major retailer discount/local/online retailer You can find the radio tuners at big electronics chains and local retailers. a clothing/electrical/food retailer a high-street/independent retailer\nsomeone who owns or manages a store or website that sells goods to the public: If a retailer wants to sell lots of a product then it is positioned on shelves at average eye level. See also\ngeneral retailer\nshopkeeperCompare\nwholesaler"}