{"id":310676,"name":"retest","type":"verb","us_sound":"","us_link":"","uk_sound":"ˌriːˈtest","uk_link":"../audio/r/cdo0622ukrete1712.mp3","content":"Add to word list\nAdd to word list\n[ usually passive ] to do a medical test on a person, animal, or substance again: She decided to have herself retested for Lyme disease, and found that she did not have it. People who have been in close contact with him will have to be retested after two weeks. The blood of one donor was retested and came back positive.\nto test something again in order to make sure it is safe, works correctly, etc., or to find out if something is present: The building was cleaned and retested, then opened for business on Tuesday. Consultants will re-test soil samples taken from the area.\nto give someone another set of questions in order to measure their knowledge or ability again: Secondary schools do not appear to trust data provided by primary schools, and retest all children in their first term. All employees will be re-tested in basic maths and English every three years.\nMore examplesFewer examplesAll the horses in the quarantined barn will be retested before the quarantine can be lifted.A total of 176 women had to be recalled and re-tested after the mistake was identified.We have re-tested the sun cream and can confirm the original test result of factor 15.\nSMART Vocabulary: related words and phrases\nTesting, checking and experimenting\nartefact\nassay\nbackground check\ncalibrate\ncalibration\nexperimentally\nexperimentation\nexperimenter\nfactorial\nfeeler\ninoculate\nput something to the test idiom\nrecheck\nreinspect\nreinspection\nresample\nscreening\nuntestable\nuntested\nwelfare check\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nQuestioning people & asking questions in general\nan occasion on which someone is given questions or practical activities again in order to give them a second chance to show what they know or what they can do: Students who scored \"unsatisfactory\" on the test had the option of going to summer school and taking a retest. A lot of these students get promoted even if they haven't passed the retest.\nan occasion on which someone is given a medical examination of part of their body again in order to check whether the result of the first test was correct: If you had your last blood pressure check shortly after your third cup of morning coffee, get a retest. A retest of the blood donor came back negative.\nan occasion on which something is checked again to find out if it is safe, working correctly, or effective: The company ordered a retest of the metal alloy used to make the necklaces, and is awaiting results. In the published retest, there was a wire with damaged insulation and the manufacturer was asked to check it out.\nMore examplesFewer examplesThose who failed the test were invited to attend a free summer school and take a retest.It might make sense to offer a retest to anyone whose first test was negative, just in case it's a false result.A retest has been demanded by company chiefs, after the compact model of the car fared badly in a crash test.\nSMART Vocabulary: related words and phrases\nExams, tests & exercises\nachievement test\nAdvanced Placement\nAP\naptitude test\nassessment\ncan do phrase\nexternal examination\nfail\nmoderate\noral\npop quiz\npractical\nprobation\nprobationary\nproctor\npsychometric\nquiz\nre-mark\nrubric\nsit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical examination\nTesting, checking and experimenting"}