{"id":310663,"name":"retention","type":"noun","us_sound":"rɪˈten.ʃən","us_link":"../audio/r/retention.mp3","uk_sound":"rɪˈten.ʃən","uk_link":"../audio/r/ukretar004.mp3","content":"Add to word list\nAdd to word list\nC2 the continued use, existence, or possession of something or someone: Two influential senators have argued for the retention of the unpopular tax. The retention of old technology has slowed the company's growth. water/heat retention\nSMART Vocabulary: related words and phrases\nKeeping and storing things\nappropriate\naside\nbank\nbogart\ncapacitance\ncling\ndump\nkeep (something/someone) back\nkept\nlay\nlay something aside\nlay something down\nlay something in\nlodge\nstash\nstockpile\nstockpiling\nstorage\nstore\ntrap\nSee more results »\nAdd to word list\nAdd to word list\nthe ability to keep or continue having something: Officials are focusing on job creation, not job retention. retentive adjective us\nYour browser doesn't support HTML5 audio\n/rɪˈten·tɪv/\na retentive memory\nAdd to word list\nAdd to word list\n[ U ]\n&#160; HR, WORKPLACE the ability of a company to keep its employees and stop them from going to work somewhere else: The study found that mentoring programs have a positive impact on teachers and their retention. Health benefits are an important recruitment and retention tool. Both these organizations have improved staff retention by paying great attention to office design. Employee retention is one of the major issues confronting business today.\nCOMMERCE the ability of a company to keep its customers, rather than losing them to competitors: Revenue growth, in turn, is achieved by pursuing growing market segments, by finding new customers, and by improving the retention of existing customers.customer/client retention Customer retention is the key to profitable growth. The unit has a client retention rate of 85%.\n[ C ]\n&#160; ACCOUNTING an amount of money that is owed to someone for doing work but that is not paid until the work has been completed in a satisfactory way: If a withheld retention is disputed, the contractor is generally entitled to adjudication.\n[ U ] the continued use or possession of something or someone: The city has traditionally favoured the retention of space for business and employment uses, but some residences are now being built. The company denied that there were any problems with its document retention procedures."}