{"id":310693,"name":"rethink","type":"verb","us_sound":"ˌriːˈθɪŋk","us_link":"../audio/r/rethink.mp3","uk_sound":"ˌriːˈθɪŋk","uk_link":"../audio/r/ukretar007.mp3","content":"Add to word list\nAdd to word list\nC1 to think again about a plan, idea, or system in order to change or improve it: Her family's disapproval made her rethink her plans. [ + question word ] The European Commission is having to rethink how it can maintain farmers' incomes while cutting costs and excess production.\nThesaurus: synonyms, antonyms, and examples\nto think carefully about somethingconsiderDon't make any decisions before you've considered the matter.contemplateHe lay in a hospital bed contemplating his future.ponderShe sat back for a minute to ponder her next move in the game.mull overI need a few days to mull things over before I decide.reflectI spent a lot of time reflecting on what he'd said.agonizeShe agonized for days before agreeing to take the job.\nSee more results »\nMore examplesFewer examplesWe're in the middle of rethinking our strategy.So we had to step back and rethink our approach.People are rethinking what they're doing with their lives.\nSMART Vocabulary: related words and phrases\nThinking and contemplating\na brown study idiom\nagonize\nagonize over/about something\nbeard-stroking\nbethink\nharbour\nin the cold light of day idiom\nintrospect\nintrospection\njoined-up thinking\nlateral thinking\nnavel\nreckon\nreflection\nrumination\nrun through someone's mind/head idiom\nscratch your head idiom\nself-contemplation\nself-exploration\nweigh\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChanging your mind\nthe act of thinking again about a plan, idea, or system in order to change or improve it: This new information means we should have a rethink. We probably need a rethink.\nMore examplesFewer examplesWe need a complete rethink of our maternity and parental leave.It's forcing a rethink of economic policy. I told him to take a break and have a rethink about the rest of the meeting.\nSMART Vocabulary: related words and phrases\nThinking and contemplating\na brown study idiom\nagonize\nagonize over/about something\nbeard-stroking\nbethink\nharbour\nin the cold light of day idiom\nintrospect\nintrospection\njoined-up thinking\nlateral thinking\nnavel\nreckon\nreflection\nrumination\nrun through someone's mind/head idiom\nscratch your head idiom\nself-contemplation\nself-exploration\nweigh\nSee more results »\nAdd to word list\nAdd to word list\nto think again about something, such as a plan in order to change or improve it: It’s time to rethink whether we need a part-time or full-time mayor.\nAdd to word list\nAdd to word list\nto think again about a plan, idea, or system in order to change or improve it: The company is rethinking its position on homeworkers.rethink how/what etc. Retailers are paying more attention to male shoppers, rethinking how their goods are marketed and displayed. The agency needs to rethink its strategy.\nan act of thinking again about a plan, idea, or system in order to change or improve it: The incident led to a rethink of the department's health and safety policies.a complete/fundamental/radical rethink A fundamental rethink on executive pay is needed."}