{"id":310854,"name":"retirement","type":"noun","us_sound":"rɪˈtaɪr.mənt","us_link":"../audio/r/retirement.mp3","uk_sound":"rɪˈtaɪə.mənt","uk_link":"../audio/r/ukretar023.mp3","content":"Add to word list\nAdd to word list\nB2 the act of leaving your job and stopping working, usually because you are old: Many teachers over the age of 50 are taking early retirement. What is the normal retirement age in this country?\nB2 the period in someone's life after they have stopped working because of having reached a particular age: We wish you a long and happy retirement.\nMore examplesFewer examplesThey held a dinner to celebrate his retirement.She's trying to lay something aside for her retirement.There have been persistent rumours that the managing director might take early retirement.I'm sure everyone will join me in wishing you a very happy retirement.Her retirement from politics will free her to write her memoirs.\nSMART Vocabulary: related words and phrases\nRetiring & resigning\nabdicate\nabdication\nattrition\nbow\nbow out\nchuck\nchuck something in\nget off\ngolden handcuffs\ngolden handshake\ngolden parachute\nhand in your notice phrase\npension\nretd\nretire\nretired\nretiree\nretiring\nserve out\nturnover\nSee more results »\nAdd to word list\nAdd to word list\nthe point at which someone stops working, esp. because of having reached a particular age or because of ill health, or the period in someone’s life after the person has stopped working: [ C ] He announced his retirement in September.\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; WORKPLACE, HR the fact of leaving your job and stopping working, usually because you have reached a particular age: With retirement less than three years away, she began to worry about her personal finances. More people are taking early retirement. The union opposes raising the retirement age because of safety concerns. He announced his retirement in April in the face of mounting criticism. The stakeholder plan will allow 25% to be taken as tax-free cash on retirement.\n[ C or U ]\n&#160; WORKPLACE, HR the period in someone's life after they have stopped working because they reached a particular age: We wish you a long and happy retirement His pensions and the money from the state meant he had a comfortable retirement. Many younger workers are more focused on paying off debts or making their mortgage payments than saving for (their) retirement.\n[ U ]\n&#160; ACCOUNTING, FINANCE the act of paying back a debt completely: There will be a one-time charge of $29 million, or 15¢ a share, from the early retirement of debt. See also\ncompulsory retirement\ndebt retirement\nearly retirement\nmandatory retirement"}