{"id":310848,"name":"retire","type":"verb","us_sound":"rɪˈtaɪr","us_link":"../audio/r/retire.mp3","uk_sound":"rɪˈtaɪər","uk_link":"../audio/r/ukretar020.mp3","content":"retire verb\n(STOP WORKING)\nAdd to word list\nAdd to word list\nB1 [ I ] to leave your job or stop working because of old age or ill health: Since retiring from the company, she has done voluntary work for a charity. He is due to retire as chief executive next year.\n[ I ] to stop taking part in a race or competition because of illness or injury: She retired from the competition after pulling a leg muscle.\n[ T often passive ] to make someone leave their job, usually at a time when they are near to the age at which they would normally stop working, or because of illness: Following the merger, he was retired with a generous pension.\nMore examplesFewer examplesHe is planning to retire from politics next year.Most female models have to retire around the age of 25, whereas a well-preserved man can go on working into his forties.He'll get £50 000 from the company when he retires, which is a tidy sum.She became Emeritus Professor of Linguistics when she retired.He now thinks that retiring early was a stupid thing to do.\nSMART Vocabulary: related words and phrases\nRetiring & resigning\nabdicate\nabdication\nattrition\nbow\nbow out\nchuck\nchuck something in\nget off\ngolden handcuffs\ngolden handshake\ngolden parachute\nhand in your notice phrase\npension\nresignation\nretd\nretired\nretiree\nretirement\nretiring\nturnover\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWinning, losing & scoring in sport\nFiring staff\nretire verb\n(LEAVE A PLACE)\n[ I ] formal to leave a room or group of people and go somewhere quiet or private: After dinner our host said, \"Shall we retire to the drawing room?\"\n[ I ] formal or old-fashioned to go to bed: It had been a long day, so I retired early.\nSMART Vocabulary: related words and phrases\nDeparting\nabandon\nabandon ship\nabandonment\nabsquatulate\nbackward\ngone\nmove\np.o.q.\npeel away/off\npiss off\npull\npull out\npull something off\npush along\nsea\nturf something out\nvacate\nvamoose\nwalk\nwalk off (somewhere)\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal physiology: sleep & sleeping\nIdiom\nretire a number\nretire verb\n(STOP WORKING)\nAdd to word list\nAdd to word list\n[ I/T ] to leave your job or stop working because of having reached a particular age or because of ill health, or to cause someone or something to stop being employed or used: [ I ] He worked in television after retiring from baseball. [ I ] I’ll be retiring soon. [ T ] The aircraft was retired in 1990.\nretire verb\n(LEAVE A PLACE)\n[ I ] fml to leave a room or group of people and go somewhere quiet or private: The judge retired to her study to review the case.\n[ I ] fml To retire also means to go to bed. retired adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/rɪˈtɑɪərd/\nHe is a retired airline pilot.\nAdd to word list\nAdd to word list\n[ I ]\n&#160; HR, WORKPLACE to leave your job or stop working, usually because of your age or ill health: She has no plans to retire.retire from sth Jenkins retires from the firm this year.retire as sth Elkin has retired as a director after 12 years on the boardretire at sth Can I get hold of the cash in my pension fund before I retire at 65? James had to retire early after suffering three heart attacks in 2007.\n[ T, often passive ]\n&#160; HR, WORKPLACE, MANAGEMENT if an employer retires an employee, they make the employee leave their job, usually because they are near the age at which they would normally stop working, or because they are ill: He was retired early by his firm. Companies typically retire workers at 60 and then hire about half of them back, often at 50-70% of their previous pay.\n[ T ]\n&#160; FINANCE to pay back a debt or loan completely: The funds were used to retire debt and to finance expansion. Even after the state reduced benefits to workers and raised taxes on employers, it took until 2010 to retire that loan.\n[ T ] to take a machine or piece of equipment out of use because it is old and no longer useful: The European-made Concorde was retired from British and French service in 2005. Among the other measures is a $35 rebate to retire older refrigerators for newer, more efficient ones."}