{"id":311011,"name":"retrench","type":"verb","us_sound":"rɪˈtrentʃ","us_link":"../audio/r/usresto021.mp3","uk_sound":"rɪˈtrentʃ","uk_link":"../audio/r/ukretre004.mp3","content":"Add to word list\nAdd to word list\n[ I ] formal If governments, companies, etc. retrench, they start spending less money, or reducing costs: The company had to retrench because of falling orders. The Government began to retrench on its nuclear programmes.\n[ T ] Australian English or South African English to remove a worker from his or her job as a way of reducing costs: The government is to retrench 30,000 public servants in the next three years. An employee you retrenched may be able to bring an unfair dismissal claim.\nMore examplesFewer examplesNorth Carolina is not retrenching on its spending on education.The president had planned to take more lavish offices but was forced to retrench amid criticism from Congress and the public.In 2011 some people were retrenched.A New South Wales cleaning contractor retrenched an employee using a standard retrenchment letter.\nSMART Vocabulary: related words and phrases\nEconomics\naccommodative\nanti-economic\nanti-inflation\nanti-inflationary\nanti-recession\ndeindustrialization\ndouble-dip\nGDP\nhuman development index\nindustrialism\ninflation\nKeynesian\nliberal\nmarket economy\nmarketeering\nmonetary\npeace dividend\nretrenchment\nstagflation\nthe public purse\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFiring staff\nAdd to word list\nAdd to word list\n[ I ]\n&#160; MANAGEMENT, FINANCE if governments, companies, etc. retrench, they start spending less money, or reducing costs: Some large corporate R&amp;D departments have retrenched. It's time to retrench and refocus on our key brands. The company retrenched and cut staff in the face of the impending downturn.\n[ T ]\n&#160; HR, WORKPLACE\n&#160; Australian English to remove a worker from their job as a way of reducing costs: With the level of unemployment already so high, the thought of approximately 10,000 workers being retrenched is difficult to bear. See also\nlay sb off"}