{"id":311041,"name":"retrieve","type":"verb","us_sound":"rɪˈtriːv","us_link":"../audio/r/retrieve.mp3","uk_sound":"rɪˈtriːv","uk_link":"../audio/r/ukretre011.mp3","content":"Add to word list\nAdd to word list\nC2 to find and bring back something: We taught our dog to retrieve a ball. Computers are used to store and retrieve information efficiently.\nThesaurus: synonyms, antonyms, and examples\nto access something on a computer, tablet, or smartphoneaccessI tried to access the site, but my browser became unresponsive.downloadI downloaded the software and installed it.uploadI uploaded my changes, and the site went live.retrieveThe data can be retrieved in a fraction of a second.\nSee more results »\nMore examplesFewer examplesThis software helps firms archive and retrieve emails.They've managed to retrieve most of the data.Did they manage to retrieve anything from the fire?She bent over to retrieve her bag from where it had fallen under the seat.Goodwill that is lost is extremely difficult to retrieve.\nSMART Vocabulary: related words and phrases\nGiving, bringing or getting back\nbring\nbring something back\nchargeback\nclaw something back\ngiver\nput\nrecovery\nrefund\nregain\nregrow\nreintroduce\nreintroduction\nreplace\nsend something back\nsyndication\ntake something back\nturn\nturn in\nturn something over to someone\nuncollectable\nSee more results »\nRelated word\nretrieval\nAdd to word list\nAdd to word list\nto find and bring back something: Important historic documents were retrieved from a dumpster last week. retrieval noun [ U ] us\nYour browser doesn't support HTML5 audio\n/rɪˈtri·vəl/\ninformation storage and retrieval\nAdd to word list\nAdd to word list\nIT to get stored information from a computer: retrieve data/information I finally managed to retrieve the deleted data.retrieve a record/image/file, etc. The search is designed to retrieve all the records WorldCat has for a particular book.retrieve sth from sth The product helps retrieve accidentally deleted image files from virtually any kind of removable media for digital cameras.\nto get something back that has been lost, taken, or left somewhere: The company has taken legal action to retrieve the stolen cash.retrieve sth from sb/sth He retrieved the documents from his colleague's desk."}