{"id":311127,"name":"retrogradation","type":"noun","us_sound":"ˌret.roʊ.ɡrəˈdeɪ.ʃən","us_link":"../audio/r/cdo1121usretr3653.mp3","uk_sound":"ˌret.rəʊ.ɡrəˈdeɪ.ʃən","uk_link":"../audio/r/cdo1121ukretr3674.mp3","content":"Add to word list\nAdd to word list\n[ C or U ]\n&#160; physics movement in a direction that is, or seems to be, the opposite to that of most other stars, planets, etc. : The distance of any planet from the sun may be obtained from a measurement of the arc of retrogradation in a given time. The middle of the retrogradation always occurs when Saturn is nearly in opposition to the Sun.\nMore examplesFewer examplesAdd to that volcanic eruptions that coincide with the retrogradation of the sun, and we could get a global cooling.Because of the upcoming retrogradation of the sun around the barycentre, she says we can expect to encounter climatic extremes.In a systematic astronomy, retrogradations become part of the conceptual structure of the system.\nSMART Vocabulary: related words and phrases\nAstronomy\nalbedo\nAndromeda\nAquarius\nAries\nasteroid\ngalactic\ngalaxy\nGemini\ngeostationary orbit\ngibbous\nnova\nobservatory\norbit\norbital\nOrion\nsubstellar\nsunspot\nsupergiant\nsupermassive\nsupermoon\nSee more results »\n[ U ]\n&#160; chemistry a reaction in which the structure of starch (= a white substance that exists in large amounts in, for example, potatoes and rice) changes when it cools after being cooked : Retrogradation is a reaction that takes place in gelatinized starch when the amylose and amylopectin chains realign themselves. Bread kept in a refrigerator will develop mould growth more slowly than bread kept at room temperature, but will turn stale quickly due to retrogradation.\nMore examplesFewer examplesAs soon as bread is cooked and has cooled it begins to go stale. This is caused by a breakdown in the gel structure called retrogradation.When steamed Chinese manju are cooled or frozen, they often become hard due to retrogradation of gelatinized starch.Hardening or loss of flexibility of tortillas is believed to be due to a physico-chemical change in the starch constituent of tortillas which is known as retrogradation.\nSMART Vocabulary: related words and phrases\nChemistry - general words\nacceptor\naerosol\naerosolize\nallotrope\namphiprotic\nchemical formula\ndistilled water\nelectrolyte\nendocrine disruptor\nendothermic\nepitaxial\nepitaxially\nepitaxy\ninorganic chemistry\nionic bond\nnonelectrolyte\nnonreactive\npreatomic\nreactive\nreactivity\nSee more results »"}