{"id":310960,"name":"retransfer","type":"verb","us_sound":"","us_link":"","uk_sound":"ˌriː.trænsˈfɜːr","uk_link":"../audio/r/cdo0622ukretr1722.mp3","content":"Add to word list\nAdd to word list\nto move something such as money or goods back to the person who owned it before or to the place where it came from: The insured may retransfer the contract to the original insurer as from the date of the demand. The executors were ordered to retransfer the shares to the plaintiffs.\nMore examplesFewer examplesThe government could not escape liability by retransferring assets to separate juridical entities.The shareholder transfers the shares to the lender subject to an agreement to re-transfer them when the loan is repaid.It is possible to make an outright transfer of the asset, with a provision that the asset be re-transferred once the secured obligations are repaid.\nSMART Vocabulary: related words and phrases\nChanging homes & moving\n(furniture) remover phrase\nanti-immigrant\nanti-immigration\nasylum seeker\ndeinstitutionalize\ndiaspora\ngreener pastures idiom\nimmigrant\nimmigration\nmigrant\nmigrate\nmover\npasture\nrelocate\nrelocation\nremoval\nremovalist\nremover\nsettle\nstake\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInheriting & bequeathing\nthe process or act of moving something such as money or goods back to the person who owned it before or to the place where it came from: A bill of sale has a provision allowing for the re-transfer of the goods upon repayment of the debt. Investigating the company's assets and their many transfers and re-transfers is a very complex process.\nMore examplesFewer examplesA decree could be passed by the courts against the executors for the retransfer of the shares. The transfer and retransfer of the woman's beach home was integral to the plot.The exchange took place without a re-transfer of money.\nSMART Vocabulary: related words and phrases\nTransferring and transporting objects\nbear\nbearer\nbike\nbike rack\nborne\nbring\nbudge\ncall for someone\nchauffeur\nconvey\nhump\nimport\npickup\nportable\nportage\npost-delivery\nput something/someone down\ntransplant\ntransportation\ntruck\nSee more results »"}