{"id":311017,"name":"retrenchment","type":"noun","us_sound":"rɪˈtrentʃ.mənt","us_link":"../audio/r/usresto023.mp3","uk_sound":"rɪˈtrentʃ.mənt","uk_link":"../audio/r/ukretre006.mp3","content":"Add to word list\nAdd to word list\na situation in which a government, etc. spends less or reduces costs: In retrenchment, central government may seek to limit the total expenditure of all local governments for economic stabilization. Experts see a major retrenchment coming from consumers.\nAustralian English or South African English a situation in which someone loses their job because their employer does not need them : The downturn in business has resulted in many retrenchments. Facing retrenchment can be a frightening experience. Synonym\nredundancy (NOT EMPLOYED) UK\nMore examplesFewer examplesThe worsening economic environment has seen a sharp retrenchment in electronics sales.Plans for such a significant fiscal retrenchment come at a vulnerable time for the world economy.Bank employees have suffered from mass retrenchments. One fifth of the sample had experienced unemployment through retrenchment in the manufacturing industries.\nSMART Vocabulary: related words and phrases\nEconomics\naccommodative\nanti-economic\nanti-inflation\nanti-inflationary\nanti-recession\ndeindustrialization\ndouble-dip\nGDP\nhuman development index\nindustrialism\ninflation\nKeynesian\nliberal\nmarket economy\nmarketeering\nmonetary\npeace dividend\nretrench\nstagflation\nthe public purse\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFiring staff\nAdd to word list\nAdd to word list\nMANAGEMENT, FINANCE the act of spending less or reducing costs: The closures will be the first substantial retrenchment at the store for 10 years. The big retrenchment in aerospace manufacturing in the early 1990s eventually infected the entire state economy. Businesses are going for growth, after the retrenchment of recent years.\nHR, WORKPLACE\n&#160; Australian English the act of removing a worker from a job as a way of saving the cost of employing them: Some firms are using retrenchments as a cost reduction measure. This resulted in the retrenchment of 40,000 public servants."}