{"id":310997,"name":"retreat","type":"verb","us_sound":"rɪˈtriːt","us_link":"../audio/r/retreat.mp3","uk_sound":"rɪˈtriːt","uk_link":"../audio/r/ukretre002.mp3","content":"retreat verb\n(POSITION)\nAdd to word list\nAdd to word list\nC2 [ I often + adv/prep ] to go away from a place or person in order to escape from fighting or danger: Attacks by enemy aircraft forced the tanks to retreat (from the city). When she came towards me shouting, I retreated (behind my desk).\nThesaurus: synonyms, antonyms, and examples\nto go backwardsreverseThe road ahead was blocked by a tree so I had to reverse. backI backed into the drive.back upI backed up into an empty parking space.retreatShe retreated hastily back up the stairs.pull backUN peacekeepers have pulled back from the border.withdrawThe British army withdrew from Dunkirk in 1940.\nSee more results »\nC2 [ I ] to go to a quiet safe place in order to avoid a difficult situation: When he's done something wrong, he retreats to his bedroom.\nMore examplesFewer examplesFire fighters had to retreat from the fierce heat.On seeing us, the deer stood stock-still for a moment, then turned and retreated into the forest.The army was forced to retreat.I saw her coming and retreated.They retreated to the relative safety of the forest.\nSMART Vocabulary: related words and phrases\nResponding to an attack\nbeat\nbeat someone off\nbeat someone/something back\ncapitulate\ncounter-assault\ncounterattack\ncountercharge\nfend someone off\nfight\nhold\nparry\npull\npull back\nrefight\nrepel\nrepulse\nresist\nresistance\nstrike\nwhite flag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRunning away and escaping\nretreat verb\n(DECISION)\n[ I often + adv/prep ] to decide not to do something, or to stop believing something, because it causes too many problems: The government is retreating from its promises.\nSMART Vocabulary: related words and phrases\nChanging your mind\n180\nabout-face\nabout-turn\nback away\nback out\ncave in\ncold\ngo back on something\nhave another think coming idiom\nmake a 180\nmake an about-face\nmake an about-turn\nmove\npull out\nshift\nshift (your) ground idiom\nthere's no turning back idiom\nthink again idiom\nthink better of something idiom\ntime-server\nSee more results »\nretreat verb\n(PRICE)\n[ I ] If a price retreats, it goes down after it has gone up: Wheat prices retreated after a two-day increase.\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nabridgment\nattenuate\nattenuated\nattenuating\nattenuation\nboil\ndamp\nfall off\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nroll back something\nrollback\nrun someone/something down\nrundown\nsag\nshave\ntelescope\ntumble\nSee more results »\nretreat noun\n(POSITION)\nC2 [ C usually singular, U ] a move back by soldiers or an army, either because they have been defeated or in order to avoid fighting: the retreat from Dunkirk Enemy soldiers are now in (full) retreat.\nC2 [ C ] a private and safe place: a country/mountain/lakeside retreat\n[ C or U ] a period of time used to pray and study quietly, or to think carefully, away from normal activities and duties: We went on (a) retreat at/to a monastery in Wales.\nMore examplesFewer examplesWe saw the rain and made a hasty retreat into the bar.The battle ended in an ignominious retreat from the front line.The luxury resort is used as a retreat by the rich and famous.The book discusses 10 famous military retreats.Thousands of soldiers died during the retreat.\nSMART Vocabulary: related words and phrases\nResponding to an attack\nbeat\nbeat someone off\nbeat someone/something back\ncapitulate\ncounter-assault\ncounterattack\ncountercharge\nfend someone off\nfight\nhold\nparry\npull\npull back\nrefight\nrepel\nrepulse\nresist\nresistance\nstrike\nwhite flag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSafe & enclosed spaces\nTime off\nretreat noun\n(DECISION)\n[ C ] a change from previous beliefs or behaviour: The professor's speech marked/signalled a retreat from his usual extreme views.\nSMART Vocabulary: related words and phrases\nChanging your mind\n180\nabout-face\nabout-turn\nback away\nback out\ncave in\ncold\ngo back on something\nhave another think coming idiom\nmake a 180\nmake an about-face\nmake an about-turn\nmove\npull out\nshift\nshift (your) ground idiom\nthere's no turning back idiom\nthink again idiom\nthink better of something idiom\ntime-server\nSee more results »\nretreat noun\n(PRICE)\n[ S or U ] a situation in which the price of something goes down: Over the past few weeks we have seen the currency's big retreat from its historic high.\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nabridgment\nattenuate\nattenuated\nattenuating\nattenuation\nboil\ndamp\nfall off\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nroll back something\nrollback\nrun someone/something down\nrundown\nsag\nshave\ntelescope\ntumble\nSee more results »\nAdd to word list\nAdd to word list\nto move back and away from someone or something, esp. because you are frightened or want to be alone: She burst into tears and retreated to the bedroom.\nTo retreat is also to go away from a person or place because you are unwilling to fight any more: Under heavy fire, the soldiers retreated.\nthe act of going away from a person or place because you are unwilling to fight any more or are frightened: [ U ] Rebel soldiers were in (full) retreat.\nA retreat is also a private and safe place where you can be alone.\nAdd to word list\nAdd to word list\nFINANCE, STOCK MARKET to become lower in value or amount, especially after getting higher: Wheat prices retreated after a two-day increase. By the end of business, the dollar had retreated by a full percentage point against the euro.retreat to sth Share prices retreated 28p to 721p.retreat from sth Other high-tech stocks retreated from strong gains earlier in the week.\nto stop doing something, because it causes too many problems: retreat from sth The company retreated from the US market in the late 1990s.\nFINANCE, STOCK MARKET a fall in the price, amount, etc. of something, especially after having been high: a retreat from sth Over the past few weeks we have seen the currency's big retreat from its historic high. The FTSE 100 was also in retreat as London traders responded to falls on Wall Street.\na decision not to do something you had planned to do, because it causes too many problems"}