{"id":311257,"name":"retune","type":"verb","us_sound":"ˌriˈtuːn","us_link":"../audio/r/cdo0622usretu1558.mp3","uk_sound":"ˌriːˈtʃuːn","uk_link":"../audio/r/cdo0123ukretu2522.mp3","content":"retune verb [I or T]\n(MUSICAL INSTRUMENT)\nAdd to word list\nAdd to word list\nto tune a musical instrument (= change some parts on it) again so that it produces the correct sounds when played, or to change it so that it produces higher or lower sounds than usual : Near the end the soloist had to retune her violin while the orchestra went on without her. The band keep guitars dedicated to those tunings so they don't have to re-tune between songs.\nMore examplesFewer examplesI was trying to figure out how I could play in a minor key without having to retune the guitar.For this song, he retuned his electronic keyboard so that the lowest note was at the right end and the highest at the left.\nSMART Vocabulary: related words and phrases\nFrequency & regularity - general words\n(as) regular as clockwork idiom\n-ly\nclockwork\nendemically\nerratic\nerratically\nfitful\nirregular\nirregularity\nirregularly\nlike clockwork idiom\nmany\non and off idiom\non-off\nperiodic\nperiodically\nprevalence\nreligiously\nunsynchronized\nwould\nSee more results »\nretune verb [I or T]\n(RADIO OR TV)\nto move the controls on a radio, television, etc. so that it can receive different programmes : The reorganization will require engineers to retune thousands of radios. The beauty of a digital radio is that you never need to re-tune.\nMore examplesFewer examplesShe reached out and retuned the radio in search of breakfast-time news.We invite you to retune to 7.34 megahertz or any of our other remaining frequencies. If you have an old digital box you will need to retune it to ensure you get all the free channels available. After my son had used the car, I had to retune the radio to NPR.\nSMART Vocabulary: related words and phrases\nBroadcasting in general\nairplay\nairtime\nairwaves\naudio described\naudio description\ncarry\ncommentary box\nheadline\nhost\ninterchannel\nlive stream\nlocation\nmistune\nproduce\nshowrunner\nslow motion\nstation\nstation break\nsubtitled\nsyndicated\nSee more results »\nretune verb [I or T]\n(MAKE CHANGES)\nto make small changes to something so that it works better or in a different way: The restaurant re-tuned its menu to cater for modern tastes. The show has been retuned for a younger, family audience.\nMore examplesFewer examplesThis kind of massage uses acupressure to boost energy, retune the body, and calm the mind.Half the partners were working with major companies to retune and redefine the role of the corporate .The company's machines and workers retune themselves almost effortlessly with every new product variation.\nSMART Vocabulary: related words and phrases\nAdapting and modifying\nacclimate\nacclimation\nacclimatization\nacclimatize\nacclimatize to something\nambidextrous\namend\namendment\nchameleon\nchange with/keep up with/move with the times idiom\nconfigure\ncounter-adaptation\npliantly\npreadaptation\npreadaptive\nput something back\nput something/someone forward\nunamended\nwrite someone out of something\nZelig\nSee more results »"}