{"id":311264,"name":"return","type":"verb","us_sound":"rɪˈtɝːn","us_link":"../audio/r/return.mp3","uk_sound":"rɪˈtɜːn","uk_link":"../audio/r/ukretre025.mp3","content":"return verb\n(GO BACK)\nAdd to word list\nAdd to word list\nA2 [ I ] to come or go back to a previous place: Odysseus returned home/returned to his home after many years of travelling. She left South Africa at the age of 15 and has never returned. [ + to infinitive ] David returned (from work) to find his house had burned down. return to something/to doing sth\nC1 If people or things return to a previous condition, they go back to that condition: Within a week, the situation had returned to normal.\nB2 If you return to an activity or subject, you start doing it or talking about it again: Gandhi urged Indians to return to spinning their own yarn. Every five minutes, he returned to the same subject.\nMore examplesFewer examplesEscape from this window and return to the main menu.He was paged at the airport and told to return home immediately.He returned in triumph from the sales with a half-price stereo system.These animals always return to the same breeding ground.The opposition leader returned to a hero's welcome after seven years in exile.\nSMART Vocabulary: related words and phrases\nReturning to a place\ncall\ncall back\ncome\ncome back\ndarken\ndouble back\nget back\ngo\ngo back\nhuddle\nhuddled\njoin\nreappear\nreappearance\nrefoulement\nregain\nrejoin\nreshore\nrevenant\nturn (someone) back\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChanging\nRepeating an action\nreturn verb\n(EXCHANGE)\nC1 [ T ] to give, do, or get something after something similar has been given or done to you: to return an invitation/greeting I returned his stare. I gave her a ride when her car broke down and now she is returning the favour (= doing something to help me in exchange). The terrorists started shooting and the police returned fire (= started shooting back).\nT to reply to someone's question or request: His representatives did not return a request for comment. She hadn't returned their earlier queries because, she said, she had already explained herself clearly.\nto give a particular amount of profit: My investments return a high rate of interest.\nMore examplesFewer examplesShe returned his smile.I'm sorry I didn't return your phone call earlier.Rosie looked at Rob, who returned her curious glance.If you look after Lucy this morning I can return the favour next week and take Evie off your hands for a few hours.Taylor has praised her skill in dealing with the situation and Churchill returns the compliment.\nSMART Vocabulary: related words and phrases\nReciprocating\nanother\neach other\ngive and take\nit takes two to tango idiom\nmutual\nmutuality\nmutually\nnon-reciprocal\none another phrase\none good turn deserves another idiom\nreciprocal\nreciprocally\nreciprocate\nreciprocation\nreciprocity\nscratch\nturn\ntwo-way\nunrequited\nyou scratch my back and I'll scratch yours idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnswering & responding\nInterest & capital\nProfits & losses\nreturn verb\n(PUT/BRING BACK)\nA2 [ T ] to send, take, give, put, etc. something back to where it came from: The new TV broke so they returned it to the shop. He returned two books he had borrowed from me in 2003. She carefully returned the book to its place on the shelf.\n[ T usually passive ] to bring someone back from somewhere: We're all hoping that Jill will be returned safely to her family.\n[ T ] in sports such as tennis, to hit the ball back to your opponent\nMore examplesFewer examplesPlease return the completed form at your earliest convenience.She demanded that he return the books he borrowed from her.You pay a deposit of 10p on the bottle, which you get back when you return the empty bottle.She was disappointed to see her essay returned with a mass of corrections in red ink.A date stamp inside the front cover of a library book shows when it should be returned.\nSMART Vocabulary: related words and phrases\nGiving, bringing or getting back\nbring\nbring something back\nchargeback\nclaw something back\ngiver\nrecover\nrecovery\nrefund\nregain\nregrow\nreintroduce\nreintroduction\nreplace\nsend\nsend something back\nsyndication\ntake something back\nturn\nturn in\nturn something over to someone\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSharing\nTennis & racket sports\nreturn verb\n(HAPPEN AGAIN)\nB2 [ I ] to happen again: You must go to the doctor if the pain returns.\nMore examplesFewer examplesWhen the good weather returns we'll go back there.If these feelings return I shall know how to deal with them.He'd had some problems with his health which returned this year.If the sick feeling returns, take these tablets.I've kept some medication in case the pain returns.\nSMART Vocabulary: related words and phrases\nOccurring and happening\nafoot\nasynchronous\nasynchronously\nattend\nattendant\nbe at work idiom\neventuate\nfall into place idiom\nfollow on\ngo hand in hand with something idiom\ngo off\ngo on\ngone\npass\nresynchronize\nroll\nroll around\nshake out\nsucceed\nsupervene\nSee more results »\nreturn verb\n(DECIDE)\nreturn a verdict/sentence law\n&#160; specialized\nto decide and say if you think someone is guilty or not guilty, or what punishment the person will be given in a court of law: The jury returned a verdict of not guilty.\nThesaurus: synonyms, antonyms, and examples\nto accuse someone of somethingaccuseHe was accused of statutory rape.make an accusation againstShe was arrested for making false accusations against her former employer.level an accusation againstFerguson was furious at the accusations levelled against his player.level a charge againstShe denied all the charges levelled against her.hurl accusations atShe hurled accusations at her ex-husband across the courtroom.charge someone withHe was charged with three counts of fraud.\nSee more results »\nreturn an indictment\nlaw\n&#160; US specialized to formally accuse someone of something in a court of law: His case will proceed to a grand jury, which must decide whether to return an indictment. The grand jury returned an indictment in January, charging the respondent with the three murders.\n[ T ] UK to elect someone to be a member of parliament, or to another political job: It was expected that he would be returned as premier.\nSMART Vocabulary: related words and phrases\nDecisions and deciding\nascription\nbe make or break for someone/something idiom\nbe on the horns of a dilemma idiom\nchoose\nclinch\nconclusion\nfix\nget it together idiom\nget something into your head idiom\nhammer something out\nhave a, some, etc. say in something idiom\nif/when it comes to the crunch idiom\njudge\nresolution\nsleep\ntake the plunge idiom\ntightrope\ntilt\ntilt the balance/scales idiom\ntop-down\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nJudges & juries\nTaking legal action\nElections\nRelated word\nreturnable\nreturn noun\n(GOING BACK)\nB1 [ S ] an occasion when someone goes or comes back to a place where they were before: The whole town came out to celebrate his return (from the war). On her return, she went straight to the office.\n[ S ] an occasion when you start to do or have something again: Some environmentalists argue for a return to a pre-industrial society. Most people have welcomed her return to power/office.\nB1 [ C ] UK (also return ticket); (US round-trip ticket) a ticket for travel to a place and back again: A return to Birmingham, please. See also\nday return\nMore examplesFewer examplesOn their return they discovered that their house had been burgled.Everyone rejoiced at the news of his safe return.The government is trying to encourage a return to the soil.She made a triumphant return to the stage after several years working in television.Her popularity has declined since her triumphal return from exile two years ago.\nSMART Vocabulary: related words and phrases\nReturning to a place\ncall\ncall back\ncome\ncome back\ndarken\ndouble back\nget back\ngo\ngo back\nhuddle\nhuddled\njoin\nreappear\nreappearance\nrefoulement\nregain\nrejoin\nreshore\nrevenant\nturn (someone) back\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRepeating an action\nTickets\nreturn noun\n(EXCHANGE)\nin return\nB2 in exchange: Some tenants get rent reductions in return for help managing the building. I'll come with you, but you have to do something for me in return.\nMore examplesFewer examplesHe's on to a good thing, he has free accommodation in return for answering the phone when the family are out.In return for some caretaking duties, we are offering a free flat and a small remuneration.A mixture of selected funds is an optimum choice for future security and return on investment.The makers of the film will want to see a decent return on their investment.We've put £20,000 capital into the business, but we're unlikely to see any return for a few years.\n[ C or U ] the act of giving, doing, or receiving something in exchange for something: Several soldiers were wounded in the return of fire.\n[ C or U ] the profit that you get from an investment: The return on the money we invested was very low.\nSMART Vocabulary: related words and phrases\nReciprocating\nanother\neach other\ngive and take\nit takes two to tango idiom\nmutual\nmutuality\nmutually\nnon-reciprocal\none another phrase\none good turn deserves another idiom\nreciprocal\nreciprocally\nreciprocate\nreciprocation\nreciprocity\nscratch\nturn\ntwo-way\nunrequited\nyou scratch my back and I'll scratch yours idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReplacing and exchanging\nProfits & losses\nreturn noun\n(HAPPENING AGAIN)\n[ S ] an occasion when something starts to happen or be used again: Will we ever see the return of/a return to comfortable fashion clothes?\nMore examplesFewer examplesHe advocates the return of capital punishment.She would like to see the return of the death penalty in Britain.It doesn't seem likely that we will see a return to full employment in the near future.The government is aiming to bring about a return to full employment.He argued for a return to traditional family values.\nSMART Vocabulary: related words and phrases\nEvents and occurrences\n-athon\nback story\nbe (all) part of life's rich tapestry/pageant idiom\nbenefit\nbinge\ncar wash\ndate night\nedition\nepiphenomenon\nepisode\nevent\ngoings-on\noccurrence\npast\nproceedings\nreoccurrence\nsaga\nspree\nsynchronicity\nthing\nSee more results »\nreturn noun\n(COMPUTER KEY)\nB1 [ U ] the key on a computer keyboard that you press in order to say that the words or numbers on the screen are correct, or that an instruction should be performed, or in order to move down a line on the screen: Press return/the return key twice to leave a blank line.\nyumiyum/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nComputer hardware\n3-D printer\nassociative memory\nblackberry\nbrick\nbubblejet\nconsole\ndata projector\nelectronic organizer\nflat screen\nhard drive\nmainframe\nmicrochip\nmicroprocessor\nnumber pad\noptical character reader\noptical reader\noptically\npalmtop\npatch\nplug and play\nSee more results »\nreturn noun\n(GIVING BACK)\nC1 [ S ] the act of giving, putting, or sending something back: the return of the stolen goods Synonyms\nrestitution formal\nrestoration\n[ C ] the act of hitting the ball back to your opponent in sports such as tennis: Chang's return of serve was powerful. returns [ plural ]\ngoods that have been taken back to the shop where they were bought by customers because they are damaged or unsuitable\nUS the votes that are returned, or the results of the voting, in an election: The election returns produced a confusing picture of gains and losses. by return (of post) UK\nin the first post collection that leaves after you receive a letter: She answered my letter by return.\nMore examplesFewer examplesThey demanded a huge ransom for the return of the little girl whom they had kidnapped.The country has been able to celebrate the return of its independence so brutally snuffed out in 1940.Her voice was breaking with emotion as she pleaded for her child's return.The writer pleaded for the return of his stolen manuscript.What a wonderful backhand return!\nSMART Vocabulary: related words and phrases\nGiving, bringing or getting back\nbring\nbring something back\nchargeback\nclaw something back\ngiver\nrecover\nrecovery\nrefund\nregain\nregrow\nreintroduce\nreintroduction\nreplace\nsend\nsend something back\nsyndication\ntake something back\nturn\nturn in\nturn something over to someone\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReciprocating\nElections\nCommunications - the postal system\nThe return part of a journey is the part in which you go back to the place where you started: The return journey took longer because the train was rerouted.\nSMART Vocabulary: related words and phrases\nReturning to a place\ncall\ncall back\ncome\ncome back\ndarken\ndouble back\nget back\ngo\ngo back\nhuddle\nhuddled\njoin\nreappear\nreappearance\nrefoulement\nregain\nrejoin\nreshore\nrevenant\nturn (someone) back\nSee more results »\nreturn verb\n(GO BACK)\nAdd to word list\nAdd to word list\n[ I ] to come or go back to a previous place, subject, activity, or condition: He returned to New York last week. He worked at other jobs but kept returning to mining. She was returning home from a business trip when the plane crashed.\nreturn verb\n(PUT BACK)\n[ T ] to put, send, or give something back to where it came from: Emily returned the blouse because it didn’t fit.\nreturn verb\n(EXCHANGE)\n[ T ] to give, do, or get something in exchange: She just doesn’t return phone calls.\nreturn verb\n(DECIDE)\n[ T ] fml to decide on something such as a judgment or decision: The jury returned a verdict of not guilty. Idiom\nin return for something\nreturn adjective [not gradable]\n(GOING BACK)\nhelping something to go or be sent back to where it came from: return postage\nA return address is the address from which a letter is being sent.\nAdd to word list\nAdd to word list\n[ T ]\n&#160; ACCOUNTING, FINANCE if a business or an investment returns an amount of money, it produces a profit: Last year all 60 branches of the business returned a profit. The account is low-risk but returns just 0.5% interest.\n[ T ]\n&#160; COMMERCE to take or send a product back to the company that sold it to you. You usually do this if you want them to replace the product or to give you back your money: Customers who return goods must present a receipt to get cash or credit.\n[ T ] to give back money that will not be used or that should not have been paid: If the sale does not go through, the agent is obliged by law to return the deposit. The department will return any overpayment or set it against your next tax bill.\n[ T ] to phone someone who has called you earlier: I left several messages on his answer-phone, but he never returned my call. He did not return the multiple messages left on his cell phone.\n[ I ] to go back to an earlier situation or to start doing something again: return to sth The refinery may not return to full production until later in the summer. Most women return to work at the end of their maternity leave.return to growth/profit The business is expected to return to growth next year.\nreturn a cheque\nBANKING to send a cheque back to the person who wrote it, usually because they do not have enough money in the bank to pay the whole amount: The bank returned our cheque for lack of funds.\nreturn a verdict\nLAW to give an official opinion in a court of law about whether someone is guilty of a crime: The jury returned a verdict of 'not guilty.'\n[ C or U ]\n&#160; ACCOUNTING, FINANCE the amount of profit made by an investment or a business activity: The program guarantees lenders a return of 10% interest. A fixed-rate investment will give you below-average returns.return on sth We need to monitor our return on advertising. make/see a return (on sth) They need to charge prices of over $20 a barrel in order to make a return. If the market improves, we can make a return of $10,000 on our investment. a positive/negative returna good/high return I want an investment which offers a good return. a low/modest return produce/offer/yield a return\n[ C or U ]\n&#160; COMMERCE a product that is returned to a company because the buyer is not satisfied with it, or the act of returning products to a company: An error in the manufacturing process led to hundreds of returns from dissatisfied customers. Check that there is a return policy in case there is a problem with the goods that you buy.\n[ C ]\n&#160; TAX\n&#160; (also tax return) an official document with details of your income that you send to the government tax department each year so that income tax can be calculated: It is possible to file your return online. When you have submitted your return, the Revenue promises you instant acknowledgement of its receipt. complete/do your return\n[ C or U ] a situation in which someone or something goes back to an earlier position or activity: a return to profit/growth/stability The last year has seen a return to normal in the banking sector.\n[ U ]\n&#160; IT\n&#160; (also return key) the key on a computer keyboard that you press to give an instruction, or to start a new line in a document: Type in your name and then press return. See also\nenter\nTRANSPORT\n&#160; ( UK also return ticket) a ticket for a journey to a place and back again: return to somewhere I need a return to Kings Cross Station. Compare\nsingle noun\nby return (of post)\nCOMMUNICATIONS using the next available mail collection to reply: We received an invoice by return of post. An answer by return would be appreciated. See also\naccounting rate of return\nannual return\ngross return\ninternal rate of return\nlaw of diminishing returns\nnet return\nproduct return\nrate of return\nsale or return\nTRANSPORT\n&#160; UK relating to a journey to a particular place and back again: a return journey/ticket/fare Compare\nsingle adjective"}