{"id":311272,"name":"returning","type":"verb","us_sound":"rɪˈtɝːn","us_link":"../audio/r/return.mp3","uk_sound":"rɪˈtɜːn","uk_link":"../audio/r/ukretre025.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nreturn\nreturn verb\n(GO BACK)\nA2 [ I ] to come or go back to a previous place: Odysseus returned home/returned to his home after many years of travelling. She left South Africa at the age of 15 and has never returned. [ + to infinitive ] David returned (from work) to find his house had burned down. return to something/to doing sth\nC1 If people or things return to a previous condition, they go back to that condition: Within a week, the situation had returned to normal.\nB2 If you return to an activity or subject, you start doing it or talking about it again: Gandhi urged Indians to return to spinning their own yarn. Every five minutes, he returned to the same subject.\nMore examplesFewer examplesEscape from this window and return to the main menu.He was paged at the airport and told to return home immediately.He returned in triumph from the sales with a half-price stereo system.These animals always return to the same breeding ground.The opposition leader returned to a hero's welcome after seven years in exile.\nSMART Vocabulary: related words and phrases\nReturning to a place\ncall\ncall back\ncome\ncome back\ndarken\ndouble back\nget back\ngo back\nhuddle\nhuddled\njoin\nreappear\nreappearance\nrefoulement\nregain\nrejoin\nreshore\nreturn\nrevenant\nturn (someone) back\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChanging\nRepeating an action\nreturn verb\n(EXCHANGE)\nC1 [ T ] to give, do, or get something after something similar has been given or done to you: to return an invitation/greeting I returned his stare. I gave her a ride when her car broke down and now she is returning the favour (= doing something to help me in exchange). The terrorists started shooting and the police returned fire (= started shooting back).\nT to reply to someone's question or request: His representatives did not return a request for comment. She hadn't returned their earlier queries because, she said, she had already explained herself clearly.\nto give a particular amount of profit: My investments return a high rate of interest.\nMore examplesFewer examplesShe returned his smile.I'm sorry I didn't return your phone call earlier.Rosie looked at Rob, who returned her curious glance.If you look after Lucy this morning I can return the favour next week and take Evie off your hands for a few hours.Taylor has praised her skill in dealing with the situation and Churchill returns the compliment.\nSMART Vocabulary: related words and phrases\nReciprocating\nanother\neach other\ngive and take\nit takes two to tango idiom\nmutual\nmutually\nnon-reciprocal\none another phrase\none good turn deserves another idiom\nping-pong\nreciprocate\nreciprocation\nreciprocity\nrequite\nreturn\nscratch\nturn\ntwo\ntwo-way\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnswering & responding\nInterest & capital\nProfits & losses\nreturn verb\n(PUT/BRING BACK)\nA2 [ T ] to send, take, give, put, etc. something back to where it came from: The new TV broke so they returned it to the shop. He returned two books he had borrowed from me in 2003. She carefully returned the book to its place on the shelf.\n[ T usually passive ] to bring someone back from somewhere: We're all hoping that Jill will be returned safely to her family.\n[ T ] in sports such as tennis, to hit the ball back to your opponent\nMore examplesFewer examplesPlease return the completed form at your earliest convenience.She demanded that he return the books he borrowed from her.You pay a deposit of 10p on the bottle, which you get back when you return the empty bottle.She was disappointed to see her essay returned with a mass of corrections in red ink.A date stamp inside the front cover of a library book shows when it should be returned.\nSMART Vocabulary: related words and phrases\nGiving, bringing or getting back\nbring\nbring something back\nchargeback\nclaw something back\ngiver\nrecover\nrecovery\nrefund\nregain\nregrow\nreintroduce\nreintroduction\nreplace\nsend\nsend something back\nsyndication\ntake something back\nturn\nturn in\nturn something over to someone\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSharing\nTennis & racket sports\nreturn verb\n(HAPPEN AGAIN)\nB2 [ I ] to happen again: You must go to the doctor if the pain returns.\nMore examplesFewer examplesWhen the good weather returns we'll go back there.If these feelings return I shall know how to deal with them.He'd had some problems with his health which returned this year.If the sick feeling returns, take these tablets.I've kept some medication in case the pain returns.\nSMART Vocabulary: related words and phrases\nOccurring and happening\nafoot\nasynchronous\nasynchronously\nattend\nattendant\nbe at work idiom\neventuate\nfall into place idiom\nfollow on\ngo hand in hand with something idiom\ngo off\ngo on\ngone\npass\nresynchronize\nroll\nroll around\nshake out\nsucceed\nsupervene\nSee more results »\nreturn verb\n(DECIDE)\nreturn a verdict/sentence law\n&#160; specialized\nto decide and say if you think someone is guilty or not guilty, or what punishment the person will be given in a court of law: The jury returned a verdict of not guilty.\nThesaurus: synonyms, antonyms, and examples\nto accuse someone of somethingaccuseHe was accused of statutory rape.make an accusation againstShe was arrested for making false accusations against her former employer.level an accusation againstFerguson was furious at the accusations levelled against his player.level a charge againstShe denied all the charges levelled against her.hurl accusations atShe hurled accusations at her ex-husband across the courtroom.charge someone withHe was charged with three counts of fraud.\nSee more results »\nreturn an indictment\nlaw\n&#160; US specialized to formally accuse someone of something in a court of law: His case will proceed to a grand jury, which must decide whether to return an indictment. The grand jury returned an indictment in January, charging the respondent with the three murders.\n[ T ] UK to elect someone to be a member of parliament, or to another political job: It was expected that he would be returned as premier.\nSMART Vocabulary: related words and phrases\nDecisions and deciding\nascription\nbe make or break for someone/something idiom\nbe on the horns of a dilemma idiom\nchoose\nclinch\nconclusion\nfix\nget it together idiom\nget something into your head idiom\nhammer something out\nhave a, some, etc. say in something idiom\nif/when it comes to the crunch idiom\njudge\nresolution\nsleep\ntake the plunge idiom\ntightrope\ntilt\ntilt the balance/scales idiom\ntop-down\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nJudges & juries\nTaking legal action\nElections\nRelated word\nreturnable"}