{"id":311383,"name":"revamp","type":"verb","us_sound":"ˌriːˈvæmp","us_link":"../audio/r/eus73980.mp3","uk_sound":"ˌriːˈvæmp","uk_link":"../audio/r/ukrev__003.mp3","content":"Add to word list\nAdd to word list\nto change or arrange something again, in order to improve it: We revamped the management system, but the business is doing no better than it was before. The walled garden was completely revamped last year.\nThesaurus: synonyms, antonyms, and examples\nto decorate a room, house, etc.decorateUK I love to decorate and create cosy spaces in each room.redecorateI'm redecorating my bedroom in this season's latest colors.refurbishThe University library is currently being refurbished.renovateThey were in the process of renovating an old barn.revampThe restaurant has recently been revamped.do upHe's bought an old cottage and is gradually doing it up.\nSee more results »\nMore examplesFewer examplesThis year, the system has been completely revamped and no problems have been reported so far.Other manufacturers have recently revamped their manufacturing processes to eliminate lead.The company has launched a revamped version of its commercial mortgages.\nSMART Vocabulary: related words and phrases\nMaking things better\nadd salt to something idiom\nallay\nalleviate\nalleviation\nameliorate\ncultivate\nleavening\nlevelling up\nlighten\nliven (something) up\nlubricate\nmake a difference idiom\nrectify\nremedial\nreorganize\nrepair\nrepolish\nrestructure\nrevitalize\nsharpen\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRestoring and reviving\nDecorating or making something attractive\nthe process of changing or arranging something again, in order to improve it: The company has spent $5 million on a major revamp of its offices. He is planning a radical revamp of his squad.\nMore examplesFewer examplesThe company underwent a major revamp and adopted a new image.When it tried its first radical revamp of the software back in 2006, users found the changes too jarring.The revamp involved gutting the 77-year-old stadium, leaving only the Doric colonnades.\nSMART Vocabulary: related words and phrases\nDecorating or making something attractive\naccessorize\nadorn\nadornment\nbeautification\nbeautify\nembellish\nflock\nfoliated\ngarland\ngewgaw\nglam\nornamentation\nornate\nover-glamorize\noverdecorate\noverdecoration\nundecorated\nwindow dressing\nyarn bombing\nzhuzh\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRestoring and reviving\nAdd to word list\nAdd to word list\nto change something, or to make or arrange something differently, in order to improve it: This country’s health care system needs revamping.\nAdd to word list\nAdd to word list\nto change something to make it more modern and efficient: We need to revamp our image to reach a younger market. They plan to revamp the HR system.\nthe process of changing something to make it more modern and efficient: Their promotional material is in urgent need of a revamp. All their stores are undergoing a revamp."}