{"id":311484,"name":"revenue","type":"noun","us_sound":"ˈrev.ə.nuː","us_link":"../audio/r/revenue.mp3","uk_sound":"ˈrev.ən.juː","uk_link":"../audio/r/ukrev__015.mp3","content":"Add to word list\nAdd to word list\nC1 the income that a government or company receives regularly: Taxes provide most of the government's revenue. Government revenues fell dramatically.\nMore examplesFewer examplesThese measures will increase the club's ability to generate revenue.Television companies have been massaging their viewing figures in order to attract more advertising revenue.The magazine misreported its sales figures in order to boost advertising revenue.Arco has reacted to the loss in revenue by pruning back its expansion plans.The government is scrabbling around for ways to raise revenue without putting up taxes.\nSMART Vocabulary: related words and phrases\nTaxation\namortizable\nanti-dumping\nanti-progressive\nanti-tax\nat source phrase\nfinancial year\nfiscal year\nflat tax\ngas tax\nHMRC\nregressive\nregressively\nroad tax\nsales tax\nself-assessment\ntaxpayer\nthe taxman\ntithe\ntop rate\nunprogressive\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccounting\nEarning money\nAdd to word list\nAdd to word list\nthe income that a business or government receives regularly, or an amount representing such income: [ C usually pl ] state/federal revenues [ U ] Company revenue rose 4% last year.\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; FINANCE, ACCOUNTING\n&#160; (also revenues) money that a company receives, especially from selling goods or services: revenue(s) from sth Revenue from online ads is much less than from print advertising.revenue(s) of Analysts had forecast revenue of $1.39bn.in revenue(s) His firm posted $41 million in revenues last year.generate/bring in/raise revenue(s) The sport doesn't generate much revenue from ticket sales.boost/increase revenue(s) The banking group has in recent years struggled to boost revenues while keeping costs under control. a fall/increase in revenue(s) The company has an estimated annual revenue of $50 million. Advertising revenue fell last year. expected/projected revenue a source of revenue\n[ C or U ]\n&#160; TAX\n&#160; (also revenues) money that a government receives from taxes: They need to restructure the tax system to collect more revenue. There is extra pressure on the Chancellor to find new ways to raise revenue. State officials predicted a 5% growth in tax revenues. Other taxes will have to be raised to compensate for the lost revenue.\n[ S ]\n&#160; TAX, GOVERNMENT\n&#160; (also the Revenue) the government department in the UK that collects taxes: Taxpayers should always check the documents they get from the Revenue.\nSee also\naverage revenue\nHM Revenue &amp; Customs\nInternal Revenue Service\nmarginal revenue\nsales revenue"}