{"id":311549,"name":"reverse","type":"verb","us_sound":"rɪˈvɝːs","us_link":"../audio/r/reverse.mp3","uk_sound":"rɪˈvɜːs","uk_link":"../audio/r/ukrev__027.mp3","content":"reverse verb\n(CHANGE TO OPPOSITE)\nAdd to word list\nAdd to word list\nC1 [ T ] to change the direction, order, position, result, etc. of something to its opposite: The new manager hoped to reverse the decline in the company's fortunes. Now that you have a job and I don't, our situations are reversed. The Court of Appeal reversed the earlier judgment.\nMore examplesFewer examplesThere is pressure on the council to reverse its decision.He reversed into a lamppost and damaged the back of the car.They claim the product can reverse the signs of ageing.To complete the test he had to reverse the vehicle into a parking space.The court's ruling reverses the original judgment.\nSMART Vocabulary: related words and phrases\nChanging\nabout-face\nabout-turn\nalterable\naltered\nalternate\nchurn\ndisturb\ndrip\nmeta\nmetamorphose\nmodulate\nmodulation\nmorph\nmove on\npervert\nsanitization\nsemi-domesticated\nshake someone out of something\nshake someone up\nstead\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChanging direction\nreverse verb\n(DRIVE BACKWARDS)\nB2 [ I or T ] mainly UK (US usually back up) to drive a vehicle backwards: He reversed into a lamppost and damaged the back of the car. She reversed the car into the parking space.\nThesaurus: synonyms, antonyms, and examples\nto go backwardsreverseThe road ahead was blocked by a tree so I had to reverse. backI backed into the drive.back upI backed up into an empty parking space.retreatShe retreated hastily back up the stairs.pull backUN peacekeepers have pulled back from the border.withdrawThe British army withdrew from Dunkirk in 1940.\nSee more results »\nSMART Vocabulary: related words and phrases\nBackwards, sideways and back and forth\nanticlockwise\naside\nback and forth idiom\nback to front phrase\nbackward\nbackwardly\nhither and thither idiom\nlateral\nlaterally\nlibration\npull\nround\nsaw\nstand\nstep\nstep aside\nswept-back\nthere and back idiom\nto and fro\nwrong\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOn the road: driving & operating road vehicles\nreverse verb\n(PHONE)\nreverse the charges mainly UK (US usually call collect)\nto make a phone call that is paid for by the person receiving it\nSMART Vocabulary: related words and phrases\nCommunications - by telephone\n0800 number\n3G\n4G\n5G\naeroplane mode\nairplane mode\narea code\nautodial\nbuzz\ncaller ID\nDirectory Enquiries\noff the hook idiom\npick\npick someone/something up\npocket dial\nprank call\nprank caller\nroam\ntelecoms\ntelephone\nSee more results »\nthe reverse\nC2 the opposite of what has been suggested: You might think that people who don't worry about their diet are fatter and more unhealthy; in fact, the reverse is true. Whatever official news broadcasts claimed, he believed the reverse.\nthe back of a coin, medal, etc.: The coin has a royal coat of arms on the reverse.\nMore examplesFewer examplesConvention dictates that it is the man who asks the woman to marry him and not the reverse.\"So is he happier?\" \"Quite the reverse. I've never seen him more miserable.\"It's a strange situation - it's the reverse of what you'd expect.I thought that she'd be happier once he was home but in fact the reverse is true.Andrew tends to look after the kids while Marie does the housework which is the reverse of this household.\nin reverse (order)\nC1 in the opposite order or way: To stop the engine, you repeat the same procedures, but in reverse (order).\nC2 [ U ] (also reverse gear) the method of controlling a vehicle that makes it go backwards : To go backwards, you must put the car in/into reverse (gear).\nThesaurus: synonyms, antonyms, and examples\nin the opposite to a forward directionbackwardsUK The dog growled and I took a step backwards.backHe leant back on the sofa.in reverseI put the car in reverse.the wrong way aroundThe batteries are in the wrong way around.back to frontUK He always wears his baseball cap back to front.\nSee more results »\n[ C ] formal a defeat or failure: They suffered a serious military/political reverse.\nSMART Vocabulary: related words and phrases\nOpposites\nantinome\nantithesis\nantithetical\nantonymous\nanything\nconverse\ncounterpose\ndiametric\ndiametrical\ndichotomist\ndichotomous\nflip side\nnegation\nopposed\nopposite\nor otherwise idiom\notherwise\npolar\npolarity\npole\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSurfaces of objects\nThe engine & engine parts\nFailures\nIdiom\ngo into reverse\nopposite to what has just happened, or to what is usual or expected: Repeat the steps in reverse order to shut the system off. The intervention was designed to help, but it had the reverse effect.\ntowards the direction that is opposite to the one you are facing: He delivered a perfect reverse pass to his teammate. The diver then does three and a half reverse somersaults in the air before plunging head first into the water. Synonym\nbackward (OPPOSITE DIRECTION) the reverse side\nthe back of something: On the reverse side of the coin will be a portrait of the Queen. Each entry must be clearly labelled with your name, address, and date of birth on the reverse side.\nMore examplesFewer examplesLast month we discussed analogue to digital conversion and the reverse process. Blood was now flowing in a reverse direction in order to nourish the starved heart muscle.\nSMART Vocabulary: related words and phrases\nOpposites\nantinome\nantithesis\nantithetical\nantonymous\nanything\nconverse\ncounterpose\ndiametric\ndiametrical\ndichotomist\ndichotomous\nflip side\nnegation\nopposed\nopposite\nor otherwise idiom\notherwise\npolar\npolarity\npole\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBackwards, sideways and back and forth\nAdd to word list\nAdd to word list\nto cause something to go in the opposite direction, order, or position: [ T ] The group is trying to reverse the trend toward developing the wetlands. reverse adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/rɪˈvɜrs/\nRepeat the steps in reverse order to shut the system off.\nthe opposite direction, order, or position: [ U ] A car came down the street in reverse.\nA reverse is also a defeat or failure: [ C ] He suffered a series of financial reverses in the 1980s.\nAdd to word list\nAdd to word list\n[ T ] to change a decision, plan, etc. so that it becomes the opposite of what it was before: Management have reversed their decision on the matter.\n[ I or T ] to stop things happening, or to stop happening, in a particular way: reverse a process/trend We have to do something to reverse the trend of people moving away to seek work. The struggling retailer has slashed prices in an attempt to reverse the decline in sales. The trend is expected to reverse next year.\n[ T ] to start to behave or to do things in a way that is the opposite of what happened before: The upward trend in prices may soon reverse course. Customer feedback forced them to reverse direction.\n[ T ]\n&#160; LAW to change a legal decision in a court of law: The court of appeal reversed the verdict in June.\nreverse (the) charges UK ( US call collect)\nCOMMUNICATIONS to make a phone call that is paid for by the person who receives it: Call me from the airport and reverse the charges.\nformal a problem or failure that makes it more difficult for a person or organization to be successful: The company suffered a reverse on the trading market.\n(also the reverse) the opposite of something: The director assured us the company was doing well, but it turned out that the reverse was true.the reverse of sth Her approach to marketing is the reverse of what we have done so far.\nthe other side of a piece of paper, etc.: Write your account details on the reverse of the cheque.\nbe in reverse/go into reverse\nFINANCE if something relating to finance goes into reverse, it starts to lose value: The shares were in reverse for a long time. If we don't get any sales growth, profits will go into reverse.\nthe opposite of what has just been mentioned: Although intended to reassure shareholders, this strategy clearly had the reverse effect.\ngoing in the opposite direction from what usually happens or what has happened before : We reviewed all the figures in reverse chronological order.\nused to describe the other side of a piece of paper, etc.: She made a note on the reverse side of the last page."}