{"id":311725,"name":"revive","type":"verb","us_sound":"rɪˈvaɪv","us_link":"../audio/r/revive.mp3","uk_sound":"rɪˈvaɪv","uk_link":"../audio/r/ukrevie011.mp3","content":"Add to word list\nAdd to word list\nC2 to come or bring something back to life, health, existence, or use: to revive someone's hopes/confidence/fortunes My plants revived as soon as I gave them some water. A hot shower and a cup of tea will revive you. Traditional skills are being revived. Synonyms\nbring someone around (MAKE CONSCIOUS)\nrevivify formal\nMore examplesFewer examplesThey recognized that the country would revive only if it thoroughly disengaged from the chaos of the old regime.How can the Trade Department be revived from its present moribund state?The peace plan put forward last August has been revived for the latest round of negotiations.Nobody fully understands the enormity and complexity of the task of reviving the country's economy.This would seem to be an opportune moment for reviving our development plan.\nSMART Vocabulary: related words and phrases\nRestoring and reviving\nbalsam\nbounce\nbounce back\nfacelift\nflip\nlick your wounds idiom\nmodernization\nmodernize\nmove with the times idiom\nrecrudescence\nregeneration\nregenerative\nrejuvenate\nrejuvenation\nresurgent\nresurrect\nresurrection\nrevamp\nrevitalize\nsnap\nSee more results »\nAdd to word list\nAdd to word list\nto come back to life, health, existence, or use, or bring something back to such a state: [ T ] She tried to revive the unconscious woman. [ I ] My plants revived as soon as I gave them a little water.\nAdd to word list\nAdd to word list\nto start to grow, develop, or become successful again, or to make something do this: Ministers are hoping to set up a programme to revive the ailing agricultural sector. The decision to revive a brand should always be backed by making the necessary investments in it. The store has revived its fortunes in recent years. Levels of carbon dioxide emissions have started to rise again as industry revives.revive an economy/business/market Recent interest rate cuts by the Fed were designed to help revive the economy.revive sales/profits Almost a quarter of the workforce is being laid off in an attempt to revive falling profits.\nrevive talk/speculation/debate, etc.\nto make people start discussing a particular subject or problem again: Amid revived talk of a possible takeover bid, shares closed 10p up at 628.5p.\nrevive interest/fears/hopes, etc.\nto make people feel interested, afraid, hopeful, etc. again: A leading research centre is facing closure in a move which has revived fears about scientific promotion of genetically modified crops."}