{"id":311687,"name":"revisionist","type":"noun","us_sound":"rɪˈvɪʒ.ən.ɪst","us_link":"../audio/r/usretro017.mp3","uk_sound":"rɪˈvɪʒ.ən.ɪst","uk_link":"../audio/r/ukrevie008.mp3","content":"Add to word list\nAdd to word list\nsomeone who examines and tries to change existing beliefs about how events happened or what their importance or meaning is: revisionists within the Communist Party See\nrevisionism\nMore examplesFewer examplesSome revisionists argue the inscription could be read as a place-name. But revisionists contend that most of those battles were his to lose, given the technical superiority of the army he commanded.UK Throughout my political life, I have been a Labour revisionist or, as it is now called, a moderniser. The revisionists embraced the primacy of socioeconomic forces in the 1970s and 1980s just as their reductionist dangers were becoming clear in the study of Western revolutions.\nSMART Vocabulary: related words and phrases\nReligious people: believers & non-believers\nanti-evolution\nanti-evolutionary\nanti-evolutionist\nanti-humanist\nantichrist\nconverted\ndeist\nevolutionist\nfaithful\nfaithless\nirreligiously\nlibertine\nmonotheist\nmystic\nsecularist\nthe laity\ntheist\ntheistic\nunbelief\nunbeliever\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHistory - general words\nexamining and trying to change existing beliefs about how events happened or what their importance or meaning is: revisionist historians revisionist biographies of Soviet leaders See\nrevisionism\nMore examplesFewer examplesAlthough advertised as revisionist, the book is not significantly re-interpretive.The phenomenon is cheered by Reaganites as an overdue tribute, though some academics see it as revisionist history taking its course.This book is not revisionist. Instead, it's a fascinating recycling. Like-minded academics and journalists have pushed forward a revisionist view of Japan's wartime history.\nSMART Vocabulary: related words and phrases\nHistory - general words\na page in/of history idiom\nAge of Exploration\nage of sail\nalternative history\nannal\nantiquarian\nantiquary\nepigraphist\nheritage\nhistographer\nhistorical\nhistorically\nhistoricity\nhistory\nlegacy\nmodern\nnon-historical\noral tradition\nthe Agrarian Revolution\ntime\nSee more results »"}