{"id":311630,"name":"review","type":"verb","us_sound":"rɪˈvjuː","us_link":"../audio/r/review.mp3","uk_sound":"rɪˈvjuː","uk_link":"../audio/r/ukrevie001.mp3","content":"review verb\n(THINK AGAIN)\nAdd to word list\nAdd to word list\nC1 [ T ] to think or talk about something again, in order to make changes to it or to make a decision about it: The committee is reviewing the current arrangement/situation. Let's review what has happened so far. He reviewed his options before making a final decision.\nMore examplesFewer examplesWith exams approaching, it's a good idea to review your class notes.He reviews films for the local newspaper.Your starting salary is £13 000 per annum and will be reviewed annually.The laws governing the possession of firearms are being reviewed.The company is reviewing its security after the robbery.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\nassign\ndive\nenquiry\ngo through\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\nreinspect\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nthe acid test\nweigh\nSee more results »\nreview verb\n(WRITE/TALK ABOUT)\nB2 [ T ] If critics review a book, play, film, etc. they write their opinion of it: I only go to see films that are reviewed favourably.\n[ T ]\n&#160; education\n&#160; specialized to describe the most important facts in a piece of academic research (= detailed study of a subject) that you have read, and give your opinion of the research: Weaver reviewed more than 200 peer-reviewed, scientific papers about cloning. See also\npeer-review\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\nassign\ndive\nenquiry\ngo through\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\nreinspect\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nthe acid test\nweigh\nSee more results »\nreview verb\n(MILITARY)\n[ T ] When an important person reviews military forces, they formally visit and look at them: The Queen reviewed the troops on her recent visit.\nSMART Vocabulary: related words and phrases\nMilitary training & ceremonies\nassault course\nattention\ncivil defence\ndrumhead\nease\nfall\nfall in\nguard\nmanoeuvre\nmilitary honours\nmilitary service\nnational service\nobstacle course\npass\npassing-out\nrecon\nreveille\ntattoo\ntroop\nwar game\nSee more results »\nreview verb\n(STUDY)\n[ I or T ] US (UK revise) to study again something you have already learned, in preparation for an exam: We're reviewing (algebra) for the test tomorrow.\nThesaurus: synonyms, antonyms, and examples\nto study somethingstudyWhat do you plan on studying at university?majorUS She majored in philosophy at Harvard.cramShe's cramming for her history exam.reviseUK I'm revising for tomorrow's test.reviewUS We're going to review for the test tomorrow night. researchScientists are researching possible new treatments for cancer.\nSee more results »\nSMART Vocabulary: related words and phrases\nLearning & knowing\nabsorptive capacity\nacquirable\nacquire\nacquisition\nassimilate\nbone\nfamiliar\nhit the books idiom\nminor\nmislearn\nmug (something) up\nnon-academic\nnon-library\nrecognition\nshadow\nsubspecialty\nswot up (something)\nteachable\nthose\nuncultivated\nSee more results »\nreview noun\n(THINK AGAIN)\nC2 [ C or U ] the act of considering something again in order to make changes to it, give an opinion of it or study it: an annual review of company performance a review of the year's top news stories Salary levels are under review at the moment. Your licence will come up for review every July.\nMore examplesFewer examplesThere's a generous review of the book in today's newspaper.The review exposed widespread corruption in the police force.The government has ordered a judicial review.The reviews of his latest movies have been highly complimentary.A review of the firm's safety procedures revealed serious problems.\nSMART Vocabulary: related words and phrases\nJudgments and analyses\nanalysis\nanatomy\nappraisal\nappraisee\nassessment\ncognizable\nconstruction\nforensics\nimpact assessment\nimpact statement\ninterpretation\njob evaluation\nprognosticate\nprognostication\nrap\nrating\nre-evaluation\nre-review\nvalue judgment\nverdict\nSee more results »\nreview noun\n(BOOK/FILM)\nB1 [ C ] a report in a newspaper, magazine, or programme that gives an opinion about a new book, film, etc.: Derek writes film/theatre/book reviews for the newspapers. The play got excellent reviews when it was first seen.\neducation\n&#160; specialized a piece of writing that describes the main facts in a piece of academic research (= detailed study of a subject) that you have read, and gives your opinion of it: An effective literature review summarizes and organizes the conclusions of previous research. More than 500 scientists contributed to a massive review of published research. See also\npeer review\n[ C usually singular ] a (part of a) newspaper or magazine that has articles on films, books, travel, famous people, etc.: Could you pass me the review (section of the paper), please?\nSMART Vocabulary: related words and phrases\nJudgments and analyses\nanalysis\nanatomy\nappraisal\nappraisee\nassessment\ncognizable\nconstruction\nforensics\nimpact assessment\nimpact statement\ninterpretation\njob evaluation\nprognosticate\nprognostication\nrap\nrating\nre-evaluation\nre-review\nvalue judgment\nverdict\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPapers and compositions\nNewspapers & magazines: headlines & features\nreview noun\n(MILITARY)\n[ C ] a formal military ceremony in which forces are reviewed by an important person: Many diplomats attended a naval review to mark the anniversary of the end of the war.\nSMART Vocabulary: related words and phrases\nMilitary training & ceremonies\nassault course\nattention\ncivil defence\ndrumhead\nease\nfall\nfall in\nguard\nmanoeuvre\nmilitary honours\nmilitary service\nnational service\nobstacle course\npass\npassing-out\nrecon\nreveille\ntattoo\ntroop\nwar game\nSee more results »\nreview noun\n(THEATRE)\n[ C ] a\nrevue\nSMART Vocabulary: related words and phrases\nSpectacles & performances\naerobatic\namateur theater\nbalancing act\nbravura performance\nbullfight\ndouble-header\nminstrel show\nmusic hall\nnon-musical\none-night stand\none-person\nroutine\nspectacular\nstrip\nstripping\nstriptease\nsuper-spectacle\nsupershow\nswansong\ntattoo\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLiterature\nreview noun\n(STUDY)\n[ C ] US information or a practice exercise about a subject to be studied: Their teacher distributed a review for the exam.\nSMART Vocabulary: related words and phrases\nPreceding and introducing\nannounce\nantecedent\nantedate\nbuild (someone/something) up\ncountdown\ncurtain-raiser\nemcee\nforerunner\nintroduce\nintroduction\nintroductory\nlead up to something\nlead-in\npreamble\npredecessor\npreface\nprefix\npreliminarily\npreliminary\nprelude\nSee more results »\nAdd to word list\nAdd to word list\nto consider something in order to make changes in it, study it, or give an opinion about it: Officials have to review the text before it’s made public. Pauline Kael reviewed movies (= wrote opinions about movies) for \"The New Yorker.\" She spent half the night reviewing her notes for the French test (= studying them again).\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; MANAGEMENT the process of carefully examining a situation to find out whether changes or improvements need to be made: review of sth The next scheduled review of bonus rates will take place early in the new year. The matter is currently under review. a price/pay/spending review a review committee/board/panelcall for/order a review (of sth) The Treasury select committee called last month for a review of the bank's supervisory role.conduct/carry out a review (of sth) Outside consultants have been called in to conduct a review of the firm's business structure.launch/complete/conclude a review (of sth) None of the major media companies will be able to act until the Office of Fair Trading concludes its review of commercial broadcasting.a strategic/independent/comprehensive review Current chairman, Richard Carter, has announced a strategic review.\n[ C ] a report that contains important information about a particular subject or activity: Current business frameworks and methodologies are analysed in the review appearing in Section 2 of the book. Ofcom has recently published its review of the telecoms market. Our annual review and accounts are published each year.\n[ C ] a short article that someone writes expressing their opinion about something such as a new product or service: Our website enables shoppers to make side-by-side product comparisons and read customer reviews. Despite mixed reviews, the movie was a huge box-office success. a book/restaurant review\n[ C ]\n&#160; ACCOUNTING, FINANCE an examination of the accounts of a business to check that they have been done according to accepted standards: The Committee received reports from the external auditors on the conduct of their audit, their review of the accounts, and their comments on risk management. Compare\naudit noun See also\npeer review\nperformance review\nMANAGEMENT to carefully examine a situation to find out whether changes or improvements need to be made: Experts are urging borrowers to review their mortgage arrangements and, if they can, to switch now to a better rate. The airline said it would continue to review the situation. The EEOC (Equal Employment Opportunity Commission) reviews all cases before any lawsuits can be filed.be reviewed by sb/sth The proposed project will be reviewed by several federal agencies.\nto provide a written description containing important information about a particular subject or activity: Before moving onto the next chapter, we review some key factors that limit the impact of CEOs within the corporate structure.\nto write a short article expressing your opinion about something such as a new product or service: Customers reviewing digital cameras are asked to identify whether they are amateur or professional photographers.\nACCOUNTING, FINANCE to examine the accounts of a business to check that they have been done according to accepted standards: The Auditor's Office generally reviews the books of public agencies every three years. Compare\naudit verb"}