{"id":311674,"name":"revise","type":"verb","us_sound":"rɪˈvaɪz","us_link":"../audio/r/revise.mp3","uk_sound":"rɪˈvaɪz","uk_link":"../audio/r/ukrevie004.mp3","content":"revise verb\n(CHANGE)\nAdd to word list\nAdd to word list\nB2 [ T ] to look at or consider again an idea, piece of writing, etc. in order to correct or improve it: His helpfulness today has made me revise my original opinion/impression of him. His publishers made him revise his manuscript three times.\nMore examplesFewer examplesCasualty figures were revised downwards after the war had ended.Conceivably, supporters of the law could filibuster to prevent it from being revised.The cost of completion has been revised upwards again due to inflation.The mechanism for collecting taxes needs revising.He was asked to revise his proposal before submitting it again.\nSMART Vocabulary: related words and phrases\nCorrecting and mending\ncalibration\nclean (someone/something) up\ncorrection\nfiddle\nfiddle (around) with something\nfine-tune\nmess\nrecondition\nreconstruct\nreconstruction\nrectifiable\nrectification\nremedy\nscratch\nservicing\nset/put the record straight idiom\nsmooth something away\nsmoothen\nsort\ntinker\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEditing & compiling\nrevise verb\n(STUDY)\nB1 [ I or T ] UK (US review) to study again something you have already learned, in preparation for an exam: We're revising (algebra) for the test tomorrow.\nThesaurus: synonyms, antonyms, and examples\nto study somethingstudyWhat do you plan on studying at university?majorUS She majored in philosophy at Harvard.cramShe's cramming for her history exam.reviseUK I'm revising for tomorrow's test.reviewUS We're going to review for the test tomorrow night. researchScientists are researching possible new treatments for cancer.\nSee more results »\nSMART Vocabulary: related words and phrases\nLearning & knowing\nabsorptive capacity\nacquirable\nacquire\nacquisition\nassimilate\nbone\nextension\nfamiliar\nhit the books idiom\nminor\nmislearn\nmug (something) up\nnon-academic\nnon-library\nshadow\nsubspecialty\nswot up (something)\nteachable\nthose\nuncultivated\nSee more results »\nAdd to word list\nAdd to word list\nto change or correct something, esp. a piece of writing: [ T ] With the final exam, you don’t revise it after the teacher reads it.\nBr To revise is to study again what you have been learning in order to prepare for an exam. revised adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/rɪˈvɑɪzd/\nHer book is available in a new revised edition.\nAdd to word list\nAdd to word list\nto change an amount or value in order to make it more accurate: The Labor Department announced it had revised the August numbers to show that the economy gained 89,000 jobs that month. Advisers have revised their estimate of its likely stock market value, from £5.4bn to £5.8bn. The biggest drop in the global figures came from revising the figure for India downward, which was done in July.revise sth down/up Eurozone inflation in November has been revised up from 1.8% to 1.9%.\nto make changes to a plan, system, or law in order to improve it: As a result of recent analysis, the performance measurement system is currently being revised. The Department of Agriculture is expected to revise its proposals concerning regulatory changes.revise a law/a rule/legislation Legislation to revise the laws on corporate lawsuits was blocked last night in the Senate.\nto make changes to a book, document, etc. in order to improve it, correct mistakes, or make it contain the most recent information: This third edition has been completely updated and revised."}