{"id":311717,"name":"revival","type":"noun","us_sound":"rɪˈvaɪ.vəl","us_link":"../audio/r/revival.mp3","uk_sound":"rɪˈvaɪ.vəl","uk_link":"../audio/r/ukrevie010.mp3","content":"Add to word list\nAdd to word list\nC2 [ C or U ] the process of becoming more active or popular again: Recently, there has been some revival of (interest in) ancient music. An economic/artistic revival is sweeping the country.\n[ C ] a performance of a play that has not been seen for a long time: We're staging a revival of a 1950s play.\n[ C or U ] a time when interest in religion starts again in a stronger way than before, or a meeting or series of meetings organized to encourage this to happen\nMore examplesFewer examplesSt Peter's Church is a striking example of mission revival architecture.A 1970s fashion revival is sweeping Europe.Cinema in Britain is undergoing a revival of popularity.The new managing director brought about a revival in the company's fortunes.The May Day festival originally celebrated the revival of life in early spring after winter.\nSMART Vocabulary: related words and phrases\nRestoring and reviving\nbalsam\nbounce\nbounce back\nfacelift\nflip\nlick your wounds idiom\nmodernization\nmodernize\nmove with the times idiom\nrecrudescence\nregeneration\nregenerative\nrejuvenate\nrejuvenation\nresurgent\nresurrect\nresurrection\nrevamp\nrevitalize\nsnap\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSpectacles & performances\nReligious practices\nAdd to word list\nAdd to word list\nA revival is also a performance of a play which has not been seen for a long time: [ C ] a revival of Pinter’s 1960 play\nAdd to word list\nAdd to word list\na process in which something starts to grow, develop, or become successful again: Senior economists believe that market liberalism is leading to a revival of the economy. We remain hopeful that the revival in the global economy will provide a boost to exports over the remainder of this year. After the recent recession, retail spending is showing signs of revival. There are early signs that an economic revival is taking hold.undergo/enjoy a revival Under new management, the firm has undergone something of a revival.spark/lead to a revival Prices at the top end of the market adjusted last year, leading to a revival in recent months."}