{"id":311683,"name":"revision","type":"noun","us_sound":"rɪˈvɪʒ.ən","us_link":"../audio/r/revision.mp3","uk_sound":"rɪˈvɪʒ.ən","uk_link":"../audio/r/ukrevie006.mp3","content":"revision noun\n(CHANGE)\nAdd to word list\nAdd to word list\n[ C or U ] a change that is made to something, or the process of doing this: These proposals will need a lot of revision. He was forced to make several revisions to his speech.\nSMART Vocabulary: related words and phrases\nAdapting and modifying\nacclimate\nacclimation\nacclimatization\nacclimatize\nacclimatize to something\nambidextrous\namendment\nchameleon\nchange with/keep up with/move with the times idiom\nconfigure\ncounter-adaptation\npliantly\npreadaptation\npreadaptive\nput something back\nput something/someone forward\nunadapted\nunamended\nwrite someone out of something\nZelig\nSee more results »\nrevision noun\n(STUDY)\nB1 [ U ] UK study of work you have done, in order to prepare for an exam: She did no revision, but she still got a very high mark.\nSMART Vocabulary: related words and phrases\nExams, tests & exercises\nachievement test\nAdvanced Placement\nAP\naptitude test\nassessment\ncan do phrase\ndictation\nexternal examination\nfail\nmoderate\noral\npop quiz\npractical\nprobationary\nproctor\npsychometric\nquiz\nre-mark\nrubric\nsit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLearning & knowing\nAdd to word list\nAdd to word list\nthe act of changing or correcting something, or the thing that has been changed or corrected: [ U ] The Senate is expected to act on tax revision.\nAdd to word list\nAdd to word list\nthe process of changing an amount or value in order to make it more accurate: The official picture of the US labor market was complicated by statistical revisions of earlier estimates. Economists have stated that revisions to growth in the first quarter of the year were in line with market expectations.make revisions (to sth) Some revisions to previous years' figures have been made by the Office for National Statistics.upward/downward revision(s) Good third-quarter figures should lead to an upward revision of the economic forecast in the November pre-budget report. earnings/tax revisions\nthe process of changing a plan, system, or law in order to improve it: Any revision of lending criteria is bound to have an effect on the real economy. The 334-page audit suggests revisions to state accountability plans.major/significant/substantial revision(s) Last month, the Environmental Protection Agency announced the first major revision in its fuel economy testing procedures since 1986.call for/propose/make revisions (to sth) Under the terms of a new environmental law, revisions to U.S. Forest Service plans will be called for every 15 years.proposed/further revision(s) Proposed revisions would enhance companies' ability to exclude economically insignificant proposals.\nthe process of changing a document, book, etc. in order to improve it, correct mistakes, or make it contain the most recent information: New software will enable 1,000 new word revisions to be added online to the dictionary every three months.revision of sth Many employers have had difficulty understanding the 150-page revision of the document. We request shareholders' comments on the proposed revisions to paragraph (c)(1), and the adoption of proposed new paragraph (c)(2). The executive order was last updated in 2006 and is currently under revision."}