{"id":311791,"name":"revolution","type":"noun","us_sound":"ˌrev.əˈluː.ʃən","us_link":"../audio/r/revolution.mp3","uk_sound":"ˌrev.əˈluː.ʃən","uk_link":"../audio/r/ukrevie017.mp3","content":"revolution noun\n(POLITICS)\nAdd to word list\nAdd to word list\nB2 [ C or U ] a change in the way a country is governed, usually to a different political system and often using violence or war: The French Revolution changed France from a monarchy to a republic. The country seems to be heading towards revolution.\nMore examplesFewer examplesIt was very difficult to encapsulate the story of the revolution in a single one-hour documentary.Tomorrow is the 30th anniversary of the revolution.He became a national hero for his part in the revolution.The whole period leading up to the revolution is an interesting chapter in British history.The bigger farms were parcelled out after the revolution in 1973.\nSMART Vocabulary: related words and phrases\nTaking action against people in power\nanarchist\nangry young man\nanti-apartheid\nanti-state\nbring\ninsurgency\ninsurrection\nlevel up\nmutineer\nmutinous\nred flag\nrevolt\nrevolutionarily\nrevolutionary\nringleader\nsubversiveness\ntopple\ntroublemaker\nungovernable\nuprising\nSee more results »\nrevolution noun\n(CHANGE)\nB2 [ C ] a very important change in the way that people do things: a technological revolution Penicillin produced a revolution in medicine.\nMore examplesFewer examplesTrendspotter Faith Starr believes a revolution is going on in the world of conferencing.The development of high-yield varieties of rice produced a revolution in the country's agriculture.The new materials brought about a revolution in building technology.The invention marked the beginning of a revolution in information technology.The industrial revolution created an enormous increase in the production of many types of goods.\nSMART Vocabulary: related words and phrases\nChange and changes\nadjustment\nalteration\nanti-evolutionism\nbe ahead of the curve idiom\nblip\nevolutionism\nflatten\nflip-flop\nfluctuation\ngradation\ngyrate\nreinterpretation\nretransformation\nreversal\nreversion\nrhythm\nuntick\nvariation\nvicissitudes\nyouthquake\nSee more results »\nrevolution noun\n(CIRCULAR MOVEMENT)\n[ S ] a circular movement: The revolution of the earth around the sun was proposed by Copernicus.\n[ C ] one complete circular movement of something, for example a wheel: Engine speed can be measured in revolutions per minute (abbreviation rpm).\nSMART Vocabulary: related words and phrases\nRevolving, rotating and spinning\naround\naround and around idiom\nbackspin\nbirl\ncentrifugal\ncircuit\nrotary\nrotate\nrotation\nrotative\nrotatory\nspan\nspin\nswim\nswing\ntwirl\ntwirling\ntwirly\nunderspin\nwheel round\nSee more results »\nAdd to word list\nAdd to word list\nsocial studies a sudden and great change, esp. the violent change of a system of government: [ U ] The country seems to be heading toward revolution. [ C ] The discovery of penicillin produced a revolution in medicine.\na movement in a circle or curve around a central point: [ C ] The moon makes one revolution around the earth in about 29.5 days.\nAdd to word list\nAdd to word list\na big change or improvement in the way that something works or looks, or in the way that people do a particular activity: a revolution in sth Facing up to climate change requires a revolution in business thinking. an economic/technological/green revolution the digital/internet/IT revolution"}