{"id":311861,"name":"reward","type":"noun","us_sound":"rɪˈwɔːrd","us_link":"../audio/r/reward.mp3","uk_sound":"rɪˈwɔːd","uk_link":"../audio/r/ukrevie023.mp3","content":"Add to word list\nAdd to word list\nB1 something given in exchange for good behaviour or good work, etc.: There's a reward for whoever finishes first. The rewards of motherhood outweigh the anguish.\nB1 an amount of money given to someone who helps the police or who helps to return stolen property to its owner: The police offered a reward for any information about the robbery.\nMore examplesFewer examplesMost police informers receive a reward for their information.We should share (in) the reward.In this business, the risks and the rewards are high.He received a reward for his part in the rescue.The rewards of teaching compensated for the poor salary.\nSMART Vocabulary: related words and phrases\nPrizes, rewards and medals\n(the/a pot of gold at) the end of the rainbow idiom\nAcademy Award\naward\nbemedalled\nblue ribbon\nbooby prize\nbronze\ngong\ngrab bag\nGrammy\nhand something out\nhonour\nOscar\nplatinum disc\nprize\nPulitzer Prize\nrainbow\nstake\nthe golden boot\nthe wooden spoon\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGifts in the form of money\nDetection & solving crimes\nB2 to give someone a reward: The company rewarded him for his years of service with a grand farewell party and several presents. All his hard work was rewarded (= was made worth it) when he saw his book in print.formal He rewarded their kindness with hostility and contempt.\nMore examplesFewer examplesHe said if his results were good, he would reward him handsomely.The cake takes two hours to cook, but your patience will be richly rewarded.After a hard climb, we were rewarded by a picture-postcard vista of rolling hills under a deep blue summer sky.The school rewards pupils for good behaviour.The scheme is intended to reward customers for their loyalty.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nspare\nSee more results »\nAdd to word list\nAdd to word list\nsomething given in exchange for a useful idea, good behavior, excellent work, etc.: [ U ] Students hoped for more reward than an announcement in the school paper of their achievement. [ C ] The rewards (= benefits) of motherhood outweigh the difficulties.\nA reward is also an amount of money given to someone who gives information about a crime to the police or who helps to return lost or stolen property to its owner. reward verb [ T ] us\nYour browser doesn't support HTML5 audio\n/rɪˈwɔrd/\nHe was rewarded for his bravery with a medal from the president.\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; WORKPLACE, HR an advantage, for example more money or a better job, that someone receives if they are successful, work hard, etc.: To compete with bigger players, small firms will need to share more of the risk and reward of the new market with partners. Two firms each received £20,000 as a reward for their continued participation in the car-sharing scheme. Achieving targets has become an increasingly significant component of management incentives and rewards.a reward for sth In a performance culture, you need to let employees know there is a reward for high performance.receive/get/collect a reward Salespeople who are willing to work longer hours will receive significant rewards.win/earn a reward The company won a reward for developing the successful patent.provide/offer a reward Providing rewards to an entire group instead of to individuals can be an effective way to encourage positive group dynamics.\n[ C, usually plural, or U ] money that someone earns for doing a job, especially when this is a very large amount: financial/economic/monetary rewards big/huge/generous rewardsreap/receive/earn rewards The link between corporate performance and the big rewards reaped by directors should be more transparent.provide/offer a reward Most securities fraud cases offer too little reward for private attorneys to pursue.\n[ C or U ]\n&#160; STOCK MARKET, FINANCE money that is earned from successful investments: Some of these funds are high risk, but the potential rewards are enormous. Another area which has reaped rewards for investors is the bond fund arena, which tends to be less volatile and lower risk than equity funds.\n[ C ] an amount of money that is given to someone who provides important information about something: A four-figure reward for information was offered by a local businessman. a $10,000/£50,000/€100,000, etc. rewardoffer/put up a reward A series of high-profile ads in the newspapers offered a substantial reward to anyone who could help with the investigation.\nWORKPLACE, HR to give a person, company, or organization money or other advantages because they have been successful: The Industrial Exporter of the Year award will reward a company that has expanded outside the domestic market.be rewarded (for sth) Managers who innovate and focus on economic profit will be rewarded.reward sb for sth Bonuses are a management tool that reward employees for hard work.be rewarded by sb Companies that reduce earnings volatility and lower the probability of large losses are rewarded by financial markets with less expensive and better access to capital.\nSTOCK MARKET, FINANCE if investors are rewarded, they make a profit from their investments: be rewarded with sth Anyone who bought the shares at 425.5p in November will have been rewarded with a 12% return."}