{"id":312247,"name":"rhyme","type":"verb","us_sound":"raɪm","us_link":"../audio/r/rhyme.mp3","uk_sound":"raɪm","uk_link":"../audio/r/ukrewou028.mp3","content":"Add to word list\nAdd to word list\nC2 Words that rhyme have the same last sound: \"Blue\" and \"flew\" rhyme. Can you think of a word that rhymes with \"orange\"?\nMore examplesFewer examples'Bat and 'cat' rhyme.'Side' and 'hide' rhyme.'Hit' and 'sit' rhyme.\nSMART Vocabulary: related words and phrases\nLiterature\naccentual\naction hero\nalliterative\nalternative history\nanapest\nfemslash\nfiction\nfictionality\nfictionally\nfictive\nnon-canonical\nnon-character\nnon-literary\nnon-metrical\nnon-poetic\nswashbuckler\nsympathetically\ntanka\ntartan noir\ntheatrics\nSee more results »\n[ C ] a word that has the same last sound as another word: Can you think of a rhyme for \"orange\"?\nC2 [ C ] a short poem, especially for young children: a book of rhymes and songs See also\nnursery rhyme\nC2 [ U ] the use of rhymes in poetry: This poem is her first attempt at rhyme. in rhyme\nC2 written or spoken as a poem so that the word at the end of a line has the same last sound as a word at the end of another line: A lot of modern poetry is not written in rhyme.\nSee more\n[ C ]\n&#160; phonetics\n&#160; specialized (also rime) the vowel in the middle of a syllable, and any sounds after it in the syllable Compare\ncoda specialized\nonset specialized\nMore examplesFewer examplesPutting information into a rhyme can help you to remember it.She is best remembered for her illustrations for books of children's rhymes.The rhymes help children to appreciate the sounds and rhythms of language.A lullaby is a type of children's rhyme.The exhibition includes a rare edition of a collection of rhymes printed in 1781.\nSMART Vocabulary: related words and phrases\nLiterature\naccentual\naction hero\nalliterative\nalternative history\nanapest\nfemslash\nfiction\nfictionality\nfictionally\nfictive\nnon-canonical\nnon-character\nnon-literary\nnon-metrical\nnon-poetic\nswashbuckler\nsympathetically\ntanka\ntartan noir\ntheatrics\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: phonology & phonetics\nIdiom\nbe no/without rhyme or reason\nAdd to word list\nAdd to word list\nliterature (of words) to have the same final sound, or to use words that have the same final sound: [ I ] \"Love\" and \"above\" rhyme.\nliterature two or more words with the same final sound, or the use of such words, esp. at the ends of lines in a poem or song: [ C ] Can you think of a rhyme for \"orange\"? [ U ] She does not use rhyme in her poems."}