{"id":312432,"name":"rhythm","type":"noun","us_sound":"ˈrɪð.əm","us_link":"../audio/r/rhythm.mp3","uk_sound":"ˈrɪð.əm","uk_link":"../audio/r/ukrewou029.mp3","content":"Add to word list\nAdd to word list\nB2 [ C or U ] a strong pattern of sounds, words, or musical notes that is used in music, poetry, and dancing: He beat out a jazz rhythm on the drums. I've got no sense of rhythm, so I'm a terrible dancer.\nB2 [ C or U ] a regular movement or pattern of movements: She was lulled to sleep by the gentle rhythm of the boat in the water. She hit the ball so hard that her opponent had no chance to establish any rhythm in her game.\n[ C ] a regular pattern of change, especially one that happens in nature: the rhythm of the seasons Breathing and sleeping are examples of biological rhythms in humans.\nMore examplesFewer examplesAs he read the poem out loud, he mangled the rhythm so badly that it scarcely made any sense.The drummer beat out a steady rhythm while we marched.Their music is a blend of jazz and African rhythms.The music suddenly changed from a smooth melody to a staccato rhythm.Defibrillators are used to restore normal rhythm to the heart.\nSMART Vocabulary: related words and phrases\nTechnical music terms\naccidental\nadagio\naleatory\nantiphonal\narpeggio\narr.\ncadence\ngiusto\nglide\ngroove\nharmonic\nharmonic progression\nharmony\nlegato\nsyncopation\ntempered\ntempo\ntimbre\ntime signature\ntonal\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStraight, even and level\nChange and changes\nAdd to word list\nAdd to word list\nmusic a regularly repeated pattern of sounds or beats used in music, poems, and dances: [ C ] a jazz rhythm [ U ] You need a sense of rhythm to be a good dancer.\nRhythm is also a regular movement: [ C ] The rhythm of a boat rocking in the water lulled him to sleep.\nRhythm is also a regular pattern of change: [ C ] Waking and sleeping are examples of biological rhythms. rhythmic adjective us\nYour browser doesn't support HTML5 audio\n/ˈrɪð·mɪk/ (also rhythmical, us/ˈrɪð·mɪ·kəl/)\nThe rhythmic sound of the rain on the roof put the child to sleep."}