{"id":312734,"name":"ribbon","type":"noun","us_sound":"ˈrɪb.ən","us_link":"../audio/r/ribbon.mp3","uk_sound":"ˈrɪb.ən","uk_link":"../audio/r/ukrhyth008.mp3","content":"Add to word list\nAdd to word list\nC2 [ C or U ] a long, narrow strip of material used to tie things together or as a decoration: Sandra often wears a ribbon in her hair. He tied up the present with ribbon.\nPoh Kim Yeoh/EyeEm/GettyImages a ribbon of something literary\na long, narrow piece of something: A ribbon of road stretched ahead of us across the desert.\nSee more\n[ C ] a small piece of coloured material given to someone in the armed forces to show approval and admiration for their brave actions\nphotogress/iStock/Getty Images Plus/GettyImages\n[ C ] US a decorative object made of ribbon given as a prize in a competition: He won a blue ribbon for best hairdresser.\nTetra images/Getty Images /GettyImages\n[ C ] the narrow strip of material that contains the ink for a typewriter: My typewriter needs a new ribbon.\nChiccoDodiFC/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesA pink ribbon had been tied around the crown of the hat.She shook her hair loose from its ribbon.They bound the packages with brightly coloured ribbon.She tied the ribbon tightly in a bow.She wrapped the present and tied it with ribbon.\nSMART Vocabulary: related words and phrases\nBands, straps and strips\narmband\nband\nbar\nbinding\nblindfold\nbraid\ncollar\ndog collar\nduct tape\ngag\nloom bands\nmasking tape\nraffia\nriband\nrubber band\nstrap\nstreamer\nstripe\nsweatband\nthong\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrizes, rewards and medals\nIdioms\ncut/tear something/someone to ribbons\nin ribbons\nAdd to word list\nAdd to word list\na long, narrow strip of material used to tie things together or as a decoration: [ U ] He tied the present with ribbon. [ C ] fig. A ribbon of road stretched before us.\nA ribbon is also the narrow strip of material that contains the ink for a typewriter or computer printer."}