{"id":312814,"name":"rich","type":"adjective","us_sound":"rɪtʃ","us_link":"../audio/r/rich.mp3","uk_sound":"rɪtʃ","uk_link":"../audio/r/ukrhyth011.mp3","content":"rich adjective\n(MONEY)\nAdd to word list\nAdd to word list\nA2 having a lot of money or valuable possessions: He's the third richest man in the country. They're one of the world's richest nations. He is determined to get rich quickly. Synonym\nwealthy Opposite\npoor (NO MONEY)\nThesaurus: synonyms, antonyms, and examples\nhaving a lot of moneyrichShe's one of the richest women in the country.wealthyOliver's parents are very wealthy.well offAfter years of working hard, we are now quite well off.loadedThey don't have any money worries - they're loaded.flushHe's flush with cash.\nSee more results »\nMore examplesFewer examplesShe came out of the divorce settlement a rich woman.The divergence between the incomes of the rich and the poor countries seems to be increasing.Even when she became rich and famous, she never forgot her humble background.A lack of formal education is no bar to becoming rich.She grew up in the days when a woman's main aim was to snare a rich husband.\nSMART Vocabulary: related words and phrases\nRich and wealthy\nadvantaged\naffluence\nbankability\nbazillionaire\nbe rolling in it idiom\ncomfortably\nfat\nfilthy\nget-rich-quick\nMidas\nnot be short of a bob or two idiom\nprosperity\nself-supporting\nsit\nsolvent\nultra-rich\nwealthily\nwell endowed\nwell heeled\nwell off\nSee more results »\nrich adjective\n(HAVING A LOT OF STH)\nB2 containing a large amount of a valuable natural substance such as coal, oil, or wood: The region is rich in minerals and coal deposits. The country has vast oil reserves and rich deposits of other minerals. Synonyms\nabundant formal\nample (ENOUGH)\nplentifulOpposite\nscarce rich in something\nB2 containing a lot of something good or useful: Pineapple juice is rich in vitamins A and B.\nSee more\nRich land or soil contains a large amount of substances that help plants to grow: the richest arable land in the country -rich\nused in compounds to say that someone has a lot of a particular thing, or that something contains a lot of a particular substance: This type of pension plan is popular with business owners or property-rich investors.\nSee more\ncontaining a lot of exciting events or experiences and therefore very interesting: He has written a book about the island's rich history. She had a rich and varied life and met many famous and exciting people.\nIf the style of something such as a piece of furniture or a building is rich, it contains a lot of decoration: The temple is noted for its rich carvings.\nSMART Vocabulary: related words and phrases\nPlenty and abundant\nabound\nabound in/with something\nabundance\nabundant\nabundantly\ngenerous\ngenerously\nhandsomely\nhealthily\nin abundance\nlavish\nluxuriant\nplenteous\nplenteously\nplentiful\nplentifully\nplenty\nrichly\nunstinted\nwell off\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFertile or infertile land\nExciting and interesting\nAttractive\nrich adjective\n(ATTRACTIVE)\nA rich colour, sound, smell, or taste is strong in a pleasing or attractive way: This lipstick gives long-lasting rich colour. She produced a rich, deep tone from her clarinet. The wine has a rich aromatic flavour.\nA rich material is very beautiful and valuable: She wore a velvet skirt and a rich brocade jacket.\nMore examplesFewer examplesThis is a wonderful wine - honeyed and rich without being remotely cloying.I like rich jewel colours, such as purple, blue and green.The leaves on the trees have started to turn a rich coppery colour.She loved the beauty and fruitfulness of the autumn, when the whole countryside was ablaze with rich golden colours.His health suffered from over-indulgence in rich food and drink.\nSMART Vocabulary: related words and phrases\nPhysically strong and powerful\n(as) tough as old boots idiom\nbilly-o\nbrute\nbulletproof\nburly\nimpregnably\nindestructible\nindestructibly\nindustrial-strength\nintensely\nruggedly\nshatterproof\nshockproof\nsinewy\nsouped-up\nstalwart\nvengeance\nviolent\nwashboard stomach\nwith a vengeance idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTextiles: general words\nrich adjective\n(FOOD)\nB2 If food is rich, it contains a large amount of oil, butter, eggs, or cream: This chocolate mousse is too rich for me.\nSMART Vocabulary: related words and phrases\nVarious qualities of food\ncandy coat\ncandy-coated\ncitric\ncordon bleu\ncreamily\nfarmhouse\nfruity\nherby\nhomegrown\nhomemade\nhoppy\ninstant\nnutritious\nnutty\nsharpness\nshelf-stable\nsingle-estate\nstore-bought\nsugar-coated\nunbalanced\nSee more results »\nrich adjective\n(UNFAIR)\n[ after verb ] used to describe someone's opinions when that person has the same bad qualities as the person they are criticizing: The education minister's criticism of the new exam system seems rich, considering it was he who demanded the changes in the first place. \"He said I looked fat.\" \"That's a bit rich coming from him.\" (= he himself is fat)\nSMART Vocabulary: related words and phrases\nDishonest\nartificiality\nbad faith\nbe rotten to the core idiom\nbent\ncowboy\ndubiously\nfalse\nfinagle\nfishy\nfly-by-night\nmalfeasance\nmendacious\nmendaciously\nmisleading\nmisleadingly\nuncandid\nunder false pretences phrase\nunderhand\nunreliability\nunreliable\nSee more results »\nthe rich\nC1 rich people considered together as a group: The resort is frequented by the rich and famous. Opposite\nthe poor\nSMART Vocabulary: related words and phrases\nRich people\nadvantaged\nballer\nbeautiful\nchampagne socialist\ndeb\nelite\nfat cat\ngilded\nmagnate\nmillionairess\nmulti-millionairess\nnouveau riche\npreppy\nscion\nsocialite\nsquattocracy\nsquillionaire\ntax exile\nthe jet set\nyuppify\nSee more results »\ncontaining a large amount of a valuable substance: milk and other calcium-rich food an oil-rich country\nSMART Vocabulary: related words and phrases\nIncluding and containing\nabsorptive capacity\naccessibly\nall in\nassimilable\nassimilate\ncarry\nconcern\ndrag\ndraw\nEDI\nEDIB\nembody\nembracingly\nencompass\nincorporation\ninvolve\nnumber someone/something among someone/something\nO, o\npack something in\nplug\nSee more results »\nrich adjective [-er/-est only]\n(WEALTHY)\nAdd to word list\nAdd to word list\nhaving a lot of money or valuable possessions; wealthy: a rich man The United States is one of the world’s richest nations.\nRich also means made of something beautiful and expensive or valuable: a rich brocade jacket\nrich adjective [-er/-est only]\n(HAVING A LOT)\nhaving or containing a large amount of something desirable or valuable: The country is rich in oil, minerals, and timber. Orange juice is rich in vitamin C. The island has a rich and complex history\nEarth that is rich contains a large amount of substances that help plants to grow.\nIf the style or decoration of something, such as a piece of furniture or a building, is rich, it has a large amount of valuable and beautiful decoration.\nrich adjective [-er/-est only]\n(FOOD)\n(of food) containing a large amount of oil, butter, eggs, or cream: This chocolate butter cream is too rich for me.\nrich adjective [-er/-est only]\n(COLOR/SOUND)\n(of a color, sound, smell, or taste) strong in a pleasing or attractive way: The fields were bathed in a rich, red-gold light from the setting sun. He has a rich, resonant voice.\nrich plural noun\n(WEALTHY)\npeople who have a lot of money or valuable possessions: The resort is crowded with the rich and famous in winter.\nAdd to word list\nAdd to word list\nhaving a lot of money or valuable possessions: He's the third richest man in Britain. All of the world's richest nations were invited to attend the summit. We're not rich but we try to give to charity as often as we can. get rich Her only aim is to get rich quickly. The rich are getting richer while the poor are getting poorer.\nNATURAL RESOURCES containing a large amount of a valuable natural substance such as coal, iron, or wood: The country has vast oil reserves and rich deposits of other minerals.be rich in sth The region is rich in minerals and coal deposits.\nthe rich\npeople who have a lot of money or valuable possessions: The very rich really can't begin to understand the problems of ordinary people."}