{"id":312936,"name":"ride","type":"verb","us_sound":"raɪd","us_link":"../audio/r/ride.mp3","uk_sound":"raɪd","uk_link":"../audio/r/ukrhyth029.mp3","content":"Add to word list\nAdd to word list\nA1 [ I or T ] to sit on something such as a bicycle, motorbike, or horse and travel along on it controlling its movements: I learned to ride a bike when I was six. I ride my moped to work. I ride to work on my moped. The hunters came riding by/past on their horses.\n[ I ] to ride a horse: Can you ride? Their daughter is learning to ride. He rides well/badly.\nA2 [ I or T ] to travel in a vehicle, such as a car, bus, or train: He doesn't have a car so he rides to work on the bus.mainly US We rode the train from San Diego to Portland.\n[ T ] US to try to control someone and force them to work: Your boss is riding you much too hard at the moment.\nMore examplesFewer examplesCan you ride a bike?I've told you many a time not to ride your bike on the pavement.She won't have any troubles learning to ride a horse - you can see she's a natural.She mounted her horse and rode off.As a young girl, she spent every weekend riding her pony.\nSMART Vocabulary: related words and phrases\nTravelling\naround Robin Hood's barn idiom\nbackpack\nbag drop\nbourne\nbum\nbum around\ncommunication\ncommuting\nconnection\nhitch\nmove\nnegotiate\nRobin Hood\nshuttle\nsuper-commuting\ntaken\ntour\ntransoceanic\nvisa\nwell travelled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nJourneys\nHorse riding\nCausing somebody to act\nSee also\nride roughshod over someone/somethingIdioms\nbe riding for a fall\nbe riding high\nlet something ride\nride (on) a wave of something\nride herd on someone/something\nride (out) the stormPhrasal verbs\nride on something/someone\nride something out\nride up\nB1 a journey on a horse or bicycle, or in a vehicle: It's a short bus ride to the airport. I went for a (horse) ride last Saturday. Do you want to come for a ride on my bike?\nB1 mainly US (UK usually lift) a free journey in a car to a place where you want to go: He asked me for a ride into town.\nThesaurus: synonyms, antonyms, and examples\nto take someone somewheretakeI have to take my mother to the doctor today.go withI offered to go with him to the police station.come withCan you come to the hospital with me?accompanyChildren under 12 must be accompanied by an adult.driveMy husband usually drives the kids to school.give someone a liftCan you give me a lift into town?\nSee more results »\nUS a person who gives you a ride in their car: Well, I have to go - my ride is here.\nUS informal someone's car: Hey, nice ride.\nB1 a machine in an amusement park that people travel in or are moved around by for entertainment: We went on all the rides. My favourite ride is the Ferris wheel.\nI love travelling..So I have clicked these pictures./iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesHang on tight - it's going to be a very bumpy ride.A five-mile bike ride? That's kids' stuff.It's a 20-minute bus ride.I gave her a piggyback ride.I gave her a ride when her car broke down.\nSMART Vocabulary: related words and phrases\nJourneys\nadventure\nbreak-journey\ncarpool\ncarpooling\ncircumnavigation\ncommuting\nexpedition\nfield trip\ngrand tour\nhaul\njaunt\njourney\njunket\nlayover\nmove\nodyssey\nsail\nseafaring\ntrip\nwanderings\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTaking someone somewhere or telling them the way\nHotels & hostels\nCarnival, fairground & circus\nIdioms\na full ride\na rough ride\ntake someone for a ride\nAdd to word list\nAdd to word list\nto sit on a horse, bicycle, etc. and travel on it while controlling its movements, or to travel in a vehicle, such as a car, bus, or train: [ I ] I ride to work on my bike. [ T ] We rode the subway from Coney Island to the Bronx.\nTo ride someone is to criticize someone, esp. to forcefully persuade that person to do more or to do what you want: [ T ] Your boss rides you much too hard. Idioms\nride a wave of something\nriding highPhrasal verbs\nride on something\nride out something\nride up\na trip on an animal or bicycle, etc., or in a vehicle: It’s a short bus ride to the airport.\nA ride is also a machine in an amusement park which spins or moves people for entertainment: My favorite ride is the Ferris wheel.\nAdd to word list\nAdd to word list\nto deal effectively with a situation that changes quickly or is difficult, usually getting an advantage from it: He came to Iowa Falls in 1985, and has ridden the ups and downs of the rural economy ever since. They rode the stock market recovery so effectively that the value of their portfolio increased by 146% during the last quarter.\nbe riding for a fall\nto be involved in a situation that may end badly: The specialist mortgage lender's lowly rating is because of widespread concerns that the buy-to-let housing market is riding for a fall.\nbe riding high\nto be having a period of great success: Shares in the telecoms company are riding high, at around $24 per share.\nride the wave (of sth) (also ride the crest of a wave)\nto enjoy the advantages of a particular situation: Banks who rode the mortgage wave for years are now experiencing much harder times. Phrasal verbs\nride on sth\nride sth out\na bumpy/rough/easy, etc. ride informal\nused to describe a situation that is dangerous, difficult, easy, etc.: Stocks could be in for a bumpy ride as Wall Street tries to guess the outcome of the Federal Reserve's next monetary policy meeting. See also\nfree ride noun\ntake sb for a ride informal\nto intentionally do something dishonest or unpleasant in order to get an advantage for yourself: Some so-called \"market professionals\" have been taking inexperienced shareholders for a ride."}