{"id":313129,"name":"rightly","type":"adverb","us_sound":"ˈraɪt.li","us_link":"../audio/r/rightly.mp3","uk_sound":"ˈraɪt.li","uk_link":"../audio/r/ukrider022.mp3","content":"rightly adverb\n(MORALLY ACCEPTABLE)\nAdd to word list\nAdd to word list\nB2 behaving in a way that is suitable and acceptable: They quite rightly complained to the manager. rightly or wrongly\nused to mean that something may or may not be morally correct, but it is a fact: Rightly or wrongly, she has been given the post of managing director.\nSee more\nMore examplesFewer examplesHe's very concerned about the situation and rightly so.She quite rightly felt very cross about how she'd been treated.They quite rightly said they wouldn't accept the proposal.She quite rightly said she wasn't going to do the extra work.James, quite rightly, asked her to moderate her language.\nSMART Vocabulary: related words and phrases\nVirtue and moral good\naltruism\nangel\nangelic\nangelically\nbe as pure as the driven snow idiom\njustifiable\njustifiably\njustified\nloftiness\nlofty\nrightfully\nrightness\nsaintly\nself-forgetful\nthe road to hell is paved with good intentions idiom\nuprightly\nuprightness\nupstanding\nvirtuous\nvirtuously\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSuitable and acceptable\nrightly adverb\n(CORRECTLY)\nB2 in a correct or exact way: Many people rightly believe that the war is a sham.\nSMART Vocabulary: related words and phrases\nAccurate and exact\naccuracy\naccurate\naccurately\naright\nauthoritative\nfor all the world idiom\nGoldilocks\ngot it in one! idiom\nin so many words idiom\ninfallible\nliterally\nnose\nprecisely\nsharp\nstrictly speaking idiom\nsuperaccurate\nsynchronization\ntechnically\ntightness\ntruly\nSee more results »\nGrammar\nRight or rightly?We use both right and rightly as adverbs, but they are used in different ways and with different meanings. …\nrightly adverb [not gradable]\n(WISELY)\nAdd to word list\nAdd to word list\nwith good judgment: You did have the opportunity, and rightly or wrongly, you didn’t follow up on it.\nrightly adverb [not gradable]\n(MORALLY)\nin a way that is considered to be morally good or acceptable or fair: She rightly protested against the idea that women can’t succeed in politics.\nrightly adverb [not gradable]\n(WITHOUT DOUBT)\nwith freedom from doubt: I think these people don’t rightly know what they’re doing."}