{"id":313100,"name":"right","type":"adjective","us_sound":"raɪt","us_link":"../audio/r/right.mp3","uk_sound":"raɪt","uk_link":"../audio/r/ukrider015.mp3","content":"right adjective\n(CORRECT)\nAdd to word list\nAdd to word list\nA1 correct: You got three answers right and two wrong. I set the clock to the right time. \"Is that Ms Kramer?\" \"Yes, that's right.\" Am I right in thinking (= is it true) that you will be at the conference? You're right to be annoyed - you've been treated very badly. You must put matters right (= make the situation better) by telling the truth. Compare\nwrong adjective (NOT CORRECT)\nThesaurus: synonyms, antonyms, and examples\nagreeing with factscorrectThat answer is correct.rightAll his answers were right.trueIs it true that you were born in Sweden?faithfulThis is a faithful account of what happened on the night of 30 May.\nSee more results »\nA1 If you are right about something or someone, you are correct in your judgment or statement about it, him, or her: You were right about Pete - he's a real troublemaker.\nMore examplesFewer examples\"I think you're absolutely right,\" concurred Chris.\"Was it wrong of me to go to the police?\" \"Oh no, I'm sure you did the right thing.\"I have a faint suspicion that you may be right!I'm fairly sure that this is the right address.Take a chance and follow your nose - you may be right!\nSMART Vocabulary: related words and phrases\nAccurate and exact\naccuracy\naccurate\naccurately\naright\nauthoritative\nfor all the world idiom\nGoldilocks\ngot it in one! idiom\nin so many words idiom\ninfallible\nliterally\nnose\nprecisely\nsharp\nslap\nstrictly\nstrictly speaking idiom\nsuperaccurate\nsynchronization\ntechnically\nSee more results »\nright adjective\n(SUITABLE)\nB1 suitable or correct, or as it should be: He's the right person for the job. I think you've made the right decision. The temperature of the swimming pool was just right (= exactly as I wanted it). That hat looks just right on you. He thought the time was right to let his intentions be known. Compare\nwrong adjective (NOT SUITABLE)\nThesaurus: synonyms, antonyms, and examples\nsuitablesuitableThis film contains language that is not suitable for children.appropriateIs this film appropriate for young children?apt\"Unusual\", yes, that's a very apt description.fittingThe promotion was a fitting reward for all his hard work.\nSee more results »\nused to refer to a person who is considered to be socially important or a place that such people go to: She knows all the right people. He likes to be seen in the right clubs and restaurants. the right way round/up UK (US the right way around/up)\nin the correct position: The lid has to go on the right way round or it won't fit.\nSee more\nMore examplesFewer examplesShe fished in her tool box for the right spanner.She knew that Dave wasn't the right man for her but she couldn't deny the animal attraction between them.I was fumbling for the right word.Apropos what you said yesterday, I think you made the right decision.This carpet would be just right for the dining room.\nSMART Vocabulary: related words and phrases\nSuitable and acceptable\nable\nacceptability\nacceptable\nacceptably\naccepted\nconvenience\nconveniently\ncorrectly\ncorrectness\ndecent\ndecently\nfelicity\njust what the doctor ordered idiom\nlegitimate\npractical\nre-eligibility\nre-eligible\nrelevance\nrelevant\nrelevantly\nSee more results »\nright adjective\n(MORALLY ACCEPTABLE)\nB2 [ after verb ] considered fair or morally acceptable by most people: I don't believe they should have put him in prison. It isn't right. [ + to infinitive ] It's not right to criticize people behind their back. [ + that ] It is only (= completely) right that men and women should be paid the same for doing the same work. Compare\nwrong adjective (NOT MORAL)\nMore examplesFewer examples\"Was it wrong of me to go to the police?\" \"Oh no, I'm sure you did the right thing.\"I'm sure you did the right thing in telling her about the problem.It's not right to treat another human being like that.It's only right that the two children be treated the same.I don't think it's right to spend so much money on yourself.\nSMART Vocabulary: related words and phrases\nVirtue and moral good\naltruism\nangel\nangelic\nangelically\nbe as pure as the driven snow idiom\njustifiable\njustifiably\njustified\nloftiness\nlofty\nrightfully\nrightly\nrightness\nsaintly\nthe road to hell is paved with good intentions idiom\nupliftment\nuprightly\nuprightness\nupstanding\nvirtuous\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nJustice and fairness\nright adjective\n(HEALTHY)\nhealthy, or working correctly: I haven't felt right since I ate that meal last night. Something isn't quite right with the brakes on your bike.\nSMART Vocabulary: related words and phrases\nAnimal physiology: fit & healthy\nacrobatically\nagility\nagree with something\namazonian\nathleticism\nbe (as) fit as a fiddle idiom\nglow\nhard/tough as nails idiom\nin the pink idiom\nlimber\nmatch fit\nmatch fitness\nmuscled\nnon-disabled\non top form phrase\nrobust\nrude\nthe able-bodied\ntrim\nvirility\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMachines - Functioning\nright adjective\n(COMPLETE)\n[ before noun ] UK informal used for emphasizing when something is bad: He's a right idiot. His house is a right mess.\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabsolutely\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\nright adjective\n(DIRECTION)\nA2 on or towards the side of your body that is to the east when you are facing north: Most people write with their right hand. He likes to sleep on the right side of the bed. Compare\nleft adjective adverb\nMore examplesFewer examplesHe wrenched his right shoulder during a game of hockey.In the US, you drive on the right side of the road, but in Britain the converse applies.\nSMART Vocabulary: related words and phrases\nGeneral location and orientation\nabout\nalong\nanterior\naround\nback onto something\nfix\nforward\nin situ\nleft\nleft-hand\nnearside\nnoncentral\noffside\non-site\nposition\nright-hand\nright/wrong way round idiom\nround\nside-on\nspot\nSee more results »\nIdioms\nbe (as) right as rain\nbe not (quite) right in the head\nbe not in your right mind\nbe on the right lines\nbe on the right track\ngive your right arm\nin the right place at the right time\npress/push the right button(s)\nput/set someone right\na right one\nMore idioms\nthe right stuff\nright adverb\n(DIRECTION)\nA2 on or towards the side of your body that is to the east when you are facing north: Turn/Go right (= take the road on the right) at the first traffic lights.\nSMART Vocabulary: related words and phrases\nDirection of motion\nabduct\nabduction\nadduct\nadduction\naround\ncircumduction\ncross-country\ndestined\ndirection\ndirection of travel\nen route\nfollow\ngo\ninto\nmultidirectional\noutbound\noverland\nstraightly\nthe right/wrong/other way around idiom\nwest\nSee more results »\nright adverb\n(EXACTLY)\nB1 exactly or all the way: I've got a pimple right on the end of my nose. They built a row of hotels right along the sea-front.\nused for emphasis: The car ran right (= completely) out of fuel. She walked right (= all the way) past me without noticing me. I'll be right back/I'll be right with you (= I will return very soon). right away mainly US (also right off)\nB1 immediately: I'll call them right away, because if I wait, I'll probably forget to do it.\nSee more right now\nat the present time: We're very busy right now.\nB1 mainly US immediately: You'd better leave right now.\nSee more\nSMART Vocabulary: related words and phrases\nAccurate and exact\naccuracy\naccurate\naccurately\naright\nauthoritative\nfor all the world idiom\nGoldilocks\ngot it in one! idiom\nin so many words idiom\ninfallible\nliterally\nnose\nprecisely\nsharp\nslap\nstrictly\nstrictly speaking idiom\nsuperaccurate\nsynchronization\ntechnically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: very & extreme\nright adverb\n(IN TITLES)\nused as part of the title of particular people, such as bishops and some members of Parliament: the Right Honourable Diane Abbott, MP\nSMART Vocabulary: related words and phrases\nReligious titles\nbeadle\nbrother\neminence\nfather\nFr.\ngrace\nlama\nMonsignor\nmother\nMsgr\npandit\nrev\nRevd\nReverend\nsaint\nst\nswami\nthe Very Reverend\nVicar of Christ\nSee more results »\nright adverb\n(CORRECTLY)\nB2 correctly: Why does he never do anything right?\nSMART Vocabulary: related words and phrases\nAccurate and exact\naccuracy\naccurate\naccurately\naright\nauthoritative\nfor all the world idiom\nGoldilocks\ngot it in one! idiom\nin so many words idiom\ninfallible\nliterally\nnose\nprecisely\nsharp\nslap\nstrictly\nstrictly speaking idiom\nsuperaccurate\nsynchronization\ntechnically\nSee more results »\nright adverb\n(SUCCESSFULLY)\ngo right\nIf something goes right, it is successful or happens in a way that you hoped it would: Things haven't been going right for me these past few months.\nSee more Grammar\nRight or rightly?We use both right and rightly as adverbs, but they are used in different ways and with different meanings. …\nIdioms\nright behind someone\nright, left, and centre\nright noun\n(DIRECTION)\nA2 [ S ] the right side: English is written and read from left to right. King's Avenue is the first right (= the first road on the right side). In this photo, my wife is the woman standing on/to my right.US I took/made (informal hung) a right (= turned into the next road on the right side) after crossing the bridge.\nMore examplesFewer examplesItalic writing slants to the right.Tens go in the left-hand column and units in the right.We have to turn down/into/up the next road on the right.Ours is the third road on the right.Go up the stairs and her office is on the right.\nSMART Vocabulary: related words and phrases\nGeneral location and orientation\nabout\nalong\nanterior\naround\nback onto something\nfix\nforward\nin situ\nleft\nleft-hand\nnearside\nnoncentral\noffside\non-site\nposition\nright-hand\nright/wrong way round idiom\nround\nside-on\nspot\nSee more results »\nright noun\n(POLITICS)\nthe right [ S, + sing/pl verb ] (also the Right)\nC2 political parties or people that have traditional opinions, and that believe in low taxes, property, and industry being privately owned, and less help for the poor: The right was/were in power after 1979. He's a man of the far (= extreme) right. Compare\nleft noun (POLITICS)\nMore examplesFewer examplesHe's certainly on the right.The right campaigned against the president.Politicians on the right are naturally in favour of the proposal.The far right are gaining in popularity.She's on the right of the party.\nSMART Vocabulary: related words and phrases\nPolitical movements & groups\nalt-right\nANC\nanti-Bolshevik\nanti-Bolshevism\nanti-capitalism\nbig tent\nblack bloc\nBlairite\nBlue Dog\nleft-winger\nleftism\nleftist\nleftward\nlefty\nsectarian\nsectarianism\nsegregationist\nSinn Fein\nthe awkward gang idiom\nthe SDLP\nSee more results »\nright noun\n(MORALLY ACCEPTABLE)\nB2 [ U ] what is considered to be morally good or acceptable: Your conscience should tell you the difference between right and wrong. in the right\nIf you are in the right, what you are doing is morally or legally correct: You're definitely in the right - there's no doubt about that.\nSee more\nB2 [ C or U ] the fact that a person or animal can expect to be treated in a fair, morally acceptable, or legal way, or to have the things that are necessary for life: She campaigned for women's rights during the 1960s. Everyone has a right to education. She has no more right to a company car than I have (= she does not deserve one more than I do). [ + to infinitive ] You're not my boss, so what right (= authority) do you have to tell me what to do? You have every right (= you have a good reason) to complain. within your rights\nIf you are within your rights to do something, you are legally allowed to do it: I think I'm quite within my rights to demand a full refund.\nSee more rights [ plural ]\nlegal controls over who is allowed to use a book or film: He has acquired the film rights to the book (= he is allowed to make a film of the book).\nnew shares in a particular company that have become available for people to buy who already own shares: The company made a rights issue of one new share for every four held.\nSee more put/set something to rights\nto improve or correct something: The company needs over a million dollars to set its finances to rights.\nSee more\nMore examplesFewer examplesFreedom of speech is a cherished right in this country.These organizations have fought very hard for the rights and welfare of immigrants.She's also a veteran campaigner for human rights.Freedom of speech should be a constitutional right.Just because you've been promoted that doesn't give you a divine right to tell us all what to do.\nSMART Vocabulary: related words and phrases\nVirtue and moral good\naltruism\nangel\nangelic\nangelically\nbe as pure as the driven snow idiom\njustifiable\njustifiably\njustified\nloftiness\nlofty\nrightfully\nrightly\nrightness\nsaintly\nthe road to hell is paved with good intentions idiom\nupliftment\nuprightly\nuprightness\nupstanding\nvirtuous\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMorality and rules of behaviour\nIdioms\nby right of\nby rights\nin your own right\nthe rights and wrongs\nright exclamation\n(AGREEMENT)\nA2 used to express agreement with someone or to show that you have understood what someone has said: \"Johnny, you climb up first.\" \"Right.\"\nA2 said when you want to make a group of people notice you, especially so that you can start an activity: Right, everyone. Could you all stop talking, and then we'll begin.\nsaid between parts of a story that you are telling, in order to make certain that people are paying attention and understanding: So there I was right, middle of the night, right, and this guy came up to me...\nMore examplesFewer examples\"You start work on that pile then.\" \"Right.\"\"We'll pick you up at eight o'clock.\" \"Right.\"Right, we've got a lot of work to get through so we'd better start now.Right, if you're ready, I'll begin.Right, if you don't mind I'd like to start this session.\nSMART Vocabulary: related words and phrases\nUnderstanding and comprehending\nappreciation for something\napprehend\napprehensible\napprehension\nastutely\nbear\ncatch\ncolour\nhandle\nkeep someone up\nknow a hawk from a handsaw idiom\nknow the score idiom\nknow/see where someone is coming from idiom\nlatch\ntease something apart\nto get a handle on something idiom\nto have a handle on something idiom\ntumble to something\ntune in\nunderstanding\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWords & phrases expressing agreement & acceptance\nLinguistics: interjections\nLinguistics: connecting words joining words or phrases with similar or related meanings\nGrammar\nTagsTags are either questions, statements or imperatives added to a clause to invite a response from the listener: …\nTags: usesTags are either questions, statements or imperatives added to a clause to invite a response from the listener: …\nTags: formTags consist of one of the auxiliary verbs be, do or have, or the main verb be, or a modal verb, plus a subject, which is most commonly a pronoun: …\nQuestion tagsQuestion tags turn statements into yes-no questions. There are two types. …\nImperative tagsA tag after an imperative clause softens the imperative a little. The tag verb is most commonly will but we can also use would, could, can and won’t: …\nStatement tagsWe can use a statement tag to emphasise or reinforce an affirmative statement. The tag is also affirmative. They typically invite the listener to agree or sympathise in some way, or to offer a parallel comment. Statement tags are very informal: …\nUniversal tags: right, yeahWe can use right and yeah in very informal situations instead of question tags: …\nIdioms\nright you are!\ntoo right\nformal If you right a situation or a mistake, you make it better or correct it: It's a terrible situation and we should right it as soon as possible.\nIf a boat rights itself, it turns itself back to its correct position in the water: The canoe will right itself if it capsizes.\nSMART Vocabulary: related words and phrases\nCorrecting and mending\ncalibration\nclean (someone/something) up\ncorrection\nfiddle\nfiddle (around) with something\nfine-tune\nrecondition\nreconstruct\nreconstruction\nrectifiable\nrectification\nremedy\nrevise\nscratch\nservicing\nset/put the record straight idiom\nsmooth something away\nsmoothen\nsort\ntinker\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStaying afloat, capsizing & sinking\nright adjective, adverb\n(CORRECT)\nAdd to word list\nAdd to word list\ncorrect, true, or exact: He said the trip would take two hours and he was absolutely/exactly right. My watch has stopped – do you have the right time? Ellen is the right person for the job. She got every answer right.\nright adjective, adverb\n(SUITABLE)\nsuitable or desirable, or as it should be: [ + to infinitive ] He thought the time was right to expand his new business. That hat looks just right on you.\nright adjective, adverb\n(HEALTHY)\n[ not gradable ] healthy, or working correctly: I haven’t felt right all day.\nright adjective, adverb\n(MORAL RULE)\n[ not gradable ] considered fair or morally acceptable by most people: It isn’t right to tell a lie. Idioms\nget off on the right foot\nright away\nright on\nright on (the money)\nright adjective\n(WISE)\nhaving or showing good judgment; wise: [ + to infinitive ] The president was right to veto that bill. I think we reached the right conclusion.\nright noun\n(LEGAL OPPORTUNITY)\n[ C ]\n&#160; social studies your opportunity to act and to be treated in particular ways that the law promises to protect for the benefit of society: civil/human rights You have a right to a trial by jury. [ + to infinitive ] Patients have a right to keep their medical records confidential. The dispute is over fishing rights.\nright noun\n(POLITICS)\n[ U ]\n&#160; politics &amp; government political groups that believe in limited government and economic controls, private ownership of property and wealth, and traditional social attitudes\nright adjective, adverb, noun [C/U]\n(DIRECTION)\nthe side of the body opposite the side that contains the heart, or the direction that is the opposite of left: Most people throw a ball with their right hand. Our house is on the right. [ C ] After you go over the bridge, make a right (= turn to the right).\nright exclamation\n(AGREEMENT)\nused to express agreement with someone or to show that you have understood what someone has said: \"Robert, be sure to pick up Susan on your way home.\" \"Right.\"\nright adverb [not gradable]\n(EXACTLY)\nexactly; just: I’m too busy to talk right now but I’ll get back to you later. He sat right behind me. I’ll be right back (= I will return very soon).\nAdd to word list\nAdd to word list\n[ C or U ] someone who has the right to something, or the right to do something, is allowed to have it or do it, often legally or officially: have a right to sth Everybody has a right to equal treatment.have the right to do sth Shareholders have the right to vote on the appointment of a new CEO. She is a leading campaigner for consumer rights. workers'/employment rights human/civil rights voting/property rights\nrights [ plural ]\nLAW if a person, company, or organization has the rights to something, they are legally allowed to buy, sell, broadcast, etc. that thing: If the group loses the court case, it will lose its exclusive rights to broadcast live games. distribution rights film/TV/broadcasting rights licensing/marketing rights\nall rights reserved\nLAW a phrase used to show that a particular person or particular people own the rights to a book, film, etc.\nrights [ plural ]\nSTOCK MARKET new shares in a particular company that have become available for existing shareholders to buy: The company made a rights issue of one new share for every four held. See also\nex-rights\ngrandfather rights\ninalienable right\nmoral rights\npatent right\npension rights\nperforming rights\npre-emption rights\nproperty rights\nproprietary rights\nView all\nstock right"}