{"id":313145,"name":"rigidity","type":"noun","us_sound":"rɪˈdʒɪd.ə.t̬i","us_link":"../audio/r/eus73996.mp3","uk_sound":"rɪˈdʒɪd.ə.ti","uk_link":"../audio/r/ukrider026.mp3","content":"rigidity noun [U]\n(STIFFNESS)\nAdd to word list\nAdd to word list\nthe quality of being stiff, fixed, or impossible to bend: Cables lack the rigidity of wires. The roof has special beams to increase rigidity.\nMore examplesFewer examplesMinerals provide bone with its rigidity.The case is a two-piece aluminum housing shaped for high rigidity. Parkinson's disease causes uncontrollable tremors and muscular rigidity.\nSMART Vocabulary: related words and phrases\nHard and firm\n(as) stiff/straight as a ramrod idiom\nadamantine\ncast iron\ncongealed\ncrisp\ncrisply\ndilatancy\ndilatant\nerect\nfirm\nfirmness\nfossilized\npetrified\nramrod\nrigid\nrock-hard\nrock-solid\nsolidly\ntense\nunyielding\nSee more results »\nrigidity noun [U]\n(IMPOSSIBLE TO CHANGE)\ndisapproving the quality of being impossible to change or persuade: FlexiLoan has been developed for customers who are looking for the freedom to spend, without the rigidity of a fixed loan. Thomas displays a rigidity in thinking that extends beyond ideology.\nMore examplesFewer examplesThis rigidity prevents them from adjusting and reformulating their programmes.In an administration known for its rigidity, she's been flexible.Extremist doctrinal rigidity and aggressiveness were preferred to constructive attempts to confront real issues.\nSMART Vocabulary: related words and phrases\nNot able to be changed\nbe no hard and fast rules idiom\nburn your boats/bridges idiom\ncongenital\ncontinuity\ndeep-seated\nincorrigible\nincurably\ninelastic\ninelasticity\ninflexible\nirreversible\nirreversibly\nirrevocable\nirrevocably\nleopard\nsb's way or the highway idiom\nunchangeable\nuncompromising\nuncompromisingly\nunredeemable\nSee more results »\nSee\nrigid\nAdd to word list\nAdd to word list\nthe quality or characteristic of not permitting any change: We will make sure that federal law operates with high standards and common sense, not just bureaucratic rigidity (= not just lack of willingness to change by government officials ).\nthe quality of not being able to bend or be bent: Steel is known to lose half of its rigidity at 1,000 degrees and begins to melt at 2,750 degrees."}