{"id":313173,"name":"rigorously","type":"adverb","us_sound":"ˈrɪɡ.ɚ.əs.li","us_link":"../audio/r/usrhizo028.mp3","uk_sound":"ˈrɪɡ.ər.əs.li","uk_link":"../audio/r/ukrigor001.mp3","content":"rigorously adverb\n(CAREFULLY)\nAdd to word list\nAdd to word list\napproving in a careful way so that every part of something is looked at or considered to make certain it is correct or safe: The plutonium fuel cells had been rigorously tested. Isabel thinks rigorously and creatively about many different things.\nMore examplesFewer examplesManufacturers rigorously test new products to avoid skin reactions in those who use them.The state should be rigorously checking these licensees.The competition is rigorously even-handed in gender terms.\nSMART Vocabulary: related words and phrases\nAccurate and exact\naccuracy\naccurate\naccurately\naright\nauthoritative\nfor all the world idiom\nGoldilocks\ngot it in one! idiom\nin so many words idiom\ninfallible\nliterally\nnose\nprecisely\nsharp\nstrictly speaking idiom\nsuperaccurate\nsynchronization\ntechnically\ntightness\ntruly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCautious and vigilant\nrigorously adverb\n(SEVERELY)\nin a way that controls behaviour severely: The rules were applied too rigorously. Driving bans for serious offences should be rigorously enforced.\nMore examplesFewer examplesThe company has an extremely stringent and rigorously applied safety policy.China has been rigorously enforcing the wearing of seat belts.Impurities could stay in the soil for up to 16 years if not rigorously controlled.\nSMART Vocabulary: related words and phrases\nSevere\nan iron hand/fist in a velvet glove idiom\naustere\nausterely\nauthoritarian\nbe heavy on someone idiom\nbrutally\nflaming\nharsh\nharshness\nnonsense\nnot stand any nonsense idiom\npitiless\nseverity\nsharp\nsharply\nsharpness\nstern\nsternly\nsternness\nstiffly\nSee more results »\nSee\nrigorous\nAdd to word list\nAdd to word list\nin a detailed and careful way: Reputable manufacturers test rigorously to make sure their products perform at the highest level.\nin a strict or severe way: Laws are rigorously enforced."}