{"id":313305,"name":"ring","type":"noun","us_sound":"rɪŋ","us_link":"../audio/r/ring.mp3","uk_sound":"rɪŋ","uk_link":"../audio/r/ukrigor009.mp3","content":"ring noun\n(CIRCLE)\nAdd to word list\nAdd to word list\nB2 [ C ] a circle of any material, or any group of things or people in a circular shape or arrangement: The game involved throwing metal rings over a stick. The children sat in a ring around the teacher.\nMartin Barraud/OJO Images/GettyImages\nA2 [ C ] a circular piece of jewellery worn especially on your finger: He bought her a diamond/emerald, etc. ring (= a ring with a jewel attached to it).\nkisgorcs/iStock/Getty Images Plus/GettyImages\n[ C ] a group of people who help each other, often secretly and in a way that is to their advantage: a drug ring a spy ring See also\nringleader\n[ C ] (US usually element) a circular piece of material often made of metal that can be heated in order to be used for cooking: a gas ring an electric ring\n[ C ] a special area where people perform or compete: a boxing ring The horses trotted round the ring. See also\nringside\nDaft_Lion_Studio/iStock/Getty Images Plus/GettyImages rings [ plural ]\ntwo round handles at the ends of two long ropes that hang from the ceiling and are used in gymnastics: Sadly, he injured his left shoulder badly while performing on the rings.\nSee more\nMore examplesFewer examplesShe accidentally dropped her ring down a drain in the road.Muhammad Ali's showmanship in the ring shouldn't detract from his considerable skill.She sat there nervously twisting the ring around on her finger.The jeweller skillfully engraved the initials on the ring.His arm was manacled to a ring on the wall.\nSMART Vocabulary: related words and phrases\nSpherical, circular and annular objects\nair bubble\nball\nbead\nbobbin\nbobble\nbowling ball\ncylinder\ncylindrically\ndisc\ndisk\ngame ball\nhoop\nknob\npearl\npelleted\nroll\nsphere\nspheroid\nspool\ntubal\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThings collected in lines or rings\nJewelry\nGroups of people\nKitchen appliances\nSurfaces on which sports take place\nring noun\n(PHONE)\nA2 [ S ] mainly UK (US usually and UK also call) the act of making a phone call to someone: I'll give you a ring tomorrow.\nSMART Vocabulary: related words and phrases\nCommunications - by telephone\n0800 number\n3G\n4G\n5G\naeroplane mode\nairplane mode\nautodial\nbuzz\ncaller ID\nDirectory Enquiries\nISDN\noff the hook idiom\npick\npick someone/something up\npocket dial\nprank call\nprank caller\nroam\ntelecoms\ntelephone\nSee more results »\nring noun\n(SOUND)\nB2 [ C ] the sound a bell makes: There was a ring at the door. He gave a ring at the door.\nSMART Vocabulary: related words and phrases\nSounds made by objects, movement or impact\nbang around\nbong\nburble\nchoo-choo\nchuff\nclick away\nclicker\nclinking\ncrunch\nplop\nresonance\nspit\nsplat\nsputter\nsqueak\nswoosh\ntinkly\ntintinnabulation\nunsounded\nwhirr\nSee more results »\nIdioms\nhave a familiar ring (to it)\nhave a/the ring of truth\nrun rings round someone\nring verb\n(PHONE)\nA2 [ I or T ] mainly UK rang | rung (US usually and UK also call) to make a phone call to someone: I ring home once a week to tell my parents I'm okay. There's been an accident - can you ring for an ambulance? The boss rang (in) to say he'll be back at 4.30.UK I rang round the airlines (= called many of them) to find out the cheapest price. Why don't you ring (up) Simon and ask him to the party?\nMore examplesFewer examples\"I'm sorry I forgot to ring you.\" \"Oh, don't worry.\"\"Margot rang to say she's too busy to come.\" \"She would - she always has an excuse.\"That decorator you rang about painting the house - did he ever return your call?If anyone rings for me, please tell them I'll be back in the office at four o'clock.I've just rung him but there was no answer.\nSMART Vocabulary: related words and phrases\nCommunications - by telephone\n0800 number\n3G\n4G\n5G\naeroplane mode\nairplane mode\nautodial\nbuzz\ncaller ID\nDirectory Enquiries\nISDN\noff the hook idiom\npick\npick someone/something up\npocket dial\nprank call\nprank caller\nroam\ntelecoms\ntelephone\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunicating & keeping in touch\nring verb\n(MAKE SOUND)\nB1 [ I or T ] rang | rung to (cause to) make the sound of a bell: The doorbell/phone rang. Anne's alarm clock rang for half an hour before she woke. I rang the bell but nobody came to the door. My head is/My ears are still ringing (= are full of a ringing noise) from the sound of the military band.\nMore examplesFewer examplesI was just snuggling down into my warm duvet when the phone rang.I was on the toilet when the phone rang.The phone rang, breaking my concentration.Is that the bell ringing?Ring the bell and see if he answers.\nSMART Vocabulary: related words and phrases\nSounds made by objects, movement or impact\nbang around\nbong\nburble\nchoo-choo\nchuff\nclick away\nclicker\nclinking\ncrunch\nplop\nresonance\nspit\nsplat\nsputter\nsqueak\nswoosh\ntinkly\ntintinnabulation\nunsounded\nwhirr\nSee more results »\nring verb\n(CIRCLE)\n[ T ] ringed | ringed to surround something: Armed police ringed the hijacked plane. The harbour is dangerous - it's ringed by/with rocks and reefs.\n[ T ] UK ringed | ringed to draw a circle around something: Students should ring the correct answers in pencil.\n[ T ] UK ringed | ringed (US band) to put a ring on something, especially an animal: We ringed the birds (= put rings around their legs) so that we could identify them later.\nSMART Vocabulary: related words and phrases\nEnclosing, surrounding and immersing\nbeleaguer\nbeleaguered\nbeset\nborder\nbox someone/something in\ndunk\nenclosure\nfence something off\nflooding\ngather\ngift wrap\ngift-wrapped\ngirdle\nsiege\nsteep\nsteep something/someone in something\nsubmersion\nswaddle\nswallow\nswamp\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal farming - general words\nIdioms\nring a bell\nring the changes (on)\nring true/falsePhrasal verbs\nring (someone) back\nring in something\nring off\nring out\nring someone/something up\nring something up\nring with something\nring noun\n(CIRCLE)\nAdd to word list\nAdd to word list\n[ C ] a circular piece, esp. of jewelry worn on a finger: a gold wedding ring\n[ C ] A ring is also any group of things or people in a circular shape or arrangement: a key ring A ring of people joined hands in the dance.\n[ C ]\n&#160; earth science A ring is also the small pieces of matter that circle around a planet.\nring noun\n(SPACE)\na space where people perform or compete that is separated from, and usually at the center of, the space where people can watch the event: a boxing ring a one-ring/three-ring circus\nring noun\n(GROUP)\n[ C ] a group of people who work together, often secretly in criminal activities: a spy ring\nring noun\n(SOUND)\n[ C usually sing ] a telephone call: I’ll give Sophia a ring. Idiom\nsomething rings a bell\nring verb\n(SOUND)\n[ I/T ] past tense rang us/ræŋ/ | past participle rung us/rʌŋ/ to make a sound, esp. the sound made when metal is hit, or to cause a bell to make a sound: [ I ] The telephone rang. [ T ] I rang the doorbell but nobody answered. [ I ] My ears are ringing (= I hear a noise that is not really there).\nring verb\n(CIRCLE)\n[ T ] to surround something: The island is ringed with rocks.\nringer noun [ C usually sing ] us\nYour browser doesn't support HTML5 audio\n/ˈrɪŋ·ər/\nI turned the ringer off on my phone so I could get some sleep. Phrasal verbs\nring up something\nring up someone\nAdd to word list\nAdd to word list\n[ I or T ]\n&#160; COMMUNICATIONS\n&#160; ( UK also ring up) to call someone on the phone: If he's out of the office, ring his mobile. I rang a few stockbrokers to see what they would recommend. When someone rings up, we can make provisional approval for a loan within five minutes.ring (sb) about/for sth The price of insurance can depend on when you ring for a quote. See also\ncall verb\n[ I ]\n&#160; COMMUNICATIONS if a phone rings, it makes a sound because someone is calling: The phone was ringing. My phone didn't ring all morning.\nring the (cash) register (also (cash) registers are ringing)\nused to describe a situation in which there are a lot of sales or a big profit is being made: Consumers are ringing cash registers at a steady pace, incomes are on the rise, and exports are rocketing. Cash registers were ringing across the nation over the Christmas period.\nring off the hook US\nCOMMUNICATIONS if a phone is ringing off the hook, it rings a lot of times: His phone has been ringing off the hook with calls from people who want him to do work for them. Phrasal verbs\nring around (sb/sth)\nring (sb) back\nring in\nring off\nring up sth\na group of people working together illegally: a drugs/smuggling/betting ring\nSTOCK MARKET the part of a stock exchange or commodity exchange (= place where oil, metal, grain, coffee, etc. are traded) where the buying and selling takes place: Some commodity markets still have a trading floor or ring. See also\npit\ngive sb a ring UK informal\nCOMMUNICATIONS to call someone on the phone: If we can be of any further assistance please give us a ring. See also\nauction ring\nprice ring"}