{"id":313521,"name":"rise","type":"verb","us_sound":"raɪz","us_link":"../audio/r/rise.mp3","uk_sound":"raɪz","uk_link":"../audio/r/ukripof005.mp3","content":"rise verb\n(MOVE UP)\nAdd to word list\nAdd to word list\nB1 [ I ] to move upwards: The balloon rose gently (up) into the air. At 6 a.m. we watched the sun rise (= appear and move upwards in the sky). New buildings are rising (= being built) throughout the city.figurative Murmurs of disapproval rose from (= came from) the crowd.\n[ I ] to stand, especially after sitting: She rose from her chair to welcome us. He rose to his feet to deliver his speech.\n[ I ] formal to get out of bed: My grandfather rises at five every morning to do his exercises.\n[ I ]\n&#160; geography\n&#160; specialized If a river rises somewhere, it first comes out of the ground there: The River Cam rises in/at a place called Ashwell.\nMore examplesFewer examplesSteam rose from the simmering stew.Suddenly, all her anger rose to the surface.What time does the moon rise?As water begins to boil, bubbles rise ever faster to the surface.This was a company that had risen from the dead.\nSMART Vocabulary: related words and phrases\nMoving upwards\nascend\nascension\nascent\nbe on an upward/downward trajectory idiom\nbristle\nclamber\ncome\ncome up\nheave\nhoick\nlevitate\nlevitation\nmount\npull\nrear\nscale\nshin\nshinny\nunscalable\nupwardly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal physiology: not sleeping & not unconscious\nMovement of liquids\nrise verb\n(INCREASE)\nB2 [ I ] to increase: Inflation is rising at/by 2.1 percent a month. The wind/storm is rising (= beginning to get stronger).\nThesaurus: synonyms, antonyms, and examples\nto increaseincreaseWe need to increase production to meet demand.growThe number of people living alone grows each year.risePrices rose by 10 per cent.go upHouse prices keep going up.escalateCrime in the city has escalated in recent weeks.\nSee more results »\n[ I ] When emotions, etc. rise, they start to increase: Tempers are rising (= people are becoming angry). My spirits rise (= I feel happier) whenever I think of my friends. She felt panic and terror rise in her whenever she thought of the future. His voice rose (= became louder or higher) as he got angry.\nMore examplesFewer examplesThe day after the explosion the death toll had risen to 90.Used car sales have risen because of the increased cost of new cars.Employment levels are unlikely to rise significantly before the end of next year.The number of business failures rose steeply last year.The party's share of the vote rose from 11 percent in the last election to 21 percent this time.\nSMART Vocabulary: related words and phrases\nPrice increases\naccrual\nadded value\nanti-inflation\nanti-inflationary\nappreciate\nappreciate by something\nappreciate in value\nbull market\ndead cat bounce\ngo through the roof idiom\nhyperinflation\ninflationary\ninflationary spiral\nput something up\nrack\nrack something up\nrebound\nreinflate\nreinflation\nroof\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIncreasing and intensifying\nrise verb\n(BECOME SUCCESSFUL)\nC2 [ I ] to become important, successful, or powerful: After a long career with the company, she has risen to the position of chief executive. He rose to power as the country emerged from its financial crisis. She quickly rose through the ranks to become head of marketing. The singer has risen from humble origins to become one of the most successful entertainers of all time.\nSMART Vocabulary: related words and phrases\nBeing important and having importance\nbeat\nbig deal\nbulk\nbulk large idiom\ncentrality\ncount\ncountable\necho\nequally\nfish\nfront and centre\nhave bigger/other fish to fry idiom\nhave/take pride of place idiom\nhigh-stakes\nmatter\npreponderate\npride\nreign\nthe beating heart of something idiom\ntreasurable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSucceeding, achieving and fulfilling\nrise verb\n(BECOME HIGHER)\n[ I ] to become higher: The ground rises over there. The castle is built on rising ground (= ground higher than areas around it). You can see the Alps rising (= showing as a higher area) in the distance/above the clouds.\n[ I, I ] If bread or dough (= a soft uncooked mixture used for making bread) rises, it becomes bigger because of the action of yeast (= a fungus used in beer and bread making): Leave the dough somewhere warm to rise.\nMore examplesFewer examplesThe temple's grand white arches rose conspicuously over the dirty decaying city.At the unspoiled North Bay, three white pyramids rise like futuristic sails from the sea.The white cliffs rise majestically from the sea.The gilded dome of the cathedral rises above the city.The office block rises above the surrounding buildings.\nSMART Vocabulary: related words and phrases\nMoving upwards\nascend\nascension\nascent\nbe on an upward/downward trajectory idiom\nbristle\nclamber\ncome\ncome up\nheave\nhoick\nlevitate\nlevitation\nmount\npull\nrear\nscale\nshin\nshinny\nunscalable\nupwardly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming bigger\nBread\nrise verb\n(BE OPPOSED TO)\n[ I usually + adv/prep ] (of a group of people) to begin to oppose or fight a bad government or ruler: The people rose (up) against the oppressor/tyrant/dictator.\nSMART Vocabulary: related words and phrases\nActivism & pressure groups\nactivism\nactivist\nagitation\nagitator\nagitprop\ncirculator\nclicktivism\nclicktivist\ncounter-demonstrate\ncounter-demonstration\nhunger striker\nidentity politics\ninsurgency\ninsurrection\ninterest group\nslacktivist\nsocial enterprise\nsocial entrepreneur\nspecial interest group\nsuper-lobbyist\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTaking action against people in power\nrise verb\n(STOP WORK)\n[ I ] formal If parliament or a court rises, it stops work: Parliament/The court rose at 6 p.m.\nSMART Vocabulary: related words and phrases\nMoving upwards\nascend\nascension\nascent\nbe on an upward/downward trajectory idiom\nbristle\nclamber\ncome\ncome up\nheave\nhoick\nlevitate\nlevitation\nmount\npull\nrear\nscale\nshin\nshinny\nunscalable\nupwardly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWorking hours\nGrammar\nArise or rise?Arise means ‘happen’ or ‘occur’. We use it with abstract nouns (e.g. problem). The three forms of arise are arise, arose, arisen. It is used in formal contexts: …\nRaise or rise?Raise must have an object, as it is a transitive verb. It is a regular verb; its three forms are raise, raised, raised: …\nIdioms\nrise and shine!\nrise from the dead/grave\nrise to fame\nrise to the bait\nrise to the occasion/challengePhrasal verb\nrise above something\nrise noun\n(INCREASE)\nB2 [ C ] an increase: a sudden temperature rise a 5 percent rise in inflation August has seen a large rise in the number of unemployed. See also\npay rise\nraise noun US\nThesaurus: synonyms, antonyms, and examples\nthe fact of getting smaller or becoming lessdecreaseThere has been a steady decrease in the number of visitors.fallA fall in the price of petrol is unlikely.fall-offThere's been a sharp fall-off in demand for the product since the company's scandal broke.falling-offThere has been a slight falling-off in public sector employment growth.riseThere has been a sharp rise in home sales this month.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nan increaseincreaseThere has been an sharp increase in municipal taxes this year.riseLast month saw a rise in the rate of inflation.gainWe are not seeing the gains in productivity that we expected.boostWe are hoping for a boost in sales this year.\nSee more results »\non the rise\nincreasing: Police say that youth crime is on the rise again.\nSee more\nMore examplesFewer examplesThe rise in the value of the dollar has depressed the company's profits this year.There has been an alarming rise in the rate of inflation.All the evidence points to a substantial rise in traffic over the next few years.She claimed that the rise in unemployment was just a further manifestation of the government's incompetence.The rise in house prices meant that those who were selling enjoyed a bonanza.\nSMART Vocabulary: related words and phrases\nIncreasing and intensifying\naccretion\naccumulate\naccumulative\naccumulatively\nadd fuel to the fire idiom\nblaze\ncrank\nexplosive\ngo up\ngrowing\ngrowingly\nheighten\nhot up\nmushroom\nramp something up\nratchet something up/down\nre-escalate\nre-escalation\nredouble\nstake\nSee more results »\nrise noun\n(MOVEMENT UP)\nC2 [ S ] the process of becoming very famous, powerful, or popular: Her rapid rise to fame/power/popularity, etc. meant that she made many enemies. Synonyms\nascent (TO HIGHER POSITION) formal\nclimb Opposite\ndescent (POSITION)\nMore examplesFewer examplesThe film tells anew the story of his rise to fame and power.The group had a meteoric rise to fame in the 70s.Her rise to fame was quite phenomenal - in less than two years she was a household name.The band enjoyed a seemingly unstoppable rise to success.He's only doing it to get a rise out of you.\nSMART Vocabulary: related words and phrases\nMaking progress and advancing\nadvance the cause\nadvancement\nage\nahead\nahead of\nboom\nevolve\nevolved\nflourish\nflower\nformatively\nfrom A to B idiom\njourney\nmature\nprogressively\npunctuated equilibrium\nrebuild\nregenerate\nripen\nspread\nSee more results »\nrise noun\n(SLOPE/HILL)\n[ C ] a small hill or slope: The castle is built on a slight rise above the town.\nSMART Vocabulary: related words and phrases\nGeography: hills & mountains\nacclivity\nbrow\nclifftop\nesker\nhillock\nMarilyn\nmesa\nmid-ocean ridge\nmotte\nMount Kilimanjaro\norographic\npinnacle\nscarp\nspur\nsteep\nthe Adirondack Mountains\nthe Alaska Range\nthe Alps\nthe Andes\nvolcano\nSee more results »\nIdioms\nget a rise out of\ngive rise to\nrise verb\n(MOVE UP)\nAdd to word list\nAdd to word list\n[ I ] to move up from a lower to a higher position, or to become higher: Smoke rose from the campfire. The trail rises gently to the top of the ridge. We watched the sun rise over the bay. New buildings are rising (= becoming higher as they are built) throughout the city. On a clear day, you can see the mountains rising (= appearing high) in the distance.\n[ I ] To rise is also to stand up: She rose to welcome us.\n[ I ] To rise is also to get out of bed, esp. in the morning.\nrise verb\n(INCREASE)\n[ I ] to become more or greater in amount, size, or degree; increase: Real estate prices have risen rapidly. The temperature rose to 80° by midday. Our hopes rose when the doctors told us that she was conscious and alert. A murmur rose from the crowd (= began to be heard).\n[ I ] To rise is also to move into a more important rank or position: He rose to fame in the 1940s.\nrise verb\n(FIGHT)\n[ I always + adv/prep ] to begin to oppose or fight (esp. a bad government or ruler) as a group: He urged his followers to rise up against the oppressive regime.\nPhrasal verbs\nrise above something\nrise to something\nrise noun\n(SOMETHING THAT MOVES UP)\n[ C ] a small hill or slope: The house is built on a rise.\nAdd to word list\nAdd to word list\nto increase in number, amount, or value: As growth becomes embedded, interest rates rise. Gold bullion for delivery in December rose $1.20 an ounce to $400 an ounce. rise sharply/dramatically/steadily, etc.rise by sth Retail sales volume rose by 7.2% in the 12 months to June.rise to sth The jobless rate rose to 4.7% in Japan in September.\nWORKPLACE to move up to a more important position in an organization: Those who rise to the top in public affairs work can expect social recognition.rise through sth Mr Reed rose quickly through the bank, becoming head of the corporate finance department in 2010.rise through the ranks She rose through the company ranks, becoming general manager in 2009.\nrise to the challenge/occasion\nto show that you can deal with a difficult situation successfully: All eyes are now on the oil companies to see if they can rise to the challenge and get the fuel out quickly.\n[ C ] an increase in number, amount, or value: a rise in sth The strong profits prompted a 64% rise in the dividend. a sharp/dramatic/small rise Commodities analysts forecast a rise of around 3% a price/rate rise\n[ C ]\n&#160; HR, WORKPLACE\n&#160; UK (US raise) an increase in salary or wages: I think you should ask the boss for a rise. Postal workers have cut a pay deal giving them a basic rise of 3.3%. He will receive a pay rise when he joins the board.\n[ S ] the process of becoming more important or powerful: Thanks to the rise of e-commerce, many firms are embracing the internet for many of their activities. the meteoric rise of the internet as a political tool\non the rise\nif something is on the rise, it is increasing: Interviews by video conference are on the rise. See also\nhigh-rise\nlow-rise\npay rise"}