{"id":313538,"name":"risk","type":"noun","us_sound":"rɪsk","us_link":"../audio/r/risk.mp3","uk_sound":"rɪsk","uk_link":"../audio/r/ukripof011.mp3","content":"Add to word list\nAdd to word list\nB2 [ C or U ] the possibility of something bad happening: In this business, the risks and the rewards are high. There's a high risk of another accident happening in this fog. [ + (that) ] The risk (that) we might fail made us work twice as hard. [ + -ing verb ] It's always a risk starting up a new business. The company is quite a good risk (= safe to lend money to). We want clean rivers and lakes, where you can swim without risk to your health. It's a low/high-risk strategy (= one that is safe/not safe).\nC1 [ C ] something bad that might happen: This wire is a safety/fire risk. His employers thought he was a security risk (= he might tell their secrets to a competitor). at risk\nB2 in a dangerous situation: at risk of All houses within 100 metres of the seas are at risk of flooding.\nSee more at your own risk\nC2 used to mean that you are responsible for any damage, loss, or difficulty: Drivers are reminded that they leave their cars here at their own risk.\nSee more run/take a risk\nB2 to do something that might be dangerous: Don't take any risks - just call the police.\nSee more\nMore examplesFewer examplesThe impurity of the water is a serious health risk.It was an awful risk to take.Are you prepared to put your children at risk?The benefits of this treatment far outweigh any risks.There are too many risks attendant on such a large investment of money.\nSMART Vocabulary: related words and phrases\nDangers and threats\nbalefully\nbaneful\nbanefully\nblack spot\nhang\nhang over something\nhazard\nhazardous\nhazardously\nnon-lethal\non/under pain of death idiom\nor else idiom\nparlous\nparlously\nsomeone's bark is worse than his/her bite idiom\nthreateningly\ntombstoning\ntreacherously\ntriple threat\nultra-hazardous\nSee more results »\nIdioms\nat the risk of doing something\nrun the risk of doing something\nB2 to do something although there is a chance of a bad result: \"It's dangerous to cross here.\" \"I'll just have to risk it.\" [ + -ing verb ] He risked losing his house when his company went bankrupt.\nB2 If you risk something important, you cause it to be in a dangerous situation where you might lose it: I'm not risking my life (informal neck) in that old car. He risked life and limb to get the cat down from the tree. She was prepared to risk everything on a last throw of the dice.\nMore examplesFewer examplesLocal people risked their own lives to shelter resistance fighters from the army.The company is risking everything on the new project.Are you prepared to risk your life?The rescuers risked their lives to save the survivors of the crash.She risks losing her reputation if her latest project fails.\nSMART Vocabulary: related words and phrases\nTaking risks\nadventurer\nall in\nbe skating on thin ice idiom\nbet the farm/ranch idiom\nbroke\ndare\nexpose\nhave/put your head on the block idiom\nhazard\nhigh wire\nhigh-stakes\nimperil\nlay\nput your neck on the line idiom\nre-expose\nrun the risk of doing something idiom\nsail\nsail close to the wind idiom\nskate\nstick your neck out idiom\nSee more results »\nAdd to word list\nAdd to word list\ndanger, or the possibility of danger, defeat, or loss: [ C ] There’s a risk of an accident happening in this fog. [ C ] I was afraid to take the risk of quitting my job before I had another one lined up. [ U ] We want clean rivers and lakes, where you can swim without risk to your health. [ U ] It was a high/low risk situation (= a situation with a lot of/very little danger).\nA risk is also someone or something that could cause a problem or loss: [ C ] Teenage drivers are considered higher risks. at risk\nTo be at risk is to be in danger: A child who hasn’t been vaccinated is at risk. risky adjective us\nYour browser doesn't support HTML5 audio\n/ˈrɪs·ki/\nThe business investment was a risky proposition.\nto do something or to enter a situation where there is a possibility of being hurt or of a loss or defeat: He risked his life helping another man escape the fire. We risk losing the business if we don’t pay off the loan on time.\nAdd to word list\nAdd to word list\n[ U ] the possibility that something bad or dangerous will happen: Heavy reliance upon one client is not without risk when building up a practice.increase/reduce the risk of sth The agency is undertaking an urgent program to reduce the risk of runway collision.\n[ C ] something bad that might happen: Our biggest risk is identity theft. I think that people who come here illegally know the risks.\n[ C or U ]\n&#160; FINANCE the possibility that an investment will lose money: Before you invest in the Fund you should carefully evaluate the risks. This stock is loaded with risk. high/low/medium riskcarry (a) risk To invest in just one stock carries a high risk.offset (a) risk Banks carry out several transactions to offset risk.\n[ C or U ]\n&#160; INSURANCE the possibility that something will be harmed, damaged, or lost: high/low riskinsure against a risk Anyone who wants to insure against the risk of illness or accident can do so at a price.\n[ C ]\n&#160; INSURANCE, BANKING a person or business that may or may not be safe to insure or lend money to: a bad/good risk In terms of insurance eligibility, the couple constituted a bad risk.\nat risk\nin danger: at risk of sth A spokeswoman last night admitted 13 people were at risk of redundancy.at risk of doing sth With its stock price severely depressed, the company was at risk of being a target for private equity investors.\nat your own risk\nif you do something at your own risk, you do it although you know you might get harmed or lose something: Please note that you download and install these programs entirely at your own risk.\nbear a risk\nto be responsible for or accept the risk involved in something: The two sides couldn't agree on how to pay for the plant and who would bear the most financial risk in the agreement. With traditional pensions the employer bears the risks and pays the benefits.\nput sb/sth at risk\nto put someone or something in a situation where they could be in danger: Why put capital at significant risk for a return which is no higher than the return on government bonds?\nrun a risk\nto do something that might be harmful or dangerous: You're running a big risk if oil prices drop sharply.run the risk of doing sth Few IFAs are prepared to run the risk of advising a client to switch out of equities and into bonds and cash in case they get their timing wrong.\nspread your risk(s)\nFINANCE to reduce the chance of losing money by making several different types of investments: While some shares in the fund may be falling in price, others could be rising, helping to spread your risk. Unit trusts let small investors spread their risks by investing in a wide range of gilts.\ntake a risk\nto do something that might be harmful or dangerous: The company thrived after taking a risk and selling its TV business.take the risk of doing sth Over the past three months, investors who have taken the risk of investing in smaller companies have had a rough ride.\nSee also\nactuarial risk\nagainst all risks\nall-risks\nassigned risk\nat-risk\nbuyer's risk\ncalculated risk\ncarrier's risk\ncountry risk\ncredit risk\nView all\ncurrency risk\ndownside risk\nexchange risk\nexecution risk\nforeign currency risk\nglobal risk\nhigh-risk\ninflation risk\ninsurance risk\ninventory risk\ninvestment risk\nliquidity risk\nlow-risk\nmarket liquidity risk\nowner's risk\nsovereign risk\nsystematic risk\nuninsurable risk\nto put something in a situation where it could be lost or damaged: Carol can get a better return on her investments without risking her capital. The region was going through a huge economic downturn and it didn't want to risk its trade ties with the USrisk sth on sth Bonds are attractive to conservative investors who don't want to risk everything on the stock market.\nto get into a situation or do something that might have a bad result: The United States is becoming dangerously dependent on foreign investors to the point that it is risking a financial crisis.risk doing sth If you're not exploiting the opportunities of e-commerce, you could risk going bankrupt. See also\nderisk"}