{"id":313544,"name":"risky","type":"adjective","us_sound":"ˈrɪs.ki","us_link":"../audio/r/risky.mp3","uk_sound":"ˈrɪs.ki","uk_link":"../audio/r/ukripof012.mp3","content":"Add to word list\nAdd to word list\nB2 involving the possibility of something bad happening: It's risky to buy a car without some good advice. We shouldn't go there. It's too risky. Teenagers often engage in risky behaviour. risky investments Synonyms\nhazardous\nhigh-risk\nThesaurus: synonyms, antonyms, and examples\nable to harm youdangerousIt's dangerous to walk alone in the woods at night.unsafeDon't play in the street - it's unsafe.hazardousHeavy rain is causing hazardous driving conditions.perilousA perilous journey through the mountains was their only escape route.treacherousIce had made the roads treacherous.\nSee more results »\nMore examplesFewer examplesThe surgeon felt that the operation was too risky.Many investors blamed the government for not warning them against risky investments.He made huge profits on a number of very risky investments.The general decided it was too risky to proceed any further.The therapy can be risky in certain conditions.\nSMART Vocabulary: related words and phrases\nDangers and threats\nbalefully\nbaneful\nbanefully\nblack spot\nhang\nhang over something\nhazard\nhazardous\nhazardously\nnon-lethal\non/under pain of death idiom\nor else idiom\nparlous\nparlously\nsomeone's bark is worse than his/her bite idiom\nthreateningly\ntombstoning\ntreacherously\ntriple threat\nultra-hazardous\nSee more results »\nRelated word\nriskily\nAdd to word list\nAdd to word list\ninvolving the possibility that something bad might happen or that something will fail or lose money: Even over the long run, stocks are risky. a risky asset/investment The travel sector is risky for investors.\nBANKING, FINANCE used to describe a person or business that may not be safe to lend money to: Economists have been arguing about the crisis in mortgage lending to risky borrowers. This credit card has a standard APR of 14.9 but a far higher rate of 24.9 for riskier customers.\na risky business\nsomething that involves risk or the chance of failure: Trading in penny shares is a risky business as any kind of bad news can have a drastic effect on the share price."}