{"id":313647,"name":"rival","type":"noun","us_sound":"ˈraɪ.vəl","us_link":"../audio/r/rival.mp3","uk_sound":"ˈraɪ.vəl","uk_link":"../audio/r/ukripof021.mp3","content":"Add to word list\nAdd to word list\nC1 a person, group, etc. competing with others for the same thing or in the same area: He beat his closest/nearest rival by 20 marks. The companies produce rival versions of the toy. Synonyms\nchallenger\ncompetitor\ncontender\nMore examplesFewer examplesThe company has decided not to go through with the takeover of its smaller rival.The airline admitted being involved in a dirty tricks campaign to win customers from their rival.She hired an assassin to eliminate her rival.Big supermarkets can undercut all rivals, especially small high-street shops.They beat several other rivals for the contract.\nSMART Vocabulary: related words and phrases\nEnemies & rivals\nadversary\nantagonist\narch-enemy\nenemy\nfoe\nfrenemy\nnemesis\nopponent\nscalp\nsworn enemy\nthem\nthem and us idiom\nC2 to be as good, clever, beautiful, etc. as someone or something else: No computer can rival a human brain for/in complexity. The beauty of the country is only rivalled by (= is as great in degree as) the violence of its politics.\nSMART Vocabulary: related words and phrases\nCompeting and contending (non-sporting)\nbe one up on someone idiom\nbid\ncat\ncatchup\nchancer\nclose-run\ncompetition\ndare\ngo in for something\ngo toe to toe idiom\nhyper-competitive\nin the game idiom\nintercollegiate\nshowing\nslugfest\nsnap at someone's heels idiom\nsuper-competitive\ntake something on\nthrow\ntoe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBeing or appearing similar or the same\nAdd to word list\nAdd to word list\na person, group, or organization competing with others for the same thing or in the same area: business/political rivals\nto equal or be as good as: No computer can rival a human brain.\nAdd to word list\nAdd to word list\na person, company, product, etc. competing with others for the same thing or in the same area: The strong pound will leave large sections of British manufacturing uncompetitive against rivals in the rest of Europe.rival for sth They are rivals for the top job.rival to sb/sth Linux is an operating system and thus a rival to Windows. your main/closest/biggest rival\ncompeting with other people, companies, products, etc. for the same thing or in the same area: a rival company/firm a rival bid/offer While they are more expensive than rival products, she said the quality makes the price worth it. Any rival bidder will have to move quickly and pay considerably more.\nto be as good as other similar people, companies, products, etc.: In the Algarve, citrus farming is expanding rapidly and the fruit rivals anything Spain can produce. Electronic marketplaces can offer a reach and efficiency that physical markets cannot rival.rival sb/sth as sth China could eventually rival Japan as the most lucrative luxury market in the world."}