{"id":313764,"name":"road","type":"noun","us_sound":"roʊd","us_link":"../audio/r/road.mp3","uk_sound":"rəʊd","uk_link":"../audio/r/ukrn___004.mp3","content":"Add to word list\nAdd to word list\nA1 a long, hard surface built for vehicles to travel along: We live on a busy/quiet road. Be careful when you cross a main road. There's a coffee shop on the other side of the road. The road from here to Adelaide runs/goes through some beautiful countryside. All roads into/out of the town were blocked by the snow. I hate flying so I go everywhere by road or rail. I live in/on Mill Road. My address is 82 Mill Road. Is this the Belfast road (= the road that goes to Belfast)? Most road accidents are caused by people driving too fast.\nWestend61/GettyImages on the road\nIf a vehicle is on the road, it is working as it should and can be legally used: My car was in the garage for a week, but it's now back on the road.\nC1 When you are on the road, you are driving or travelling, usually over a long distance: After two days on the road, they reached the coast.\nIf a group of actors or musicians are on the road, they are travelling to different places to perform: Most rock groups spend two or three months a year on the road.\nMore examplesFewer examplesThe car skidded off the road, hit a tree and overturned.New pedestrian pathways are being built alongside the road.I bent down and picked up the coins lying on the road.Snow and ice have left many roads treacherous, and motorists are warned to drive slowly.Wintry conditions are making roads hazardous for drivers in the northeast of England.\nSMART Vocabulary: related words and phrases\nRoads & routes in general\nadopt\nadopted\napproach\nascent\nbicycle lane/path\nbike lane\ndead end\ndetour\nexit\nimpassable\nlane\nmilk round\nmulti-lane\nroadway\nroadworks\nroute\nRR\nshortcut\nskid marks\ntoll road\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMachines - Functioning\nOn the road: driving & operating road vehicles\nSpectacles & performances\nIdioms\nall roads lead to Rome\nbe on the road to something\ncome to the end of the road\nget out of the road!\none for the road\nroad to Damascus\nthe road to hell is paved with good intentions\ntake to the road\nAdd to word list\nAdd to word list\na route for traveling between places by vehicle, esp. one that has been specially surfaced and made flat: [ C ] a gravel/dirt/paved road\nRoad ( (abbreviation Rd.)) is often used in the names of roads: [ U ] 82 Mill Road Idioms\non the road\non the road to something"}