{"id":313812,"name":"roam","type":"verb","us_sound":"roʊm","us_link":"../audio/r/roam.mp3","uk_sound":"rəʊm","uk_link":"../audio/r/ukrn___017.mp3","content":"roam verb\n(MOVE AROUND)\nAdd to word list\nAdd to word list\n[ I + adv/prep, T ] to move about or travel, especially without a clear idea of what you are going to do: After the bars close, gangs of youths roam the city streets. She roamed around America for a year, working in bars and restaurants. Synonyms\ndrift\nrange\nrove\nwander Compare\ntramp verb\nramble verb\n[ I or T ] If someone's hands or eyes roam, they touch or look in many different places, especially in a sexual way or when they should not do this: She enjoys his company, but occasionally he lets his hands roam where they shouldn't. We are sick of fighting off roaming hands on dates. Her eyes boldly roamed the room.\n[ I ] to have sexual relationships or experiences outside of your marriage or usual relationship: There are some people who are faithful and some who tend to roam. She put up with a roaming husband in order to protect her child.\nSMART Vocabulary: related words and phrases\nGeneral words for movement\nbetake\nbudge\nbudge up\ncirculate\ndad dancing\ngangway\ngone\nkinetic\nkinetic energy\nkinetically\nlibration\nlocomotion\nmotion\nmove\npass\nround\nscoot\nseethe\nshove\nslip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTravelling\nRelationships: infidelity\nroam verb\n(PHONE SERVICE)\nto connect to a mobile phone service that is not the one that you normally use, for example if you are in another country: Trying to place an outbound mobile phone call results in an error message telling you that you are roaming. You can stop your phone from roaming if you want to avoid big charges when abroad.\nSMART Vocabulary: related words and phrases\nCommunications - by telephone\n0800 number\n3G\n4G\n5G\naeroplane mode\nairplane mode\narea code\nautodial\nbuzz\ncaller ID\ndialling tone\nDirectory Enquiries\noff the hook idiom\npick\npick someone/something up\npocket dial\nprank call\nprank caller\ntelecoms\ntelephone\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunications - general words\nAdd to word list\nAdd to word list\nto walk or travel without any real purpose or direction: [ I ] Our dog just likes to roam."}