{"id":313839,"name":"rob","type":"verb","us_sound":"rɑːb","us_link":"../audio/r/rob.mp3","uk_sound":"rɒb","uk_link":"../audio/r/ukrn___024.mp3","content":"Add to word list\nAdd to word list\nB1 to take money or property illegally from a place, organization, or person, often using violence: The terrorists financed themselves by robbing banks. My wallet's gone! I've been robbed! They robbed the company of $2 million.\nThesaurus: synonyms, antonyms, and examples\nto steal somethingstealI caught him trying to steal my bike.takeSomeone took their car from outside the house.shopliftHe was caught shoplifting by a security guard.robHe robbed a bank.burgleUK When she got home from work, she discovered that her house had been burgled.pilferEmployees pilfering paper, pens, etc. can cost employers a lot.\nSee more results »\nC2 If someone is robbed of something they deserve or want, it is taken away from them: A last-minute injury robbed me of my place on the team.\nMore examplesFewer examplesThey were robbed of all their savings.Police said the couple had been trussed up and robbed before being shot.He was robbed while he was on holiday.He was robbed of his wallet and car keys.That was when I realized I'd been robbed.\nSMART Vocabulary: related words and phrases\nStealing\nabscond\nabscond with someone/something\naggravated burglary\nanti-burglar\nanti-burglary\neavesdrop\nhome invasion\nhot-wire\nhousebreaking\njemmy\njimmy\nkleptomania\npiracy\npiratical\npiratically\nplunder\npoach\nrustle\nsnaffle\nsnarf\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTaking things away from someone or somewhere\nGrammar\nRob or steal?Rob and steal both mean ‘take something from someone without permission’. …\nIdiom\nrob Peter to pay Paul\nAdd to word list\nAdd to word list\nto take money or property from a person or place illegally: Two men robbed the store last night.\nIf someone is robbed of a quality, that quality is taken away: Elderly people should not be robbed of their dignity.\nAdd to word list\nAdd to word list\nto take money or property illegally from a place, organization, or person: The bank was robbed last year.rob sb of sth They were robbed of their life insurance.\nabbreviation for\nrun of book"}