{"id":313891,"name":"robotics","type":"noun","us_sound":"roʊˈbɑː.t̬ɪks","us_link":"../audio/r/robotics.mp3","uk_sound":"rəʊˈbɒt.ɪks","uk_link":"../audio/r/ukrobot002.mp3","content":"Add to word list\nAdd to word list\nthe science of making and using robots (= machines controlled by computers that are used to perform jobs automatically): The field of robotics has seen many exciting developments in the last decade. Strangely, for the director of a robotics department, he doesn't seem to know what a robot is.\nrobots (= machines controlled by computers that are used to perform jobs automatically): The plant constructs 800,000 skis per year, using computerized robotics. They had to come up with these really sporty robotics to get the crew member up close to the solar array.\nMore examplesFewer examplesThe rapid advances in robotics and sensors will allow ever more sophisticated versions to be developed for hospitals.The lab would use robotics technology, which can process 96 samples at a time, to handle swab samples.The innovation that has occurred in machine tools and robotics is less obvious but has an equally positive impact on our lives.The modern manufacturing process is a very sophisticated operation utilizing highly skilled workers, advanced machinery, and even robotics.\nSMART Vocabulary: related words and phrases\nInventing, designing and innovation\nabsorptive capacity\narchitect\nartificer\nbionics\nblueprint\ndesign\ndesigner\ndevise\ndream something up\nergonomic\nlead time\nmodularization\nnanotechnology\nnon-imitative\noperational research\nthink outside the box idiom\nthink something up\ntrailblaze\nwhole cloth\nwind tunnel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMachines - general words\nAdd to word list\nAdd to word list\nthe science of designing and operating robots\nAdd to word list\nAdd to word list\nthe science of making and using robots: Workers were being laid off as plants used more robotics in their assembly lines."}