{"id":314204,"name":"roistering","type":"adjective","us_sound":"ˈrɔɪ.stɚ.ɪŋ","us_link":"../audio/r/cdo1121usrois3691.mp3","uk_sound":"ˈrɔɪ.stər.ɪŋ","uk_link":"../audio/r/cdo1121ukrois3707.mp3","content":"Add to word list\nAdd to word list\nenjoying yourself in a noisy and energetic way: My days as a roistering singleton are now long over. He has affectionate memories of those days and the roistering workers who got drunk on Saturday nights.\nMore examplesFewer examplesManchester's Exchange Square was so packed with roistering fans that buses could not move through the packed streets.Much of the vast wealth of this vibrant, roistering man went into countless civic projects around Colorado Springs.The constable was detained for several days while the roistering lunatic drove gaily back to St. Andrews.\nSMART Vocabulary: related words and phrases\nCelebrating & entertaining\namuse\namused\nbacchanalian\nbanqueting\nbar-hop\nemcee\nentertain\nentertaining\nents\ngo to town idiom\nhoot\nhostess\npropose\npush\nput the flags out! idiom\nregale someone with something\nrejoice\nrejoicing\nrejoicingly\nthrow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTaking pleasure in something\nbehaviour in which someone enjoys themselves in a noisy and energetic way: He has spoken of a life devoted to romance, roistering, and rebellion. During the roistering a soldier said he had lost his gun.\nMore examplesFewer examplesHis co-star was so alarmed by his roistering and general state of unfitness that she bought him a bike.The roistering of the Bohemians in Act I was exceptionally loud.Her time at Oxford was dedicated, as she admitted, to \"roistering\", so that she failed her English degree.\nSMART Vocabulary: related words and phrases\nCelebrating & entertaining\namuse\namused\nbacchanalian\nbanqueting\nbar-hop\nemcee\nentertain\nentertaining\nents\ngo to town idiom\nhoot\nhostess\npropose\npush\nput the flags out! idiom\nregale someone with something\nrejoice\nrejoicing\nrejoicingly\nthrow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTaking pleasure in something"}