{"id":314231,"name":"role","type":"noun","us_sound":"roʊl","us_link":"../audio/r/role.mp3","uk_sound":"rəʊl","uk_link":"../audio/r/ukrobot028.mp3","content":"role noun [C]\n(DUTY)\nAdd to word list\nAdd to word list\nB2 the position or purpose that someone or something has in a situation, organization, society, or relationship: What is his role in this project? Schools play an important role in society. Six people have been put on trial for their role (= involvement) in the anti-government demonstrations.\nMore examplesFewer examplesYour role in the project will be strictly defined.The role of the police is to ensure (that) the law is obeyed.Television has an important role to play in popularizing new scientific ideas.The government should be playing a more prominent role in promoting human rights.The kidney plays a vital role in the removal of waste products from the blood.\nSMART Vocabulary: related words and phrases\nOrganizations - position & status\nambassador\nanti-elite\nanti-elitist\napparatchik\nback seat\nbrother\ncounterpart\nfish\ngrassroots\nhigh-ranking\nopposite number\nrank\nseat\nspokeswoman\nsuper-elite\nsuperboard\nsuperiority\nsuperordinate\nthane\ntitularly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDuty, obligation and responsibility\nrole noun [C]\n(ACTING)\nB1 an actor's part in a film or play: She's got a leading/supporting role in the school play. She plays the role of a crooked lawyer. Synonym\npart (SEPARATE PIECE)\nMore examplesFewer examplesShe quickly left the chorus for a starring role.She's done all the important Shakespearean roles apart from Lady Macbeth.Marlene Dietrich was immortalized through her roles in movies like 'The Blue Angel'.The six principal roles in this opera have an average vocal range of two octaves.In despair, the theatre director recast the leading role.\nSMART Vocabulary: related words and phrases\nCinema & theatre: casting, roles & scripts\nbilling\nbit part\ncallback\ncast list\ncasting couch\ncharacterization\nchorus\ndialogue\nexit\nHarlequin\nmiscast\noff script\non script\nopposite\ntable read\ntapescript\nteleplay\ntheatre\ntitle role\ntypecast\nSee more results »\nrole noun [C]\n(DUTY)\nAdd to word list\nAdd to word list\nthe duty or use that someone or something usually has or is expected to have: Bouchard hopes to play a pivotal/major/key role in Quebec’s future.\nrole noun [C]\n(REPRESENTATION)\nthe person whom an actor represents in a movie or play: Astin plays the role of Radford, the store’s owner."}