{"id":314244,"name":"rolled","type":"verb","us_sound":"roʊl","us_link":"../audio/r/role.mp3","uk_sound":"rəʊl","uk_link":"../audio/r/ukrobot028.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nroll\nroll verb\n(MOVE)\nB2 [ I or T, usually + adv/prep ] to (cause something to) move somewhere by turning over and over or from side to side: The vase rolled off the edge of the table and smashed. The dog rolled over onto its back. I rolled the wheel along the side of the road back to the car.\nB2 [ I or T, usually + adv/prep ] to move somewhere easily and without sudden movements: A tear rolled down his cheek. A wave of cigarette smoke rolled towards me. The piano's on wheels, so we can roll it into the room.\n[ I ] If an aircraft or a ship rolls, it leans to one side and then to the other because of the wind or waves.\n[ I ] If a machine is rolling, it is operating: Just as the television cameras started rolling, it began to pour down with rain.\nC2 [ T ] If you roll your eyes, you move them so that you are looking up, to show that you consider someone or something stupid or silly: When he suggested they should buy a new car, she rolled her eyes in disbelief.\nMore examplesFewer examplesYou roll the dice and whoever gets the highest score goes first.An apple rolled out of the bag.He rolled the ball back to the goalkeeper.How do we decide who rolls first?The ship was rolling violently from side to side.\nSMART Vocabulary: related words and phrases\nRevolving, rotating and spinning\naround\naround and around idiom\nbackspin\nbirl\ncentrifugal\nreel\nrevolving\nrotary\nrotate\nrotation\nrotative\nspan\nspin\nswim\nswing\nswizzle\ntwirl\ntwirling\ntwirly\nunderspin\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdvancing and moving forward\nAir travel: aviation\nSailing & boating\nSlanting, sloping, leaning, tilting\nMachines - Functioning\nGrimacing and frowning\nroll verb\n(TURN OVER)\nB1 [ T usually + adv/prep ] to (cause something to) turn over onto itself to form the shape of a ball or a tube: He rolled the clay into a ball in his hands. As I got closer, the hedgehog rolled itself (up) into a ball.\n[ T ] to make a cigarette by wrapping a piece of paper around some tobacco\n[ I or T, + adv/prep ] to fold over a piece of clothing or material to make it shorter: We rolled back the carpet to see the floorboards.\nMore examplesFewer examplesHe rolled a cigarette while he was waiting.You should roll your sleeves up if you don't want them to get dirty.By rolling up his sleeping bag he was able to fit it into his rucksack.Roll the mixture in your hands and then dip it into the batter.She rolled up the newspaper and used it to swat the fly.\nSMART Vocabulary: related words and phrases\nBending, twisting and curving\narch your back\nball up\nbendy\nbent\nbowed\ndescribe\nentwine\nflex\nflexion\nflexure\nfluted\nrewind\nswirlingly\nswoopy\ntangle\ntangled\ntangly\nwristy\nwrithe\nzigzag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTobacco & smoking\nMaking things more or less smooth or straight\nroll verb\n(SMOOTH)\n[ T ] to make something smooth and flat: [ + obj + adj ] She borrowed a garden roller to roll the grass flat. When you have rolled (out) the pastry, place it in a pie dish.\nSMART Vocabulary: related words and phrases\nMaking things more or less smooth or straight\nbunch\nbunch (something) up\ncoarsen\ncoarsening\ncreased\ncrinkle\nfold\nfolding\nfurl\ngrooming\ninterfold\nisolator\npucker\nrumple\nsand\nsandpaper\nscrew\nsleek\nsleek back/down\nwrinkle\nSee more results »\nroll verb\n(SOUND)\n[ I ] to make a continuous, repeated, deep sound: The drums rolled as the acrobat walked along the tightrope.\n[ T ] If you roll your r's, you pronounce them with your tongue moving quickly and repeatedly against the top of the mouth: When you speak Spanish you roll your r's.\nSMART Vocabulary: related words and phrases\nSounds made by objects, movement or impact\nbang around\nbong\nburble\nchoo-choo\nchuff\nclick away\nclicker\nclinking\ncrunch\nplop\nresonance\nspit\nsplat\nsputter\nsqueak\nswoosh\ntinkly\ntintinnabulation\nunsounded\nwhirr\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWays of speaking\nIdioms\nhow sb rolls\nrolled into one\nbe rolling in it\nbe rolling in the aisles\nroll on the weekend, five o'clock, etc.\nroll up!\nroll up your sleeves\nroll with the punchesPhrasal verbs\nroll around\nroll back something\nroll something back\nroll by\nroll in\nroll (something) out\nroll over\nroll (something) over something\nroll something up\nroll up"}