{"id":314354,"name":"romantic","type":"adjective","us_sound":"roʊˈmæn.t̬ɪk","us_link":"../audio/r/eus74014.mp3","uk_sound":"rəʊˈmæn.tɪk","uk_link":"../audio/r/ukrolli012.mp3","content":"Add to word list\nAdd to word list\nB1 relating to love or a close loving relationship: a romantic novel/comedy You used to be so romantic, but now you never tell me that you love me. I suppose he is quite romantic - he sends me flowers on my birthday and tells me I'm looking beautiful and so on.\nexciting and mysterious and having a strong effect on your emotions: We thought that Egypt was an incredibly romantic country.\nC2 sometimes disapproving not practical and having a lot of ideas that are not related to real life: She has a romantic idea of what it's like to be a struggling young artist.\nMore examplesFewer examplesHis latest film is described as a 'romantic comedy'.Sing one of those romantic numbers.She wished her husband was a bit more romantic.I'd planned a romantic evening together, but circumstances conspired against it - friends arrived unexpectedly and then Dave was called out to an emergency.That evening they went for a romantic walk along the beach.\nSMART Vocabulary: related words and phrases\nLoving and in love\nabsence\nabsence makes the heart grow fonder idiom\nadore\nadoring\nadoringly\nadorkable\ndotty\nendearment\never-loving\nfall for someone\nfall in love idiom\ngaga\nlurve\nmadly\nmoon\nmoon over someone/something\npash\nshine\ntreasure\nworship\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExciting and interesting\nUseless and futile\nRelated word\nromantically\nsomeone who is not practical and has ideas that are not related to real life: You're a hopeless/incurable romantic.\nSMART Vocabulary: related words and phrases\nUseless and futile\na mug's game idiom\nadrift\naimless\naimlessly\naimlessness\nairy-fairy\nfruitless\nfruitlessly\nfruitlessness\nfutile\nfutilely\nmotiveless\nnegate\nnegation\nno good idiom\nunseriousness\nuntil you are blue in the face idiom\nunviability\nunviable\nunwieldily\nSee more results »\nrelating to a style of art, music, and literature, popular in Europe in the late 18th and early 19th centuries, that deals with the beauty of nature and human emotions: Beethoven, Schumann, and Chopin were leading Romantic composers. Romantic poets such as Shelley and Coleridge See\nRomanticism\nMore examplesFewer examplesthe German Romantic movementmajor Romantic thinkers of the 19th centuryHe is the archetypal Romantic hero.\nSMART Vocabulary: related words and phrases\nArt history & artistic movements\nabstract\naesthetic\nanti-modern\nanti-modernism\nanti-modernist\ncubist\nexpressionism\nexpressionist\nexpressionistic\nexpressionistically\nmodernism\nmodernist\nmontage\nnaturalism\nnaturalistic\nregency\nrococo\nromanticism\nscreen printing\nsilkscreen\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArtists\nsomeone who follows the late 18th and early 19th century ideas of Romanticism, or who creates art, music, or literature in the Romantic style: The German Romantics emphasized the uniqueness of each intimate experience. He traces art history through the Romantics and Daumier and Degas and then onto Picasso. See\nRomanticism\nMore examplesFewer examples It was the Romantics who first insisted that a whole variety of artistic manners and modes could be beautiful, so long as they were authentic.The artists whom we think of as Romantics or Expressionists may be inclined to believe that form and space have no fixed identity.The Romantics believed in man's natural goodness and the call of individuals to develop their personality to the full.\nSMART Vocabulary: related words and phrases\nArt history & artistic movements\nabstract\naesthetic\nanti-modern\nanti-modernism\nanti-modernist\ncubist\nexpressionism\nexpressionist\nexpressionistic\nexpressionistically\nmodernism\nmodernist\nmontage\nnaturalism\nnaturalistic\nregency\nrococo\nromanticism\nscreen printing\nsilkscreen\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArtists\nAdd to word list\nAdd to word list\nrelating to love or to an affectionate, loving relationship: a romantic comedy/novel\nIf something is romantic, it is exciting and mysterious and has a strong effect on your emotions: I think Egypt is an incredibly romantic country.\nRomantic ideas and people are not practical or related to real life: She has a romantic idea of what it’s like to be an actor. romantic noun [ C ] us\nYour browser doesn't support HTML5 audio\n/roʊˈmæn·tɪk/\nYou’re such an old-fashioned romantic, always bringing me flowers. romantically adverb us\nYour browser doesn't support HTML5 audio\n/roʊˈmæn·tɪ·kli/\nTheir names have been romantically linked."}