{"id":314304,"name":"romance","type":"noun","us_sound":"roʊˈmæns","us_link":"../audio/r/eus74013.mp3","uk_sound":"rəʊˈmæns","uk_link":"../audio/r/ukrolli008.mp3","content":"Add to word list\nAdd to word list\nB1 [ C ] a close, usually short relationship of love between two people: They got married last year after a whirlwind (= very short and unexpected) romance. It was just a holiday romance. Office romances are usually a bad idea.\n[ U ] the feelings and behaviour of two people who are in a loving and sexual relationship with each other: I felt as though all the romance had gone out of my marriage.\nThesaurus: synonyms, antonyms, and examples\nloveloveI have a great love and respect for her.adorationShe described her complete adoration of her brother.romanceTheir relationship was nothing but romance and bliss.passionThe passion had gone out of their relationship.infatuationNo one expected their infatuation with each other to last.crushHe had a crush on his French tutor.\nSee more results »\n[ U ] the feeling of excitement or mystery that you have from a particular experience or event: He loves the romance of travelling on a steam train.\n[ C ] a story about love: a historical romance She loves reading romances.\n[ C ] a story of exciting events, especially one written or set in the past: medieval romances\nMore examplesFewer examplesThey married three months after they met - it was a real whirlwind romance.Sun, sand, and romance - her holiday was complete.If you're looking for a storybook romance, you're always going to be disappointed.I want some light reading for the summer holidays - a romance or something.The magazine, which gives frank advice about sex and romance, is aimed at the teenage market.\nSMART Vocabulary: related words and phrases\nLoving and in love\nabsence\nabsence makes the heart grow fonder idiom\nadore\nadoring\nadoringly\nadorkable\ndotty\nendearment\never-loving\nfall for someone\nfall in love idiom\nlurve\nmadly\nmoon\nmoon over someone/something\npash\nshine\nsteal\ntreasure\nworship\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExcitement, interest, energy and enthusiasm\nTypes of film, play, book etc.\nAccounts and stories\n[ I ] to tell stories that are not true, or to describe an event in a way that makes it sound better than it was\n[ T ] old-fashioned to try to persuade someone to love you\nSMART Vocabulary: related words and phrases\nDefining & explaining\naccount (to someone) for something\naccountability\nadumbrate\nadumbration\nannotation\nannotator\nbelabour\ndemythologize\ndisabuse\nexcuse\nextenuate\ninexpressibly\njustificatory\nlay something out\nlimn\nmansplaining\noutline\nsketch\nspell\nundefinable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRelationships: finding a partner\n(of a language) developed from Latin: French, Italian, and Spanish are all Romance languages.\nSMART Vocabulary: related words and phrases\nLanguage names\nAlbanian\nAmerican English\nAmharic\nAngrezi\nAramaic\nEbonics\nFijian\nFilipino\nFinno-Ugric\nGeorgian\nGreenlandic\nMarshallese\nMoldovan\nMongolian\nMontenegrin\nMonégasque\nTuvaluan\nUzbek\nVietnamese\nYiddish\nSee more results »\nAdd to word list\nAdd to word list\na close relationship between two people who are in love with each other: [ C ] Their three-year romance never went smoothly.\nRomance is also the feeling of comfort and pleasure you experience in a relationship with someone you love: [ U ] Without romance, marriage is a lot like an old habit.\nRomance is also a quality of excitement or mystery connected with an experience or place: [ U ] He loves the romance of traveling by train.\nliterature A romance is a story of love between two people, often containing exciting events or magic: [ C ] He is the successful author of rollicking historical romances."}