{"id":314541,"name":"room","type":"noun","us_sound":"ruːm","us_link":"../audio/r/room.mp3","uk_sound":"ruːm","uk_link":"../audio/r/ukrooke003.mp3","content":"room noun\n(PLACE)\nAdd to word list\nAdd to word list\nA1 [ C ] a part of the inside of a building that is separated from other parts by walls, floor, and ceiling: I like this room - it has plenty of light. I could hear people talking in the next room. She's waiting for you in the conference room upstairs.figurative The whole room (= all the people in the room) turned and looked at her.\na bedroom: She's upstairs in her room. Go tidy your room, or you can't watch TV tonight. a single/double room (= a bedroom for one person/two people)\n[ C ] used as a combining form in the names of particular rooms: a bedroom a bathroom a dining room a living room rooms [ plural ] UK old-fashioned\na set of rented rooms, especially in a college or university: These were his rooms when he was studying here.\nSee more\nMore examplesFewer examplesLeave the windows open to let the room air a bit.The room was dimly lit.I think this room has got a lot of potential.Hotel guests are requested to vacate their rooms by twelve noon.We asked for adjoining rooms.\nSMART Vocabulary: related words and phrases\nParts of buildings: rooms\nantechamber\nanteroom\natelier\nattic\nballroom\ndressing room\nefficiency room\nen suite\neyrie\nfamily room\nmaster bedroom\nmeat locker\nmulti-chambered\nmulti-room\nobservation lounge\nutility room\nvestibule\nwaiting room\nwet room\nworkroom\nSee more results »\nroom noun\n(SPACE)\nB1 [ U ] the amount of space that someone or something needs: That sofa would take up too much room in the flat. James took the books off the little table to make room for the television. He's fainted! Don't crowd him - give him room. Is there (enough/any) room for me in the car? [ + to infinitive ] There's hardly room to move in here. Synonym\nspace (EMPTY PLACE)\n[ U ] opportunity for doing something: I feel the company has little room for/to manoeuvre.\nMore examplesFewer examplesIf we push the table back against the wall, we'll have more room.Come and stay with us - we've got bags of room.Scoot over and make room for your sister.We have no room for shirkers in this office.Shove over, Lena, and make some room for me.\nSMART Vocabulary: related words and phrases\nSpace - general words\nbay\nbox\nchamber\nclearance\nelbow room\nexpanse\nfootprint\nheadroom\nnon-spatial\nspace\nspacial\nspacing\nspacious\nspaciously\nspatially\nstanding room\nsubzone\nvoid\nway\nzone\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFreedom to act\nIdioms\nget a room\nno room for something\nroom for doubt\nroom for improvement\nno/not enough room to swing a cat\nto rent a room from someone, or share a rented room with someone: At college he rooms with this guy from Nebraska. Synonym\nboard\nSMART Vocabulary: related words and phrases\nLiving or sleeping somewhere\nabide\nco-resident\nco-residential\ndomiciled\ndwell\ninhospitable\ninhospitably\nlive in\nlive in sin idiom\nlive out\nlodge\npopulate\nreoccupation\nrepopulate\nrepopulation\nreside\nresidence\nsettle\nslum\ntenancy\nSee more results »\nroom noun\n(PLACE)\nAdd to word list\nAdd to word list\n[ C ] an area within a building that has its own walls, floor, ceiling, and door: The house has a laundry room.\nroom noun\n(SPACE)\n[ U ] space available for something: Is there any room for me in the car? fig. She writes better, but there is still room for improvement.\nroom verb [I always + adv/prep]\n(PLACE)\nto share a room with someone, esp. a rented room: I roomed with Anita in college.\nAdd to word list\nAdd to word list\n[ C ] a part of the inside of a building that is separated from other parts by walls, floor, and ceiling: a meeting/conference/dining room\n[ U ] opportunity for doing something: room for sth I feel the company has little room for manoeuvre.\nrooms [ plural ]\nPROPERTY rooms that you rent in a building: He lived in rooms above a shop.\nroom for improvement\nused to say that something is not good enough and could be made better: The business is doing well, but there is definitely room for improvement. See also\npost room\nto rent a room from someone, or share a rented room with someone: He rooms with one of his colleagues."}