{"id":314638,"name":"rope","type":"noun","us_sound":"roʊp","us_link":"../audio/r/rope.mp3","uk_sound":"rəʊp","uk_link":"../audio/r/ukrooke017.mp3","content":"Add to word list\nAdd to word list\nB2 [ C or U ] (a piece of) strong, thick string made of long twisted threads: A sailor threw a rope ashore and we tied the boat to a post. a coil of rope\nR.Tsubin/Moment/GettyImages\n[ C ] several of one type of object connected together on a string: a rope of garlic a rope of pearls the ropes [ plural ]\nthick rope which surrounds an area used for boxing (= sport in which two people hit each other) or wrestling: The middleweight boxing champion had his opponent up against the ropes.\nSee more\nMore examplesFewer examplesA coil of rope lay on the beach.We anchored ourselves to the rocks with a rope.He caught the rope and knotted it around a post.There's too much slack in these ropes.The builders worked on wooden platforms, suspended by ropes from the roof of the building.\nSMART Vocabulary: related words and phrases\nCords, ropes, cables & string\nbell pull\nbowline\nbungee\ncable\ncatgut\ncord\nfibre\nflex\nhalter\nhalyard\nharness\nlandline\nlanyard\nlariat\nrein\nshackles\nshock cord\nstringed\nstringy\ntether\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThings collected in lines or rings\nIdioms\nlearn/know the ropes\non the ropes\nshow/teach someone the ropes\nto tie things together with rope: I'll rope my horse to your car and pull you out of the ditch. The climbers roped themselves together. Compare\nlasso verb\nSMART Vocabulary: related words and phrases\nFastening and tying\nanchor\nbale\nbe locked together idiom\nbelay\nboard something up\nbolt\nbound\nbowline\nhalf hitch\nharness\nhobble\nhogtie\nknotted\nstake\nstrap something up\nstrop\ntack\ntape something up\ntether\ntie someone down\nSee more results »\nPhrasal verbs\nrope someone in\nrope something/somewhere off\nAdd to word list\nAdd to word list\na strong, thick cord made of twisted fibers Idioms\non the ropes\nthe ropes\nto tie something with rope: We roped the box to the top of the car.\nTo rope something off is to put rope or cord around it to keep it separate: [ M ] The site has been marked with “No Trespassing” signs and areas have been roped off. Phrasal verbs\nrope someone into something\nrope someone in"}