{"id":314775,"name":"rosella","type":"noun","us_sound":"roʊˈzel.ə","us_link":"../audio/r/usrom__027.mp3","uk_sound":"rəʊˈzel.ə","uk_link":"../audio/r/ukrooke028.mp3","content":"rosella noun\n(BIRD)\nAdd to word list\nAdd to word list\n[ C ] any of several brightly coloured parrots of eastern Australia: You could see koalas as well as rosellas and other native birds.\nMore examplesFewer examplesRosellas screeched overhead.I found a pile of fresh feathers from a rosella.The rosellas seemed to be able to communicate to their friends that it is time to fly away.\nSMART Vocabulary: related words and phrases\nBirds commonly kept as pets\nbudgie\ncanary\ncockatoo\ngalah\nhoming pigeon\nIndian mynah\nlorikeet\nmacaw\nmynah\nparakeet\nparrot\npigeon\nracing pigeon\nsulphur-crested cockatoo\nrosella noun\n(PLANT)\n[ C or U ] a type of hibiscus (= a tropical plant) with yellow flowers with a red spot, and red calyxes (= parts that cover and protect the petals as they develop) that are used to make a type of tea: The botanical name for the rosella is Hibiscus sabdariffa.\n[ C or U ] the calyx (= part that covers and protects the petals as they develop) of the rosella bush, used as a food and dried to make a type of fruit tea: Save a couple of rosellas and let them go brown on the plant so you’ll have your own seed for next time. Have you ever eaten rosella jam? She made some rosella tea.\nMore examplesFewer examplesThe rosella makes beautiful jam.Last year I made a batch of rosella jam and bottled it.I have just grown my first crop of rosella.Rosellas make a delicious cordial and a tangy red tea.\nSMART Vocabulary: related words and phrases\nBushes & shrubs\nabelia\nabutilon\nangel's trumpet\naronia\nartemisia\ndewberry\ndogwood\neglantine\nephedra\nfirethorn\nmanuka\nmanzanita\nmayflower\nMexican orange\nmock orange\nsnowberry\nspicebush\nstaghorn sumac\nsumac\nsweetbriar\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParts of plants"}