{"id":315096,"name":"roughness","type":"noun","us_sound":"ˈrʌf.nəs","us_link":"../audio/r/usb01322.mp3","uk_sound":"ˈrʌf.nəs","uk_link":"../audio/r/ukb01322.mp3","content":"roughness noun [U]\n(NOT SMOOTH)\nAdd to word list\nAdd to word list\nthe quality of not being even or smooth, often because of being in bad condition: The roughness of the roads is the biggest danger to tyres.\nthe quality of not feeling smooth to touch: the roughness of his skin\nMore examplesFewer examplesThe company makes devices that test the roughness of surfaces to ensure they meet precise specifications.In our memories we smell the sunscreen and salt air and feel the hot roughness of the sand.The spin and roughness of the ball really do make a difference.She could smell his cologne and feel the slight roughness of his face against hers.\nSMART Vocabulary: related words and phrases\nRough, irregular and uneven\nabrasion\nabrasive\nabrasiveness\nbumpy\ncoarsely\njagged\njaggedly\njaggy\njerky\nknobbly\npockmarked\nragged\nraggedly\nraggedness\nraggedy\nrugged\nunsteadily\nunsteady\nwonkiness\nwonky\nSee more results »\nroughness noun [U]\n(NOT GENTLE)\nthe quality of not being gentle: Kids still play tag at his school but no roughness is allowed.\na quality of a place that is not pleasant because a lot of violent things happen there: The roughness of the area put off many buyers.\nMore examplesFewer examplesHe emphasizes the sport's roughness and danger.There was little roughness in the sport, and much playfulness. His behaviour included some physical roughness such as slapping and shaking.The airline agent slammed the box on to the conveyor belt with a roughness that was not appropriate for such a precious item. The author acknowledges the roughness and corruption of back streets awaiting demolition.Under its polished veneer and boho-chic reputation, the roughness of the area's former days still lurks.\nSMART Vocabulary: related words and phrases\nViolent or aggressive\nabusively\naggressive\naggressively\naggressiveness\naggro\nferociously\nferocity\nfierce\nfierceness\nfighting words\noffensively\noutrage\nproactive aggression\npugnacious\npugnaciously\nuntameable\nvicious\nviciously\nviciousness\nviolence\nSee more results »\nroughness noun [U]\n(SOUND)\na loud, unpleasant quality in a sound, often one that suggests something is damaged: There was no roughness to her voice. Roughness suggests engine failure.\nMore examplesFewer examplesDespite the occasional roughness, her singing had a deep and true beauty. In extreme cases, the music took on a roughness that rendered it unattractive and technically inaccurate. He'd been wrong: there was no roughness to her voice, just a deep huskiness that made it, well, seductive. The result could be engine roughness during acceleration.\nSMART Vocabulary: related words and phrases\nDescribing qualities of the human voice\nadenoidal\nbe dripping with something idiom\nboomy\nbray\nbreathy\nbrittle\nchocolatey\ngruff\nliltingly\nmulti-voiced\nnasally\npitchy\npurringly\nsoft-spoken\nstentorian\nstrangled\ntoned\ntoneless\nvoiced\nwispily\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIn bad condition\nroughness noun [U]\n(NOT DETAILED)\nthe quality of not being exact or detailed or not in a final form: the roughness of the images\nthe quality of being simple and made quickly: the roughness of the furniture\nMore examplesFewer examplesThere's a roughness to their shows, one that signals the audience to relax.The roughness of Matisse's modelling gives his sculptures of women an unusual air of independence.We're not printing on photo paper so some roughness in your images is acceptable.The table's roughness was hidden under a baize cloth pockmarked by cigarette burns.The book captures the roughness and rusticity of Spanish food.\nSMART Vocabulary: related words and phrases\nApproximate\nabout\napprox.\napproximate\napproximately\naround\nexact\nguess\ninexact\ninexactly\nish\nloosely\nloosey-goosey\nround\nrule\nsense\nsome\nsomething\nsomething like 96 percent, half, etc. idiom\nsomewhere\nsort\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCrude and basic\nroughness noun [U]\n(SEA/WEATHER)\n(of the sea or the weather) the quality of having strong winds or big waves: They were unaffected by the roughness of the sea. See\nrough\nMore examplesFewer examplesWe were delayed for a few hours by the roughness of the river.We had a cabin so if there was any roughness throughout the night we slept through it.Happily unaffected by the roughness of the sea, they ate with good appetite.On an exposed bit of land, the roughness of the weather is heightened.\nSMART Vocabulary: related words and phrases\nDescribing bad weather\nbleak\nbleakly\nbleakness\nbreak\ndepression\ndreich\nfickle\nfickleness\ngray\ngrey\ngreyly\ninclement\novercast\nrough\nthreatening\ntreacherous\ntreacherously\nunseasonably\nunseasonal\nunseasonally\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWind & winds\nWaves"}