{"id":315136,"name":"round","type":"preposition","us_sound":"raʊnd","us_link":"../audio/r/ukrough006.mp3","uk_sound":"raʊnd","uk_link":"../audio/r/ukrough006.mp3","content":"round preposition, adverb\n(AROUND)\nAdd to word list\nAdd to word list\nA2 in a circular direction or position; around: The moon goes round the earth. We ran round (the outside of the house) to the back, looking for the dog. The idea has been going round and round in my head all day (= I can't stop thinking about it). When one engine stopped, we had to turn round (= turn to face the opposite direction) and fly home. He tried to go round the keeper (= move with the football past a goalkeeper) but was forced wide. See also\ntheatre in the round\nMore examplesFewer examplesThe discussion kept going round in circles.Christmas comes round so quickly!She wears a gold cross round her neck.It has always been my declared intention to sail round the world.I'll just turn the car round and go back the way we've come.\nSMART Vocabulary: related words and phrases\nBending, twisting and curving\narch your back\nball up\nbendy\nbent\nbowed\ndescribe\nentwine\nflex\nflexion\nflexure\nfluted\nrewind\nswirlingly\nswoopy\ntangle\ntangled\ntangly\nwristy\nwrithe\nzigzag\nSee more results »\nround preposition, adverb\n(IN ALL PARTS)\nB1 in every part of a place, or in various parts of a place: The landlord showed me round (the house). I had to go all round town to find a hotel that was open. This virus has been going round (the school) (= many people have had it) .\nMore examplesFewer examplesI walked round the town.I'll take you round the grounds.We went round the shops.There's a rumour going round the office to that effect.There's a stomach bug going round the school.\nSMART Vocabulary: related words and phrases\nSomewhere, anywhere, nowhere, or everywhere\nacross\nall over\nanyplace\nanywhere\nat every turn idiom\ncoast\nevery\nfrom top to bottom idiom\nfrom top to toe idiom\nhunt/search high and low idiom\nlength\nnon-universal\npan\nsomeplace\nsomewhere\nthe length and breadth of somewhere idiom\nthroughout\nturn\nubiquitous\nubiquitously\nSee more results »\nround preposition, adverb\n(SURROUNDING)\nA2 on all or some sides of something: We sat round the fire. The house has trees all round. The pyramid is 50 metres high and 100 metres round (the base). Everyone for a mile round (= in the area) heard the explosion.\nMore examplesFewer examplesThey live in an idyllic country cottage, with roses round the door.As soon as he appeared, reporters crowded round.If we put the chairs a bit closer together , we should be able to get another one round the table.There was a black line round the edge of the page.The spectators had gathered round the green to watch the winning putt.\nSMART Vocabulary: related words and phrases\nEnclosing, surrounding and immersing\nbeleaguer\nbeleaguered\nbeset\nborder\nbox someone/something in\ndunk\nenclosure\nfence something off\nflooding\ngather\ngift wrap\ngift-wrapped\ngirdle\nsiege\nsteep\nsteep something/someone in something\nsubmersion\nswaddle\nswallow\nswamp\nSee more results »\nround preposition, adverb\n(DIRECTION)\nA2 in a particular direction: The garden is round the back (of the house). I used to live round (= near) here when I was a child. You must come round (to my house) sometime soon.UK not standard We're going round (= to) the pub for a quick drink.\nMore examplesFewer examplesThere's a restaurant round the corner that serves cheap and cheerful food.Come round tonight and we'll watch a video.There are two entrances - one at the front and one round the back.He said he wouldn't pay up so I sent my brother round to put the frighteners on him.Who's the head honcho round here?\nSMART Vocabulary: related words and phrases\nDescribing movement towards\n-wards\n-ways\nat\nconvergent\nearthward\nfacing\nfor\nforward\nforwards\nhither\ninwards\non\noncoming\nonward\nonwards\nthither\nto\nup\nward\nwise\nSee more results »\nGrammar\nAround or round?Around and round are prepositions or adverbs. We use around and round when we refer to movements in circles or from one place to another. Around and round can both be used. Around is more common in American English. Round is a little more common in speaking: …\nIdioms\nright/wrong way round\nround about\nround and round\nround the corner\nway round\nround adjective\n(CIRCULAR)\nA2 shaped like a ball or circle, or curved: Tennis balls and oranges are round. a round hole/stone/table/window a round face round eyes\nMore examplesFewer examplesThe sculpture consists of two round sections connected by a series of wires.They had a large round table in the dining room.The bullet left a small round hole in the glass.Use the cutter to cut the pastry into round shapes.I'd like one of the round loaves, please.\nSMART Vocabulary: related words and phrases\nGeometry: properties of circles & curves\namplitude\narched\nbore\ncircularity\ncircumference\ncircumferential\nconcave\nconcavity\nconcentric\nconcentrically\nconic\ncurvy\ngauge\ngirth\nincisura\nosculate\nparabolic\nrectifiable\nsinuosity\nspiral\nSee more results »\nround adjective\n(COMPLETE)\n(of a number) whole or complete; given to the nearest 1, 10, 100, etc. and not as exact amounts: 2.8 to the nearest round number is 3. \"I've got 95 bottles here for you.\" \"Could you make it a round hundred, please?\"\nSMART Vocabulary: related words and phrases\nTerms for numbers\nadditive inverse\naliquot\ncommon denominator\ncommon factor\ncommon multiple\nexponent\nfold\nfortyfold\nfourfold\nGCF\nhundredfold\nimaginary number\nreciprocal\nrecurring\nrecurring number\nremainder\nresponse variable\ntwentyfold\ntwofold\nweighting\nSee more results »\nround noun [C]\n(GROUP)\nC2 a number of things or group of events: Russia and America will hold another round of talks next month. When we were young life was just one long round of parties/pleasure.\nC2 drinks that you buy for a group of people: It's your turn to buy a round. He bought a round of drinks to say thank you.\nUK a single slice of toast, or a sandwich\nUK (US route) a set of regular visits that you make to a number of places or people, especially in order to take products as part of your job: He has a milk/paper round.\nmusic\n&#160; specialized a song for several singers, who begin singing one after the other at various points in the song\nMore examplesFewer examplesCooper was counted out in the final round.He crashed out of the French Open in the second round.We often play a round of golf at the weekend.Persuading Chris to buy a round of drinks is like getting blood out of a stone.She's through to the next round of interviews.\nSMART Vocabulary: related words and phrases\nGroups and collections of things\nage bracket\nagglomerate\nagglomeration\nAladdin's cave\nanthology\nbasket\ncrop\ndataset\nempty set\nensemble\nfamily\nfeast\npackage\npermutation\npool\nportfolio\nselection\nsheaf\nsheaves\nstarter pack\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDrinking alcohol\nSandwiches & snacks\nVisiting\nTransferring and transporting objects\nSinging\nround noun [C]\n(COMPETITION PART)\nB2 a part of a competition: She was knocked out of the championship in the third round.\none of the periods of time during a boxing or wrestling match when the competitors are fighting\na complete game in golf\nSMART Vocabulary: related words and phrases\nParts & stages of competitions\na game in hand idiom\nadded time\nbracket\ncup tie\nelimination\nevent\nfinal\nfull time\nhalf\nhand\nkick\nkick off\nlap\nlap of honour phrase\nquarter\nshootout\nsqueaky-bum time\ntimeout\nvictory\nvictory lap\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFighting sports\nGolf\nround noun [C]\n(BULLET)\na bullet or other single piece of ammunition: The soldiers had only 20 rounds left.\nSMART Vocabulary: related words and phrases\nBullets & cartridges\nballistic\nblank\nbuckshot\nbullet\ncartridge\ndumdum bullet\nfusillade\ngrapeshot\npellet\nplastic bullet\nshot\nslug\ntracer\nvolley\nIdioms\nthe daily round\ngo/do the rounds\nmake/do the rounds\non your rounds\nround of applause\nto go around something: Colin rounded the corner at high speed.\nto move around and past another player while keeping the ball: He rounded the keeper and scored.\nSMART Vocabulary: related words and phrases\nRevolving, rotating and spinning\naround\naround and around idiom\nbackspin\nbirl\ncentrifugal\nreel\nrevolving\nrotary\nrotate\nrotation\nrotative\nspan\nspin\nswim\nswing\nswizzle\ntwirl\ntwirling\ntwirly\nunderspin\nSee more results »\nPhrasal verbs\nround something down\nround something off\nround on someone/something\nround something out\nround something/someone up\nround something up\nround adjective\n(CIRCULAR)\nAdd to word list\nAdd to word list\n[ -er/-est only ] shaped like a circle or having a surface like part of a ball: They sat at a round table. She held up a round mirror. Carlos was a round-cheeked boy.\nround adjective\n(APPROXIMATE)\n[ not gradable ] (of a number) not exact but approximate, and ending in zero: In round numbers, about three million tourists visit each year. Idioms\nround and round\nround the clock\nround verb [T]\n(MOVE AROUND)\nto go around something and arrive on the other side: The car rounded the corner and stopped in front of the house.\nPhrasal verbs\nround out something\nround up something/someone\nround noun [C]\n(SINGLE EVENT)\na single event or a small group of similar events that are part of a larger series of events: The first round of negotiations got nowhere.\nIn many sports, a round is a stage in a competition: They lost in the first round of the tournament.\nIn golf, a round is a complete game.\nIn boxing, a round is one of the periods during which the competitors fight. round of applause\nA round of applause is a period of clapping to show approval: Let’s give the band a nice round of applause. round (of drinks)\nA round (of drinks) is a drink for each person in a group.\nround noun [C]\n(BULLET)\na bullet or other piece of ammunition (= something that can be shot from a weapon or exploded): They fired several rounds, then fled.\nround adverb\n(MOVE AROUND)\naround\nAdd to word list\nAdd to word list\nused to describe a number that is given to the nearest 1, 10, 100, etc. and not as an exact amount: 2.8 to the nearest a round number is 3. In round figures, he earns $80,000.\na group of events: The EU will hold another round of talks next month. around of meetings The school building programme has been stopped in the latest round of cuts.\n(also route) a set of regular visits that you make to a number of places or people, especially in order to take products as part of your job: a milk/paper round\nSee also\nthe milk round"}