{"id":315235,"name":"route","type":"noun","us_sound":"ruːt","us_link":"../audio/r/root.mp3","uk_sound":"ruːt","uk_link":"../audio/r/ukrooke012.mp3","content":"Add to word list\nAdd to word list\nB1 a particular way or direction between places: The route we had planned took us right across Greece. I live on a bus route so I can easily get to work.\nC2 a method of achieving something: A college education is often the best route to a good job.\nUS (UK round) a set of regular visits that you make to a number of places or people, especially in order to take products as part of your job\nMore examplesFewer examplesThe route is all downhill from here to the finish.Police lined the route of the demonstration.We can decide which route to take nearer the time.Before the new railway was built, its route was carefully surveyed.Some airlines have cancelled less popular routes in an effort to maximize profits.\nSMART Vocabulary: related words and phrases\nRoads & routes in general\nadopt\nadopted\napproach\nascent\nbicycle lane/path\nbike lane\ncommunication\ndead end\ndetour\nexit\nimpassable\nlane\nmilk round\nmulti-lane\nroadway\nroadworks\nRR\nskid marks\ntoll road\ntollway\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWays of achieving things\nVisiting\nTransferring and transporting objects\nRoute\nB1 in the US, used as part of the name of numbered roads: Route 66\nSMART Vocabulary: related words and phrases\nRoads: motorways\naccess road\nartery\nautobahn\ncarriageway\nclearway\ncontraflow\nfreeway\nhard shoulder\nhighway\nHOV lane\ninterstate\nmotorway\npassing lane\npike\nramp\nslip road\nsuperhighway\ntoll plaza\ntoll road\nturnpike\nSee more results »\nto send something somewhere using a particular way or direction: Deliveries are routed via/by way of London.\ninternet &amp; telecoms to send information from one computer network to another: When a customer buys, the purchase order is routed via the internet to each supplier's personal Web page.\nSMART Vocabulary: related words and phrases\nDelivering and despatching\nair bridge\nair corridor\nair drop\nair-dash\nbox scheme\nconsign\ncourier\ndrop off\nmisaddress\nmisdirect\nmisdirection\nmisroute\nnon-delivery\nship\nshipment\nshipper\nshoot\nshoot something off\nteleport\ntruck\nSee more results »\nAdd to word list\nAdd to word list\na particular way or direction between places: The most direct route is to take the expressway.\nA route is also a fixed path for regularly moving or delivering people or things: bus routes a supply route\nAdd to word list\nAdd to word list\nTRANSPORT a particular way from one place to another, especially the way that a bus, train, plane, etc. travels regularly: a shipping route a bus/train/plane route\na method of achieving something: a route to (doing) sth An internship is one of the best routes to gaining experience in the industry.\n→\nround noun\nIT to send information from one computer system to another: route sth from/to sth Find out how to use the application to route email from other folders in your mailbox.\nto send someone or something a particular way: route sth to/via sth Deliveries are routed via New York."}