{"id":315253,"name":"routine","type":"noun","us_sound":"ruːˈtiːn","us_link":"../audio/r/routine.mp3","uk_sound":"ruːˈtiːn","uk_link":"../audio/r/ukrough019.mp3","content":"Add to word list\nAdd to word list\nB1 [ C or U ] a usual or fixed way of doing things: There's no set/fixed routine at work - every day is different. Most companies insure property and equipment against damage or theft as a matter of routine.\n[ C ] a regular series of movements, jokes, or similar things used in a performance: an exercise/dance routine He went into his usual \"I'm the head of the family\" routine (= usual way of speaking).\n[ C ]\n&#160; computing\n&#160; specialized a part of a computer program that does a particular operation\nMore examplesFewer examplesExercise has become part of my daily routine.The routine was the same every day, with nothing to relieve the monotony.On page 21, some tricks to speed up your beauty routine.The airline has been criticized for failing to heed warnings about lack of safety routines.If you get out of a routine, it's very hard to get back into it.\nSMART Vocabulary: related words and phrases\nStandard and routine\naverage\naverage Joe\nbog-standard\nconformance\nconformity\nconventionalized\ndefault\ngiven\ninstitutionalize\nmainline\northodox\nquotidian\nregularity\nregularization\nregularize\nround\nstock\nthe/your average bear idiom\nunchallenging\nunspectacular\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHabitual behaviour\nSpectacles & performances\nComputer programming & software\ndone as part of what usually happens, and not for any special reason: a routine inspection/medical check-up\nThesaurus: synonyms, antonyms, and examples\nbeing part of normal life and not specialordinaryHe took ordinary household objects and transformed them into pieces of art. everydayComputers are now just a part of everyday life.quotidianWe longed for the quotidian rituals, like shopping and tea, that the end of the war would bring.day-to-dayDay-to-day operations of the team would be handled by the assistant coach.dailyI'm looking for a good daily shampoo that won't damage my hair.\nSee more results »\nordinary and not special or unusual: a routine case of appendicitis He died during a routine operation which went wrong.\nC2 disapproving ordinary and boring: My job is so routine and boring - I hate it.\nSMART Vocabulary: related words and phrases\nStandard and routine\naverage\naverage Joe\nbog-standard\nconformance\nconformity\nconventionalized\ndefault\ngiven\ninstitutionalize\nmainline\northodox\nquotidian\nregularity\nregularization\nregularize\nround\nstock\nthe/your average bear idiom\nunchallenging\nunspectacular\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTedious and uninspiring\nAdd to word list\nAdd to word list\na usual set of activities or way of doing things: [ C ] Getting coffee and a bagel was part of my daily routine.\nA routine is also a particular set of activities performed to entertain others: [ C ] a comedy/skating routine routine adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ruˈtin/\nThe test is part of a routine six-month checkup. routinely adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ruˈtin·li/\nShe routinely works out at the gym.\nAdd to word list\nAdd to word list\na usual or fixed way of doing things: the usual/daily routinea fixed/set routine The office's fixed routine was disturbed by the large order.\nIT a part of a computer program that does a particular operation: She had learned how to program a basic computer routine.\ndone as part of what usually happens, and not for any special reason: The Center Street Bridge will get only a routine inspection. Most routine business is done in the parliament's Brussels headquarters. a routine decision.\nordinary and boring: The work is dull and routine."}