{"id":315287,"name":"row","type":"noun","us_sound":"roʊ","us_link":"../audio/r/roe.mp3","uk_sound":"rəʊ","uk_link":"../audio/r/ukad5078.mp3","content":"row noun\n(LINE)\nAdd to word list\nAdd to word list\nB1 [ C ] a line of things, people, animals, etc. arranged next to each other: a row of houses/books/plants/people/horses We had seats in the front/back row of the theatre.\nSergio Amiti/Moment/GettyImages\nUS (UK terrace) a line of houses joined together along their side walls\nAntenna/fStop/Getty Images /GettyImages\n[ C ] used in the names of some roads: Prospect Row in a row\nB2 one after another without a break: She's been voted Best Actress three years in a row.\nSee more\nMore examplesFewer examplesThe roof of the temple was held up by a row of thick stone columns.I'd like seats on the front row of the stalls.\"This is our fourth victory in a row, \" he gloated.They built a row of hotels right along the sea-front.A row of tall fir trees shuts off the view of the street in front.\nSMART Vocabulary: related words and phrases\nThings collected in lines or rings\nchain\ncolumn\ncrocodile\nfile\ninterrow\nline\nqueue\nrank\nring\nrope\nsingle file\nstring\nthread\ntier\ntrain\ntwo-tier\nYou can also find related words, phrases, and synonyms in the topics:\nHouses & homes\nRoads: urban & residential streets\nrow noun\n(MOVING THROUGH WATER)\n[ C usually singular ] the activity of making a boat move through water using oars (= poles with flat ends): They've gone for a row to the island.\nSMART Vocabulary: related words and phrases\nMovement on or through water\nbuoyantly\ncast\ncast someone adrift idiom\ndabble\ndip\nfloat\nhydroplane\noutsail\npaddle\npaddler\nraft\nsail\nslingshot\nsmoothness\nsurface\nswim\ntack\nwade\nwallow\nYou can also find related words, phrases, and synonyms in the topics:\nRowing\nIdiom\na hard/tough row to hoe\nB2 to cause a boat to move through water by pushing against the water with oars (= poles with flat ends): The wind dropped, so we had to row (the boat) back home. He rowed for the US in the 2016 Olympics.\nSMART Vocabulary: related words and phrases\nRowing\nbow\ncanvas\ncox\nfeather\nfour\noar\noarsman\noarswoman\nout-row\nrower\nrowing\nscull\nsculling\nshell\nRelated words\nrower\nrowingPhrasal verb\nrow back\nrow noun\n(ARGUMENT)\n[ C ] a noisy argument or fight: My parents often have rows, but my dad does most of the shouting. What was a political row over government policy on Europe is fast becoming a diplomatic row between France and Britain.\nThesaurus: synonyms, antonyms, and examples\nan argumentargumentI don't want to get into an argument with you about this.disagreementThere was a disagreement over who should pay the bill.quarrelThere were bitter quarrels between the two neighbours.rowUK My parents had a row about money.squabbleI'm always dealing with squabbles between the children.tiffShe had a tiff with her boyfriend last night.\nSee more results »\nMore examplesFewer examplesThey had an awful row several years ago, but now they've resolved their differences.There was an almighty row when I asked them to leave.We had a flaming row over it last night.Did you manage to patch things up with Jackie after your row?They have massive rows because they're both so stubborn.\nSMART Vocabulary: related words and phrases\nArguments & disagreements\nargument\nbe (on) non-speakers idiom\nbelligerence\nbickering\nblow (someone/something) up\nbust up\nclash\ncontentiousness\ncontretemps\nding-dong\ndispute\ndust-up\nhostility\nkerfuffle\nlogjam\nmisunderstanding\npile\nrhubarb\nspat\nsquabble\nSee more results »\nrow noun\n(NOISE)\n[ S ] loud noise: I can't concentrate because of the row the builders are making.\nSMART Vocabulary: related words and phrases\nNoise & noisy\nabuzz\nbang something out\nbarky\nbash\nbash something out\nblast\nboisterously\nbrouhaha\ncacophony\nexplosive\nloudly\nnoisy\nresonant\nring with something\nrowdily\nrowdiness\nrowdyism\nrumbustious\nstrident\ntumult\nSee more results »\nto argue, especially loudly: My parents are always rowing (about/over money).\nThesaurus: synonyms, antonyms, and examples\nto argue with someoneargueThe kids are always arguing about something.have an argumentI had an argument with my sister.fightThe two sides continue to fight over control of the assembly.quarrelStop quarrelling, you two!rowUK My parents were always rowing about money.squabbleThey are still squabbling over who will get the big office.\nSee more results »\nSMART Vocabulary: related words and phrases\nArguing & disagreeing\nagent provocateur\nalienate\nalienated\nargue with someone\nargumentatively\nbandy\nbone\nconflict\ncross swords idiom\nflame\nhammer\nlock horns idiom\npiggy in the middle\nprovocateur\nquarrel\nsays who? idiom\nset someone against someone\nshadowbox\nshadowboxing\nthrow\nSee more results »\nrow noun [C]\n(LINE)\nAdd to word list\nAdd to word list\na line of things arranged next to each other: Everybody lined up in a neat little row. I want to sit in the front row. in a row\nIf something happens a number of times in a row, it happens that many times without interruption: They’ve won six games in a row.\nrow verb [I/T]\n(MOVE IN WATER)\nto cause a boat to move by pushing against the water with oars (= long poles with flat ends), or to move people in a boat in this way: [ T ] Dad rowed us back to shore. rowing noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈroʊ·ɪŋ/\nSarah won an Olympic medal in rowing."}