{"id":315373,"name":"rub","type":"verb","us_sound":"rʌb","us_link":"../audio/r/rub.mp3","uk_sound":"rʌb","uk_link":"../audio/r/ukroyal014.mp3","content":"Add to word list\nAdd to word list\nB2 to press or be pressed against something with a circular or up-and-down repeated movement: She yawned and rubbed her eyes sleepily. He rubbed (at) the stain on his trousers and made it worse. We rubbed some polish into the surface of the wood. She gently rubbed the ointment in. First rub the baking tray well with butter. [ + obj + adj ] Alice rubbed the blackboard clean for the teacher. Your cat keeps on rubbing itself (up) against my leg. She was rubbing her hands (together) at the thought of winning. The branches rubbed against each other in the wind. The chair legs have rubbed holes in the carpet. My new shoes are rubbing (against/on my toe) and now I've got blisters. These marks will never rub off (= be cleaned off). Alice rubbed the sums off (= cleaned them off) the blackboard for the teacher.\nThesaurus: synonyms, antonyms, and examples\nto cause painhurtMy leg hurts.acheMy legs are still aching from my run yesterday.throbMy head throbbed.stingHis cheeks stung from the aftershave he'd just put on.smartThe smoke was thick, making her eyes smart.rubThe clothing is cleverly stitched to prevent the seams rubbing anywhere.\nSee more results »\nMore examplesFewer examplesShe rubbed sun lotion over her entire body.With the back of his hand, he rubbed the stubble on his chin.He rubbed his hand despairingly over his face.The strap had rubbed against his skin and caused irritation.The shoe had rubbed a raw place on her heel.\nSMART Vocabulary: related words and phrases\nScratching and rubbing\nabrade\nabrasion\nbuff\nchafe\nchaff\nerode\nerosive\ngrind\nrasp\nregrind\nrub something down\nrubdown\nscour\nscour something out\nscrape\nscratch\nscuff\nsmooth\ntowel\nwear (something) away\nSee more results »\nIdioms\nrub someone's nose in it\nrub salt in/into the wound\nrub shoulders (with)\nrub someone up the wrong wayPhrasal verbs\nrub along\nrub something down\nrub something/someone down\nrub something in\nrub off\nrub something out\nrub someone out\nthe act of rubbing something: He gave her hair a good rub to dry it.\nSMART Vocabulary: related words and phrases\nScratching and rubbing\nabrade\nabrasion\nbuff\nchafe\nchaff\nerode\nerosive\ngrind\nrasp\nregrind\nrub something down\nrubdown\nscour\nscour something out\nscrape\nscratch\nscuff\nsmooth\ntowel\nwear (something) away\nSee more results »\nAdd to word list\nAdd to word list\nto press or be pressed against something with a repeated circular, side to side, or up and down movement: [ T ] I rubbed the place where I bumped my head. [ T ] If you rub linseed oil into the wood, it will protect it. Idioms\nrub it in\nrub shoulders with someone\nrub someone the wrong wayPhrasal verbs\nrub down someone\nrub off on someone\nrub out something/someone\nThe rub is something that prevents success: She got good reviews for her original cooking, but the rub was that people wanted very traditional dishes."}