{"id":315727,"name":"ruin","type":"verb","us_sound":"ˈruː.ɪn","us_link":"../audio/r/ruin.mp3","uk_sound":"ˈruː.ɪn","uk_link":"../audio/r/ukrucks022.mp3","content":"Add to word list\nAdd to word list\nB2 to spoil or destroy something completely: Huge modern hotels have ruined this once unspoilt coastline. Her injury ruined her chances of winning the race.\nThesaurus: synonyms, antonyms, and examples\nto spoil somethingspoilDon't spoil the movie by telling me what happens!ruinI put too much salt in the sauce and ruined it.defaceMany of the library books had been defaced.disfigureHer face was disfigured by the scar.sourOur friendship soured after the argument, and we just drifted apart.poisonThe long dispute has poisoned relations between the two countries.\nSee more results »\nto cause a person or company to lose all their money or their good reputation: Cheap imported goods are ruining many businesses. If there's a scandal I'll be ruined!\nMore examplesFewer examplesA modern extension on the old building would ruin its architectural integrity.The poor sound quality ruined an otherwise splendid film.Lucy has just ruined her new dress. That's children for you.I think the new extension ruins the proportions of the building.If you scuff your feet like that, you'll ruin your shoes.\nSMART Vocabulary: related words and phrases\nDestroying and demolishing\nannihilate\nannihilation\napocalypse\nbash\nbash through (something)\nbe sacrificed on the altar of something idiom\nerosionally\nerosive\nextirpate\nextirpation\nfall in\nsacking\nsacrifice\nscarred\nself-destruct\nself-devouring\nshred\nsink\ntear\nwipe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDamaging reputation\n[ U ] the process or state of being spoiled or destroyed: The car accident meant the ruin of all her hopes. They let the palace fall into ruin. Synonyms\ndepredation formal\ndesolation (EMPTINESS)\ndestruction\ndevastation (DAMAGE)\nC2 [ U ] a situation in which a person or company has lost all their money or their reputation: Many companies are on the edge/brink/verge of ruin. Alcohol was my ruin (= the thing that spoiled my life)\nB1 [ C ] the broken parts that are left of an ancient building or town: We visited a Roman ruin. the ruins of the ancient city of Carthage\nStefan Cristian Cioata/Moment/GettyImages\nthe broken parts that are left of a building or town that has been destroyed by bombs, fire, etc.: They live in the worst of the city's bombed-out ruins. Nine bodies lie among the smoking ruins. be/lie in ruins\n(of a building or city) to be extremely badly damaged so that most of it has fallen down: The town lay in ruins after years of bombing.\nC1 to be in an extremely bad state: The economy was in ruins after the war.\nSMART Vocabulary: related words and phrases\nDamaging and spoiling\nadulterate\nadulterated\nadulteration\napplecart\nat-risk\nbutcher\neat\neat away at something\nerode\nflaw\nfoul\nfoul (something) up\ngloss\nqueer\nrain on someone's parade idiom\nrampage\nravage\nravages\nsour\nwreck\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHumiliating and degrading\nThings remaining\nArchaeology\nDestroying and demolishing\nIn bad condition\nAdd to word list\nAdd to word list\nto spoil or destroy something: It would be a shame to ruin such a beautiful place. That guy isn’t going to ruin my life.\nAdd to word list\nAdd to word list\nto spoil something severely or destroy it: Huge modern hotels are ruining this once unspoilt coastline. His frequent lateness has ruined his chances for a promotion.\nto cause a person or company to lose all their money or their reputation: Cheap imported goods are ruining many businesses. If there's a scandal, I'll be ruined!\n[ U ] the loss of all your money, your business, or your reputation: Many workers are one health catastrophe away from financial ruin. the brink/edge/verge of ruin\nbe/lie in ruins\na place, building, etc. that is in ruins has been extremely badly damaged: The showroom was in ruins after the flood.\nto have failed or got into an extremely bad state: The economy was in ruins after the war. He lied about the company's finances, and now his career is in ruins."}