{"id":315753,"name":"rule","type":"noun","us_sound":"ruːl","us_link":"../audio/r/rule.mp3","uk_sound":"ruːl","uk_link":"../audio/r/ukrucks028.mp3","content":"rule noun\n(INSTRUCTION)\nAdd to word list\nAdd to word list\nB1 [ C usually plural ] an accepted principle or instruction that states the way things are or should be done, and tells you what you are allowed or are not allowed to do: A referee must know all the rules of the game. The first/most important rule in life is always to appear confident. Before you start your own business you should be familiar with the government's rules and regulations. You must follow/obey/observe the rules. You must not break the rules. In special cases the manager will bend/stretch the rules (= allow the rules to be broken slightly). You can trust Ruth because she always plays (it) by/goes by/does things by the rules (= follows instructions, standards, or rules). [ + to infinitive ] It's against the rules (of/in boxing) to hit below the belt. [ + that ] It's a club rule that new members must sing a song.\nMore examplesFewer examplesThere are exceptions to every rule.There's an unwritten rule that you don't wear jeans to work.They made an ineffective attempt to get the rules changed.Prisoners complain that they are subjected to too many petty rules and restrictions.Grammatical rules prescribe how words may be used together.\nSMART Vocabulary: related words and phrases\nRules & laws\nadministrative\nadmiralty\nanti-bribery\nanti-regulatory\nanti-sodomy\nbinding\nblue law\ncivil law\nhumanitarian law\ninvocation\njuridical\njuridically\njuristic\nland tenure\nlegislation\nprovision\nRafferty's rules\nthe rule of law\nuncanonical\nunenforceable\nSee more results »\nrule noun\n(CONTROL)\nC2 [ U ] a period of time during which a particular person or group is in control of a country: The period of Fascist rule is one people try to forget. We don't want one-party rule - we want rule by the people. See also\nmisrule\nMore examplesFewer examplesVarious parts of Africa have suffered under colonial rule.UK The constituency fell to Labour at the last election, after ten years of Conservative rule.The president resigned after 30 years of autocratic rule.In the end she left home just to escape the tyrannical rule of her mother.The people revolted against foreign rule and established their own government.\nSMART Vocabulary: related words and phrases\nRuling & governing\nadministration\naffairs of state\nascend\nascend the throne idiom\nbipartisanship\ngovernment-sponsored\ngovernmental\ngovernmentally\ngovernorate\nhard Brexit idiom\noppress\noppression\noppressively\noppressiveness\novergovern\nstatesmanship\nsubjection\nsubjugate\nsubjugation\nsuper-government\nSee more results »\nIdioms\nas a (general) rule\nmake it a rule\nrule of thumb\nrules are made to be broken\nrule verb\n(CONTROL)\nB2 [ I or T ] to control or be the person in charge of something such as a country: Most modern kings and queens rule (their countries) only in a formal way, without real power. She rules her household with an iron hand/fist (= severely).\nB2 [ I or T ] to be the most important and controlling influence on someone: Love ruled supreme in her heart. The desperate desire to go to Moscow ruled their lives.\nMore examplesFewer examplesThe occupying force ruled by diktat.The Romans ruled over most of Europe.He was able to rule the game with his superior strength and skill.He has been ruling the country since a military coup in 1987.It used to be said that Britain ruled an empire on which the sun never set.\nSMART Vocabulary: related words and phrases\nRuling & governing\nadministration\naffairs of state\nascend\nascend the throne idiom\nbipartisanship\ngovernment-sponsored\ngovernmental\ngovernmentally\ngovernorate\nhard Brexit idiom\noppress\noppression\noppressively\noppressiveness\novergovern\nstatesmanship\nsubjection\nsubjugate\nsubjugation\nsuper-government\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nControlling and being in charge\nrule verb\n(DECIDE)\n[ I or T ] to decide officially: Only the Appeal Court can rule on this point. The judge ruled for/in favour of/against the defendant. [ + that ] The government has ruled that the refugees must be deported. [ + obj + noun/adj ] The courts have ruled his brave action illegal. See also\noverrule formal\nMore examplesFewer examplesHer confession was ruled inadmissible as evidence because it was given under pressure from the police.The judge ruled that the directors had knowingly broken the law.The judge ruled her unfit to plead on the grounds of insanity.We won't be surprised if the judge rules in her favour.The player was ruled off-side and so the goal was disallowed.\nSMART Vocabulary: related words and phrases\nUK politics: legislation & law-making\nabolish\nabrogate\nabrogation\namend\namendment\nassemblyman\nconstitutionally\nenact\nGreen Paper\nguillotine\nhard Brexit idiom\nirrepealable\njurisprudence\nPMQs\npocket veto\npresiding officer\nPrime Minister's Questions\nprivate member's bill\nsanction\nwrit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nJudges & juries\nrule verb\n(DRAW)\n[ T ] to draw a straight line using something that has a straight edge: She ruled two red lines under the title.\nSMART Vocabulary: related words and phrases\nPainting, drawing & printing\nairbrush\naxonometric\nbrushstroke\nbrushwork\nchiaroscuro\ndescribe\ndrawn\nengraving\netching\nface painting\nforeshorten\nillustrate\npainterly\npainting\npainting by numbers idiom\npentimento\npicturize\nshade\nsketch\nvanishing point\nSee more results »\nIdioms\nbe ruled by someone\nrule OK\nrule the roostPhrasal verbs\nrule something or someone in\nrule something or someone out\nrule something out\nrule noun\n(INSTRUCTION)\nAdd to word list\nAdd to word list\n[ C ] an accepted principle or instruction that states the way things are or should be done, and tells you what you are allowed or are not allowed to do: The company's chief executive failed to enforce federal workplace rules. If you broke the rule, you’re going to be punished for it. It's against the rules to kick someone.\nrule noun\n(CONTROL)\n[ U ] control: This area was under Polish rule until the start of World War II.\nrule verb [I/T]\n(DECIDE)\nto decide officially: [ I ] A lower court ruled in favor of the society. [ + that clause ] The judge ruled that the defendant be taken back to Virginia.\nrule verb [I/T]\n(CONTROL)\npolitics &amp; government to control, or be the person in charge of a country: [ I ] The prince ruled wisely and well. Phrasal verb\nrule out something\nAdd to word list\nAdd to word list\nGOVERNMENT, LAW an accepted principle or instruction that states the way things are or should be done, and tells you what you are allowed or are not allowed to do: rules and regulations. a general/basic/fundamental rule As a general rule, companies do not qualify for the generous tax breaks if they are listed on another exchange.a rule about/on sth Hodgson breached Football League rules on payments to agents.a rule of sth A basic rule of finance is that if an asset produces a high return, it carries a high risk. make/set/change the rules follow/obey/observe the rules strict/tough rulesbe against the rules Such misleading advertising is against the rules.it is against the rules to do sth Halverson said it was against the group's rules to disclose the number of volunteers in its ranks. Under current rules only €30,000 of savings would be protected should the bank collapse. break the rules This huge company has been the exception to the rule that conglomerates are doomed to underperformance.\nbend/stretch the rules\nto allow the rules to be broken in a way that is not very serious: Is it acceptable to lie, cheat, or just bend the rules a little in order to succeed in our highly competitive world? In special cases the manager will stretch the rules.\nrule of thumb\na practical and approximate way of measuring or deciding about something: As a rule of thumb, the higher the yield offered, the riskier the investments will be.\nthe rules of the game\nthe set of ideas and principles that most people involved in an activity, area of business, etc. accept and follow: Both companies changed the rules of the retail game by producing entertaining retail experiences. know the rules of the game.\nsth is the rule\nused to say that a particular condition or way of operating is typical or accepted in a particuar situation: In most public school libraries, a staff of one person is the rule, not the exception. In the newest high-end restaurants, high style is the rule. See also\nground rules\nthe Hague Rules\nrun verb\n[ I or T ]\n&#160; LAW to decide officially: The judge ruled that the directors had knowingly broken the law.rule on sth She is expected to rule on the matter within 20 days.rule on how/whether/what, etc. On Friday a judge will rule on whether proper procedures were adhered to.rule for/against The EC ruled against the merger. The judged ruled in favour of the plaintiff.\nSee also\noverrulePhrasal verbs\nrule sth/sb out\nrule sth out"}