{"id":315763,"name":"ruling","type":"noun","us_sound":"ˈruː.lɪŋ","us_link":"../audio/r/ruling.mp3","uk_sound":"ˈruː.lɪŋ","uk_link":"../audio/r/ukrucks030.mp3","content":"Add to word list\nAdd to word list\nC2 a decision: [ + that ] The court has made a final ruling on the case that the companies acted illegally.\nMore examplesFewer examplesLangdale described the court ruling as a travesty of justice.The ruling sets a legal precedent.Many believe the ruling to be unfair.The judge will make his ruling after all the evidence has been submitted.A ruling in favour of the defendant will be seen by some as a victory for common sense.\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\ndiminished responsibility\nextrajudicial\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\npleading\npower of attorney\nprecedent\npretrial\nprobate\nthe Webster ruling\nwitness to something\nwobbler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDecisions and deciding\nbeing in control of a country, society, etc.; making the decisions about how a country, society, etc. is run: The Communists are the ruling party at the moment.\nMore examplesFewer examplesHe was a member of the ruling class.There are signs of dissension within the ruling political party.Prince Rainier is the ruling prince of Monaco.Previous elections in the country have been rigged by the ruling party.The new leaders expatriated the ruling family.\nSMART Vocabulary: related words and phrases\nControlling and being in charge\naggrandize\nassert your authority\nassume\nassumption\nauthoritative\ncommanding\ncynical\nget the better of someone idiom\nget your hooks into someone/something idiom\nget/fall into the wrong hands idiom\ngovern\nguiding principle\npaternalistic\npaternalistically\nperemptorily\nperemptory\nplay God idiom\ntame\nwrangle\nwrangler\nSee more results »\nIdiom\nsomeone's ruling passion\nruling noun [C]\n(DECISION)\nAdd to word list\nAdd to word list\nan official decision: The US Supreme Court refused to review the state court’s ruling.\nruling adjective [not gradable]\n(CONTROLLING)\npolitics &amp; government being in charge of a country: the ruling party\nAdd to word list\nAdd to word list\nan official decision, especially one by a judge, a court, or other authority: If some states launch a legal challenge to the FCC's ruling, Congress may have to step in. The electronics giant is appealing against the Commission's ruling that the company had abused its market position. The director of the EPA said he'd issue a written ruling within two weeks.a ruling is upheld/overturned The ruling was later overturned by the state Supreme Court.\na ruling group in a country or area is the group that governs it or has the most political power: the leader of the ruling National Party the ruling class/elite"}