{"id":315843,"name":"rummage","type":"verb","us_sound":"ˈrʌm.ɪdʒ","us_link":"../audio/r/rummage.mp3","uk_sound":"ˈrʌm.ɪdʒ","uk_link":"../audio/r/ukrum__009.mp3","content":"Add to word list\nAdd to word list\nto search for something that is difficult to find among other things: rummage in/through She rummaged in/through all the drawers, looking for a pen. The chapters overlap and interrelate and readers in search of particular information will have to rummage.\nThesaurus: synonyms, antonyms, and examples\nto search for somethingsearchI've searched everywhere and can't find my passport.lookShe was looking in her handbag for a pen.huntI've hunted all over the place but I can't find that book.rummageHe rummaged through his pockets, looking for his keys.ferret outThe inspector general has broad powers to ferret out fraud on the state and local level.combPolice combed the area for evidence.\nSee more results »\nSMART Vocabulary: related words and phrases\nSearching\n-seeking\nbeachcomb\nbeachcomber\nbeachcombing\nbody search\nbounty hunter\ndivine\nhunting ground\nkeep your/an eye out for someone/something idiom\nleave no stone unturned idiom\nmanhunt\nmudlark\nscout\nscratch\nseek someone/something out\nseeker\nshake\nshake someone down\nshakedown\ntroll\nSee more results »\nUK a search for something that is difficult to find among other things: rummage around/about I had a rummage around/about (the house), but I couldn't find my certificate anywhere. Her mother was away, and he was bored, so he had a nosy rummage in her desk. A rummage through his collection of recipe books produced a tempting selection of dishes.\nMore examplesFewer examplesA quick rummage around in the pile on my desk produced a dogeared contract.I like a good old rummage in a vintage store.If you're lucky enough to have a well-dressed grandma, I suggest a good rummage through her jewellery box.\nSMART Vocabulary: related words and phrases\nSearching\n-seeking\nbeachcomb\nbeachcomber\nbeachcombing\nbody search\nbounty hunter\ndivine\nhunting ground\nkeep your/an eye out for someone/something idiom\nleave no stone unturned idiom\nmanhunt\nmudlark\nscout\nscratch\nseek someone/something out\nseeker\nshake\nshake someone down\nshakedown\ntroll\nSee more results »\nAdd to word list\nAdd to word list\nto search for something by moving things around without care and looking into, under, and behind them: She rummaged through the drawer, looking for a pen."}