{"id":315972,"name":"running","type":"adjective","us_sound":"ˈrʌn.ɪŋ","us_link":"../audio/r/running.mp3","uk_sound":"ˈrʌn.ɪŋ","uk_link":"../audio/r/ukrum__029.mp3","content":"Add to word list\nAdd to word list\nC2 happening on a particular number of regular occasions: You've been late three days running. They won the trophy for the third year running.\nMore examplesFewer examplesFor the second day running, play was impossible because of the rain.They had to make running repairs to the vessel to prevent it from sinking.It's a running joke between us that he can never remember my wife's name.He has been nominated for the best actor award for the fourth year running.As he repaired the cooker he gave a running commentary on what he was doing.\nSMART Vocabulary: related words and phrases\nOrder and sequence - general words\nalphabetize\naround\nback end\nbe a chapter of accidents idiom\ncatalogue\nchapter\ncycle\ninconsecutive\ninline\nlinear\nlinearity\nlinearly\nlitany\nprecedence\npriority\nprocession\nsecondly\nsequence\nstring\nwave\nSee more results »\nIdioms\nrunning battle\n(go and) take a running jump\nrunning noun [U]\n(GOING QUICKLY)\nA2 the activity of going somewhere quickly on foot, as a sport or for pleasure: running shoes/shorts\nMike Harrington/Taxi/GettyImages\nSMART Vocabulary: related words and phrases\nAthletics\nathletically\nbiathlon\nblade\ndecathlon\nDNF\nendurance\nfaller\nfun run\nhigh jumper\nhurdle\njavelin\nobstacle course\nsplit\nstarter\ntape\ntriple jump\ntriple jumper\nultra\nultra-runner\nultra-running\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMoving quickly\nrunning noun [U]\n(OPERATION)\nC2 the activity of controlling or taking care of something: She has control of the day-to-day running of the business.\nSMART Vocabulary: related words and phrases\nManaging and organizing\nadmin\nadminister\nadministration\nanti-bureaucracy\nbronze command\nfixer\nflabbily\nget up\nget your act together idiom\ngold command\nmobilize\nmount\npaperwork\nparty planner\nparty planning\nproject-manage\nrationalization\nrationalize\nvice-presidential\nwieldy\nSee more results »\nIdioms\nin/out of the running\nmake (all) the running\nrunning noun [U]\n(OPERATE)\nAdd to word list\nAdd to word list\nthe management or operation of something: The running of a large household is not easy.\nAdd to word list\nAdd to word list\n[ before noun ] happening continuously without interruption: a running battle/argument/dispute The news site has kept up a running commentary on the state of the county's debt.\ntwo years/six weeks/eight days, etc. running\nhappening for two years, six weeks, eight days, etc. without interruption: Sales have been up three years running. We have seen a rise in the unemployment rate for several months running.\nthe activity of managing the operation of something: the running of sth Our company places value on things that go beyond the running of the business. She is in charge of the day-to-day running of the department.\nin the running (for sth)\nbeing considered as one of the possible choices for something: The land is one of six sites nationally in the running for the $11.5 million project. A new CEO will be hired, and Martyn is one of several executives in the running."}