{"id":315976,"name":"runoff","type":"noun","us_sound":"ˈrʌn.ɑːf","us_link":"../audio/r/cdo0623usruno3442.mp3","uk_sound":"ˈrʌn.ɒf","uk_link":"../audio/r/cdo0623ukruno3466.mp3","content":"runoff noun\n(VOTE)\nAdd to word list\nAdd to word list\n[ C ] an extra vote to decide who wins an election or competition because there is no clear winner after the first vote, often one in which candidates or competitors with the fewest votes are no longer included: In a run-off for the presidency of the assembly, Santos beat Gutiérrez. There is no runoff, so the candidate with the most votes wins.\nMore examplesFewer examplesThe endorsements of the eliminated Democratic candidates may not have any effect on a runoff in which many voters are unlikely to return to the polls.All the candidates like to avoid the word runoff.The winner of the presidential election had to get more than half the votes cast to avoid a run-off.The bill would do away with the second primary, or runoff election.\nSMART Vocabulary: related words and phrases\nElections\nabsentee\nabsentee ballot\nabsentee vote\nabsentee voter\nabsentee voting\nentrance poll\nexit poll\nfirst-past-the-post\nflip\nfranchise\nprimary\nproportional representation\nproxy\nproxy vote\nproxy voter\nvote something through\nvoting\nvoting booth\nvoting machine\nvoting slip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParts & stages of competitions\nrunoff noun\n(LIQUID)\n[ C or U ] water from rain or melting snow, or liquid from an industrial or farming process, that flows into a place such as a river: Reduced runoff means less water for irrigation. The plants are fed and watered via an irrigation system, using run-off from the roof. Sometimes entire villages are affected by diseases traceable to industrial runoffs in the water supply. The water is orange because of run-offs from ironstone rock inside the hill.\nMore examplesFewer examplesThere will be more large storms with heavy runoff that can cause flooding problems.Some local residents fear the runoff from the lab contains unacceptable levels of dangerous contaminants.\nSMART Vocabulary: related words and phrases\nMovement of liquids\nbacksplash\nbe dripping with something idiom\nbleed\ncounter-stream\ndecant\ndrainage\ndrip\nleakage\nreinjection\nrespray\nripple\nrun a bath phrase\nrun someone/something over\nrunnel\nspate\nswill\nswirl\nswirling\ntop something up\ntrickle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnvironmental issues\nrunoff noun\n(ELECTION)\nAdd to word list\nAdd to word list\n[ C ] a second or final election held when no one got enough votes to win an earlier election\nrunoff noun\n(LIQUID)\n[ U ]\n&#160; earth science water that flows away from high areas to low areas: Houses and subdivisions can disturb spring water runoff from the mountains.\n[ U ]\n&#160; earth science Runoff is also chemicals and animal excrement that flow into rivers and lakes and pollute the environment: Stormwater runoff is a major source of water pollution."}