{"id":236750,"name":"nacho","type":"noun","us_sound":"ˈnɑː.tʃoʊ","us_link":"../audio/n/usmysti009.mp3","uk_sound":"ˈnɑː.tʃəʊ","uk_link":"../audio/n/ukmyth_013.mp3","content":"Add to word list\nAdd to word list\n[ C ] (US also nacho chip) a small piece of fried tortilla (= flat bread made from maize flour), often eaten with melted cheese or a dip: Dip a nacho in a bowl of salsa. a bag of nachos\nHussenot, Pierre/Foodcollection/GettyImages nachos [ plural ]\na dish made with small pieces of fried tortilla covered with melted cheese, beans, sometimes pieces of meat, and a spicy sauce: To taste real nachos you have to go to Mexico.\nSee more\nMore examplesFewer examplesHe swipes a nacho into a bowl of queso dip. I was clutching a bottle of water and a bag of nachos I had just bought.They ate corn-chip nachos with melted Tex-Mex cheese dip.Could I have some nachos and a cola?Fans slouch happily in cushy chairs, eating nachos and guzzling beer.A serving of beef and cheese nachos with sour cream and guacamole contained 1,360 calories.\nSMART Vocabulary: related words and phrases\nSandwiches & snacks\navocado toast\nbanh mi\nBLT\nBombay mix\nbreakfast bar\ndevils on horseback\ndouble-decker\nelephant ear\nfairy bread\nfinger chip\nmuffuletta\nmunchies\nnibble\nopen-faced\nopen-faced sandwich\nshrimp chip\nslider\nsloppy joe\nsnack mix\nstacker\nSee more results »\nserved with or relating to nachos: There are industrial-sized containers of nacho cheese and ketchup.\nMore examplesFewer examplesThe most common seasoning used is nacho cheese.When I was in the Mexican food section I spotted the nacho sauces.You may want to melt some cheese to make a nacho dip.\nSMART Vocabulary: related words and phrases\nSandwiches & snacks\navocado toast\nbanh mi\nBLT\nBombay mix\nbreakfast bar\ndevils on horseback\ndouble-decker\nelephant ear\nfairy bread\nfinger chip\nmuffuletta\nmunchies\nnibble\nopen-faced\nopen-faced sandwich\nshrimp chip\nslider\nsloppy joe\nsnack mix\nstacker\nSee more results »"}