{"id":236866,"name":"nail","type":"noun","us_sound":"neɪl","us_link":"../audio/n/nail.mp3","uk_sound":"neɪl","uk_link":"../audio/n/ukmyth_020.mp3","content":"nail noun [C]\n(METAL)\nAdd to word list\nAdd to word list\nB2 a small, thin piece of metal with one pointed end and one flat end that you hit into something with a hammer, especially in order to fasten or join it to something else: a three-inch nail I stepped on a nail sticking out of the floorboards. Hammer a nail into the wall and we'll hang the mirror from it.\ntrekandshoot/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesI got a flat tyre after driving over a nail.Can you hold this nail in position while I hammer it into the door?I ripped my shirt on a nail.I've got a run in my tights from the nail on my chair.She scrounged around in the tool box for a tack or nail to hang the notice up with.\nSMART Vocabulary: related words and phrases\nNuts, bolts & screws\nbolt\nhobnail\nnut\nrivet\nscrew\nthread\nwing nut\nnail noun [C]\n(BODY PART)\nB2 a thin, hard area that covers the upper side of the end of each finger and each toe: Stop biting your nails! nail clippers a nail file See also\nfingernail\ntoenail\nkrisanapong detraphiphat/Moment/GettyImages\nMore examplesFewer examplesYou're not to bite your nails like that.She painted her nails a bright red.She filed her nails as she watched TV.She sat in the dentist's waiting room, nervously chewing at her nails.I wish my nail polish wouldn't keep chipping.\nSMART Vocabulary: related words and phrases\nThe hand\ncarpal\ncarpometacarpal\ncarpus\ncuticle\ndexterity\ndexterous\nfinger\nfingertip\nknuckle\nleft-handed\nleft-hander\nlittle finger\nmetacarpus\nminimus\nopposable\npalm\npalmar\nphalangeal\npinkie\ntwo-handed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe foot\nIdioms\nanother/the final nail in the coffin\nhard/tough as nails\nnail verb\n(FASTEN)\n[ T + adv/prep ] to fasten something with nails: She had nailed a small shelf to the door. A notice had been nailed up on the wall. The lid of the box had been nailed down.\nSMART Vocabulary: related words and phrases\nFastening and tying\nanchor\nbale\nbe locked together idiom\nbelay\nbind\nboard something up\nbound\nbowline\nhalf hitch\nharness\nhobble\nhogtie\nknotted\nstake\nstrap someone in\nstrap something up\nstrop\ntack\ntape something up\ntether\nSee more results »\nnail verb\n(CATCH)\n[ T ] slang to catch someone, especially when they are doing something wrong, or to make it clear that they are guilty: The police had been trying to nail those guys for months.\nThesaurus: synonyms, antonyms, and examples\nto find and take a person who has done something wrongcatchThey were caught trying to smuggle cigarettes across the border.arrestHe was arrested on suspicion of causing criminal damage to property.place/put under arrestThe suspect was placed under arrest and charged with armed assault.captureThe soldiers were captured by enemy forces.apprehendThe police have apprehended two individuals in connection with the crime.nabThe cops nabbed him as he tried to get away.\nSee more results »\nSMART Vocabulary: related words and phrases\nArresting & charging\napprehend\napprehension\narrest\nassist\nattach\nattachment\nbust\nbusted\ncollar\nfed\nhandcuff\nhandcuffs\nhouse arrest\nknock\npick\npick someone/something up\npolice action\npost-arrest\nprobable cause\nwarrant\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBlaming & accusing\nnail verb\n(SUCCEED)\n[ T ] informal to do something successfully: She nailed her audition and got the lead part in the musical. You totally nailed it!\nSMART Vocabulary: related words and phrases\nSucceeding, achieving and fulfilling\nA game\naccomplish\nachieve\nacquit\nactualize\nbear\nget to/reach first base idiom\ngo (like/down) a bomb idiom\ngo far idiom\ngo from strength to strength idiom\ngo into orbit idiom\ngrade\nkill\nrise\nscale the heights idiom\nscrape through (something)\nsew something up\nslam dunk\nsmash it idiom\nstand out\nSee more results »\nIdioms\nnail your colours to the mast\nnail a lie\nnailing jelly to the wallPhrasal verbs\nnail someone down\nnail something down\nnail something on\nnail noun [C]\n(METAL)\nAdd to word list\nAdd to word list\na thin piece of metal having a pointed end that is forced into wood or another substance by hitting the other end with a hammer, and is used esp. to join two pieces or to hold something in place\nnail noun [C]\n(BODY PART)\nthe hard, smooth part at the upper end of each finger and toe Idiom\n(as) tough as nails\nnail verb [T]\n(FASTEN)\nto attach or fasten with a nail or nails: [ M ] Workmen were nailing down the carpet.\nIf you nail something shut, you put nails in it to fasten it so that it cannot easily be opened: He nailed the box shut.\ninfml To nail someone is to catch someone in a dishonest or illegal act: We finally nailed the guys dumping garbage in the park.\nPhrasal verb\nnail something down\nAdd to word list\nAdd to word list\nto prove that someone is guilty of doing something: Identifying and nailing insider dealers in the credit markets is a difficult task.\nto do something successfully: He nailed the interview and was offered the job right there. Phrasal verbs\nnail sth down\nnail sb down\non the nail UK informal\nat exactly the right time: Some credit cards are offering loyalty bonuses to customers who pay on the nail ."}