{"id":236979,"name":"name","type":"noun","us_sound":"neɪm","us_link":"../audio/n/name.mp3","uk_sound":"neɪm","uk_link":"../audio/n/ukmyth_029.mp3","content":"Add to word list\nAdd to word list\nA1 [ C ] the word or words that a person, thing, or place is known by: \"Hi, what's your name?\" \"My name's Diane.\" Please write your full (= complete) name and address on the form. What's the name of that mountain in the distance? We finally agreed on the name Luca for our son. The students were listed by name and by country of origin.\nB2 [ C usually singular ] the opinion or reputation that someone or something has: She went to court to clear her name (= prove that the bad things said about her were not true). The fans' actions gave our team a bad name in the youth league at that time. They're trying to restore the good name of the manufacturer.\n[ C ] someone who is famous or has a good reputation: It seemed like all the big names in football were there. by the name of something formal\ncalled: I need to talk to a professor by the name of Bin Said.\nSee more go by the name of something\nto give yourself a name that is not your real name: In the business world he goes by the name of J. Walter Fortune.\nSee more in the name of someone (also in someone's name)\nfor someone or belonging to someone: I'm here to pick up my tickets - I reserved them by phone yesterday in the name of Tremin.\nSee more\nMore examplesFewer examplesPlease would you check in at the reception desk and sign your name in the book.I can't think of her name - it'll come back to me later.What's the file name?The police officers were taking down the names of witnesses.She slapped him and called him names, but he didn't react.\nSMART Vocabulary: related words and phrases\nNames and titles\nA.N. Other\nage\naka\nalias\nappellation\nform of address\ngiven name\ngood name\nidentity\nilk\nplace name\npseudonym\npseudonymity\npseudonymous\npseudonymously\nunchristened\nunder the name of idiom\nunidentified\nunnamed\nuntitled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReputation\nFamous people\nGrammar\nNames and titles: addressing peopleWhen we talk to someone directly, we use names and titles: …\nIdioms\nbe a name to conjure with\nin all but name\nin God's/heaven's name\nin name only\nin the name of something\nin the name of someone/something\nmake a name for yourself\nyour name is mud\nthe name of the game\ntake someone's name in vain\nMore idioms\nto your name\nunder the name of\nname verb [T]\n(GIVE/SAY NAME)\nB1 to give someone or something a name: [ + two objects ] We named our dogs Shandy and Belle. A man named Dennis answered the door.\nB1 to say what something or someone's name is: In the first question you had to name three types of monkey. He couldn't name his attacker.\nMore examplesFewer examplesWe've just got a new cat, but we haven't named him yet.Paul was named after his grandad.The Queen attended a ceremony to name the ship.Some parents chose to name their children after characters from the show.They named their son Isaac after the biblical character.\nSMART Vocabulary: related words and phrases\nNames and titles\nA.N. Other\nage\naka\nalias\nappellation\nform of address\ngiven name\ngood name\nidentity\nilk\nplace name\npseudonym\npseudonymity\npseudonymous\npseudonymously\nunchristened\nunder the name of idiom\nunidentified\nunnamed\nuntitled\nSee more results »\nname verb [T]\n(CHOOSE)\nB2 to choose someone or something: Just name the time and I'll be there. Name your conditions/terms/price. Ms Martinez has been named (as) the new Democratic candidate.\nSMART Vocabulary: related words and phrases\nTaking and choosing\nadopt\nadopted\nadoption\nappoint\nbags I... idiom\nbe your best bet idiom\ncull\nempanel\nfaute de mieux\nfavoured\nfilterable\ngo for someone\npicker\nplump\nselect\nselection\nselective\nselectively\nselectivity\nskim\nSee more results »\nIdioms\nname and shame\nname names\nname the day\nyou name itPhrasal verb\nname someone/something after someone/something\nAdd to word list\nAdd to word list\na word or words that a person or thing is known by: Hello, my name is Beth. Do you remember the name of that town we visited in Maine? I’m looking for someone by the name of (= who has the name) Stephen Weinberg.\nA name is also a reputation, esp. a good one: She had made a name for herself as an architect by the time she was thirty.\nA name is also a famous person or thing: He’s a big name in the field of fashion. They wanted a name band for the wedding. Idioms\nin name only\nin the name of something\nname names\nthe name of the game\nto give a name to someone or something: They decided to name their first child Benjamin.\nTo name is also to choose or to state publicly: The president has yet to name a new ambassador to Russia.\nAdd to word list\nAdd to word list\na well-known and successful company, person, or product: a big/famous name Some big names in the technology sector were hardest hit.\nthe reputation of a company, person, or product: good/bad name It is hard to put a value on a firm's good name.\nmake your name\nto become famous by achieving something: He had already made his name on Wall Street in the early 90s with his high-risk investment strategies.\n[ C ]\n&#160; INSURANCE\n&#160; (also Lloyd's name) an investor who makes large sums of their own money available to the insurance group Lloyds so that it can provide insurance for organizations or industries that have large risks See also\nassumed name\nbig name\nbrand name noun\nchange of name\ndomain name\nfilename\nfirm name\nhousehold name\ntrade name"}