{"id":237360,"name":"narrowness","type":"noun","us_sound":"ˈner.oʊ.nəs","us_link":"../audio/n/usnarci010.mp3","uk_sound":"ˈnær.əʊ.nəs","uk_link":"../audio/n/uknark_009.mp3","content":"narrowness noun [U]\n(OF WIDTH)\nAdd to word list\nAdd to word list\nthe quality of having a small distance from one side to the other, especially in comparison with the length: the narrowness of the twisting Cambridge streets\nMore examplesFewer examplesThe relative narrowness of the river means rowing crews sometimes get stuck behind slow moving novices. The narrowness of the mummy's skull matches closely that of the famous bust of Nefertiti.\nSMART Vocabulary: related words and phrases\nNarrow and thin\nattenuate\nattenuated\nattenuation\nelongate\nnarrow\nrailroad\ntapering\nthin\nthinly\nultra-thin\nwafer-thin\nwasp waist\nYou can also find related words, phrases, and synonyms in the topics:\nThin and fine\nnarrowness noun [U]\n(OF SCOPE)\nthe fact of being limited to a small area of interest, activity, or thought: His main flaw is his narrowness of vision.\nMore examplesFewer examplesThe person who is indifferent to philosophy and art condemns himself to a depressing narrowness of outlook. He is critical of what he sees as an inherent narrowness in thinking about psychotherapy.\nSMART Vocabulary: related words and phrases\nRange and limits\nall the way to idiom\nambit\nanywhere\nband\nbeyond the bounds of something\ncompass\nfinitude\ngamut\nglass ceiling\nlimit\nlimited\nproviso\nrealm\nrestricted\nscope\nspecialized\nspectrum\nspread\nstretch\nstring\nSee more results »\nnarrowness noun [U]\n(OF RESULT)\nThe narrowness of a victory or defeat is the fact that it happened only by a very small amount, and the result could easily have been different: Despite the narrowness of the victory, the party will be pleased.\nMore examplesFewer examplesThe narrowness of their winning margin only added to the thrill of the moment.The narrowness of her opponent's lead gave some cause for optimism.\nSMART Vocabulary: related words and phrases\nSmall in number and quantity\nbeggarly\nbelow\nbupkis\ncertain\ncould count something on (the fingers of) one hand idiom\nlimitedness\nmeasly\nmild\nmildness\nmingy\nminimal\npiffling\nremote\nscantly\nslenderly\nslenderness\nspeak\nstrength\nsuggestion\nthin\nSee more results »\nSee\nnarrow"}