{"id":237348,"name":"narrow","type":"adjective","us_sound":"ˈner.oʊ","us_link":"../audio/n/eus73161.mp3","uk_sound":"ˈnær.əʊ","uk_link":"../audio/n/uknark_007.mp3","content":"narrow adjective\n(SMALL WIDTH)\nAdd to word list\nAdd to word list\nB1 having a small distance from one side to the other, especially in comparison with the length: a narrow bridge/passage/gap a narrow face narrow feet The little village has very narrow streets.\nMore examplesFewer examplesWe drove up a narrow dirt track to their house.They had a narrow escape when their car crashed.The Socialists won by a narrow/large majority.The evening sun slanted through the narrow window.The boats all have to pass through this narrow channel.\nSMART Vocabulary: related words and phrases\nNarrow and thin\nattenuate\nattenuated\nattenuation\nelongate\nnarrowness\nrailroad\ntapering\nthin\nthinly\nultra-thin\nwafer-thin\nwasp waist\nYou can also find related words, phrases, and synonyms in the topics:\nThin and fine\nnarrow adjective\n(LIMITED)\nC2 mainly disapproving limited to a small area of interest, activity, or thought: They are unable to see beyond the narrow world of the theatre. It was regarded as a very narrow interpretation of the law. See also\nnarrow-minded disapproving\nSMART Vocabulary: related words and phrases\nRange and limits\nall the way to idiom\nambit\nanywhere\nband\nbeyond the bounds of something\ncompass\nfinitude\ngamut\nglass ceiling\nlimit\nlimited\nproviso\nrealm\nrestricted\nscope\nspecialized\nspectrum\nspread\nstretch\nstring\nSee more results »\nnarrow adjective\n(ONLY JUST)\nA narrow result is one that could easily have been different because the amount by which someone failed or succeeded was very small: The election was won by the very narrow margin of only 185 votes. The opposition had a narrow defeat. We won a narrow victory. a narrow escape\nC2 a situation in which you avoid danger although you very nearly do not: We got out in time but it was a narrow escape.\nSee more\nSMART Vocabulary: related words and phrases\nSmall in number and quantity\nbeggarly\nbelow\nbupkis\ncertain\ncould count something on (the fingers of) one hand idiom\nlimitedness\nmeasly\nmild\nmildness\nmingy\nminimal\npiffling\nremote\nscantly\nslenderly\nslenderness\nspeak\nstrength\nsuggestion\nthin\nSee more results »\nRelated word\nnarrownessIdiom\na narrow squeak\nnarrow verb\n(LESS WIDE)\nC1 [ I or T ] to become less wide or to make something less wide: The road narrows after the bridge. He narrowed his eyes in suspicion. They have narrowed the focus of the investigation, to concentrate on younger adults.figurative We must strive to narrow the gap between rich and poor.\nSMART Vocabulary: related words and phrases\nNarrow and thin\nattenuate\nattenuated\nattenuation\nelongate\nnarrowness\nrailroad\ntapering\nthin\nthinly\nultra-thin\nwafer-thin\nwasp waist\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming and making smaller or less\nnarrow verb\n(LESS)\nC2 [ I ] to become less: The retailer's loss narrowed to $3 million from $10 million a year earlier.\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nabridgment\nattenuate\nattenuated\nattenuating\nattenuation\nboil\ndamp\nfall off\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nroll back something\nrollback\nrun someone/something down\nrundown\nsag\nshave\ntelescope\ntumble\nSee more results »\nPhrasal verb\nnarrow something down\nnarrow adjective\n(SMALL)\nAdd to word list\nAdd to word list\nhaving a small distance from one side to the other: Scenes from the movie were filmed in some of Rome’s ancient, narrow streets.\nNarrow also means slight, esp. as a measure of difference: He was defeated in the election by a narrow margin. It was a narrow victory, with the golf tournament decided by a single stroke.\nNarrow also means only just successful: He had a narrow escape, getting out of the car just before it burst into flames.\nnarrow adjective\n(LIMITED)\nlimited in range: The local newspaper tends to focus on narrow regional issues.\nnarrow verb [I/T]\n(BECOME SMALLER)\nto become or make something narrower or smaller: [ I ] The road narrows from four lanes to two when you leave town. [ T ] Senate leaders met again to try to narrow the budget deficit.\nAdd to word list\nAdd to word list\nextremely small: a narrow margin/defeat/victory/lead The election was won by a narrow margin of 85 votes.\nincluding only a small number of things: Specialization by developing countries in a narrow range of commodities had left them vulnerable to external shocks. With little money available, the policymakers established narrow eligibility criteria and limited the number of grants.\nin a narrow range\nFINANCE if something trades in a narrow range, it does not go up and down very much in price: Dealers in London described trading as light with prices continuing to trade in a narrow range.\n[ I ] to become less in amount, or to make something become less in amount: narrow to sth (from sth) The retailer's loss narrowed to $3 million from $10 million a year earlier. a narrowing gap/difference/deficit narrowing noun [ S or U ]\nRising costs caused some narrowing of profit margins."}