{"id":237392,"name":"nasally","type":"adverb","us_sound":"ˈneɪ.zəl.i","us_link":"../audio/n/usnarci012.mp3","uk_sound":"ˈneɪ.zəl.i","uk_link":"../audio/n/uknark_013.mp3","content":"Add to word list\nAdd to word list\nin a way that relates to the nose or is done through the nose: They are best known as the maker of a nasally inhaled flu vaccine. Dmitri was breathing nasally.\nusually disapproving If someone speaks nasally, their voice has a particular sound because air is going through the nose when they speak: Mr Smith droned on nasally. He plays the character with a high-pitched, nasally projected voice. See\nnasal\nMore examplesFewer examplesThese drugs are active taken orally or nasally.A more costly flu vaccine that is administered nasally also is available.She experiments vocally: wailing nasally like Axl Rose, or rapping huskily.\nSMART Vocabulary: related words and phrases\nRelating to particular parts of the body\nabdominal\nabdominally\nabdominis\nanally\naortic\naural\nbronchial\ncranial\ngenito-urinary\nmotor\nneural\nnoncardiac\nnonvascular\noptic\norally\npubis\npulmonary\nrectal\nrenal\nspinal\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDescribing qualities of the human voice\nIf a person's voice is nasally, it has a particular sound because air is going through the nose when they speak: I hated my voice. I have a very nasally tone. I had this very high, very nasally talking and singing voice. See\nnasal\nMore examplesFewer examplesHe sounded more nasally than velvety for the first couple of songs.The actress has a remarkably expressive face and a nasally voice.The swaggering superstar spoke in a gruff, nasally tone.\nSMART Vocabulary: related words and phrases\nDescribing qualities of the human voice\nadenoidal\nbe dripping with something idiom\nboomy\nbray\nbreathy\nbrittle\nchocolatey\ngruff\nliltingly\nmulti-voiced\npitchy\npurringly\nrasping\nsoft-spoken\nstentorian\nstrangled\ntoned\ntoneless\nvoiced\nwispily\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRelating to particular parts of the body"}