{"id":237481,"name":"nasty","type":"adjective","us_sound":"ˈnæs.ti","us_link":"../audio/n/nasty.mp3","uk_sound":"ˈnɑː.sti","uk_link":"../audio/n/uknark_019.mp3","content":"Add to word list\nAdd to word list\nB1 bad or very unpleasant: a nasty shock/surprise There's a nasty smell in here. He had a nasty cut above the eye. She has a nasty habit of picking on people in meetings.\nB1 unkind: Don't be so nasty to your brother - he's four years younger than you!\nThesaurus: synonyms, antonyms, and examples\nnot kind to someone or something and causing paincruelTeasing them for being overweight is cruel.callousHe had a callous disregard for the feelings of others.cold-bloodedThe budget is based on a cold-blooded analysis of the markets.ruthlessHe was a ruthless dictator.heartlessHe has been described as a heartless boss by several employees.\nSee more results »\nB2 mainly UK dangerous or violent: In an emergency you could get out through a window, but it would be a nasty drop. The situation could turn (= become) nasty at any moment.\nrude or offensive: She said some really nasty things about him. have a nasty feeling\nmainly UK to think that something bad is likely to happen or to be true: I've got a nasty feeling that I forgot to tell Joe I couldn't come.\nSee more\nMore examplesFewer examplesEmily has a very nasty cough.You could get a nasty shock from that water heater if it isn't earthed properly.He had a nasty fall and hurt his back.He's a nasty little man.I hope he's not going to spring any nasty surprises on us at the meeting this morning.\nSMART Vocabulary: related words and phrases\nSerious and unpleasant\nabominable\nabominably\nabysmal\nabysmally\napocalyptic\nfraught\nfrightful\nfrom hell idiom\nfun\nghastliness\nnot be all fun and games idiom\nnoxiously\nobjectionable\nobjectionably\nodious\nunpretty\nunspeakable\nunspeakably\nunsupportable\nunsympathetically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnkind, cruel & unfeeling\nDangers and threats\nRelated words\nnastily\nnastinessIdiom\na nasty piece of work\nAdd to word list\nAdd to word list\nmean, unpleasant, or offensive: He was, to be honest, a nasty man, with never a kind word for anyone. I got a rather nasty (= severe) cut from the garage door."}