{"id":237582,"name":"nativist","type":"noun","us_sound":"ˈneɪ.t̬ɪ.vɪst","us_link":"../audio/n/cald4us1557.mp3","uk_sound":"ˈneɪ.tɪ.vɪst","uk_link":"../audio/n/cald4uk1066.mp3","content":"Add to word list\nAdd to word list\na person who supports the idea of nativism (= the idea that people who were born in a country are more important than people who have come to the country from somewhere else): We are a nation of immigrants, but also a nation of xenophobes and nativists. The nativists viewed immigrants as worthy of only low-paying jobs that most people would not take. See\nnativism\nMore examplesFewer examplesNativists and trade unions joined hands to demand restriction on immigrants.Nativists, worried about of the power of “foreigners,” blocked efforts to give them more representatives.\nSMART Vocabulary: related words and phrases\nPatriotism & nationalism\nanti-national\nchauvinism\nchauvinist\nchauvinistically\nhyper-nationalistic\njingoism\njingoist\njingoistic\njingoistically\nNat\nnativism\npatriot\npatriotic\npatriotically\npatriotism\nultra-nationalist\nultra-patriotic\nunpatriotic\nunpatriotically\nwrap\nSee more results »\nrelating to nativism (= the idea that people who were born in a country are more important than people who have come to the country from somewhere else): Nativist radicals falsely accused the emperor of plotting to overthrow the constitution. There is a lot of nativist sentiment in this country right now that is very anti-immigrant. See\nnativism\nMore examplesFewer examplesThe movement was fueled by thinly-veiled racism and nativist paranoia.The article argues that the United States is not a nativist, xenophobic country.Candidates have tried to appeal to the party's nativist wing.\nSMART Vocabulary: related words and phrases\nPatriotism & nationalism\nanti-national\nchauvinism\nchauvinist\nchauvinistically\nhyper-nationalistic\njingoism\njingoist\njingoistic\njingoistically\nNat\nnativism\npatriot\npatriotic\npatriotically\npatriotism\nultra-nationalist\nultra-patriotic\nunpatriotic\nunpatriotically\nwrap\nSee more results »"}