{"id":237576,"name":"native","type":"adjective","us_sound":"ˈneɪ.t̬ɪv","us_link":"../audio/n/native.mp3","uk_sound":"ˈneɪ.tɪv","uk_link":"../audio/n/uknark_030.mp3","content":"Add to word list\nAdd to word list\nB2 [ before noun ] relating to or describing someone's country or place of birth or someone who was born in a particular country or place: She returned to live and work in her native Japan. She's a native Californian.\nC2 used to refer to plants and animals that grow naturally in a place, and have not been brought there from somewhere else: Henderson Island in the Pacific has more than 55 species of native flowering plants. The horse is not native to America - it was introduced by the Spanish.\nB2 [ before noun ] relating to the first people to live in an area: The Aborigines are the native inhabitants of Australia. the native population native customs and traditions See also\nindigenous someone's native language/tongue\nB2 the first language that someone learns: French is his native tongue.\nSee more someone's native soil\nthe country in which someone was born and lived while young: Our enemies have attacked us on our native soil, killing thousands. The team's players seemed glad to be back on their native soil.\nMore examplesFewer examplesShe will never make any move away from her native soil.They protested against the occupation of their native soil.He dropped to his knees and kissed his native soil after decades of exile.\n[ before noun ] A native ability or characteristic is one that a person or thing has naturally and is part of their basic character: his native wit Synonym\ninnate\nMore examplesFewer examplesSri Lanka is my native country, but I've been living in Belgium for the past five years.These bracelets were crafted by native Americans.The early settlers enslaved or killed much of the native population.The game is thought to have originated among the native peoples of Alaska.Much of the region's native vegetation has been damaged by developers who are building hotels along the coast.\nSMART Vocabulary: related words and phrases\nCustom, tradition & conformity\nAmericanization\nanti-classical\nanti-conventional\nanti-institutional\nanti-traditional\nconventionalized\nconventionally\ncounter-tradition\ncrowd\ncustom\nmores\nmulticultural\nmulticulturalism\nmulticulturally\nnon-classical\ntraditionalist\ntraditionally\nultra-conservatism\nultra-conservative\nultra-traditional\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInnate and congenital\nCountries, nationalities & continents: country & nation\nIdiom\ngo native\na person who was born in a particular place, or a plant or animal that lives or grows naturally in a place and has not been brought from somewhere else: a native of Monaco The red squirrel is a native of Britain.\noffensive old-fashioned an extremely offensive word for someone who lived in a country, especially in Africa, before Europeans went there\nSMART Vocabulary: related words and phrases\nInnate and congenital\nAmerican, Italian, etc. by birth phrase\nbirth\nborn\nborn and bred idiom\ncongenital\ndescend\ndescend from something\nheritable\ninborn\ninbred\ninclined\ninherit\ninheritable\ninheritance\ninnately\ninstinct\ninstinctive\ninstinctively\ninstinctual\nnatural\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNames of groups of people who lived in the past\nAdd to word list\nAdd to word list\nof or relating to the place where you were born: This was his first visit to his native land in 30 years. Larry is a native Texan (= He was born in Texas). His native language is Spanish, but he speaks English without a trace of an accent.\nSomeone or something native to a place was born or started to develop there: Corn is native to North America.\na person born in a particular place: He was a native of Indianapolis and a graduate of Indiana University.\ndated A native is also a person who was born and lived in a country before Europeans began to visit and live there: Note: This use is considered offensive."}