{"id":237575,"name":"nationwide","type":"adjective","us_sound":"ˌneɪ.ʃənˈwaɪd","us_link":"../audio/n/nationwide.mp3","uk_sound":"ˌneɪ.ʃənˈwaɪd","uk_link":"../audio/n/uknark_029.mp3","content":"Add to word list\nAdd to word list\nB2 existing or happening in all parts of a particular country: a nationwide network/chain of stores a nationwide survey/referendum Synonym\ncountrywide\nMore examplesFewer examplesWomen's groups have demanded a nationwide assault on sexism in the workplace.Some miners are calling for a nationwide strike in support of their sacked colleagues.She is performing in Birmingham tonight, on the third leg of her nationwide tour.He owns a nationwide chain of restaurants.Police have launched a nationwide hunt for the killer.\nSMART Vocabulary: related words and phrases\nCountries, nationalities & continents: country & nation\nbirthright citizenship\nbody politic\nBRICS\ncitizen\ncompatriot\ncross-border\ndenaturalize\ndomestic\ndomestically\ndual\nfatherland\ninternationalism\nnative\nnaturalization\nnon-country\nnon-domestic\nnon-indigenous\nnon-national\nstatehood\nstateless\nSee more results »\nB2 in all parts of a particular country: Schools nationwide are experiencing a shortage of teachers. Consumer spending is down nationwide. Synonym\ncountrywide\nMore examplesFewer examplesNationwide, violent crime rose 3.7 percent in the first half of the year.Available nationwide, cornmeal is an inexpensive ingredient with good nutritional value.The group now has more than 300 members nationwide.\nSMART Vocabulary: related words and phrases\nCountries, nationalities & continents: country & nation\nbirthright citizenship\nbody politic\nBRICS\ncitizen\ncompatriot\ncross-border\ndenaturalize\ndomestic\ndomestically\ndual\nfatherland\ninternationalism\nnative\nnaturalization\nnon-country\nnon-domestic\nnon-indigenous\nnon-national\nstatehood\nstateless\nSee more results »\nAdd to word list\nAdd to word list\nexisting or happening in all parts of a particular country: A nationwide survey of mothers revealed some very interesting things about what mothers want from fathers. nationwide adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈneɪ·ʃənˈwɑɪd/\nThe performances were taped for telecasting nationwide.\nAdd to word list\nAdd to word list\nexisting or happening in all parts of a particular country: a nationwide chain/network Essential services could still be delivered through a nationwide network of local post offices. a nationwide strike\nin all parts of a particular country: The products are available nationwide. Businesses nationwide that delayed buying equipment and expanding during the recession are now upgrading."}