{"id":237551,"name":"nation","type":"noun","us_sound":"ˈneɪ.ʃən","us_link":"../audio/n/nation.mp3","uk_sound":"ˈneɪ.ʃən","uk_link":"../audio/n/uknark_020.mp3","content":"Add to word list\nAdd to word list\nB2 [ C ] a country, especially when thought of as a large group of people living in one area with their own government, language, traditions, etc.: All the nations of the world will be represented at the conference. The Germans, as a nation, are often thought to be well organized. Practically the whole nation watched the ceremony on television.\n[ S ] a large group of people of the same race who share the same language, traditions, and history, but who might not all live in one area: the Navajo nation\nMore examplesFewer examplesThe debate about food safety has engaged the whole nation.They contacted party members from across the nation to ask for their support.It is hoped that these measures will push the nation towards recovery.The former president still holds a place in the nation's affections.Many nations have imposed sanctions on the country because of its attacks on its own people.\nSMART Vocabulary: related words and phrases\nCountries, nationalities & continents: country & nation\nbirthright citizenship\nbody politic\nBRICS\ncitizen\ncompatriot\ndenaturalize\ndomestic\ndomestically\ndual\nfatherland\ninternationalism\nnative\nnaturalization\nnon-country\nnon-domestic\nnon-indigenous\nnon-national\noverseas\nstatehood\nstateless\nSee more results »\nAdd to word list\nAdd to word list\na country, esp. when thought of as a large group of people living in one area with their own government, language, and traditions: Most industrialized nations of the world will be represented at the conference. Throughout the nation today people will go to the polls to elect a new government.\nA nation is also an American Indian group, esp. one that is a member of an American Indian federation.\nAdd to word list\nAdd to word list\na country, especially when considered as a society with its own government, economy, etc.: developing/emerging/industrialized nations The local community within a typical developing nation can expect to reap only around 15% of the total spent there. African/Asian/European nations See also\ncreditor nation\nmost-favoured nation"}