{"id":237647,"name":"nature","type":"noun","us_sound":"ˈneɪ.tʃɚ","us_link":"../audio/n/nature.mp3","uk_sound":"ˈneɪ.tʃər","uk_link":"../audio/n/uknativ015.mp3","content":"nature noun\n(LIFE)\nAdd to word list\nAdd to word list\nA2 [ U ] all the animals, plants, rocks, etc. in the world and all the features, forces, and processes that happen or exist independently of people, such as the weather, the sea, mountains, the production of young animals or plants, and growth: her love of nature This new technique of artificially growing cells copies what actually happens in nature. a nature article/book/programme Nature\nthe force that is responsible for physical life and that is sometimes spoken of as a person: Feeling tired-out is Nature's way of telling you to rest. Nature gave these tiny creatures the ability to reproduce quickly when food is abundant.\nMore examplesFewer examplesLying naked in the grass, among the trees and birds, he felt he had communed with nature.He lived in close communion with nature.But I digress. To get back to what I was saying, this poem reflects the poet's love of nature and his religious beliefs.Fishermen are always at the mercy of the forces of nature .Modernist architecture tries to conquer nature instead of working with it.\nSMART Vocabulary: related words and phrases\nThe Earth & outer space - general words\nablate\nanti-gravity\natmosphere\natmospherically\nauroral\ncosmic\ngravity\nhorizon\nhydrosphere\nionospheric\nlithosphere\nlithospheric\nmacrocosm\nmesosphere\nmesospheric\nMother Nature\nthe Big Bang\nunconformity\nweightlessness\nzero gravity\nSee more results »\nnature noun\n(TYPE)\nC1 [ S or U ] the type or main characteristic of something: What was the nature of his inquiry? Motor-racing is by nature a dangerous sport. be in the nature of things\nto be usual and expected: There are problems in every relationship - it's in the nature of things.\nMore examplesFewer examplesEven the police were horrified at the macabre nature of the killings.If you think that these transport problems can be solved by building more roads, you completely misunderstand the nature of the problem.The book is full of interesting observations on/about the nature of musical composition.By its nature, terrorism is designed to strike at the heart of our democratic values.Students, she complained, had nothing better to do than spend whole days philosophizing about the nature of truth.\nSMART Vocabulary: related words and phrases\nConditions and characteristics\n-ance\n-ibility\nability\nadverse conditions\nage\nambience\nappearance\naspect\ngood/bad karma idiom\nhave it in you idiom\nhood\nhumanity\npresentation\nrespect\nshape\ntrait\ntrappings\nunaffiliated\nundercurrent\nvibe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHabitual and customary\nnature noun\n(CHARACTER)\nB2 [ C or U ] a person's character: As a child, Juliana had a very sensitive nature. [ + to infinitive ] It's not really in her nature to be aggressive. He is by nature inclined to be lazy.\nMore examplesFewer examplesI think she takes advantage of his good nature.Her calm nature served as a natural counterbalance to his excitable personality.His poems reveal the duality of his nature, the joy and hope, the fear and despair.The vicar praised what he called her \"kind and forbearing nature\".Even the police were horrified at the macabre nature of the killings.\nSMART Vocabulary: related words and phrases\nMind and personality\n-hearted\n-heartedly\n-heartedness\nalexithymia\nallism\nallistic\nalter ego\nambivert\nAsperger's syndrome\ngestaltist\nhuman nature\nneurotypical\nneurotypicality\nnoddle\nnoetic\nnoggin\npsychoanalysis\npsychoanalytic\nsubconscious\nsuperego\nSee more results »\nIdioms\nbe the nature of the beast\ngo/get back to nature\nlet nature take its course\nnature noun\n(LIFE)\nAdd to word list\nAdd to word list\n[ U ] all the animals and plants in the world and all the features, forces, and processes that exist or happen independently of people, such as the weather, the sea, mountains, reproduction, and growth: As a young man he loved hiking and being close to nature. This technique of growing cells copies what actually happens in nature.\n[ U ] The force that is responsible for physical life is often called nature, and is sometimes spoken of as a person: Feeling stressed is Nature’s way of telling you to relax.\nnature noun\n(TYPE)\n[ C/U ] the type or main characteristic (of something): [ U ] The problem is delicate in nature. [ C ] Nothing of a secret nature can happen in that household.\nnature noun\n(CHARACTER)\n[ C/U ] the character of a person, or the characteristics a person is born with: [ C ] She’s always had a sunny nature. [ U ] She is by nature a gentle soul.\nIdiom\nthe nature of things"}