{"id":237623,"name":"natural","type":"adjective","us_sound":"ˈnætʃ.ɚ.əl","us_link":"../audio/n/natural.mp3","uk_sound":"ˈnætʃ.ər.əl","uk_link":"../audio/n/uknativ006.mp3","content":"natural adjective\n(NOT ARTIFICIAL)\nAdd to word list\nAdd to word list\nB1 as found in nature and not involving anything made or done by people: a natural substance People say that breast-feeding is better than bottle-feeding because it's more natural. He died from natural causes (= because he was old or ill). Floods and earthquakes are natural disasters.\nC1 A natural ability or characteristic is one that you were born with: natural beauty a natural talent for sports She's a natural blonde (= her real hair colour is blonde).\n(of a person or their behaviour) seeming normal and relaxed: \"Hi, how are you?\" he asked, trying to sound natural. He reads the news in a natural, conversational way.\nNatural food or drink is pure and has no chemical substances added to it and is therefore thought to be healthy: natural mineral water natural ingredients someone's natural mother/father/parent\na parent who caused someone to be born, although possibly not their legal parent or the parent who raised them\nMore examplesFewer examplesA good diet helps build the body's natural defences.If we continue to deplete the earth's natural resources, we will cause serious damage to the environment.It was her natural elegance that struck me.The garden has been designed to harmonize with the natural landscape.She had died of natural causes.\nSMART Vocabulary: related words and phrases\nNatural and artificial\nanti-natural\nartificial\nartificiality\nartificially\nbiodynamic\ndollishly\nfake\nfalse\nfreshness\nGod-given\nnon-toxic\norganically\npure\nrawness\nrefined\nunbleached\nunnatural\nunnaturally\nunprocessed\nuntamed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInnate and congenital\nExciting and interesting\nHabitual and customary\nVarious qualities of food\nParents & children\nnatural adjective\n(EXPECTED)\nB2 normal or expected: Of course you're upset - it's only natural. It's natural that you should feel anxious when you first leave home. It's quite natural to experience a few doubts just before you get married.\nThesaurus: synonyms, antonyms, and examples\nnormalnormalTemperatures are well above normal today.usualI went to bed at my usual time.ordinaryThe magazine has stories about ordinary people rather than celebrities.standardIt's standard practice for surgeons to wear gloves.naturalIt's completely natural to feel anxious on your first day at a new school.typicalHe was a typical teenager - arguing with his parents and staying out late.\nSee more results »\nMore examplesFewer examplesLoss of memory is a natural concomitant of old age.Unhappiness was woven into the natural fabric of people's lives.It's only natural that you should worry about your children.She'd always worked with old people so becoming a nurse was a natural progression.I think a certain amount of worry about work is very natural, but you've got to keep it in proportion .\nSMART Vocabulary: related words and phrases\nHabitual and customary\naccustomed\nall in a day's work idiom\nas a (general) rule idiom\nas a matter of course idiom\nas per usual/normal idiom\ninveterate\ninveterately\nknee-jerk\nmainstream\nmainstreaming\nmake it a rule idiom\nmechanical\nordinarily\nper\nprevail\npro forma\nregulation\nsurprise\nsurprise, surprise idiom\nterritory\nSee more results »\nnatural adjective\n(MUSIC)\n[ after noun ] (of a musical note) not sharp or flat: E natural\nSMART Vocabulary: related words and phrases\nNotes of the musical scale\nB, b\nC, c\nD, d\ndoh\nE, e\nflat\nhigh doh\nla\nlah\nmajor\nmi\nmiddle C\nminor\nnote\nregister\nsoh\nsol\nsol-fa\nte\nti\nSee more results »\nsomeone who was born with the right characteristics or abilities for doing a particular thing: She won't have any troubles learning to ride a horse - you can see she's a natural.\nSMART Vocabulary: related words and phrases\nExperts and specialists\nacademician\nartist\nauthority\nboffin\nchild prodigy\ndoyenne\nhotshot\nknow something inside out idiom\nlapidary\nLatin Americanist\nliterati\npyrotechnician\nRenaissance man\nsavant\nsemiotician\nskilled\nwhizz\nwizard\nwonder\nwunderkind\nSee more results »\nin a way that is normal and relaxed: You're supposed to act natural when we're recording the video. See also\nnaturally\nSMART Vocabulary: related words and phrases\nExciting and interesting\nabsorbing\nabsorbingly\naction-packed\nadventurous\nalley\neye-catchingly\nfancifully\nfascinating\nfascinatingly\nfascinator\npulsating\npunchy\nracy\nriveting\nrivetingly\nspectacularly\nwith bells on idiom\nzhuzh\nzing\nzingy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHabitual and customary\nnatural adjective\n(NOT ARTIFICIAL)\nAdd to word list\nAdd to word list\nfrom nature; not artificial or involving anything made or caused by people: Cotton is a natural fiber. He died of natural causes (= because he was old or ill). Floods and earthquakes are natural disasters.\nIf food or drink is described as natural, it means it has no artificial chemical substances added to it.\nnatural adjective\n(BORN WITH)\nhaving an ability or characteristic because you were born with it: a natural athlete a natural blonde\nnatural adjective\n(EXPECTED)\nto be expected; usual: a natural reaction [ + to infinitive ] It’s only natural to be upset when your dog dies.\nnatural adjective\n(MUSIC)\n[ not gradable ]\n&#160; music us/ˈnætʃ·ər·əl/ (of written music) having no sharp or flat: a B natural a natural scale\nnatural noun [C]\n(MUSIC)\nmusic us/ˈnætʃ·ər·əl/ a mark in written music that shows that a note should return to its original pitch\nnatural noun [C]\n(PERSON BORN WITH)\ninfml a person born with the characteristics or abilities needed for doing something: She won’t have any trouble learning to ride a horse – she’s a natural.\nAdd to word list\nAdd to word list\nas found in nature, and not involving anything made or done by people: natural flavourings/foods/ingredients Over 50% of all cosmetics products in the Chinese market are advertised as consisting of natural ingredients. They are implementing a major economic recovery programme after the country's worst-ever natural disaster.\nnormal or expected: Having seen the value of their shares collapse, it was only natural for shareholders to complain. For the customer, the natural choice is a repayment mortgage, not an endowment.\nused to describe an ability or a characteristic that someone was born with: He was a natural leader."}