{"id":237813,"name":"navigate","type":"verb","us_sound":"ˈnæv.ə.ɡeɪt","us_link":"../audio/n/navigate.mp3","uk_sound":"ˈnæv.ɪ.ɡeɪt","uk_link":"../audio/n/uknaval004.mp3","content":"Add to word list\nAdd to word list\ntransport to direct the way that a ship, aircraft, etc. will travel, or to find a direction across, along, or over an area of water or land, often by using a map: Sailors have special equipment to help them navigate. Even ancient ships were able to navigate large stretches of open water. Some migrating birds can navigate by the moon (= using the moon as a guide). There weren't any road signs to help us navigate through the maze of one-way streets. We had to navigate several flights of stairs to find his office.\ninternet &amp; telecoms to move around a website or computer screen, or between websites or screens: Their website is fairly plain, but very easy to navigate.\nSMART Vocabulary: related words and phrases\nNavigation & shipwrecks\nastrolabe\ncelestial navigation\nchannel\nchart\ncircumnavigate\ncircumnavigation\ndead reckoning\nfoghorn\nlane\nlightship\nlodestar\nnarrows\nnavigability\npassage\npilot\nquadrant\nsea lane\nsextant\nsubmersible\nyaw\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternet terminology\nAdd to word list\nAdd to word list\nto direct the way that a vehicle, esp. a ship or aircraft will travel, or to find a direction across, along, or over an area of water or land: [ T ] He learned to navigate these waters. [ I ] Whales navigate by visual means. [ I ] fig. Cyberspace is an environment in which computers navigate. navigation noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌnæv·ɪˈɡeɪ·ʃən/\na satellite navigation system\nAdd to word list\nAdd to word list\nto lead a company, activity, etc. in a particular direction, or to deal effectively with a difficult situation: We help new home-buyers navigate the complex and often confusing process of purchasing a property.navigate (sth) through sth She has successfully faced the task of navigating the company through its most difficult period in 25 years. The market has come and gone and management has been very successful in navigating through.\nTRANSPORT to successfully find a way from one place to another: To reach the farm, produce trucks must navigate a dirt road with a ditch on one side. One study suggests cell phones could be disrupting bees' ability to navigate.\nIT, INTERNET to move around within a website or between websites: The site is well-organized and easy to navigate."}