{"id":237904,"name":"nearly","type":"adverb","us_sound":"ˈnɪr.li","us_link":"../audio/n/nearly.mp3","uk_sound":"ˈnɪə.li","uk_link":"../audio/n/uknaval023.mp3","content":"Add to word list\nAdd to word list\nA2 almost, or not completely: It's been nearly three months since my last haircut. I've nearly finished that book you lent me. She's nearly as tall as her father now. They'd eaten nearly everything. It was so funny - we nearly died laughing.\nThesaurus: synonyms, antonyms, and examples\nnot completelyalmostWe need to hurry up - it's almost time to go.nearlyIt's nearly midnight.nearHe was near tears (= almost crying).aboutAre you about ready to leave?all butThe concert was all but over by the time we arrived. well-nighIt was well-nigh impossible to get a person on the phone these days.\nSee more results »\nnot nearly as/so\nC1 a lot less: She's not nearly as beautiful as you said she was.\nSee more not nearly enough\nmuch less than you want or need: There's not nearly enough food for all these people!\nSee more\nMore examplesFewer examplesThe under-18s constitute nearly 25% of the town's population.Customs officers have seized nearly a ton of heroin destined for New York.I'm nearly ready - just give me a couple of minutes.It was such a hassle trying to get my bank account changed that I nearly gave up.They were finally reconciled with each other, after not speaking for nearly five years.\nSMART Vocabulary: related words and phrases\nAlmost\na hop, skip, and a jump idiom\nabout\nalmost\nas good as idiom\nas much as idiom\nbe on the way to something idiom\ngoing on\nintent\nmore\nmore or less idiom\nmuch\npart\nscant\nsub\nthat was close! idiom\nto/for all intents and purposes idiom\nup to (doing) something idiom\nverge\nvirtual\nway\nSee more results »\nGrammar\nAlmost or nearly?We use almost and nearly to refer to the progress of things, especially if we are measuring and counting things. In these examples, almost and nearly can both be used: …\nAdd to word list\nAdd to word list\nalmost but not quite; close to: I’ve nearly finished that book you lent me. She’s nearly as tall as her father now. The problem isn’t nearly as bad as you think."}