{"id":238000,"name":"necessary","type":"adjective","us_sound":"ˈnes.ə.ser.i","us_link":"../audio/n/necessary.mp3","uk_sound":"ˈnes.ə.ser.i","uk_link":"../audio/n/uknebbo010.mp3","content":"Add to word list\nAdd to word list\nB1 needed in order to achieve a particular result: He lacks the necessary skills for the job. I don't have much time so I won't be staying any longer than necessary. Just do what's necessary and then leave. If necessary, we can always change the dates of our trip. Is it necessary for all of us to be present at the meeting this afternoon? We don't want to take any more luggage with us than is strictly necessary.\nThesaurus: synonyms, antonyms, and examples\nnecessarynecessaryDo you have the necessary skills for the job?needDoes she have the skills needed for work of that sort?requireWill you require a wake-up call in the morning?mustThe meat must be cooked thoroughly.essentialClean water is essential for a society's health.fundamentalSome understanding of grammar is fundamental to learning a language.\nSee more results »\nused in negatives and questions to show that you disapprove of something and do not think it should be used or done: I don't think that kind of language is necessary in a show that kids could be watching. Was it really necessary for you to say that?\nMore examplesFewer examplesIf you're going into teaching, energy is a necessary commodity.Some alterations to our original plans might be necessary.We shall do everything necessary to bring the murderer to justice.We can always go back to the original plan if necessary.No purchase is necessary for you to enter this competition.\nSMART Vocabulary: related words and phrases\nEssential or necessary\nbasically\nbasis\nbe a question of doing something idiom\nbox ticking\nbusiness-critical\ndependence\nelemental\nif need be idiom\nif/when push comes to shove idiom\nincumbent\nindispensable\nindispensably\nnecessitate\nnecessity\nneed\nneeded\nneedful\nowe\nsymbiotically\nwarrant\nSee more results »\nAdd to word list\nAdd to word list\nneeded in order to achieve a particular result: Don’t take any more luggage than is strictly necessary. He lacks the necessary skills for the job. If necessary, we can always change the date of our trip. necessary evil\nA necessary evil is something unpleasant that must be accepted in order to achieve a particular result: Most Americans accept taxes as a necessary evil.\nNecessary can be used in negatives and questions to show that you disapprove of something and do not think it should be done: [ + to infinitive ] Was it really necessary to say that?"}