{"id":238029,"name":"neck","type":"noun","us_sound":"nek","us_link":"../audio/n/neck.mp3","uk_sound":"nek","uk_link":"../audio/n/uknebbo013.mp3","content":"neck noun [C]\n(BODY PART)\nAdd to word list\nAdd to word list\nA2 the part of the body that joins the head to the shoulders: He had the thickest neck I'd ever seen. She wore a gold chain around her neck.\nChev Wilkinson/Stone/GettyImages\nC2 the part of a piece of clothing that goes around a person's neck: This sweater's too tight in the neck. He wasn't wearing a tie and his shirt was open at the neck. a low-neck dress\nMore examplesFewer examplesShe wears a gold cross round her neck.That child is a real pain in the neck.Sitting still at a computer terminal all day can give you a stiff neck.She flung her arms around his neck.He peeled the label off the neck of the bottle.\nSMART Vocabulary: related words and phrases\nThe head & face\n-cheeked\n-chinned\n-faced\n-necked\ncheek\nchinless\nchiselled\nchop\ndimpled\nduck face\nfrontal\njaw\njowl\nmaxillary\nmaxillofacial\nmodiolus\nnucha\nvisage\nzygomatic\nzygomaticus\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe head & neck of non-human animals\nParts of clothes\nneck noun [C]\n(TOP PART)\npart of a hollow object that is at the top and is narrower than the part below it: the neck of a bottle/guitar\nSepidehmaleki/iStock/Getty Images Plus/GettyImages\nmedical\n&#160; specialized a narrow part of a body part: cancer of the neck of the uterus\nSMART Vocabulary: related words and phrases\nWords meaning parts of things\nback end\nbifurcation\nbiomarker\ncartridge\nchunk\nelement\nmodularity\nmodularized\nmodularly\nmodule\nmoiety\nmulti-branched\npanel\npiece\nsnatch\nsub\nsub-sector\nsubscale\nsubscience\nsubsection\nSee more results »\nSee also\nbottleneck\nhalterneck\nredneck\nroughneck\nturtleneckIdioms\nbe up to your neck (in something)\nbe up to your neck in something\nget it in the neck\nneck and neck\nthis, our, etc. neck of the woods\nput your neck on the line\nneck verb [I]\n(KISS)\nto kiss and hold a person in a sexual way\nneck verb [I]\n(DRINK)\nUK informal to drink something, especially alcohol, very quickly: He's necked two bottles of wine already.\nneck noun [C]\n(BODY PART)\nAdd to word list\nAdd to word list\nthe part of the body that joins the head to the shoulders: She rubbed her neck.\nThe neck of a piece of clothing is the part that goes around a person’s neck: His shirt was open at the neck.\nA neck is also a narrow part near the top of an object such as a bottle: a vase with a long neck\nA neck is also the long, narrow part of a string instrument, such as a guitar, on which the strings are pressed in order to produce different notes. Idioms\nneck and neck\nsomeone's neck of the woods\nneck verb [I]\n(KISS)\nto kiss someone for a long time"}