{"id":238203,"name":"need","type":"verb","us_sound":"niːd","us_link":"../audio/n/knead.mp3","uk_sound":"niːd","uk_link":"../audio/n/ukkit__028.mp3","content":"need verb\n(MUST HAVE)\nAdd to word list\nAdd to word list\nA1 [ T ] to have to have something, or to want something very much: Babies need constant care. The doctor said I needed an operation. [ + to infinitive ] I need to go to the toilet. Most people need to feel loved. [ + obj + to infinitive ] I need you to help me choose an outfit. I badly need (= strongly want) a rest from all this.informal I don't need all this hassle.\nB1 [ T ] If you say that someone or something needs something else, you mean that they should have it, or would get an advantage from having it: What you need is a nice hot bowl of soup. [ + -ing verb ] This room needs cleaning. [ + past participle ] She needs her hair washed.\nMore examplesFewer examplesHe needs some climbing boots.You need 250 g of grated cheese for this recipe.All she needed to complete her happiness was a baby.I called her on the pretext of needing more information.We need a coat hook on the back of this door.\nSMART Vocabulary: related words and phrases\nLacking things\nbankrupt\nbankruptcy\nbe hard up (for something) idiom\nbereft\ncry out for something\nhole\ninappeasable\nlack\nlacking\nminus\nneed something like you need a hole in the head idiom\nneedful\nscrape\nscream\nshy\nskimpily\nstarve someone/something of something\ntaken\nunaccompanied\nunappeased\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWanting things\nneed verb\n(MUST DO)\nA1 [ + to infinitive or + infinitive without to ] to have (to): [ + to infinitive ] He needs to lose some weight. I need to do some shopping on my way home from work. There needs to be more effort from everyone. [ + infinitive without to ] I don't think we need ask him. Nothing need be done about this till next week.formal \"Need we take your mother?\" \"No, we needn't.\"\nThesaurus: synonyms, antonyms, and examples\nnecessarynecessaryDo you have the necessary skills for the job?needDoes she have the skills needed for work of that sort?requireWill you require a wake-up call in the morning?mustThe meat must be cooked thoroughly.essentialClean water is essential for a society's health.fundamentalSome understanding of grammar is fundamental to learning a language.\nSee more results »\nsomeone/something needn't do something UK\nA2 there is no reason for someone or something to do a particular thing: You needn't worry - I'm not going to mention it to anyone. It's a wonderful way of getting to see Italy, and it needn't cost very much. someone needn't do something UK\nused, often when you are angry with someone, to say that they should not do a particular thing or that they have no right to do it: He needn't think I'm driving him all the way there! You needn't laugh! It'll be your turn next! someone didn't need to\nused to say either that someone did a particular thing although they did not have to, or that someone did not do it because they did not have to: I gave her some extra money - I know I didn't need to but I thought it would be kind. \"Did you ask Sophia to help?\" \"I didn't need to - I managed perfectly well on my own.\" someone needn't have done something UK\nit was not necessary for someone to have done a particular thing, although they did do it: You needn't have washed all those dishes, you know - I'd have done them myself when I got home. You needn't have worried about the dinner - it was delicious!\nMore examplesFewer examplesWe'll need to check out his story.I need to get those films processed.In the past, a woman needed to be chaste to make a good marriage.He spun some tale about needing to take time off work because his mother was ill.The city needs to attract more industry.\nSMART Vocabulary: related words and phrases\nEssential or necessary\nbasically\nbasis\nbe a question of doing something idiom\nbox ticking\nbusiness-critical\ndependence\nelemental\nif need be idiom\nif/when push comes to shove idiom\nincumbent\nindispensable\nindispensably\nnecessary evil\nnecessitate\nnecessity\nneeded\nneedful\nowe\nsymbiotically\nwarrant\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExpressions of anger\nGrammar\nDare, need, ought to and used to (semi-modal verbs)Dare, need, ought to and used to are often called semi-modal because in some ways they are formed like modal verbs and in some ways they are like other main verbs. …\nNeedNeed is a semi-modal verb because in some ways it is like a modal verb and in other ways like a main verb. …\nNeed: formAffirmatives with the semi-modal need are not common and they are used in formal contexts. There is almost always a negative word (e.g. no one, nobody, nothing) or phrase in the clause, even if the verb phrase is affirmative: …\nNeed: useThe semi-modal need is most common in the negative. We use it to show that there is no obligation: …\nSemi-modal need and main verb needWe can use main verb need as an alternative to semi-modal need. Main verb need is followed by to and it changes with person, number and tense (I, you, we, they need to; she, he, it needs to; I, you, she, he, it, we, they needed to). …\nIdioms\nI need hardly do something\nneed you ask!\nneed I say\nneed I say more?\nneed your head examined\nwho needs...?\nB2 [ S or U ] the state of having to have something that you do not have, especially something that you must have so that you can have a satisfactory life: Are you in need of help? There's a growing need for cheap housing in the larger cities. needs B2 [ plural ]\nthe things that a person must have in order to have a satisfactory life: Housing and education are basic needs. They don't have enough food to meet their needs.\nB2 [ C or U ] a feeling or state of strongly wanting something: [ + to infinitive ] He seems to have a desperate need to be loved by everyone. I don't know about you but I'm in need of a drink.formal We have no need of your sympathy. in need\nnot having enough money or food: You just hope that the money goes to those who are most in need.\n[ U ] the state of being necessary: Help yourself to stationery as the need arises. If need/needs be (= if necessary), we can take a second car to fit everyone in. I don't think there's any need for all of us to attend the meeting. be no need to do something\nB2 If there is no need to do something, it is not necessary or it is wrong: There's no need to buy more food - there's plenty in the fridge. I understand why she was angry, but there was no need to be so nasty to him. There's no need to yell! Just calm down.\nMore examplesFewer examplesThere's a crying need for a better education system.The findings of this survey are demonstrative of the need for further research.There is a tremendous need for more low-cost housing.Will future oil supplies be adequate to meet world needs?It's not by any means a brilliant salary but it's adequate for our needs.\nSMART Vocabulary: related words and phrases\nLacking things\nbankrupt\nbankruptcy\nbe hard up (for something) idiom\nbereft\ncry out for something\nhole\ninappeasable\nlack\nlacking\nminus\nneed something like you need a hole in the head idiom\nneedful\nscrape\nscream\nshy\nskimpily\nstarve someone/something of something\ntaken\nunaccompanied\nunappeased\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nScarce, inadequate and not enough\nImportant and essential things\nFeelings of desire\nEssential or necessary\nToo much and unnecessary\nneed verb\n(MUST HAVE)\nAdd to word list\nAdd to word list\n[ T ] to be necessary to have something, or to want something very much: To make pastry, you need flour, fat, and water. Do we need anything from the store? Will I be needed in the office tomorrow? I need you to advise me on what to wear. I need a rest.\n[ T ] infml If you say that you don’t need something, it can mean that you do not want it because it is causing you trouble: I don’t need all this arguing.\n[ T ] If you say that someone or something needs something, you can mean that the person or thing should have it or would benefit from having it: What you need is some hot soup to warm you up. My hair needs to be washed.\nneed verb\n(MUST DO)\npresent tense needs or need to have to take an action: [ + to infinitive ] He needs to lose weight. [ + to infinitive ] Before we make a decision, we need to consider our options. [ + to infinitive ] I need to do some shopping on my way home. I don’t think we need ask him. Nothing need be done about this before next week. [ + to infinitive ] As it turned out, I didn’t need to buy any extra material (= I did it, although I didn’t have to). Idiom\nneed I say more\nneed noun [U]\n(SOMETHING YOU MUST HAVE)\nsomething that you must or should have, or the lack of this: There’s a growing need for low-cost housing.\nNeed can be a reason: [ + to infinitive ] I don’t think there’s any need to worry.\nNeed is also a feeling or state of greatly wanting something: [ + to infinitive ] a desperate need to be loved We have no need for your sympathy.\nNeed is also the state of being necessary: Help yourself to supplies as the need arises. [ + to infinitive ] There’s no need to buy any more food. in need\nPeople who are in need do not have enough money or need some type of help: The money will go to those who are most in need. in need of\nSomeone who is in need of something must or should have it: They’re in need of help.\nAdd to word list\nAdd to word list\nsomething that you must have in order to live a satisfactory life or to achieve a particular thing: business/consumer/customer needs One of the company's strengths is its ability to develop truly innovative products to meet consumer needs.changing/evolving needs We need to keep up with the rapidly changing needs of high-tech industry.meet/respond to/satisfy needs The research will assess how effectively the supply chain has met customer needs. address/assess/understand sb's needs"}