{"id":238331,"name":"neglect","type":"verb","us_sound":"nɪˈɡlekt","us_link":"../audio/n/neglect.mp3","uk_sound":"nɪˈɡlekt","uk_link":"../audio/n/ukneedl021.mp3","content":"Add to word list\nAdd to word list\nC1 to not give enough care or attention to people or things that are your responsibility: to neglect your appearance/the house He neglects that poor dog - he never takes him for walks or gives him any attention. She's been neglecting her studies this semester. neglect to do something\nC2 to not do something, often because you forget: I'd neglected to give him the name of the hotel where I'd be staying.\nSee more\nMore examplesFewer examplesHe rather neglected his children in favour of his career.I've been neglecting my friends recently.She's been neglecting the housework.The government is neglecting its duty to protect the vulnerable.He was prosecuted for neglecting his animals.\nSMART Vocabulary: related words and phrases\nNeglecting and ignoring\naside\nbeneath the/someone's radar idiom\nblock something out\nbrush someone/something off\nbury/have your head in the sand idiom\near\nlay\nlet go idiom\nlet sleeping dogs lie idiom\nlet something go/pass idiom\nlet something ride idiom\nlook straight/right through someone idiom\nnose\nshut\nshut someone/something out\nshut your eyes to something idiom\nsleeping beauty\nsomeone's back is turned idiom\nthe silent treatment idiom\nwink\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTreating people or animals badly\nC1 a situation in which you do not give enough care or attention to someone or something, or the state of not receiving enough care or attention: Both parents were found guilty of neglect and their child was taken away from them. Over the years the church has fallen into a state of neglect. Synonym\ndisuse\nThesaurus: synonyms, antonyms, and examples\nthe fact of not doing something you shouldfailureFailure to follow the employee guidelines can lead to your immediate termination.defaultThe bank seized his house because his mortgage was in default.malpracticeThe surgeon was sued for malpractice.derelictionHe was dishonourably discharged for dereliction of duty.neglectCorruption and neglect resulted in a government that was weakened enough to be overthrown. negligenceEducational standards deteriorated thanks to the negligence of the administration.\nSee more results »\nMore examplesFewer examplesDoctors guilty of neglect are liable to prosecution.The present crisis is the result of years of wilful neglect by the council.A bit of healthy neglect is good for children.I'm afraid my garden is suffering from neglect.They accused their foster parents of neglect.\nSMART Vocabulary: related words and phrases\nNeglecting and ignoring\naside\nbeneath the/someone's radar idiom\nblock something out\nbrush someone/something off\nbury/have your head in the sand idiom\near\nlay\nlet go idiom\nlet sleeping dogs lie idiom\nlet something go/pass idiom\nlet something ride idiom\nlook straight/right through someone idiom\nnose\nshut\nshut someone/something out\nshut your eyes to something idiom\nsleeping beauty\nsomeone's back is turned idiom\nthe silent treatment idiom\nwink\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTreating people or animals badly\nAdd to word list\nAdd to word list\nto fail to give needed care or attention to someone or something: [ T ] She had neglected the program and allowed student interest in it to fall off. [ I ] He neglected to tell his employer that he would be taking the day off. neglect noun [ U ] us\nYour browser doesn't support HTML5 audio\n/nɪˈɡlekt/\nThe park was in a sorry state of neglect."}