{"id":238354,"name":"negligent","type":"adjective","us_sound":"ˈneɡ.lə.dʒənt","us_link":"../audio/n/negligent.mp3","uk_sound":"ˈneɡ.lɪ.dʒənt","uk_link":"../audio/n/ukneedl027.mp3","content":"Add to word list\nAdd to word list\nC2 not being careful or giving enough attention to people or things that are your responsibility: The judge said that the teacher had been negligent in allowing the children to swim in dangerous water. Synonym\nremiss formalOpposite\ndiligent\nThesaurus: synonyms, antonyms, and examples\nnot taking or showing enough care and attentioncarelessThat was careless of you.sloppySpelling mistakes always look sloppy in a formal letter.slapdashHis work is always hurried and slapdash. rashThat was a rash decision - you didn't think about the costs involved.thoughtlessThe Prime Minister made a thoughtless remark about the environment.\nSee more results »\nSMART Vocabulary: related words and phrases\nNeglecting and ignoring\naside\nbeneath the/someone's radar idiom\nblock something out\nbrush someone/something off\nbury/have your head in the sand idiom\near\nlay\nlet go idiom\nlet sleeping dogs lie idiom\nlet something go/pass idiom\nlet something ride idiom\nlook straight/right through someone idiom\nnose\nshut\nshut someone/something out\nshut your eyes to something idiom\nsleeping beauty\nsomeone's back is turned idiom\nthe silent treatment idiom\nwink\nSee more results »\nRelated word\nnegligently\nAdd to word list\nAdd to word list\nfailing to be careful enough or to give enough attention to your responsibilities, esp. when this results in harm or loss to others negligence noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈneɡ·lə·dʒəns/\nShe charged her landlord with negligence for not repairing leaks that ruined her rugs.\nAdd to word list\nAdd to word list\nnot giving enough care or attention to someone or something that you are responsible for: It was necessary to prove that the manager had been negligent.be negligent in (doing) sth The court ruled that the company was negligent in manufacturing, selling, and testing its product. criminally/grossly negligent"}