{"id":238373,"name":"negotiation","type":"noun","us_sound":"nəˌɡoʊ.ʃiˈeɪ.ʃən","us_link":"../audio/n/negotiation.mp3","uk_sound":"nəˌɡəʊ.ʃiˈeɪ.ʃən","uk_link":"../audio/n/uknegot003.mp3","content":"Add to word list\nAdd to word list\nC1 the process of discussing something with someone in order to reach an agreement with them, or the discussions themselves: The agreement was reached after a series of difficult negotiations. The exact details of the agreement are still under negotiation. Negotiation for the pay increase is likely to take several weeks.\nMore examplesFewer examplesThe pending releases of the prisoners are meant to create a climate for negotiation.The president is predisposed towards negotiation and favours a peaceful way of resolving the crisis.The pay negotiations have reached a delicate stage.What sort of line do you think we should take in the pay negotiations?A halt to the fighting is a precondition for negotiations.\nSMART Vocabulary: related words and phrases\nInternational relations: diplomacy & mediation\nambassador\nambassadorial\nappease\nappeasement\nattaché\ndiplomatic\ndiplomatic bag\ndiplomatic corps\ndiplomatic immunity\ndiplomatic relations\nintercede\nintermediary\nintermediation\ninternationalist\ninterventionism\nlegation\nplenipotentiary\nshuttle diplomacy\nundiplomatic\nundiplomatically\nSee more results »\nAdd to word list\nAdd to word list\nthe process of discussing something with someone in order to reach an agreement, or the discussions themselves: [ C usually pl ] Negotiations remained at a standstill.\nAdd to word list\nAdd to word list\n[ C, usually plural or U ] a formal discussion between people who are trying to reach an agreement: begin/enter into/be in negotiations (with someone) The board is certainly willing to enter into negotiations to find common ground, he said. The company is starting a new round of negotiations with its main workforce. budget/contract negotiations There was little room for negotiation.\nopen to negotiation\nable to be discussed and changed by people who are trying to reach an agreement: The terms of the contract are still open to negotiation.\nunder negotiation\nin the process of being discussed by people who are trying to reach an agreement: The revised contract has been under negotiation for several months.\n[ U ]\n&#160; FINANCE, BANKING the process of changing a cheque into money: Payment by negotiation can only be used if the draft or cheque is in the local currency of the country on which it is drawn. a negotiation fee\n[ U ]\n&#160; FINANCE the process of changing the legal owner of a cheque, a bill of exchange, etc.: The transfer of a cheque by negotiation is a transfer from the holder to another person."}