{"id":238369,"name":"negotiate","type":"verb","us_sound":"nəˈɡoʊ.ʃi.eɪt","us_link":"../audio/n/negotiate.mp3","uk_sound":"nəˈɡəʊ.ʃi.eɪt","uk_link":"../audio/n/uknegot002.mp3","content":"negotiate verb\n(DISCUSS)\nAdd to word list\nAdd to word list\nC1 [ I or T ] to have formal discussions with someone in order to reach an agreement with them: The government has refused to negotiate with the strikers. I'm negotiating for a new contract. I've managed to negotiate (= get by discussion) a five percent pay increase with my boss.\nMore examplesFewer examplesDespite the deep antipathies between them, the two sides have managed to negotiate an agreement.The government's official line has always been to refuse to negotiate with terrorists.The police negotiated with the gunman through an intermediary.We need someone who is practised at negotiating business deals.He spent ages negotiating for a pay increase, only to resign from his job soon after he'd received it.\nSMART Vocabulary: related words and phrases\nDebate & discussion\nagent provocateur\nargue\nargue against something\nargue for something\nbargain\nbargainer\nbat around\ncontroversialist\ndialogue\nfloat\nhash\nout-debate\noutbargain\npalaver\npanel discussion\npolarized\nsophism\ntendentious\nwash (something) up\nwell argued\nSee more results »\nnegotiate verb\n(MANAGE TO DO)\n[ T ] to manage to travel along a difficult route: The only way to negotiate the muddy hillside is on foot.\n[ T ] to deal with something difficult: The company's had some tricky problems to negotiate in its first year in business.\nSMART Vocabulary: related words and phrases\nTravelling\naround Robin Hood's barn idiom\nbackpack\nbag drop\nbourne\nbum\nbum around\ncommunication\ncommuting\nconnection\nhitch\nmove\nRobin Hood\nshuttle\nsuper-commuting\nswan\ntaken\ntour\ntransoceanic\nvisa\nwell travelled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDealing with things or people\nnegotiate verb\n(EXCHANGE)\n[ T ]\n&#160; finance &amp; economics\n&#160; specialized to get or give an amount of money in exchange for a financial document of the same value\nSMART Vocabulary: related words and phrases\nNegotiating prices\nbargainer\nbargaining power\nbarter\nbeat\nbeat down\nbid\ncap\ndicker\ndrive a hard bargain idiom\ngazump\ngazunder\nhaggle\nhaggler\nnon-market\nnon-negotiable\noutbargain\nquotation\nquote\nsettle\nsettle on something\nSee more results »\nnegotiate verb\n(DISCUSS)\nAdd to word list\nAdd to word list\n[ I/T ] to have formal discussions with someone in order to reach an agreement: [ T ] We want to negotiate a settlement that is fair to both sides.\nnegotiate verb\n(MOVE)\n[ T ] to move carefully or with difficulty past, through, or along something: She was able to negotiate the climb with some help from younger campers.\nAdd to word list\nAdd to word list\n[ I ]\n&#160; MEETINGS to have formal discussions with someone in order to reach agreement: The dealers who negotiate on behalf of clients are known as commodity brokers.negotiate with sb/sth The merger agreement requires that we don't negotiate with any other company.negotiate for sth He is negotiating for higher royalties from the record company.negotiate on/over sth Unions are negotiating over pensions.negotiate to do sth The company is negotiating to buy a multi-million dollar stake in one of the world's biggest oil fields.\n[ T ]\n&#160; MEETINGS to achieve, arrange, or agree to something by having formal discussions with someone: negotiate a contract/deal/settlement The unions should take the opportunity to negotiate further pay deals as soon as possible.negotiate a discount/fee/price Retailers should be allowed to negotiate prices directly with producers.\n[ T ]\n&#160; BANKING, FINANCE to discuss the details of borrowing money from a bank, etc. such as how much they will lend you and what rate of interest you will pay: negotiate financing/a loan/a mortgage The organization can negotiate a loan based on its assets and future contracts.\n[ T ]\n&#160; FINANCE, BANKING to get or give a sum of money in exchange for a financial document of the same value: negotiate a bill of exchange/a cheque We can negotiate any single cheque up to the value of £2000.\n[ T ] to deal with something difficult: The company has had some difficult problems to negotiate in its first year of business."}