{"id":238469,"name":"neither","type":"determiner","us_sound":"ˈnaɪ.ðɚ","us_link":"../audio/n/neither.mp3","uk_sound":"ˈnaɪ.ðər","uk_link":"../audio/n/uknegot013.mp3","content":"Add to word list\nAdd to word list\nB2 not either of two things or people: We've got two TVs, but neither works properly. Neither of my parents likes my boyfriend. Neither one of us is interested in gardening. \"Which one would you choose?\" \"Neither. They're both terrible.\" If she doesn't agree to the plan, neither will Tom (= he will also not). Chris wasn't at the meeting and neither was her assistant.informal \"I don't feel like going out this evening.\" \"Me neither.\" On two occasions she was accused of stealing money from the company, but in neither case was there any evidence to support the claims. neither ... nor\nB2 used when you want to say that two or more things are not true: Neither my mother nor my father went to university.\nSee more\nMore examplesFewer examplesThe teams change ends at half-time so that neither side has an unfair advantage.It's an absurd situation - neither of them will talk to the other.Strangely, neither Carlo nor Juan saw what had happened.This is a war which neither side can win.His words to the press were deliberately equivocal - he didn't deny the reports but neither did he confirm them.\nSMART Vocabulary: related words and phrases\nEither, or, neither, nor\nand\nand/or phrase\neither\nelse\nnor\nor\nor else idiom\notherwise\nGrammar\nNeither, neither … nor and not … eitherNeither allows us to make a negative statement about two people or things at the same time. Neither goes before singular countable nouns. We use it to say ‘not either’ in relation to two things. Neither can be pronounced /ˈnaɪðə(r)/ or /ˈni:ðə(r)/. …\nNeither as a determinerNeither allows us to make a negative statement about two people or things at the same time. Neither goes before singular countable nouns. We use it to say ‘not either’ in relation to two things. Neither can be pronounced /ˈnaɪðə(r)/ or /ˈni:ðə(r)/. …\nNeither … norWe can use neither as a conjunction with nor. It connects two or more negative alternatives. This can sound formal in speaking: …\nNot with neither and norWhen a clause with neither or nor is used after a negative clause, we invert the subject and the verb after neither and nor: …\nNeither do I, Nor can sheWe use neither and nor + auxiliary/modal verb + subject to mean ‘also not’: …\nNot … eitherWe can use not … either to mean ‘also not’, but we do not change the word order of the auxiliary or modal verb and subject: …\nNeither: typical errorsWe use neither, not none, when we are talking about two people or things: …\nIdioms\nbe neither here nor there\nbe neither one thing nor the other\nAdd to word list\nAdd to word list\nnot one and not the other of two things or people: They have two TVs but neither one works. Neither of my brothers could come to the party. infml \"I don’t feel like going out tonight.\" \"Me neither.\" Idiom\nneither here nor there"}