{"id":238614,"name":"neoconservative","type":"noun","us_sound":"ˌniː.oʊ.kənˈsɝː.və.t̬ɪv","us_link":"../audio/n/cdo0318usneoc3218.mp3","uk_sound":"ˌniː.əʊ.kənˈsɜː.və.tɪv","uk_link":"../audio/n/cdo0318ukneoc0923.mp3","content":"Add to word list\nAdd to word list\nsomeone whose politics are conservative or right wing, who believes strongly in the free market and thinks that their country should use its military power to become involved with or try to control problems in other countries: Neoconservatives saw America's unrivalled military power as a force for good and wanted to unleash it. We have slightly different views on foreign policy - he's more of a neocon. Compare\npaleoconservative\nMore examplesFewer examplesConservative activists increasingly blamed neoconservatives for placing Iraq at the center of the war on terrorism.The paleoconservatives are more explicitly racialist and anti-democratic than the neoconservatives, who continue to support immigration, civil rights, and limited government.The President publicly signed on to the neocons' vision for Iraq to become a model corporate state.\nSMART Vocabulary: related words and phrases\nPolitical movements & groups\nalt-right\nANC\nanti-Bolshevik\nanti-Bolshevism\nanti-capitalism\nbig tent\nblack bloc\nBlairite\nBlue Dog\nleft-winger\nleftism\nleftist\nleftward\nlefty\nsectarian\nsectarianism\nsegregationist\nSinn Fein\nSovietism\nthe awkward gang idiom\nSee more results »\nhaving or expressing political views that are conservative or right wing, with a strong belief in the free market and the belief that your country should use its military power to become involved with or try to control problems in other countries: the neoconservative approach to foreign policy a neocon Senator Compare\npaleoconservative\nMore examplesFewer examplesThe Bush doctrine, and its neoconservative supporters, advocated the aggressive promotion of liberal democracy by the United States. Many members of these institutions proudly identified themselves as neoconservative. Paul Wolfowitz, a leading neocon strategist, urged Bush at Camp David to target Iraq.\nSMART Vocabulary: related words and phrases\nPolitical movements & groups\nalt-right\nANC\nanti-Bolshevik\nanti-Bolshevism\nanti-capitalism\nbig tent\nblack bloc\nBlairite\nBlue Dog\nleft-winger\nleftism\nleftist\nleftward\nlefty\nsectarian\nsectarianism\nsegregationist\nSinn Fein\nSovietism\nthe awkward gang idiom\nSee more results »"}