{"id":238643,"name":"neogene","type":"adjective","us_sound":"ˈniː.oʊ.dʒiːn","us_link":"../audio/n/cdo0318usneog3219.mp3","uk_sound":"ˈniː.əʊ.dʒiːn","uk_link":"../audio/n/cdo0216neoguk1287.mp3","content":"Add to word list\nAdd to word list\nfrom or referring to the period of time between about 22 and 2.5 million years ago, in which many modern mammals and the earliest forms of humans appeared: Submarine landslides from Neogene times on have been recorded. They found several small outcrops of Neogene volcanic rocks.\nMore examplesFewer examplesThe Neogene sediments around the Mediterranean are, for the most part, flat-lying shallow-marine.There seems to be an age inconsistency between old (1970s) and new (1980-90s) studies regarding the Neogene basins in western Turkey.These remarkable deposits provide a unique window into the Neogene tropical ocean-climate system.\nSMART Vocabulary: related words and phrases\nGeology - general words\nAnthropocene\nanticline\nauriferous\nbiozone\ncarboniferous\ncementation\ncontinental crust\ncontinental plate\ngeologically\ngeomorphic\ngully erosion\nhenge\nHolocene\npetrographically\npetrography\npetrological\npetrologically\npetrology\nPrecambrian\nrockfall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrehistory\nSpecific periods of time\nthe Neogene\nthe period of time between about 22 and 2.5 million years ago, in which many modern mammals and the earliest forms of humans appeared: During the Neogene, mammals and birds evolved considerably. There were changes in the relative abundance of carbonate and silica during the Neogene.\nMore examplesFewer examplesIt preserves fossils dating back to the Neogene.The Earth has had many globally cool spells right through late Phanerozoic, several in the Jurassic, Cretaceous and Paleogene and of course in the Neogene.From the late Neogene to the mid Pleistocene a huge delta system developed in the southern North Sea basin.\nSMART Vocabulary: related words and phrases\nGeology - general words\nAnthropocene\nanticline\nauriferous\nbiozone\ncarboniferous\ncementation\ncontinental crust\ncontinental plate\ngeologically\ngeomorphic\ngully erosion\nhenge\nHolocene\npetrographically\npetrography\npetrological\npetrologically\npetrology\nPrecambrian\nrockfall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrehistory\nSpecific periods of time"}