{"id":239029,"name":"nerve","type":"noun","us_sound":"nɝːv","us_link":"../audio/n/nerve.mp3","uk_sound":"nɜːv","uk_link":"../audio/n/ukneptu004.mp3","content":"nerve noun\n(BODY)\nAdd to word list\nAdd to word list\nC2 [ C ] a group of long, thin fibres (= structures like threads) that carry information or instructions between the brain and other parts of the body: the optic nerve a spinal nervenerve damage Some conditions, such as diabetes, can cause nerve damage. nerve fibres\nMore examplesFewer examplesA neurotransmitter is a chemical that nerve cells use to communicate with each other and with muscles.The newspaper article touched a raw nerve - people still resent the closure of the local school.Repairing damaged nerves is a very delicate operation.The drug paralyses the nerves so that there is no feeling or movement in the legs.The nerves are protected by thin sheaths of fatty tissue.\nSMART Vocabulary: related words and phrases\nSubstances & structures in the body\nabductor\naccessorius\nadductor\nadenoid\nagonist\nglomerulus\nGnRH\ngonadotropin\ngracilis\ngrey matter\nnotch\norigin\noxytocin\npapilla\npapillary\nvalvular\nventriculus\nvesica\nvesical\nvesicle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe brain & nervous system\nnerve noun\n(COURAGE)\nC2 [ U ] the courage or confidence necessary to do something difficult, unpleasant, or rude: It takes a lot of nerve to be a bomb disposal expert.lose your nerve I wanted to ask her out, but I lost my nerve and couldn't go through with it. [ + to infinitive ] I didn't have the nerve to tell him what I really thought of his suggestion.\nThesaurus: synonyms, antonyms, and examples\nbraverybraveryA policeman who chased a burglar despite a serious leg injury has received an award for bravery. courageYou have shown great courage in coming to testify.pluckYou have to admire his pluck.gutsI didn't have the guts to go on my own.valourUK The Victoria Cross is Britain's highest military award for valour. heroismI witnessed an example of heroism that made me proud to be British.\nSee more results »\nSMART Vocabulary: related words and phrases\nBravery\naudaciousness\naudacity\nbackbone\nballs\nbell\nbell the cat idiom\ncourage\ndaring\nderring-do\nDutch courage\nfearlessness\ngrit\ngut\nheart\nheroism\nintestinal fortitude\nliquid courage\npluck\nspunk\nswash\nSee more results »\nnerve noun\n(WORRY)\nnerves [ plural ]\nB2 worry or anxiety about something that is going to happen: I never suffer from nerves when I'm speaking in public.\nSee more get on someone's nerves\nB2 to annoy someone a lot: We really got on each other's nerves when we were living together.\nSee more steady/strong nerves\nB2 the ability to be calm in difficult situations: You need a cool head and steady nerves for this job.\nSee more\nnerve noun\n(RUDENESS)\nC2 [ S or U ] the rudeness to do something that you know will upset other people: [ + to infinitive ] She's late for work every day, but she still has the nerve to lecture me about punctuality. That man has some nerve! He's always blaming me for things that are his fault.UK also That man has such a nerve!of all the nerve She drove the car into a tree and then told me it was my fault for not concentrating, of all the nerve!\nSMART Vocabulary: related words and phrases\nRude and cheeky\ncheekily\ncheekiness\ncheeky\nchurlishly\nchurlishness\ncoarsely\nfruity\ngall\ngraceless\nincivility\nindelicate\nobnoxiously\nobnoxiousness\noffensively\noffensiveness\npertly\npresume\nscatological\nunpleasant\nunprintable\nSee more results »\nIdioms\nnerves of steel\nhit/touch a (raw) nerve\nnerve yourself UK\nto make yourself brave enough to do something: [ + to infinitive ] It took her several months before she eventually nerved herself (up) to invite him to her house. He took a deep breath, nerved himself, and jumped into the icy waters. Finally, twenty minutes into the meeting, she nerved herself to speak up. On the way to the meeting room he'd been nerving himself for the confrontation. She felt sick inside, nerving herself for the question she was about to put to him. Eventually, I nerved myself up to speak.\nSMART Vocabulary: related words and phrases\nBrave and courageous\nadventurous\nadventurously\naudacious\nballsy\nbe man enough to do something idiom\nfaint heart never won fair lady/maiden idiom\nfearless\nfearlessly\ngallant\ngallantly\nlion-hearted\nman up\nmanfully\nmuster something up\nnerves of steel idiom\nunflinchingly\nunperturbed\nvaliant\nvaliantly\nvalorously\nSee more results »\nnerve noun\n(BODY FIBER)\nAdd to word list\nAdd to word list\n[ C ]\n&#160; biology a group of long, thin fibers in the body, esp. in the brain, which send and receive messages that control how the body reacts to signals it receives, such as to changes in temperature or pressure against the skin\nnerve noun\n(BRAVERY)\n[ U ] bravery or confidence necessary to do something difficult or unpleasant: It takes a lot of nerve to get up in front of a class when you’re not used to it.\n[ U ] Nerve also means the ability to do something rude without caring about other people’s feelings: She has some nerve. I can't believe she had the nerve to call me fat!"}