{"id":239107,"name":"nest","type":"noun","us_sound":"nest","us_link":"../audio/n/nest.mp3","uk_sound":"nest","uk_link":"../audio/n/ukneptu013.mp3","content":"nest noun [C]\n(HOME)\nAdd to word list\nAdd to word list\nC2 a structure built by birds or insects to leave their eggs in to develop, and by some other animals to give birth or live in: a bird's nest a wasps'/hornets' nest a rat's nest Cuckoos are famous for laying their eggs in the nests of other birds. The alligators build their nests out of grass near the water's edge.\nmalerapaso/E+/GettyImages\na comfortable home: One day the children grow up and leave the nest.\na place where something unpleasant or unwanted has developed: The diplomats have been sent home because their embassy has become a nest of spies.\nMore examplesFewer examplesThe cuckoo lays her egg in another bird's nest.If disturbed, the bird may abandon the nest, leaving the chicks to die.The bird regarded me with suspicion as I walked up to its nest.There's a wasps' nest in that old tree.Meanwhile, the mother flies back to the nest to feed her young.\nSMART Vocabulary: related words and phrases\nAnimal dwellings - natural\nanthill\narboreal\nburrow\nbyre\ncobweb\nearth\neyrie\nfoxhole\nguest\nhabitat\nhole\nholt\nlair\nlodge\nrabbit hole\nrookery\nsett\nspider's web\nwarren\nwildlife corridor\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHome\nUnpleasant places\nnest noun [C]\n(SET)\na set of things that are similar but different in size and have been designed to fit inside each other: I'd like a nest of tables for the living room.\nSMART Vocabulary: related words and phrases\nGroups and collections of things\nage bracket\nagglomerate\nagglomeration\nAladdin's cave\nanthology\nbasket\ndataset\nempty set\nensemble\nfamily\nfeast\ngeneration\npackage\npermutation\npool\nportfolio\nselection\nsheaf\nsheaves\nstarter pack\nSee more results »\nnest verb\n(OF ANIMALS)\nC2 [ I ] to build a nest, or live in a nest: We've got some swallows nesting in our roof at the moment. Farm buildings are ideal nesting sites for barn owls.\nMore examplesFewer examplesSome bugs had nested under the computer's motherboard.Until now, experts thought this puffin nested much farther north.Eagles haven't nested on this island for over 50 years.The beach is closed to protect nesting turtles.Penguins' nesting habits vary widely.\nSMART Vocabulary: related words and phrases\nAnimal (non-human) behaviour\naccidental\napex predator\nbeg\nbehave\nbehaviour\nbehavioural science\nclaw\nfawn\ngambol\ngroom\nhoming\nhousebroken\nmigrate\nmonogamously\nmonogamy\nmurmuration\nnocturnal\nnon-migrant\nnuzzle\nscent\nSee more results »\nnest verb\n(FIT INSIDE)\n[ I or T ] to fit one object inside another, or to fit inside in this way: nested coffee tables dolls that nest inside one another\n[ T ]\n&#160; language, computing\n&#160; specialized to put a piece of information, text, etc. inside another, or at a lower level in a system: Each document has a root element and all elements must be nested within other elements. Text documents often comprise nested regions like lists within lists or procedures within procedures.\nMore examplesFewer examplesThey're called nesting toys because the smaller toys fit inside the larger ones. The malaria lab is contained within three nested rooms for security.It's a Russian doll of a book. It's a novel, nested within a memoir, nested within a how-to-guide.Although they may appear to be nested within one another, each charge stands alone from the others and requires independent proof.The book contains sentences and phrases full of subtle suggestions nested inside each other.Other XSP or user markup may be nested inside this tag. Elements may not overlap (though they may be nested). The program lets you expand and collapse tags to show nested tags.\nSMART Vocabulary: related words and phrases\nPlacing and positioning an object\n-based\nappose\naround\nchange something around\ncircle\nconsign\nfit\ngone\ninstall\nlie\npile (something) up\nplant\nredeposit\nreinstall\nreinstallation\nrelocate\nreorientate\nsuperimpose\ntranspose\ntransposition\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClassifying and creating order\nComputer concepts\nLinguistics: terminology & vocabulary\nAdd to word list\nAdd to word list\na structure or other place where creatures, esp. birds, give birth or leave their eggs to develop nest verb [ I ] us\nYour browser doesn't support HTML5 audio\n/nest/\nSwallows are nesting in our apple tree."}