{"id":239135,"name":"net","type":"noun","us_sound":"net","us_link":"../audio/n/net.mp3","uk_sound":"net","uk_link":"../audio/n/ukneptu017.mp3","content":"net noun\n(MATERIAL)\nAdd to word list\nAdd to word list\nB1 [ C or U ] material made of threads of rope, string, wire, or plastic with spaces between them, allowing gas, liquid, or small objects to go through, or an object made with this material that is used to limit the movement of something: a fishing net a butterfly net Dolphins often get tangled in the nets that are used to catch tuna fish.UK The living-room windows have net curtains that let in sunlight but stop passers-by looking in from the street.\ndemachi/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesThe goalkeeper made a valiant dive for the ball, but couldn't stop it going in the net.There are laws there to protect the mentally ill, but now and then someone does slip through the net.The welfare state was set up to provide a safety net for the poor and needy.The police are tightening the net around the smugglers.You'll have to hit the ball quite high to get it over that net.\nSMART Vocabulary: related words and phrases\nNets, grids and grilles\nchicken wire\ncobweb\ndragnet\ndrift net\ngauze\ngrating\ngrid\ngrille\nlattice\nmesh\nmosquito net\nnetting\nreticulated\nreticulation\nseine\ntrellis\nweb\nwebbed\nwebby\nwire netting\nYou can also find related words, phrases, and synonyms in the topics:\nTextiles: general words\nnet noun\n(SPORT)\nB1 [ C ] a rectangular piece of material made from string, used to separate the two sides in various sports: If the ball touches the net during a serve in a game of tennis, you have to serve again.\nkkrs/iStock/Getty Images Plus/GettyImages\nB1 [ C ] the area surrounded by a piece of material made from string into which a ball or puck is put in order to score points in various sports: His penalty kick placed the ball decisively in the back of the net. a basketball net\nJeffoto/E+/GettyImages\nSMART Vocabulary: related words and phrases\nTennis & racket sports\nadvantage\nbackhand\nball boy\nball girl\nbaseline\nbird\nbreak\ncode violation\ncourt\ndouble fault\ngroundstroke\nlob\noverhead\nserve\nsquash\nsweet spot\ntennis\nunreturnable\nunseeded\nvolley\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSurfaces on which sports take place\nnet verb [T]\n(CATCH)\nto catch something using a net: How many fish did you net this afternoon?\nThesaurus: synonyms, antonyms, and examples\nto take a wild or loose animalcatchThe dog got out, but we caught her.netWe netted a ton of fish downstream.trawlCommercial fisheries trawl these waters for cod.trollThey troll for tuna far offshore. lassoThe cowboys learned at a young age how to lasso horses and steers.trapThe turtles are trapped for their flesh.\nSee more results »\nto get something good or to earn a lot of money from something: [ + two objects ] She netted herself a fortune when she sold her company. Mark's netted himself a top job with an advertising company. She netted $10 million (for herself) from the sale of her company.\nSMART Vocabulary: related words and phrases\nCapturing or taking possession of things\n-grabbing\napprehend\napprehension\narrogate\nat bay idiom\ncage\ncapture\ncatch\nclutch\ncollar\nget/lay/put your hands on someone idiom\ngrab\ngrabber\ngrasp at something\nrepossess\nseize\nsequester\nsequestration\nsnag\nsnatch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEarning money\nnet verb [T]\n(SCORE)\nIf you net the ball during a game such as football, you score a goal: He secured a dramatic victory for England by netting the ball half a minute before the end of the game.\nSMART Vocabulary: related words and phrases\nWinning, losing & scoring in sport\naet\nagainst the run of play idiom\nblow someone away\nboss\nbreak your duck idiom\nclose-run\nconcede\ndraw\nequalizer\npromedios\npull\npull back\nreel something off\nrelegation zone\nromp\nscore\nshutout\nstraight\nstrike\ntreble\nSee more results »\nleft when there is nothing else to be taken away: I earn $50,000 gross, but my net income (= income that is left after tax has been paid) is about $36,000. The net weight of something excludes the weight of the material that it is packed in. Compare\ngross adjective adverb\nMore examplesFewer examplesHaving deducted costs we still made a net gain of five thousand pounds.The net result of the changes will be increased fares and reduced services for most rail travellers.The fund must buy its shares back for their approximate net asset value.What are your net earnings?The country's net exports have decreased.\nSMART Vocabulary: related words and phrases\nTaxation\namortizable\nanti-dumping\nanti-progressive\nanti-tax\nat source phrase\nfinancial year\nfiscal year\nflat tax\ngas tax\nHMRC\nregressive\nregressively\nroad tax\nsales tax\nself-assessment\ntaxpayer\nthe taxman\ntithe\ntop rate\nunprogressive\nSee more results »\nA2 abbreviation for\ninternet : I found a really useful website about allergies on the Net.\nSMART Vocabulary: related words and phrases\nInternet terminology\n.plc.uk\n2FA\n2SV\nabove/below the fold idiom\naddress bar\naffiliate link\nhybrid\ninternet-enabled\ninterweb\nIP\nkeyboard warrior\nlanding page\nping\npodcast\nservice provider\ntweeter\ntweetstorm\ntwitterati\nTwitterer\ntwittering\nSee more results »\nnetwork: the part of an internet address that shows it belongs to a network or a business\nSMART Vocabulary: related words and phrases\nInternet terminology\n.plc.uk\n2FA\n2SV\nabove/below the fold idiom\naddress bar\naffiliate link\nhybrid\ninternet-enabled\ninterweb\nIP\nkeyboard warrior\nlanding page\nping\npodcast\nservice provider\ntweeter\ntweetstorm\ntwitterati\nTwitterer\ntwittering\nSee more results »\nnet noun [C]\n(MATERIAL)\nAdd to word list\nAdd to word list\na piece of material made of long, narrow strips woven so that there are spaces between them: fishing nets a volleyball net\nnet adjective [not gradable]\n(LEFT OVER)\n(of money received from selling something) left after you have subtracted the cost of what you are selling, and other expenses related to it: net income/profit fig. The net result (= result after everything has been considered) of the changes will be fewer trains for most suburban commuters.\nNet weight is the weight of something contained in a package, without including the weight of the package.\nphysics Net force is the total amount of force that is in effect on an object at a particular time.\nnet verb [T]\n(GET)\nto succeed in getting something of value, esp. as the result of a plan of action: The deal netted the online video company $23 million.\nnet verb [T]\n(HIT INTO NET)\n(in sports) to hit the ball into a net instead of over it: He netted an easy backhand in the fifth game to lose the tennis match.\nTo net is also to catch something in a net: They netted five crabs.\nnet verb [T]\n(HAVE LEFT OVER)\nto have left after you have subtracted the cost of what you are selling, and other expenses related to it: Smithsonian, on a gross of $28 million, netted $7 million with one magazine.\nshort form ofInternet\nNet is also used at the end of a US Internet address to show that the address belongs to a network: info@sover.net\nAdd to word list\nAdd to word list\npart of an internet address that shows that it belongs to a business, often a network that provides internet services: Their website address is www.homelove.net.\n[ U ]\n&#160; MONEY, TAX\n&#160; US (also net income); (also net profit) the amount of profit that a business has left after tax has been paid: The company's fourth-quarter net edged higher to $22.4 million from $22 million.\ncast/spread your net wide\nto include many people or things when you are looking for something or trying to do something: With unemployment in the area below 1%, it has had to cast its net wide to fill the 70 jobs it expects to create this year.\nSee also\nsafety net\nACCOUNTING if something nets a person or a business an amount of money, it produces that amount for them after all costs have been paid: a deal/scheme/sale nets sb sth The sale of the three big oil enterprises could net the country $3 billion.\nACCOUNTING to earn an amount of profit after tax and other costs have been paid: He had netted $1 million before he was 40.net sb sth The business was sold in 1998, netting him £174m. People who decided to sell netted a huge profit.\ninformal to obtain or achieve something good: His 200 applications netted only three callbacks.\nPhrasal verbs\nnet sth down\nnet out\nnet sth out\nACCOUNTING, FINANCE used to describe an amount of money that is left after tax and other costs have been paid: net amount/gain/loss Sixty percent of any net gain or loss will be treated as long-term capital gain or loss.net earnings/income/profit She favored switching the system entirely from a tax on net company profits to one on the gross value of the oil.a net increase/decrease in sth The state will see a net increase of $743 million in income, sales, and other tax revenue. net costs/debt/revenue\nCOMMERCE, PRODUCTION used to describe a situation in which the value of goods sold or exported by one country is more than the value of the same type of goods sold or exported by the other: The UK became a net exporter of oil.\nused to describe what is left after everything important has been included or removed: net effect/impact/result The net result of all the changes in employment levels was a solid gain of 157,000 jobs last month.\nCompare\ngross\nACCOUNTING, FINANCE after tax and other costs have been paid: She earns a salary of $60,000 net.\n[ S ]\n&#160; INTERNET →\ninternet noun"}