{"id":239211,"name":"network","type":"noun","us_sound":"ˈnet.wɝːk","us_link":"../audio/n/network.mp3","uk_sound":"ˈnet.wɜːk","uk_link":"../audio/n/ukneptu025.mp3","content":"Add to word list\nAdd to word list\nB2 a large system consisting of many similar parts that are connected together to allow movement or communication between or along the parts, or between the parts and a control centre: a television network a road/rail network Massive investment is needed to modernize the country's phone network. We could reduce our costs by developing a more efficient distribution network. a network of spies/a spy network\na number of computers that are connected together so that they can share information: We've just spent £1.9 million on improving our computer network.\npeople that you know, considered as a group whose members exchange information with each other: Use your networks - tell everyone you know that you are looking for a job. I hope that you will participate and share this message with your networks. See also\nsocial network\nsupport network\nMore examplesFewer examplesIt is thought that they worked in collusion with the terrorist network.The government has announced an ambitious programme to modernize the railway network.Beneath the city lies a labyrinthine network of tunnels.This new product line should be able to plug into our existing distribution network.\nSMART Vocabulary: related words and phrases\nCommunications - general words\nanti-satellite\napp\nautodial\nautodialler\nbar\nhack\nmulti-line\nmultimode\nmultipath\nnoise\nnon-computer\nnon-network\nreplay\nsilent\ntrace\nwatch party\nwebchat\nZoom bomb\nZoombomber\nZoombombing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer hardware\nOperating computers\nGroups of people\nnetwork verb\n(COMPUTERS)\n[ T ] to connect computers together so that they can share information: Our computer system consists of about 20 personal computers networked to a powerful file-server.\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntap\ntoolbar\nvectorization\nvectorize\nvirtualization\nvirtualize\nwake word\nzip file\nSee more results »\nnetwork verb\n(MEET PEOPLE)\n[ I ] to meet people who might be useful to know, especially in your job: I don't really enjoy these conferences, but they're a good opportunity to network.\nSMART Vocabulary: related words and phrases\nCreating alliances\naffiliate\nalign\nalign against someone/something\nalliance\nally\nally yourself to/with someone\nassociate with someone\nattach\ncling\ncosiness\nforce\ngo\ngo in on something\nhobnob\nintegrate\njoin\npair\npair off\npair up\npairing\nSee more results »\nRelated word\nnetworking\nAdd to word list\nAdd to word list\na group formed from parts that are connected together: a transportation network\nA network is also a company that provides programs to a group of television or radio stations, or this company and the group considered together: the ABC television network\nA network is also a group of computers that are connected and can share information.\nA network is also a group of people with the same interests: a network of political advisers\nto make an effort to meet and talk to a lot of people, esp. in order to get information that can help you\nAdd to word list\nAdd to word list\nIT a system of computers connected together so that they can share information: A domain name identifies a computer or computer network used to access the web.\na group of people or organizations in different places who work together and share information: He also has a network of contacts who give him help when he needs it. a network of agents/dealers/suppliers\nTRANSPORT, COMMUNICATIONS, BANKING a large system consisting of many similar parts that are connected together: a network of sth The bank is planning to expand its network of cash machines. a television/road/rail network a telephone/distribution/communications network\na group of television or radio companies that connect together to broadcast programmes in different places at the same time, or a company that produces these programmes: He owns American television network ABC. See also\nbackbone network\nfixed network\nGMN\nlocal area network\nPCN\nrun of site\nWAN\n[ T ]\n&#160; IT to connect computers together, or to connect a piece of electronic equipment to a computer, so that they can share information: The office computers have all been networked.network sth to sth You can have your TV networked to your home computer.\n[ I ] to meet people who might be useful to know, especially in your job: They network through friends, former co-workers, and professional organizations.network with sb Conferences offer the opportunity to network with other professionals in your field of business."}