{"id":239213,"name":"networking","type":"noun","us_sound":"ˈnet.wɝː.kɪŋ","us_link":"../audio/n/cdo0318usnetw3234.mp3","uk_sound":"ˈnet.wɜː.kɪŋ","uk_link":"../audio/n/ukcld00932.mp3","content":"networking noun [U]\n(meeting people)\nAdd to word list\nAdd to word list\nthe activity of meeting people who might be useful to know, especially in your job: Students find networking essential to getting the right job. Her networking skills were legendary in the business.\nMore examplesFewer examplesThe conference is designed to encourage networking and to create unique business and educational opportunities for all attendees. Every industry has some way to facilitate networking within that industry.Pessimists have poor job performance and networking skills.\nSMART Vocabulary: related words and phrases\nCreating alliances\naffiliate\nalign\nalign against someone/something\nalliance\nally\nally yourself to/with someone\nassociate\nassociate with someone\nattach\ncling\ncosiness\nforce\ngo\ngo in on something\nhobnob\nintegrate\njoin\nnetwork\npair up\npairing\nSee more results »\nnetworking noun [U]\n(computers)\nthe process of connecting computers together so that they can share information: The joint project is not simply about computer networking. Wireless networking is becoming more popular in homes and small offices.\nMore examplesFewer examplesComputer networking allows one computer to connect to others in a limited area or beyond, and exchange information.Networking becomes more important because data has to flow back and forth instantaneously.The company provides computer networking solutions and data integration for schools and businesses.\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\ndrill down\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntoolbar\nvectorize\nvirtualization\nvirtualize\nwake word\nwhite hat\nzip file\nSee more results »\nSee\nnetwork\nAdd to word list\nAdd to word list\nthe process of meeting and talking to a lot of people, esp. in order to get information that can help you: Students find networking essential to finding the right job.\nAdd to word list\nAdd to word list\nthe activity of trying to meet people who might be useful to know, especially in your job: It was a good opportunity to do some networking. The annual Country Radio Seminar is a large networking event in Nashville.\nIT the process of connecting two or more computers together so that they can share information: home/office networking The website gives information about home networking and setting up a wireless home network. See also\nsocial networking"}