{"id":239644,"name":"never","type":"adverb","us_sound":"ˈnev.ɚ","us_link":"../audio/n/never.mp3","uk_sound":"ˈnev.ər","uk_link":"../audio/n/ukneuro017.mp3","content":"Add to word list\nAdd to word list\nA1 not at any time or not on any occasion: We've never been to Australia. I've never heard anything so ridiculous. Let us never forget those who gave their lives for their country. Wars never solve anything. He threatened to shoot, but I never thought (= did not think) he would. I never realized you knew my brother. It's never too late to start eating a healthy diet.UK informal \"He's never 61! (= it's difficult to believe he's 61!) He looks so young.\"UK not standard \"You stole my drink!\" \"No, I never (= I didn't).\" never ever\nused as a way of saying \"never\" with extra emphasis: Never ever break up with someone via a text message. I've never ever seen a squirrel at such close range before.\nMore examplesFewer examplesI'm never going to guess the answer if you don't give me a clue.She complained that her husband never paid her any compliments any more.He's never been able to admit to his mistakes.After what she did to me, I'll never trust her again.British weather can never be relied on - it's always changing.\nSMART Vocabulary: related words and phrases\nAlways & never\nagain\nall along idiom\nall-time\nalong\nalways\never\nfail\nhell\nin all my (born) days idiom\nin/through all the years idiom\ninvariably\nkingdom\nmonth\nperpetual\nperpetually\ntill/until kingdom come idiom\ntill/until the cows come home idiom\nunprecedentedly\nwhenever\nworld\nSee more results »\nGrammar\nNever or not … ever?We can use not … ever instead of never, but never is much more common: …\nIdioms\nas never before\nnever mind\nnever mind that\nnever the twain shall meet\nthat will never do\nwell, I never (did)!\nAdd to word list\nAdd to word list\nnot at any time, or not on any occasion: I’ve never been to Europe. He was never seen again. She never had acting lessons We’ve never had a chance to sit down and talk. Hal Willner? Never heard of him. I never forget a face. Idiom\nnever mind"}