{"id":239661,"name":"new","type":"adjective","us_sound":"nuː","us_link":"../audio/n/knew.mp3","uk_sound":"njuː","uk_link":"../audio/n/ukkneel006.mp3","content":"new adjective\n(RECENTLY CREATED)\nAdd to word list\nAdd to word list\nA1 recently created or having started to exist recently: a new car She's very creative and always coming up with new ideas. What have they decided to name the new baby? What's new in the fashion world? We have to invest in new technology if we are to remain competitive. See also\nbrand new\nThesaurus: synonyms, antonyms, and examples\nrecently appeared, arrived, or developednewI bought a new suit for my interview.brand newThe company unveiled a brand new product this week.novelThat's a novel way of approaching the problem.novelThe bank has introduced a novel way of detecting fraud.innovativeThe project uses innovative ideas for recycling.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\na babybabyShe is having a baby in the spring.newbornNewborn babies are not able to focus their eyes fully for the first few weeks of life.new babyBringing home a new baby can be a confusing time for parents.bundle of joyCongratulations on bringing home your little bundle of joy!neonateThe doctor headed up a study on perception in neonates.infantInfants under 2 years of age must travel on an adult's lap.\nSee more results »\nMore examplesFewer examplesI'm going to check out that new club.The company cited a 12% decline in new orders as evidence that overall demand for its products was falling.Her new book has received fulsome praise from the critics.The new development will generate 1500 new jobs.Have you heard their new record? It's really funky.\nSMART Vocabulary: related words and phrases\nNew\nafresh\nbe ahead of the curve idiom\nbox-fresh\nbrand new\nink\ninnovative\ninnovatively\nlatest\nnewborn\nnext-gen\nnext-generation\nnovel\nnovelty\noriginal\noriginality\nthe avant-garde\nthe ink is not dry/still wet idiom\nunprecedented\nup-to-the-minute idiom\nyouth\nSee more results »\nnew adjective\n(DIFFERENT)\nA1 [ before noun ] different from one that existed earlier: Have you met the new secretary? She's looking for a new job. Have you seen Ann's new house (= where she has just started living)? They've just launched a new generation of computers that are much more powerful than earlier models.\nMore examplesFewer examplesThe citizens of Moscow woke up this morning to find they had a new government.Buying our new house has completely cleaned us out.I have to spend three months of the year away from home - but there are compensations like the chance to meet new people.Under the union constitution, a new committee must be elected each year.Barker introduced some radically new ideas.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanother\nanything\ndisparity\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nnon-uniform\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nvariant\nSee more results »\nnew adjective\n(NOT FAMILIAR)\nB1 [ after verb ] not yet familiar or experienced: to be new to the area She's new to the job so you can't expect her to know everything yet.\nMore examplesFewer examplesThe good thing about children is that they adapt very easily to new environments.He was new to the village and was treated with suspicion by the locals.The extra power of the car was still new to her.As he was new to the job, he became the butt of several practical jokes.The animals were unsettled by their new surroundings.\nSMART Vocabulary: related words and phrases\nInexperienced (of people)\narmchair\nbe new to this game idiom\nbe wet behind the ears idiom\ndewy-eyed\nfledgling\ninnocency\ninnocent\ninnocently\nmaladroitly\nnewness\nrubbish\nuninitiated\nunrefined\nunscholarly\nunseasoned\nunslick\nuntravelled\nuntutored\nunversed\nunworldly\nSee more results »\nnew adjective\n(NOT USED)\nnot previously used or owned: Used car sales have risen because of the increased cost of new cars. Did you buy your bike new or second-hand? See also\nbrand new\nThesaurus: synonyms, antonyms, and examples\nnot owned or used beforenewNew cars tend to lose a lot of their value in the first year.brand newThe dress is brand new - still has the sales tags on it!in pristine conditionThe LPs are in pristine condition and still wrapped in plastic.in mint conditionThat collector has a 1972 Corvette in mint condition.\nSee more results »\nMore examplesFewer examplesDemand for new cars has fallen due to the recession.Although it has hardly been used, I got it for half of what you would pay for a new one.I couldn't afford to buy a new car, so I went for a second-hand one.Although the car had two previous owners, It looked as good as new.The showroom was full of gleaming new cars.\nSMART Vocabulary: related words and phrases\nNew\nafresh\nbe ahead of the curve idiom\nbox-fresh\nbrand new\nink\ninnovative\ninnovatively\nlatest\nnewborn\nnext-gen\nnext-generation\nnovel\nnovelty\noriginal\noriginality\nthe avant-garde\nthe ink is not dry/still wet idiom\nunprecedented\nup-to-the-minute idiom\nyouth\nSee more results »\nnew adjective\n(RECENTLY DISCOVERED)\nA1 recently discovered or made known: This new cancer treatment offers hope to many sufferers. A retrial can only take place when new evidence has emerged.\nMore examplesFewer examplesThere are doubts about the effectiveness of the new drug in treating the disease.The new pill will be used alongside existing medicines.We shall need to evaluate how the new material stands up to wear and tear.Evaluation of this new treatment cannot take place until all the data has been collected.The exploration for new sources of energy is vital for the future of our planet.\nSMART Vocabulary: related words and phrases\nNew\nafresh\nbe ahead of the curve idiom\nbox-fresh\nbrand new\nink\ninnovative\ninnovatively\nlatest\nnewborn\nnext-gen\nnext-generation\nnovel\nnovelty\noriginal\noriginality\nthe avant-garde\nthe ink is not dry/still wet idiom\nunprecedented\nup-to-the-minute idiom\nyouth\nSee more results »\nRelated word\nnewnessIdioms\nbe the new something\nfeel like a new woman/man\na new broom sweeps clean\na/the new kid on the block\na new lease of life\nthat's a new one on me.\nthe new\nnew things: Out with the old and in with the new.\nMore examplesFewer examplesHe always enjoys the new.She is only interested in the new and the fashionable.\nSMART Vocabulary: related words and phrases\nNew\nafresh\nbe ahead of the curve idiom\nbox-fresh\nbrand new\nink\ninnovative\ninnovatively\nlatest\nnewborn\nnext-gen\nnext-generation\nnovel\nnovelty\noriginal\noriginality\nthe avant-garde\nthe ink is not dry/still wet idiom\nunprecedented\nup-to-the-minute idiom\nyouth\nSee more results »\nrecent or recently: The government's new-found enthusiasm for green issues has been welcomed by environmentalists.\nSMART Vocabulary: related words and phrases\nNew\nafresh\nbe ahead of the curve idiom\nbox-fresh\nbrand new\nink\ninnovative\ninnovatively\nlatest\nnewborn\nnext-gen\nnext-generation\nnovel\nnovelty\noriginal\noriginality\nthe avant-garde\nthe ink is not dry/still wet idiom\nunprecedented\nup-to-the-minute idiom\nyouth\nSee more results »\nnew adjective [-er/-est only]\n(RECENTLY CREATED)\nAdd to word list\nAdd to word list\nrecently created or having started to exist recently: His newest book will be out next month. She’s always coming up with new ideas.\nnew adjective [-er/-est only]\n(DIFFERENT)\ndifferent from the one that existed earlier: Have you met Carlos’s new assistant? \"What’s new (= What is different in your life)?\" \"Not much, what’s new with you?\"\nnew adjective [-er/-est only]\n(NOT FAMILIAR)\nnot yet familiar or experienced: Don’t ask me how to get there, I’m new around here.\nnew adjective [-er/-est only]\n(NOT USED)\nnot previously used or owned: They sell new and used cars/books/clothing.\nnew adjective [-er/-est only]\n(RECENTLY DISCOVERED)\nrecently discovered or made known: This new treatment offers hope to many sufferers. Astronomers reported finding millions of new stars."}