{"id":239666,"name":"newborn","type":"adjective","us_sound":"ˈnuː.bɔːrn","us_link":"../audio/n/usnewbo001.mp3","uk_sound":"ˈnjuː.bɔːn","uk_link":"../audio/n/ukneuro021.mp3","content":"Add to word list\nAdd to word list\nrecently born: Breast-feeding is extremely beneficial to the health of newborn babies. Newborn infants, who have little immunity, are especially vulnerable to whooping cough.\nThesaurus: synonyms, antonyms, and examples\na babybabyShe is having a baby in the spring.newbornNewborn babies are not able to focus their eyes fully for the first few weeks of life.new babyBringing home a new baby can be a confusing time for parents.bundle of joyCongratulations on bringing home your little bundle of joy!neonateThe doctor headed up a study on perception in neonates.infantInfants under 2 years of age must travel on an adult's lap.\nSee more results »\nused to refer to something that has recently been created or started to exist: This is not some kind of newborn liberalism. the newborn democracies of the world\nSMART Vocabulary: related words and phrases\nObstetrics: birth\nafterbirth\nantenatally\nApgar score\nB, b\nbirth centre\nbirth partner\nbirth rate\nbore\nchildbearing\nchildbirth\nhypnobirth\nhypnobirthing\ninduce\nmaternity suite\nmaternity unit\nmatrescence\nposh\npreemie\nstillbirth\nstillborn\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNew\na baby that was born recently: About 94 percent of newborns are given hearing tests. A newborn's sense of touch may be as acute as their ability to taste and smell.\nPurple Collar Pet Photography/Moment/GettyImages\nSMART Vocabulary: related words and phrases\nChildren & babies\nankle-biter\narrival\nbabe\nbabe in arms\nbaby\ncomfort blanket\ncrawler\ndesigner baby\ndevil\ndiddums\nnipper\nonly child\noops-a-daisy\npacifier\npapoose\ntike\ntoddler\ntoilet-trained\ntomboy\ntot\nSee more results »\nAdd to word list\nAdd to word list\nhaving recently been born: a newborn baby\na child or animal that has recently been born"}