{"id":239715,"name":"news","type":"noun","us_sound":"nuːz","us_link":"../audio/n/news.mp3","uk_sound":"njuːz","uk_link":"../audio/n/ukneuro028.mp3","content":"Add to word list\nAdd to word list\nA2 information or reports about recent events: That's the best (piece of) news I've heard for a long time! We've had no news of them since they left for Australia. Have you heard the news about Tina and Tom? They're getting divorced. I can't wait to hear all your news. [ + that ] The news that Dan had resigned took everyone by surprise. We've got some good news for you. We're getting married. the news\nB1 a television or radio programme consisting of reports about recent events: Was there anything interesting on the news tonight? I saw it on the 6 o'clock news.UK I usually watch the early evening/late night news. break the news\nto tell someone about something bad that has just happened and may have an effect on them: I was devastated when the doctor broke the news to me.\nSee more be good/bad news\nC1 to be someone or something that will affect a person or situation well/badly: He's bad news for the company. He should never have been given the job. A fall in interest rates is obviously good news for borrowers but it's bad news for savers. Long spells of dry weather are always bad news for gardeners. Falling house prices are good news for first-time buyers. As soon as Sophie brought him home, I knew he was bad news. The price reduction will be good news for consumers. be in the news\nto be reported about: They've been in the news a lot recently because of their marital problems.\nSee more\nMore examplesFewer examplesI watched the colour drain from her face as she heard the news.He was crushed by the news of the accident.They crowded round the spokesperson, eager for any news.Highlights of the match will be shown after the news.The news of his resignation came as a surprise to one and all.\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\nprospectus\nPSA\npush notification\nradiogram\nreadout\nsubtlety\ntelemetry\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNews reporting & the press\nBroadcasting: programmes & other broadcasts\nHoping and hopefulness\nNot hopeful\nGrammar\nNewsWe use the uncountable noun news to mean ‘information or reports about recent events’. It takes a singular verb: …\nIdioms\nbe news to someone\nhave news for someone\nno news is good news\nnews noun [U]\n(INFORMATION)\nAdd to word list\nAdd to word list\nrecent information about people you know: Why don’t you call them and see if there’s any news? I’ve got some bad news for you. We just heard the good news – congratulations on your engagement!\nnews noun [U]\n(REPORTS)\na printed or broadcast report of information about important events in the world, the country, or the local area: the nightly news I’m pretty disgusted with TV news coverage. Where were you when the news of the assassination broke? Idiom\nnews to someone\nAdd to word list\nAdd to word list\ninformation or reports about recent events: news of sth News of the merger was announced last week.news about sth Continuing bad news about the U.S. economy means fewer sales for European manufacturers.news that News that sales were down 22% affected the share price.bad/good news This is good news for millions of borrowers and mortgage holders.\n(also the news) a television or radio programme consisting of reports about recent events: Was there anything interesting on the news this evening? a news bulletin/report/item"}