{"id":239754,"name":"newspaper","type":"noun","us_sound":"ˈnuːzˌpeɪ.pɚ","us_link":"../audio/n/usnewbo012.mp3","uk_sound":"ˈnjuːzˌpeɪ.pər","uk_link":"../audio/n/uknewsc006.mp3","content":"Add to word list\nAdd to word list\nA1 [ C ] a regularly printed document consisting of large sheets of paper that are folded together, or a website, containing news reports, articles, photographs, and advertisements: Do you read a newspaper regularly?daily/Sunday newspaper She writes an advice column in the daily/Sunday newspaper.\nscanrail/iStock/Getty Images Plus/GettyImages\n[ C ] an organization that publishes a newspaper: He wants to work for a newspaper when he graduates.\nA2 [ U ] old newspapers: You'd better wrap that mirror up in newspaper before you put it in the car.\nMore examplesFewer examplesA friend recently sent me a newspaper clipping about someone we were at school with.There's a good arts coverage in the newspaper, but not much political commentary.He was so enraged at the article about him that he sued the newspaper.The supermarket has installed recycling bins for old newspapers, bottles and cans.I read the fashion pages in the newspapers to keep up with the latest styles.\nSMART Vocabulary: related words and phrases\nNewspapers & magazines\nabove/below the fold idiom\nannal\nanti-press\nback copy\nbroadsheet\ncomic\neditorial\nfold\nglossy magazine\nhouse journal\nhouse organ\njournal\nlad mag\norgan\nreader\nsentinel\nserialize\nSunday paper\nsupermarket tabloid\ntabloid\nSee more results »\nGrammar\nNewspaper headlinesA newspaper headline is a very short summary of a news report. It normally appears in large letters above the report. …\nAdd to word list\nAdd to word list\na document published regularly, consisting of news reports, articles, photographs, and advertisements that are printed on large sheets of paper folded together\nAdd to word list\nAdd to word list\na document consisting of news reports, articles, and photographs that is published every day or every week: in a newspaper They took out a full-page ad in the newspaper.a daily/weekly/Sunday newspaper He writes a column in a Sunday newspaper.a local/national newspaper The story was all over the front pages of the national newspapers the next day. a newspaper article/advertisement a newspaper company/publisher/group\nan organization that creates and publishes a newspaper: Half of the top managers at the newspaper are women."}