{"id":239873,"name":"nice","type":"adjective","us_sound":"naɪs","us_link":"../audio/n/nice.mp3","uk_sound":"naɪs","uk_link":"../audio/n/uknewsc028.mp3","content":"nice adjective\n(PLEASANT)\nAdd to word list\nAdd to word list\nA1 pleasant, enjoyable, or satisfactory: Did you have a nice trip? Have a nice day/time! This milk doesn't smell very nice. Thanks for ringing - it's been nice talking to you.\nThesaurus: synonyms, antonyms, and examples\ngiving pleasure and holding your attention goodIt's a good film overall.enjoyableWe had an enjoyable time with Bob and Helen.pleasant The weather is pleasant but not too hot.interestingThe history of the place was really interesting.niceHave a nice day!\nSee more results »\nnice and... B1 informal\npleasantly: This orange is nice and juicy.\nSee more\nMore examplesFewer examplesAfter the trip, it was nice getting back to a few home comforts.This room is nice and cosy in the winter.You looked equally nice in both dresses - I wouldn't know which one to advise you to buy.It's always nice to be paid a compliment.It's nice to see her smile for a change.\nSMART Vocabulary: related words and phrases\nCausing pleasure\nagreeable\nagreeableness\nagreeably\nall things to all people idiom\nattractive\ndelightful\ndelightfully\ndistraction\ndiverting\ndivertingly\nhomely\nhomey\nindulgent\nindulgently\njovial\nsensuous\nsensuously\nserendipitous\nsweeten\nswooning\nSee more results »\nnice adjective\n(KIND)\nA1 kind, friendly, or polite: Jane's new boyfriend is a really nice guy. I wish you'd be nice to your brother. It was very nice of her to drive you home. It's not nice to talk with your mouth full.\nThesaurus: synonyms, antonyms, and examples\nbehaving in a kind and pleasant wayfriendlyI like his sister - she's so friendly.niceHer boyfriend is really nice.amiableShe was perfectly amiable.genialOur genial host led us to our room.congenialHe's very congenial and so quite likeable.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\na kind personkindYou'll never meet a kinder person.niceHe's such a nice guy.sweetShe's the sweetest little girl in the whole class.good toJay's mother has been very good to us.good-heartedHe's a good-hearted kid who loves to help out.\nSee more results »\nMore examplesFewer examplesShe's nice, but I don't feel I can confide in her.He's obviously making a conscious effort to be nice to me at the moment.He's a really nice guy.I tried to be nice to him, honest to God I did!He's not amazingly handsome, but he's nice and that's more important.\nSMART Vocabulary: related words and phrases\nFriendly\naffability\naffable\naffably\naffiliative\nagreeableness\nconversable\nconvivial\nconviviality\nconvivially\ncordial\nhospitable\nhospitably\nhospitality\ninseparable\nsugar and spice idiom\nsweet-natured\nsweet-tempered\nsweetness\nthe human touch\ntogetherness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nKind & thoughtful\nnice adjective\n(SLIGHTLY DIFFERENT)\n[ before noun ] formal based on very slight differences: I wasn't convinced by his nice distinction between a lie and an untruth.\nSMART Vocabulary: related words and phrases\nDetailed and careful\nblow-by-blow\ndetailed\ndetailedly\ndiligence\ndiligent\nin depth phrase\nin the weeds idiom\nintimately\nintricate\nintricately\nover-elaborate\nover-fussy\npainstaking\npainstakingly\npointillistic\nthoroughgoing\nthoroughgoingly\nthoroughness\nwhite-glove\nwonkiness\nSee more results »\nGrammar\nAnd + adjectiveIn informal speaking, when we want to emphasise something positive, we often use and after nice or lovely with another adjective: …\nNice or sympathetic?Nice is an adjective meaning ‘pleasant’, ‘enjoyable’ or ‘satisfactory’: …\nIdioms\nmake nice\nnice one!\nnice work if you can get it\nnice adjective [-er/-est only]\n(PLEASANT)\nAdd to word list\nAdd to word list\npleasant, enjoyable, or satisfactory: Have a nice day! It was nice talking to you. That’s a really nice restaurant. She plans to start running more when the weather gets nicer.\nnice adjective [-er/-est only]\n(KIND)\nkind or friendly: I wish you’d be nice to your brother. He’s very smart, but he isn’t very nice."}