{"id":240187,"name":"nigglingly","type":"adverb","us_sound":"ˈnɪɡ.əl.ɪŋ.li","us_link":"../audio/n/cdo0623usnigg2686.mp3","uk_sound":"ˈnɪɡ.əl.ɪŋ.li","uk_link":"../audio/n/cdo0623uknigg2690.mp3","content":"nigglingly adverb\n(WORRY/PAIN)\nAdd to word list\nAdd to word list\nin a way that worries someone or causes them slight pain, usually for a long time: It had been annoying me, nigglingly, for weeks, so I finally decided to do something about it. The trapped nerve pulsed nigglingly in his face.\nMore examplesFewer examplesShe was nigglingly familiar to me, but I just couldn't remember where I'd met her.This sore knee has been bothering me, nigglingly, for nearly two years now.A number of questions nigglingly remained unanswered at the conclusion of the novel.\nSMART Vocabulary: related words and phrases\nAnnoying\naccursed\naggravating\nannoying\nannoyingly\nball-ache\nexasperatingly\nfrustratingly\ngadfly\ngalling\ngallingly\nirritating\nirritatingly\nlimit\nmaddening\nmither\nsickeningly\nspiteful\nstupid\ntrying\nvexatious\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing anxiety and worry\nnigglingly adverb\n(DETAIL)\nin a way that criticizes someone about small details, or that gives too much attention to details: It was a nigglingly dismissive review that seemed to be personally motivated. \"The word should be spelled with a capital letter,\" she pointed out correctly but nigglingly.\nMore examplesFewer examplesThe manager would nigglingly force all the staff to record how they spent every minute of their time.He liked to nigglingly list all of the things that were wrong with the company, but he was actually very proud to work there.\nSMART Vocabulary: related words and phrases\nAnnoying\naccursed\naggravating\nannoying\nannoyingly\nball-ache\nexasperatingly\nfrustratingly\ngadfly\ngalling\ngallingly\nirritating\nirritatingly\nlimit\nmaddening\nmither\nsickeningly\nspiteful\nstupid\ntrying\nvexatious\nSee more results »\nRelated word\nniggling"}