{"id":240203,"name":"night","type":"noun","us_sound":"naɪt","us_link":"../audio/n/knight.mp3","uk_sound":"naɪt","uk_link":"../audio/n/ukkneel012.mp3","content":"night noun\n(DARK PERIOD)\nAdd to word list\nAdd to word list\nA1 [ C or U ] the part of every 24-hour period when it is dark because there is very little light from the sun: It gets cold at night. I slept really badly last night. I spent the night at Ted's. He took the night ferry/train.\nAlex Walker/Moment/GettyImages\nMore examplesFewer examplesThe snow came down during the night.I'm not feeling very alert today - not enough sleep last night!They work during the night and sleep by day.We were woken in the night by the wail of ambulance sirens.Get a good night's sleep and you'll feel better able to cope.\nSMART Vocabulary: related words and phrases\nDays & times of day\nafternoon\nafternoons\nall day\nam\narvo\nhappy hour\nhigh noon\nhour\nin broad daylight idiom\nin the dead of night/winter idiom\nnocturnally\nnoon\nnoontime\no'clock\noffice hours\nthe witching hour\nwee small hours\nwhite night\nwine o'clock\nworkday\nSee more results »\nnight noun\n(EVENING)\nA1 [ C or U ] the period of time between the late afternoon and going to bed; the evening: Let's go out on Saturday night. We've eaten out every night this week. She's a singer in a bar by night and a secretary by day.\n[ S ] the evening on which a special event happens: When's the last night of your show? The first/opening night of her new movie was a great success. night-night child's expression\nused as another way of saying good night, usually by or to children: \"Night-night, Daddy.\" \"Good night, honey. Sleep well!\"\nSee more the other night\non one evening recently: I saw Naomi at the gym the other night.\nSee more a night out\nan evening spent at a restaurant, theatre, etc. rather than staying at home: I need a night out with the girls this weekend.\nSee more\nMore examplesFewer examplesShe comperes that awful game show on Saturday night.It was lovely to see your mum and dad at the school concert last night.I've been out every night this week.They did a charity performance on the first night, to raise money for AIDS research.I loved that dress you had on last night.\nSMART Vocabulary: related words and phrases\nDays & times of day\nafternoon\nafternoons\nall day\nam\narvo\nhappy hour\nhigh noon\nhour\nin broad daylight idiom\nin the dead of night/winter idiom\nnocturnally\nnoon\nnoontime\no'clock\noffice hours\nthe witching hour\nwee small hours\nwhite night\nwine o'clock\nworkday\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSpectacles & performances\nCelebrations, parties & special occasions\nIdioms\nnight after night\nnight and day\na night on the town\na friendly way of saying goodbye when you leave someone in the evening or before going to bed or to sleep: Night, sweetheart! Sleep well! Compare\ngood night\nSMART Vocabulary: related words and phrases\nWelcoming, greeting & greetings\nafternoon\nair kiss\naloha\nayup\nbid someone/something adieu\nfive\ng'day\ngod\nhello stranger idiom\nhowdy\nlady\nmerry Christmas! idiom\nmind\nmorning\nnamaskar\npleased\npoke\npress the flesh idiom\nshalom\nwish\nSee more results »\nAdd to word list\nAdd to word list\nthe part of every 24-hour period when it is dark because there is no direct light from the sun: [ C ] I’ll be in Pittsburgh on Tuesday night. [ C ] There was a fire last night in the Tremont section of the Bronx. [ U ] It often gets cold here at night. Idioms\nnight after night\nnight and day"}