{"id":241081,"name":"noir","type":"adjective","us_sound":"nwɑːr","us_link":"../audio/n/eus19946.mp3","uk_sound":"nwɑːr","uk_link":"../audio/n/epd20327.mp3","content":"Add to word list\nAdd to word list\nshowing the world as being unpleasant, strange, or cruel, especially in books and films: Unlike a noir mystery, these books end on a happier note with the bad guys caught and the mystery tidily solved. She is the noir investigator, trying to fit the pieces together, getting bloodied in the process. It's all very noir and very depressing. See also\nfilm noir\nMore examplesFewer examplesThere are betrayals, heartbreak, double-dealing and delicious noir stylings in the high school thriller Brick.The book is a noir police story set in streets too mean for any Alaska fishing town.The words are cryptic and slightly noir without being too nihilistic.\nSMART Vocabulary: related words and phrases\nTypes of film, play, book etc.\nadaptation\nAfrofuturism\nAga saga\nallegorical\nanime\nautobiographical\nboy-meets-girl\nDickensian\nGothic\nhokum\npaean\nparodic\nparody\npassion project\npastiche\npolice procedural\nprocedural\npsychological\nslow\nsmash\nSee more results »\nRelated word\nnoirish\n[ U ] a way of showing the world as being unpleasant, strange, or cruel, especially in books and films: The atmosphere is classic noir: fog, rain, night and streets that lead nowhere. For years, a touch of noir has been the perfect accessory for all hip crime writers.\n[ C ] a book or film that shows the world as being unpleasant, strange, or cruel: Several noirs, including \"Raw Deal\", have been set here. Ten years ago he published a noir. Now, with his latest novel, he has written a thriller.\nMore examplesFewer examplesPlace is essential to noir, character less so.In Ray's film, as in all real noirs, things aren't so simple.\nSMART Vocabulary: related words and phrases\nTypes of film, play, book etc.\nadaptation\nAfrofuturism\nAga saga\nallegorical\nanime\nautobiographical\nboy-meets-girl\nDickensian\nGothic\nhokum\npaean\nparodic\nparody\npassion project\npastiche\npolice procedural\nprocedural\npsychological\nslow\nsmash\nSee more results »\nAdd to word list\nAdd to word list\na type of movie, usually filmed in a city, that shows the world as an unhappy, violent place in which many unpleasant people live, or a film of this type: The film is a classic noir with an unusual mix of political satire."}