{"id":241187,"name":"nomination","type":"noun","us_sound":"ˌnɑː.məˈneɪ.ʃən","us_link":"../audio/n/nomination.mp3","uk_sound":"ˌnɒm.ɪˈneɪ.ʃən","uk_link":"../audio/n/uknoctu029.mp3","content":"nomination noun [C or U]\n(SUGGESTION)\nAdd to word list\nAdd to word list\nC1 the act of officially suggesting someone or something for a job, position, or prize: There have been two nominations for the new job.\nThesaurus: synonyms, antonyms, and examples\na suggestionsuggestionMay I make a suggestion? Keep your receipts for tax reimbursement.proposalThe proposal for a new stadium has been rejected.propositionHe wrote to me with a very interesting business proposition.thoughtI've had a thought about what we might do this summer.ideaRebecca has a few ideas about how we could improve things.motionThere is a motion before the assembly to adjourn the meeting.\nSee more results »\nMore examplesFewer examplesThe closing date for nominations is the fifth of August.The film received four Oscar nominations.Each jury makes three nominations to the board.The actress has received six Academy Award nominations.He was an unsuccessful for the 1972 and 1992 Democratic presidential nominations.\nSMART Vocabulary: related words and phrases\nElections\nabsentee\nabsentee ballot\nabsentee vote\nabsentee voter\nabsentee voting\nentrance poll\nexit poll\nfirst-past-the-post\nflip\nfranchise\nprimary\nproportional representation\nproxy\nproxy vote\nproxy voter\nvote of no confidence\nvote something through\nvoting\nvoting booth\nvoting machine\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSuggestions & proposals\nnomination noun [C or U]\n(CHOICE)\nthe act of officially choosing someone for a job or position: the nomination of Elena Kagan to the Supreme Court\nSMART Vocabulary: related words and phrases\nApplying for a job\nacqui-hire\nadvertisement\nanoint\nanointed\napplicant\nassign\nelect\nemploy\nemployable\nemployment\nemployment agency\nequality, diversity and inclusion\nprospect\nreferee\nreinstate\nreinstatement\nrelocation expenses\nresume\nretain\ntestimonial\nSee more results »\nAdd to word list\nAdd to word list\nan official suggestion that someone should be considered to do a particular job, take part in an election, receive an honour, etc.: nomination for sth These are the nominations for the outstanding achievement award this year.\nthe act of officially choosing someone to do a particular job or task: They expect to make a nomination for the medical examiner job soon."}