{"id":241182,"name":"nominate","type":"verb","us_sound":"ˈnɑː.mə.neɪt","us_link":"../audio/n/nominate.mp3","uk_sound":"ˈnɒm.ɪ.neɪt","uk_link":"../audio/n/uknoctu028.mp3","content":"nominate verb [T]\n(SUGGEST)\nAdd to word list\nAdd to word list\nC1 to officially suggest someone for an election, job, position, or honour: He's been nominated by the Green Party as their candidate in the next election. Would you like to nominate anyone for/as director?\nC1 to say officially that a film, song, programme, etc. will be included in a competition for a prize: The film was nominated for an Academy Award.\nSMART Vocabulary: related words and phrases\nElections\nabsentee\nabsentee ballot\nabsentee vote\nabsentee voter\nabsentee voting\nentrance poll\nexit poll\nfirst-past-the-post\nflip\nfranchise\nprimary\nproportional representation\nproxy\nproxy vote\nproxy voter\nvote of no confidence\nvote something through\nvoting\nvoting booth\nvoting machine\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSuggestions & proposals\nnominate verb [T]\n(CHOOSE)\nto officially choose someone for a job or to do something: She was nominated as the delegation's official interpreter. [ + to infinitive ] President Yeltsin nominated acting prime minister Sergei Kiriyenko to head the government.\nSMART Vocabulary: related words and phrases\nApplying for a job\nacqui-hire\nadvertisement\nanoint\nanointed\napplicant\nassign\nelect\nemploy\nemployable\nemployment\nemployment agency\nequality, diversity and inclusion\nnomination\nprospect\nreinstate\nreinstatement\nrelocation expenses\nresume\nretain\ntestimonial\nSee more results »\nAdd to word list\nAdd to word list\nto officially suggest someone for a position, an honor, or election: She was nominated by the president to serve on the Supreme Court.\nIf someone or something is nominated for a prize, it is one of the official competitors for it. nomination noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/ˌnɑm·əˈneɪ·ʃən/\n[ U ] Three candidates are seeking the Democratic nomination for the presidency.\nAdd to word list\nAdd to word list\nto officially suggest that someone should be considered to do a particular job, take part in an election, receive an honour, etc.: be nominated for sth The former vice president has been nominated for the Nobel Peace Prize.\nto officially choose someone to do a particular job or task: be nominated as sth He's been nominated as fire chief.be nominated for sth The current secretary has been nominated for the post of director of the U.S. Fish and Wildlife Service.be nominated to do sth The following six directors have been nominated to serve until the next Annual Meeting."}