{"id":244504,"name":"nonfulfillment","type":"noun","us_sound":"ˌnɑːn.fʊlˈfɪl.mənt","us_link":"../audio/n/cdo0622usnonf1148.mp3","uk_sound":"ˌnɒn.fʊlˈfɪl.mənt","uk_link":"../audio/n/cdo0622uknonf1204.mp3","content":"nonfulfillment noun [U]\n(NO SATISFACTION)\nAdd to word list\nAdd to word list\na lack of pleasure and satisfaction because you are not happy with your life: After a lifetime of nonfulfillment, it was not surprising that he experienced bouts of rage. The sense of non-fulfillment in her personal life contrasted with her very successful business career.\nMore examplesFewer examplesTheir marriage was characterized by nonfulfillment and anxiety.After a long period of non-fulfillment, she found happiness later in life.The decision not to move overseas contributed to his feeling of non-fulfillment.\nSMART Vocabulary: related words and phrases\nFeeling sad and unhappy\na dog's life idiom\na long face idiom\nabjection\nangsty\nbe cut up idiom\nbe down in the mouth idiom\nbe in a funk idiom\ndistraught\ndistressed\ndog\ndoleful\nlovelorn\nlovesick\nlow-spirited\nlugubrious\nwistful\nwistfully\nwoe\nwoe is me idiom\nwoebegone\nSee more results »\nnonfulfillment noun [U]\n(NO ACTION)\nthe failure to do something that someone wanted you to do or that you promised to do: The group was protesting against the nonfulfillment of their demands. They were fined for non-fulfillment of their contractual obligations.\nThesaurus: synonyms, antonyms, and examples\nthe fact of not doing something you shouldfailureFailure to follow the employee guidelines can lead to your immediate termination.defaultThe bank seized his house because his mortgage was in default.malpracticeThe surgeon was sued for malpractice.derelictionHe was dishonorably discharged for dereliction of duty.neglectCorruption and neglect resulted in a government that was weakened enough to be overthrown. negligenceEducational standards deteriorated thanks to the negligence of the administration.\nSee more results »\nMore examplesFewer examplesFines are levied for non-fulfillment.Nonfulfillment of the conditions of the lease will result in eviction.\nSMART Vocabulary: related words and phrases\nFailing and doing badly\nabjectly\nat-risk\nbackbencher\nballs (something) up\nbe on your beam ends idiom\nblow (someone/something) up\nbomb\negg\nflog\nflog a dead horse idiom\nflop\nflub\nflunk out\nfounder\nmess\nrot\nrunning on empty idiom\nsclerotic\nscrew\nthe rot sets in idiom\nSee more results »"}