{"id":246507,"name":"nonprofessional","type":"adjective","us_sound":"ˌnɑːn.prəˈfeʃ.ən.əl","us_link":"../audio/n/cdo0123usnonp1670.mp3","uk_sound":"ˌnɒn.prəˈfeʃ.ən.əl","uk_link":"../audio/n/cdo0123uknonp1995.mp3","content":"Add to word list\nAdd to word list\n(of a person) doing something as a hobby or to help someone, not as a paid job: The director liked to use nonprofessional actors in her films. Most people who play the game are nonprofessional.\n(of work) not needing special training or education: Many graduates work in nonprofessional jobs for a while after leaving university. He advised me not to take on a non-professional job.\nhaving the type of job that does not involve a high level of education and training: A teacher can earn a lot more than most nonprofessional workers. Most of our students come from non-professional families.\nMore examplesFewer examplesThe children often serve as non-professional translators for their parents.A non-professional choir like ours relies on the dedication and commitment of volunteer singers.We recruited 50 nonprofessional taste testers to help us.There is a huge difference between professional and non-professional sport.\nSMART Vocabulary: related words and phrases\nPastimes - general words\nactivity\namusement\navocation\navocational\navocationally\ncaper\nfrolic\ngame\nhobby\ninterest\nleisure\nnonprofessionally\npastime\npursuit\nrec\nrecreate\nrecreation\nrecreational\nrecreationist\nrelaxation\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of employment\na person who does something as a hobby or to help someone, rather than as a job that they have been trained for or are paid to do: Her books are popular with both scientists and nonprofessionals. He did remarkably well for a non-professional.\nMore examplesFewer examplesShe completed the course in a record time for a non-professional.The cast, a mixture of professionals and nonprofessionals, is excellent.This is not the sort of job I would ask a nonprofessional to do.\nSMART Vocabulary: related words and phrases\nPastimes - general words\nactivity\namusement\navocation\navocational\navocationally\ncaper\nfrolic\ngame\nhobby\ninterest\nleisure\nnonprofessionally\npastime\npursuit\nrec\nrecreate\nrecreation\nrecreational\nrecreationist\nrelaxation\nRelated word\nprofessional"}