{"id":248828,"name":"normal","type":"adjective","us_sound":"ˈnɔːr.məl","us_link":"../audio/n/uszzzzd080.mp3","uk_sound":"ˈnɔː.məl","uk_link":"../audio/n/ukzzzze080.mp3","content":"Add to word list\nAdd to word list\nA2 ordinary or usual; the same as would be expected: a normal working day Lively behaviour is normal for a four-year-old child. It's normal for couples to argue now and then. They were selling the goods at half the normal cost. The temperature was above/below normal for the time of year. Things are back to normal now that we've paid off all our debts.\nThesaurus: synonyms, antonyms, and examples\nnormalnormalTemperatures are well above normal today.usualI went to bed at my usual time.ordinaryThe magazine has stories about ordinary people rather than celebrities.standardIt's standard practice for surgeons to wear gloves.naturalIt's completely natural to feel anxious on your first day at a new school.typicalHe was a typical teenager - arguing with his parents and staying out late.\nSee more results »\nMore examplesFewer examplesIt's normal to feel a little apprehension before starting a new job.He was able to lead a normal life, despite the illness.The restrictions on water usage have been lifted now that the river levels are normal.The prison service should try to rehabilitate prisoners so that they can lead normal lives when they leave prison.Today's temperatures will be normal for the time of year.\nSMART Vocabulary: related words and phrases\nHabitual and customary\naccustomed\nall in a day's work idiom\nas a (general) rule idiom\nas a matter of course idiom\nas per usual/normal idiom\ninveterate\ninveterately\nknee-jerk\nmainstream\nmainstreaming\nmake it a rule idiom\nmechanical\nordinarily\nper\nprevail\npro forma\nregulation\nsurprise\nsurprise, surprise idiom\nterritory\nSee more results »\nnormal adjective\n(NOT UNUSUAL)\nAdd to word list\nAdd to word list\nordinary or usual; as would be expected: He seemed perfectly normal to me. The temperature is above/below normal today. normalization noun [ U ] us/ˌnɔr·mə·ləˈzeɪ·ʃən, -lɑɪ-/\nnormal noun [C]\n(LINE)\nphysics a line that is perpendicular (= at an angle of 90 degrees) to a surface\nAdd to word list\nAdd to word list\nusual, and what you would expect: They were selling the good at half the normal price. In normal circumstances, you should be able to decide this sort of thing without consulting your manager. It is normal practice to refer such questions to the Board. The day after the incident, everyone was back at work as normal."}