{"id":248899,"name":"north","type":"noun","us_sound":"nɔːrθ","us_link":"../audio/n/north.mp3","uk_sound":"nɔːθ","uk_link":"../audio/n/uknorma004.mp3","content":"Add to word list\nAdd to word list\nA2 the direction that goes towards the part of the earth above the equator, opposite to the south, or the part of an area or country that is in this direction: The points of the compass are north, south, east, and west. The landscape is more mountainous in the north (of the country). Cambridge is/lies to the north of London. a north-facing window the North\nthe rich industrial countries of the world, most of which are above the equator\nthe northern states of the middle and eastern part of the US: The North defeated the South in the American Civil War.\nMore examplesFewer examplesMost of the country's population is concentrated in the north.The wind is coming from the north.The revolt in the north is believed to have been instigated by a high-ranking general.The needle on a compass always points to magnetic north.House prices in the north are rocketing (up).\nSMART Vocabulary: related words and phrases\nPoints of the compass\ncardinal point\ncompass reading\ncompass rose\nE, e\neasterly\neastern\neasternmost\ngeomagnetic pole\nmagnetic north\nmagnetic pole\nnortheastern\nnortheastward\nnortherly\nnorthern\nnorthernmost\nsouthern\nsouthwestern\nSW\nwestern\nwesternmost\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTowns & regions: parts of countries\nCountries, nationalities & continents: continents & regions of the world\nTowns & regions: named regions of countries\nGrammar\nEast or eastern; north or northern? …\nIdiom\nnorth of something\nA2 in or forming the north part of something: North America/Africa the north coast of Iceland Our farm is a few miles north of the village. north wind\na wind coming from the north: A vicious north wind was blowing.\nSee more\nMore examplesFewer examplesThe north face of the Eiger is a very difficult climb.A cinema was burned out in north London last night. Police suspect arson.They live on the north coast of Scotland.We camped on the north slope of the valley.There is a huge forest on the north side of the mountain.\nSMART Vocabulary: related words and phrases\nPoints of the compass\ncardinal point\ncompass reading\ncompass rose\nE, e\neasterly\neastern\neasternmost\ngeomagnetic pole\nmagnetic north\nmagnetic pole\nnortheastern\nnortheastward\nnortherly\nnorthern\nnorthernmost\nsouthern\nsouthwestern\nSW\nwestern\nwesternmost\nSee more results »\nGrammar\nEast or eastern; north or northern? …\nA2 towards the north: Go due (= directly) north for two miles. The garden faces north and doesn't get much sun in the winter. up north informal\nto or in the north of the country or region: I live in London, but my relatives live up north, in Manchester.\nSee more\nSMART Vocabulary: related words and phrases\nPoints of the compass\ncardinal point\ncompass reading\ncompass rose\nE, e\neasterly\neastern\neasternmost\ngeomagnetic pole\nmagnetic north\nmagnetic pole\nnortheastern\nnortheastward\nnortherly\nnorthern\nnorthernmost\nsouthern\nsouthwestern\nSW\nwestern\nwesternmost\nSee more results »\nGrammar\nEast or eastern; north or northern? …\nAdd to word list\nAdd to word list\nthe direction that is opposite south, or the part of an area or country which is in this direction: The points of the compass are north, south, east, and west.\nIn the US, the North is the part of the country in the north and east: Ken grew up in Mississippi but settled in the North after college.\nUS history In the US Civil War, the North was the group of states that fought to keep the US together. northern adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈnɔr·ðərn/ (abbreviation N.); (abbreviation No.)\nTom lives in the northern part of the state.\nin, forming, or toward the north part of something: the north coast She lives about forty miles north of here.\nA north wind is a wind coming from the north.\nnorth of\nAdd to word list\nAdd to word list\nused to say that an amount is more than the one stated: The company's market cap is now north of $160 billion."}