{"id":248982,"name":"nosedive","type":"noun","us_sound":"ˈnoʊz.daɪv","us_link":"../audio/n/nosedive.mp3","uk_sound":"ˈnəʊz.daɪv","uk_link":"../audio/n/uknorma030.mp3","content":"Add to word list\nAdd to word list\na fast and sudden fall to the ground with the front pointing down: The plane roared overhead and went into a nosedive.\na sudden fast fall in prices, value, etc.: There was alarm in the markets when the dollar took a nosedive.\nThesaurus: synonyms, antonyms, and examples\nthe fact of getting smaller or becoming lessdecreaseThere has been a steady decrease in the number of visitors.fallA fall in the price of petrol is unlikely.fall-offThere's been a sharp fall-off in demand for the product since the company's scandal broke.falling-offThere has been a slight falling-off in public sector employment growth.riseThere has been a sharp rise in home sales this month.\nSee more results »\nSMART Vocabulary: related words and phrases\nFalling and dropping\nass\nbase jumping\ncollapse/fall in a heap idiom\ncropper\ncrumple\ndrop\ndrop like flies idiom\nfaceplant\nfall away\nfly\nlet go idiom\nmic drop\noverbalance\nparachutist\nplunge\npratfall\nshower\nthump\ntrip\nwayside\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrice decreases\nto suddenly fall to the ground with the front pointing down: Spectators in the crowd watched in horror as the plane nosedived.\nto suddenly fall in value, quickly and by a large amount: House prices nosedived without warning.\nSMART Vocabulary: related words and phrases\nMoving downwards\ncascade\ndescend\ndive\ndownwardly\ndrop/fall/sink like a stone idiom\nfall down\nflop\ngo down\nparachute\npronate\npronation\nput\nput something/someone down\nrain (something) down\nset\nset something down\nsink\nspiral\ntouch\ntouch down\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming and making smaller or less\nAdd to word list\nAdd to word list\n(esp. of an aircraft) a fast and sudden fall to the ground with the front pointing down: fig. Stock prices took a nosedive (= a sudden fall in value). nosedive verb [ I ] us\nYour browser doesn't support HTML5 audio\n/ˈnoʊzˌdɑɪv/\nfig. Profits nosedived in the last quarter.\nAdd to word list\nAdd to word list\na sudden fast fall in price, value, etc.: Most analysts view the stock's recent nosedive as investor overreaction. Shares on Wall Street took a nosedive last night.\nto suddenly fall in value, quickly and by a large amount: Market prices continue to nosedive this week."}