{"id":249092,"name":"not","type":"adverb","us_sound":"nɑːt","us_link":"../audio/n/knot.mp3","uk_sound":"nɒt","uk_link":"../audio/n/ukknock005.mp3","content":"Add to word list\nAdd to word list\nA1 used to form a negative phrase after verbs like \"be\", \"can\", \"have\", \"will\", \"must\", etc., usually used in the short form \"n't\" in speech: He's not fat! I won't tell her. I can't go. Don't you like her? It isn't hard (= it is easy). I'm just not interested. He's not bad-looking (= he is fairly attractive). He's not as tall as his father.\nA1 used to give the next word or group of words a negative meaning: I told you not to do that. I like most vegetables but not cabbage. \"Come and play, Dad.\" \"Not now, Jamie.\" It was Yuko who said that, not Richard.\nA2 used after verbs like \"be afraid\", \"hope\", \"suspect\", etc. in short, negative replies: \"Is he coming with us?\" \"I hope not.\" \"Are you done?\" \"I'm afraid not.\" if not\nA2 used to say what the situation will be if something does not happen: I hope to see you there but, if not, I'll call you.\nSee more or not\nA2 used to express the possibility that something might not happen: Are you going to reply or not?\nSee more\nhumorous sometimes used at the end of a statement to show that you did not mean what you have said: That was the best meal I've ever had - not!\nMore examplesFewer examplesCheer up! It's not that bad!She's not one of my close circle of friends.Party unity is threatened when members will not compromise.The TV won't work if the aerial's not connected.It's not very dignified behaviour for a 54-year-old man.\nSMART Vocabulary: related words and phrases\nYes, no & not\na sure thing idiom\naffirmation\naffirmatively\nain't\nbetcha\nbit\ndidn't\ndoes a bear/do bears shit in the woods? idiom\nfar\nhardly\nnot that idiom\nopposed\nslight\nsure\nwasn't\nweren't\nwon't\nwouldn't be seen dead idiom\nyes\nyou bet idiom\nSee more results »\nGrammar\nNo or not?No and not are the two most common words we use to indicate negation. We use no before a noun phrase: …\nNotNot is one of the most common words we use to indicate negation. It is often shortened to n’t and joined to an auxiliary verb or modal verb: …\nNot in negative statements (She hasn’t …, I did not …)We form negative declarative clauses with not after be (she is not talking), after modal verbs (they must not go) and after auxiliary verbs do and have (we did not like it; they have not eaten). …\nNot and n’t in questions (Did younot …? Wasn’t she …?)We use not or n’t to form negative questions: …\nDon’t, Do not: orders and instructionsWe use don’t + the base form of the verb or do + not + the base form of the verb to make negative imperatives. We use these to give orders, instructions or commands. Do not is stronger and much more formal: …\nNot: short repliesWe use not in negative short replies with mental process verbs (e.g. be afraid, guess, hope): …\nNot: contrastWe often use not after but to express a contrast. We often leave out the verb phrase or part of it in the second clause: …\nNot + -ing and not + toWe use not before an -ing clause in more formal styles: …\nOr notWe can use or not in questions to ask about a range of possibilities: …\nSo and not with expect, hope, think, etc.We can use so after some verbs instead of repeating an object clause, especially in short answers. The verbs we do this with most are: appear, assume, be afraid (meaning ‘regret’), believe, expect, guess, hope, imagine, presume, reckon, seem, suppose, think: …\nIdioms\nnot all that\nnot at all\nnot be up to much\nnot that\nAdd to word list\nAdd to word list\nused to make a word or group of words negative, or to give a word or words an opposite meaning: Her life was not happy. If it’s not yours, whose is it? He’s not bad-looking (= He is attractive). She was not only an excellent teacher but (also) a brilliant researcher (= she was both these things). Not that I mind (= I do not mind), but why didn’t you call yesterday? not-too-distant\nNot-too-distant refers to a time in the near future or recent past: They plan to have children in the not-too-distant future. Idioms\nnot a chance\nnot at all\nnot your day\nnot yourself\nnot to mention (someone/something)"}