{"id":249155,"name":"note","type":"noun","us_sound":"noʊt","us_link":"../audio/n/note.mp3","uk_sound":"nəʊt","uk_link":"../audio/n/uknosh_017.mp3","content":"note noun\n(WRITING)\nAdd to word list\nAdd to word list\nA1 [ C ] a short piece of writing: He left a note to say he would be home late. There's a note on the door saying when the shop will open again.\nB2 [ C ] a short explanation or an extra piece of information that is given at the bottom of a page, at the back of a book, etc.: For more information see Note 3. See also\nfootnote notes A2 [ plural ]\ninformation written on paper: The wind blew my notes all over the room.\nSee more\nMore examplesFewer examplesHe sent her a note of congratulation on her election victory.The book was delivered yesterday with a note saying the bill for it would follow in a day or two.I'd better leave a note so they'll know I'll be late.I have a pad and pencil for taking notes.She spoke for an hour without once referring to her notes.\nSMART Vocabulary: related words and phrases\nLetters, notes and cards\naerogramme\nair letter\nbillet-doux\nchain letter\nChristmas card\ncorrespondence\nget-well card\ngreetings card\nhandbill\nhate mail\ninvitation\njunk mail\nplace card\npoison-pen letter\npostcard\nPPS\nPS\nrejection\nround robin\nwire\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPieces of writing\nInformation and messages\nnote noun\n(SOUND)\nC2 [ C ] a single sound at a particular level, usually in music, or a written symbol that represents this sound: high/low notes She played three long notes on the piano. The engine noise suddenly changed its note and rose to a whine.\nMore examplesFewer examplesI can't reach the high notes.I just can't hit those high notes like I used to.The musical notes on the lines go EGBDF - use the mnemonic 'every good boy deserves fun'.Ann blew a few notes on the trumpet.Accent the first note of every bar.\nSMART Vocabulary: related words and phrases\nNotes of the musical scale\nB, b\nC, c\nD, d\ndoh\nE, e\nflat\nhigh doh\nla\nlah\nmajor\nmi\nmiddle C\nminor\nregister\nscale\nsemitone\nsoh\nsol\nsol-fa\nte\nSee more results »\nnote noun\n(WAY OF EXPRESSING)\nC1 [ S ] an emotion or a way of expressing something: There was a note of caution in her letter. His speech struck just the right note. The meeting ended on an optimistic note.\nSMART Vocabulary: related words and phrases\nFeelings - general words\natmospherically\naura\nbreast\ncharged\nemotional\nemotionalism\nemotionally\nfeeling\ngut\nhimself\nnon-emotional\nnon-material\nsensibility\nsentience\nsentient\nspirited\nsusceptibility\nteam spirit\nthirsty\nvibe\nSee more results »\nnote noun\n(MONEY)\nB1 [ C ] UK (US bill) a piece of paper money: a €20 note He took a wad of notes from his pocket.\nSMART Vocabulary: related words and phrases\nPayment methods\nanti-kickback\nATM card\nautomatic withdrawal\nbad cheque\nbaksheesh\nbribe\nchip\ncommission\nlegal tender\nliquefy\nliquid\nmoney-back\nmonometallic\nMonopoly money\nnon-cash\nnon-monetary\npayoff\nper calendar month\npocket\nwhip-round\nSee more results »\nnote noun\n(IMPORTANCE)\nC2 [ U ] formal importance, or the fact that something deserves attention: There was nothing of note in the latest report.\nThesaurus: synonyms, antonyms, and examples\nhaving great effect or influenceimportantIt was one of the most important legal cases of the century.bigThis is a big match tonight - if we lose, we won't be in the playoffs.majorThis is a major decision so we'd better get it right.significantDid he make any significant changes to my suggestions?\nSee more results »\nSMART Vocabulary: related words and phrases\nImportance - general words\nall that matters\ncentre of gravity\ncornerstone\ncriticality\nfocus\ngrandness\nimport\nmeaning\nmomentousness\noverfocus\npertinence\npre-eminence\nprecedence\nsignificance\nsubstantial\nsupereminence\nsupremacy\ntranscendence\nurgency\nworth\nSee more results »\nIdioms\nmake/take a note\ntake note of something\nB1 to notice something: They noted the consumers' growing demand for quicker service. [ + (that) ] Please note (that) we will be closed on Saturday. [ + question word ] Note how easy it is to release the catch quickly.\nto give your attention to something by discussing it or making a written record of it: [ + that ] He said the weather was beyond our control, noting that last summer was one of the hottest on record. In the article, she notes several cases of medical incompetence.\nMore examplesFewer examplesShe noted his epicene features - the long eyelashes, the full lips.Will patrons kindly note that this shop will be closed on 17 July.The report notes that 40 percent of lawyers entering the profession are women.He noted what time the train was due to get in.Did you note what number bus we need to catch?\nSMART Vocabulary: related words and phrases\nPaying attention and being careful\nattention span\nattentiveness\nbe good, and if you can't be good, be careful idiom\nbe on (your) guard idiom\ncared-for\negg\nguard\nhandle/treat someone with kid gloves idiom\nhang\nhang on/upon something\nhave a care idiom\nprudently\nreligion\nrevolve\nrevolve around someone/something\nsafety\nsafety first idiom\nsit\nthe/a glare of something idiom\nzero\nSee more results »\nPhrasal verb\nnote something down\nnote noun\n(WRITING)\nAdd to word list\nAdd to word list\n[ C ] a short piece of writing: a handwritten note Make a note to phone him (= Write it down so you remember).\n[ C ] A note is a piece of information that you write down while something is happening: [ C usually pl ] Be sure to take notes in class (= write down information).\nnote noun\n(SOUND)\n[ C ] a single sound, esp. in music, or a written symbol which represents this sound: Her soprano voice intoned the low, first notes of the song.\n[ C ] fig. Note also means the particular quality of an emotion or feeling: The meeting ended on an optimistic note.\nnote noun\n(IMPORTANCE)\n[ U ] importance or fame: There was nothing of note in the report.\nnote verb [T]\n(NOTICE)\nto take notice of, give attention to, or make a record of something: [ + that clause ] Please note that we will be closed on Saturday. noted adjective us\nYour browser doesn't support HTML5 audio\n/ˈnoʊ·t̬ɪd/\na noted scholar\nAdd to word list\nAdd to word list\n[ C ]\n&#160; MONEY\n&#160; ( US usually bill) a piece of paper money: a €500 notein notes He gave me £100 in £10 notes. I had no change; I only had notes. Can you change a €20 note?\n[ C ]\n&#160; FINANCE a written agreement that one person, organization, etc. will pay a particular amount of money to another person, etc. by a particular date: The note for your loan comes due on 1 June. a two-year note\n[ C ]\n&#160; COMMUNICATIONS a short letter, or something that you write down in order to remember something: send/write sb a note I'll send you a note about this but please do put it on your calendars.note to sb The bank said in a note to investors that the operation would make strategic sense. I got a note from the CEO congratulating me on the deal. I made a note to review the matter in a month's time.\n[ C ] a short official document: They can get out of the requirement with a note from their doctor confirming their diagnosis. Please check the goods before signing the delivery note.\nnotes [ plural ]\ndetailed information that you write down: take notes In any disciplinary meeting, it is always advisable to take notes.make notes I read through the notes I'd made at the conference. The keynote speaker gave his lecture without notes. See also\nadvice note\nbanknote\nbond note\nbought note\nconsignment note\ncontract note\nconvertible note\ncover note\ncredit note\ncurrency note\nView all\ndelivery note\ndemand note\ndispatch advice\nEMTN\nfloating rate note\nloan note\nnoncallable notes\npromissory note\nprompt note\nrail consignment note\nrevenue anticipation note\nroad consignment note\nsecured notes\nsenior notes\nshipping note\nsick note\nsold note\nsubordinated notes\ntax anticipation note\nTreasury note\nunsecured notes\nweight note\nto notice or realize something: They noted the consumers' growing demand for quicker service.note (that) Please note that we will be closed on Saturday.\nto mention something so that people are aware of it: In her report, she notes several cases of poor practice on the part of management. Phrasal verb\nnote sth down"}