{"id":249192,"name":"nothing","type":"pronoun","us_sound":"ˈnʌθ.ɪŋ","us_link":"../audio/n/nothing.mp3","uk_sound":"ˈnʌθ.ɪŋ","uk_link":"../audio/n/uknosh_025.mp3","content":"Add to word list\nAdd to word list\nA2 not anything: There's nothing in the drawer - I took everything out. Nothing I could say would cheer her up. I have nothing new to tell you. There's nothing else (= no other thing) we can do to help. There's nothing much (= not very much) to do in our town. The story was nothing but (= only) lies.US The score is Yankees three, Red Sox nothing (= no points). have nothing to do with someone (also UK be nothing to do with someone)\nB2 to be a matter or subject that someone has no good reason to know about or be involved with: UK I wish he wouldn't offer advice on my marriage - it's nothing to do with him.\nSee more have/want nothing to do with someone/something\nB2 (also UK be nothing to do with someone/something) to have or want no connection or influence with someone or something: UK We are nothing to do with the firm that has the offices next door.\nSee more be/mean nothing\nto have no importance or value: Money means nothing to him.\nSee more for nothing\nfree or without paying: I got this painting for nothing from a friend.\nB2 with no good result or for no purpose: He queued for two hours and (all) for nothing - there were no seats left.\nSee more nothing on\nno clothes on your body: She sleeps with nothing on.\nUK no arrangements for a stated period: I checked my calendar and I have nothing on on Tuesday afternoon.\nSee more\nMore examplesFewer examplesHe reassured people that law-abiding citizens would have nothing to fear from the enquiries.We talked late into the night, but nothing was concluded.There was nothing we could do about it - the situation was beyond our control.Although they said nothing, she could sense their disapproval of her suggestion.There's nothing more refreshing on a hot day than a cold beer.\nSMART Vocabulary: related words and phrases\nSomething, anything, nothing, and everything\nacross-the-board\nanything\naught\nbazillion\nbupkis\nfresh\nmatter\nnil\nnone\nnot a dicky bird idiom\nnot a sausage idiom\nnot/nothing much idiom\nsummat\nsweet\nsweet fanny adams idiom\nwhat with one thing and another idiom\nwhatevs\nwhit\nzero\nzip\nSee more results »\nGrammar\nNo one, nobody, nothing, nowhereNo one, nobody, nothing and nowhere are indefinite pronouns. …\nIdioms\nall or nothing\nbe nothing for it\nbe nothing if not generous, honest, helpful, etc.\nbe nothing less than something\nnothing like someone/something\nbe nothing short of...\nbe nothing special\nbe nothing to it\nit is/was nothing\nlike nothing on earth\nMore idioms\nnothing doing\nnothing more than\nnothing of the kind\nthere's nothing in something\nin no way: mainly UK He had two letters of refusal but, nothing daunted (= not discouraged), he tried again.\nSMART Vocabulary: related words and phrases\nYes, no & not\na sure thing idiom\naffirmation\naffirmatively\nain't\nbetcha\nbit\ndidn't\ndoes a bear/do bears shit in the woods? idiom\nfar\nhardly\nno way idiom\nnot that idiom\nopposed\nslight\nsure\nwasn't\nweren't\nwon't\nwouldn't be seen dead idiom\nyes\nSee more results »\nGrammar\nNo one, nobody, nothing, nowhereNo one, nobody, nothing and nowhere are indefinite pronouns. …\nsomeone of no value or importance: He's a nothing, a low-down, useless nobody. Synonyms\nnil\nnix US informal\nzilch informal\nzip\nSMART Vocabulary: related words and phrases\nPeople of little importance\na cog in a/the machine idiom\nbe past your sell-by date idiom\ncannon fodder\nCinderella\ninferior\nlightweight\nmediocrity\nminnow\npast\npawn\npipsqueak\nplaything\npoor\npoor relation idiom\npygmy\nunknown\nwaste\nwaste of space idiom\nwaster\nworm\nSee more results »\nGrammar\nNo one, nobody, nothing, nowhereNo one, nobody, nothing and nowhere are indefinite pronouns. …\nAdd to word list\nAdd to word list\nnot anything: There’s nothing in the drawer – I took everything out. Money means nothing to him (= is not important). The score is Yankees three, Red Sox nothing (= no points). The story was nothing but (= only) lies. nothing to\nIf something is nothing to someone, it has little meaning or value to that person: Losing a thousand bucks is nothing to him. nothing to do with\nTo have nothing to do with someone or something is to not be involved with that person or thing: That has nothing to do with me.\nPeople say something is nothing as a polite answer when they are thanked: “Thanks for the tickets.” “Oh, it’s nothing.” Idioms\nnothing could be further from the truth\nnothing less than something\nnothing like something\nnothing much\nnothing special\nnothing to sneeze at"}