{"id":249213,"name":"notice","type":"verb","us_sound":"ˈnoʊ.t̬ɪs","us_link":"../audio/n/notice.mp3","uk_sound":"ˈnəʊ.tɪs","uk_link":"../audio/n/uknosh_027.mp3","content":"Add to word list\nAdd to word list\nB1 [ I or T ] to see or become conscious of something or someone: I noticed a crack in the ceiling. Mary waved at the man but he didn't seem to notice. [ + (that) ] He noticed (that) the woman was staring at him. [ + question word ] Did you notice how she did that?\nThesaurus: synonyms, antonyms, and examples\nto see somethingseeI can see for miles from up here.noticeI noticed a crack in the ceiling.perceiveBill perceived a tiny figure in the distance.observeA teacher observed her climbing over the gate.spotWe managed to spot a leopard.catch sight ofWe looked for the bird and caught sight of it just as it flew off.\nSee more results »\n[ T often passive ] to bring someone to the attention of the public, usually because of an unusual skill, etc.: She was first noticed by the critics at the age of twelve, and went on to become a world-famous violinist.\nMore examplesFewer examplesSimon was so absorbed in his book, he didn't even notice me come in.I noticed a certain distance between father and son.They noticed him going into the hotel bar.She's such a perfectionist that she notices even the tiniest mistakes.It seems impossible that I could have walked by without noticing her.\nSMART Vocabulary: related words and phrases\nUsing the eyes\naccommodate\naccommodation\nall eyes are on someone/something idiom\nastigmatic\nbeholder\ncast\ncorner\ndiscern\nfix\nglare\npenetrating\nperceive\nre-sight\nrest on someone/something\nresurvey\nrubbernecking\nscope\nsighting\nspot\ntab\nSee more results »\nnotice noun\n(INFORMATION)\nA2 [ C ] (a board, piece of paper, etc. containing) information or instructions: There was a large notice on the wall saying \"No Parking\". I saw a notice in the paper announcing their marriage. notices [ plural ] mainly UK\nprinted statements of opinion in the newspapers about plays, films, books, etc.: The musical has received wonderful notices.\nSee more\nMore examplesFewer examplesThere's a notice outside the building which says 'No admission before 12 noon'.He attached a notice saying 'Wet paint!'I stuck the notice (up) on the board.The notice outside the cinema said 'Closed on Wednesday'.Can you read what that notice says?\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\nprospectus\nPSA\npush notification\nradiogram\nreadout\nsubtlety\ntelemetry\nSee more results »\nnotice noun\n(WARNING)\nB1 [ U ] information or a warning given about something that is going to happen in the future: give someone notice The next time you visit, can you give me more notice?at a moment's notice The first responders are ready to spring into action at a moment's notice.until further notice The building is closed until further notice (= until another official announcement is made).\n[ U ] the period of time that you must work after you have said that you are leaving your job, or after you have been asked to leave: Do I have to work out my notice? give someone notice\n(also give sb their notice) to ask someone who works for you to leave their job, usually after a particular period of time: My boss gave me a month's notice.\nUS (also give (your) notice) to tell your employer or landlord that you will be leaving your job or your rented home, usually after a particular period of time: I gave my notice at work yesterday.\nSee more hand in your notice (UK also give in your notice); (US also put in your notice)\nC2 to tell your employer that you intend to leave your job after a particular period of time: I handed in my notice yesterday.\nSee more put someone on notice\nto warn someone about something: I put them on notice of what I expect from them. Schools are being put on notice that if they do not show improvement, they may be shut down.\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\nprospectus\nPSA\npush notification\nradiogram\nreadout\nsubtlety\ntelemetry\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThreats & warnings\nFiring staff\nRetiring & resigning\nnotice noun\n(ATTENTION)\nB1 [ U ] attention: come/bring to your notice It has come to/been brought to my notice (= I have been told) that you have been late for work every day this week. take notice\nto give attention to something: I asked him to drive more slowly, but he didn't take any notice.\nSee more\nSMART Vocabulary: related words and phrases\nPaying attention and being careful\nattention span\nattentiveness\nbe good, and if you can't be good, be careful idiom\nbe on (your) guard idiom\ncared-for\negg\nguard\nhandle/treat someone with kid gloves idiom\nhang\nhang on/upon something\nhave a care idiom\nprudently\nreligion\nrevolve\nrevolve around someone/something\nsafety\nsafety first idiom\nsit\nthe/a glare of something idiom\nzero\nSee more results »\nIdioms\nat a moment's/two hours'/three weeks', etc. notice\nat short notice\nnotice verb\n(SEE)\nAdd to word list\nAdd to word list\nto become aware of, esp. by looking; to see: [ I ] Mary waved but he didn’t seem to notice. [ + that clause ] He noticed that she was staring at him.\nnotice noun\n(INFORMATION)\n[ C/U ] something written or printed that gives information or instructions: [ C ] We got a notice about recycling in the mail. [ U ] This building is closed until further notice (= until official instructions are given).\n[ C/U ] Notice is also warning that something will happen or needs to happen: [ U ] I can’t cancel my plans on such short notice/at a moment’s notice (= immediately).\n[ C/U ] Notice is also an official statement saying you are leaving your job or telling you your job has ended: [ U ] I got my 30-day notice yesterday at work.\nnotice noun\n(ATTENTION)\n[ U ] attention: Twain first attracted notice as a humorist.\nAdd to word list\nAdd to word list\n[ C ]\n&#160; COMMUNICATIONS a piece of written information on paper, a board, a website, etc.: There was a notice about the proposed reorganization on all the office noticeboards.\n[ U ] information or a warning about something that is going to happen in the future, or the period of time before it happens: An inspection can take place at any time without notice.give (sb) notice (that) We hereby give notice that we have been appointed official receivers for the assets of the above-named company.a week's/month's, etc. notice You will need to give a month's notice if you want to withdraw any of the cash. These offices will remain closed until further notice.\n[ U ]\n&#160; HR a letter or a statement saying that an employee will or must leave their job after a particular period of time: give in/hand in your notice The situation at work was so bad that I decided to hand in my notice.give sb notice Many of the junior staff were given notice to leave.\n[ U ]\n&#160; HR the period of time that an employee works in their job after they have said that they are leaving, or after they have been asked to leave: a week's/month's, etc. notice In this type of job you usually only have a week's notice. They paid me for the two weeks instead of making me work out my notice.\n[ C or U ]\n&#160; LAW a formal document or statement that tells someone to do something, or gives them information about something: The tenants refused to leave and have now been served with notices of eviction by the landlord. All the redundancy notices have now gone out to the members of staff affected.\nat short notice ( US on short notice)\nonly a short time before something happens: It is not possible to get a replacement at such short notice.\nnotice to quit\nPROPERTY, LAW\n&#160; (also Notice to Quit) a formal letter saying that a person who is renting a property will or must leave it after a particular period: A tenant may end a tenancy by issuing a valid notice to quit. Our template Notice to Quit is aimed at tenants who have owed you rent for at least 60 days.\nput sb on notice (that)\nto warn someone officially that something is going to happen, or could possibly happen: The facility was put on notice that its funding was in danger if improvements were not carried out.\nserve notice (that)\nLAW to tell someone officially that they must do something, or that something is going to happen: The highway authority is required to serve notice informing everyone who may be affected by the new route.\nSee also\nbankruptcy notice\ndeficiency notice\nmoney at call and short notice\nrenewal notice"}