{"id":249343,"name":"noun","type":"noun","us_sound":"naʊn","us_link":"../audio/n/noun.mp3","uk_sound":"naʊn","uk_link":"../audio/n/uknotif012.mp3","content":"Add to word list\nAdd to word list\nA2 a word that refers to a person, place, thing, event, substance, or quality: 'Doctor', 'coal', and 'beauty' are all nouns.\nMore examplesFewer examplesAn example of a countable noun is 'table', and an example of an uncountable noun is 'money'.In 'safety barrier', the noun 'safety' is being used as a modifier.In this dictionary the word 'noun' is represented by the letter n.Examples of proper nouns in English are Joseph, Vienna and the White House.'Family' and 'flock' are examples of collective nouns.\nSMART Vocabulary: related words and phrases\nLinguistics: parts of speech\nabstract noun\nadj\nadjectival\nadjectivally\nadjunct\nadv\nadverb\nadverbial\narticle\ncommon noun\nconcrete noun\nconj\nconjunction\nconnective\ncount noun\ncountable noun\npart of speech\nprep\npronoun\nrelative pronoun\nSee more results »\nGrammar\nNounsNouns are one of the four major word classes, along with verbs, adjectives and adverbs. Nouns are the largest word class. …\nTypes of nounsA noun refers to a person, animal or thing. Some examples are: …\nIdentifying nounsIt is not always possible to identify a noun by its form. However, some word endings can show that the word is probably a noun. …\nNouns: compound nounsSome nouns consist of more than one word. These are compound nouns. Compound nouns can be formed in different ways. The most common way is to put two nouns together (noun + noun); other common types are adjective + noun and verb + noun. …\nNouns: countable and uncountableSome nouns refer to things which, in English, are treated as separate items which can be counted. These are called countable nouns. Here are some examples: …\nCountable nounsSome nouns refer to things which, in English, are treated as separate items which can be counted. These are called countable nouns. Here are some examples: …\nUncountable nounsIn English grammar, some things are seen as a whole or mass. These are called uncountable nouns, because they cannot be separated or counted. …\nCountable and uncountable nouns with different meaningsSome nouns can be used either countably or uncountably, but with different meanings. …\nUncountable nouns used countablySometimes uncountable nouns are used countably, to mean ‘a measure of something’ or ‘a type or example of something’: …\nNouns: formNouns can be either singular or plural. Singular means just one of the person, animal or thing which the noun refers to. Plural means more than one. …\nSingular and plural nounsNouns can be either singular or plural. Singular means just one of the person, animal or thing which the noun refers to. Plural means more than one. …\nForming the plural of nounsThe rules for making the plural of nouns depend on the spelling and pronunciation. Most nouns form their plural by adding -s: …\nNouns: forming nouns from other wordsWe often form nouns from other parts of speech, most commonly from a verb or an adjective. We can then use the noun phrase instead of the verb or adjective to create a more formal style. We call this nominalisation: …\nNouns: singular and pluralSome nouns are used only in the singular, even though they end in -s. These include: the names of academic subjects such as classics, economics, mathematics/maths, physics; the physical activities gymnastics and aerobics; the diseases measles and mumps; and the word news: …\nNouns used only in the singularSome nouns are used only in the singular, even though they end in -s. These include: the names of academic subjects such as classics, economics, mathematics/maths, physics; the physical activities gymnastics and aerobics; the diseases measles and mumps; and the word news: …\nNouns used only in the pluralSome nouns only have a plural form. They cannot be used with numbers. They include the names of certain tools, instruments and articles of clothing which have two parts. …\nCollective nouns (group words)Some nouns refer to groups of people (e.g. audience, committee, government, team). These are sometimes called collective nouns. Some collective nouns can take a singular or plural verb, depending on whether they are considered as a single unit or as a collection of individuals: …\nNouns and genderMost English nouns do not have grammatical gender. Nouns referring to people do not have separate forms for men (male form) and women (female form). However, some nouns traditionally had different forms. Nowadays, people usually prefer more neutral forms. …\nNouns and prepositionsMany nouns have particular prepositions which normally follow them. Here are some common examples: …\nNoun phrasesA noun phrase consists of a noun or pronoun, which is called the head, and any dependent words before or after the head. Dependent words give specific information about the head. …\nNoun phrases: dependent wordsIn a noun phrase, dependent words before the head are either determiners (e.g. the, my, some) or premodifiers (e.g. adjectives). Dependent words after the head are either complements or postmodifiers. …\nNoun phrases: determiners (a, the, my, his, some, this, etc.)Determiners come first in a noun phrase (e.g. the big black car). They include: …\nNoun phrases: premodifiers (big, good, red)Premodifiers consist of single adjectives, adjective phrases, single nouns and noun phrases which are used before the head in a noun phrase. …\nNoun phrases: complementsComplements come immediately after the head in a noun phrase. They are prepositional phrases or clauses which are necessary to complete the meaning of the noun. Without the complement, we wouldn’t understand what the noun was referring to. …\nNoun phrases: postmodifiersPostmodifiers come after the head in a noun phrase. They consist of adverb phrases, prepositional phrases and clauses. Postmodifiers give extra or specific information about the noun (e.g. place, possession, identifying features). Unlike complements, they are not necessary to complete the meaning. …\nNoun phrases: complements or postmodifiers?Complements are necessary to complete the meaning of a noun. Postmodifiers are not necessary; they give extra information about the noun which helps to identify it or locate it in some way. (The complement and the postmodifier are underlined below.) …\nNoun phrases: orderBefore the head of a noun phrase, determiners come first, then adjectives, then nouns acting as modifiers. The spoken stress is normally on the head. …\nNoun phrases: usesWe most typically use noun phrases as the subjects (s) and objects (o) of clauses (io = indirect object; do = direct object): …\nNoun phrases: noun phrases and verbsNoun phrases can show person (first, second or third) and number (singular or plural). The person and number of the noun phrase which is the subject of a clause decides the person and number of the verb. This is called agreement. …\nNoun phrases: two noun phrases togetherWe can put two noun phrases (np) together to refer to the same person or thing. This is called apposition: …\nAdd to word list\nAdd to word list\ngrammar a word that refers to a person, place, thing, event, substance, or quality: \"Doctor,\" \"party,\" and \"beauty\" are nouns."}