{"id":249396,"name":"novel","type":"noun","us_sound":"ˈnɑː.vəl","us_link":"../audio/n/novel.mp3","uk_sound":"ˈnɒv.əl","uk_link":"../audio/n/uknotif020.mp3","content":"Add to word list\nAdd to word list\nB1 a long printed story about imaginary characters and events: a paperback novel historical/romantic novels Have you read any of Jane Austen's novels? His latest novel is selling really well.\nMore examplesFewer examplesShe churns out a new bestselling novel every year.Have you ever read Fielding's classic novel \"Tom Jones\"?This passage of text has been excerpted from her latest novel.She has amassed a huge fortune from her novels.The characters in his novels tend to be rather one-dimensional.\nSMART Vocabulary: related words and phrases\nBooks: kinds of books\nabridgment\nannual\nanthology\naudiobook\nbacklist\ndigest\ndime novel\ne-reader\neasy read\nexercise book\nmulti-volume\nmust-read\nnovelette\nnovelistic\nnovelistically\ntrilogy\nvade mecum\nworkbook\nya\nyoung adult\nSee more results »\nnew and original, not like anything seen before: a novel idea/suggestion Keeping a sheep in the garden is a novel way of keeping the grass short!\nThesaurus: synonyms, antonyms, and examples\nrecently appeared, arrived, or developednewI bought a new suit for my interview.brand newThe company unveiled a brand new product this week.novelThat's a novel way of approaching the problem.novelThe bank has introduced a novel way of detecting fraud.innovativeThe project uses innovative ideas for recycling.\nSee more results »\nmedical\n&#160; specialized used to refer to a new strain (= type) of a virus that has not been seen before: The COVID-19 pathogen is a novel coronavirus. A novel virus in swine is closely related to the human hepatitis E virus.\nSMART Vocabulary: related words and phrases\nNew\nafresh\nbe ahead of the curve idiom\nbox-fresh\nbrand new\nink\ninnovative\ninnovatively\nlatest\nnewborn\nnewness\nnext-gen\nnext-generation\nnovelty\noriginal\noriginality\nthe avant-garde\nthe ink is not dry/still wet idiom\nunprecedented\nup-to-the-minute idiom\nyouth\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBacteria, moulds, germs & viruses\nnovel noun [C]\n(BOOK)\nAdd to word list\nAdd to word list\nliterature a long, printed story about imaginary characters and events: literary/romance novels\nnovel adjective\n(NEW)\nnew and original; not like anything seen before: a novel idea/suggestion"}