{"id":249493,"name":"now","type":"adverb","us_sound":"naʊ","us_link":"../audio/n/now.mp3","uk_sound":"naʊ","uk_link":"../audio/n/uknotif030.mp3","content":"now adverb\n(AT PRESENT)\nAdd to word list\nAdd to word list\nA1 at the present time, not in the past or future: She used to be a teacher, but now she works in publishing. I may eat something later, but I'm not hungry now. Many people now own a smartphone.\nA2 immediately: I don't want to wait until tomorrow, I want it now!\nThesaurus: synonyms, antonyms, and examples\nwithout delay or waitingimmediatelyPlease report to the office immediately.nowI need you to get me that report now. right nowYou put that back right now.right awayIf you're going to call the doctor, you'd better do it right away - the office is closing in two minutes.straight awayI called them back straight away.\nSee more results »\nB2 used to express how long something has been happening, from when it began to the present time: She's been a vegetarian for ten years now.\nused in stories or reports of past events to describe a new situation or event: It was getting dark now, and we were tired.\nused when describing a situation that is the result of what someone just said or did: Oh yes, now I know who you mean. any minute/moment/second/time now\nB2 very soon: The guests are coming any minute now, and the house is still a mess.\nSee more now for ... informal\nused to introduce a new subject: And now for what we're going to do tomorrow.\nSee more\nMore examplesFewer examplesBoth her children are now married with children of their own.After ten years of military dictatorship, the country now has a civil government.The breathing problem has now been complicated by a chest infection.The college now has a counsellor to help students with both personal and work problems.His marks in English have been below average for some time now.\nSMART Vocabulary: related words and phrases\nNow\ncarpe diem\ncontemporaneity\ncontemporarily\ncontemporary\ncurrent\ncurrently\neven\nhereupon\nimmediate\nin this day and age idiom\nminute\nmodern-day\nmoment\npresently\nstate\nstill\nthe status quo\nthere's no time like the present idiom\nthis minute idiom\ntoday\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUntil a particular moment\nLinguistics: connecting words joining words or phrases with similar or related meanings\nnow adverb\n(IN SPEECH)\nused in statements and questions to introduce or give emphasis to what you are saying: Now, where did I put my hat? There was a knock at the door. Now Jan knew her mother had promised to come by, so she assumed it was her. Hurry, now, or you'll miss the bus! Sorry, I can't today. Now if you'd asked me yesterday, I would have said yes.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words joining words or phrases with similar or related meanings\nand/or phrase\nanyhoo\nanyhow\nanyways\nconcatenate\nconjunctive\nconjunctively\nergo\nhereby\nI mean idiom\nless\nmean\nslash\nso\nthe thing is idiom\nthere\ntherefore\nthing\nwhat\nwith that idiom\nSee more results »\nGrammar\nNow for emphasisWe sometimes use now to make a command or order stronger. We use it before or after imperative clauses: …\nNow (that)We can use now that as a conjunction to refer to something and its result(s): …\nNowWe use now most commonly as an adverb of time. It means ‘at the present time’, ‘at this moment’ or ‘very soon’. We usually put now with this meaning in end position: …\nNow as an adverb of timeWe use now most commonly as an adverb of time. It means ‘at the present time’, ‘at this moment’ or ‘very soon’. We usually put now with this meaning in end position: …\nNow as a discourse markerWe use now in speaking to signal something new, particularly when giving instructions or introducing a new idea or topic. We often use it with other similar markers such as right or OK: …\nIdioms\nit's now or never\n(every) now and then/again\nnow then\nnow you're talking\nnow, now\nthe present moment or time: Now isn't a good time to speak to him. I thought you'd be finished by now. You should have mentioned it before now. That's all for now (= until a future point in time). from now on (also UK as from now)\nfrom this moment and always in the future: From now on the gates will be locked at midnight.\nSee more\nMore examplesFewer examplesNow would be a good time to prepare the lunch.Why didn't you tell me before now?I thought you'd have got over it by now.Now really isn't a good time to talk to her.Is now a convenient time to meet?\nSMART Vocabulary: related words and phrases\nNow\ncarpe diem\ncontemporaneity\ncontemporarily\ncontemporary\ncurrent\ncurrently\neven\nhereupon\nimmediate\nin this day and age idiom\nminute\nmodern-day\nmoment\npresently\nstate\nstill\nthe status quo\nthere's no time like the present idiom\nthis minute idiom\ntoday\nSee more results »\nnow (that)...\nB2 used to give an explanation of a new situation: Now I have my car, I don't get as much exercise as I used to.\nSee more Grammar\nNow for emphasisWe sometimes use now to make a command or order stronger. We use it before or after imperative clauses: …\nNow (that)We can use now that as a conjunction to refer to something and its result(s): …\nNowWe use now most commonly as an adverb of time. It means ‘at the present time’, ‘at this moment’ or ‘very soon’. We usually put now with this meaning in end position: …\nNow as an adverb of timeWe use now most commonly as an adverb of time. It means ‘at the present time’, ‘at this moment’ or ‘very soon’. We usually put now with this meaning in end position: …\nNow as a discourse markerWe use now in speaking to signal something new, particularly when giving instructions or introducing a new idea or topic. We often use it with other similar markers such as right or OK: …\ninformal fashionable and popular at the present time: Posh decorative glass is very now. Name changes are so now, with several stores keen to acquire a new image this way.\nMore examplesFewer examplesWe love the fresh (and very now) green-and-white colour combination.Cava is the new Chardonnay. Because bubbles are so now.The new movie Cinderella is set in the very now realm of LA's San Fernando Valley.\nSMART Vocabulary: related words and phrases\nModern & fashionable\nbe (all) the rage idiom\nbe having a moment idiom\nbe the last word in something idiom\nfoppishly\nfunky\nfuturistic\nfuturistically\nget with the programme idiom\npeacock\nshabby chic\nsleekly\nsleekness\nsmartly\nthe avant-garde\nultra-modern\nultra-progressive\nultra-slick\nultra-sophisticated\nup to date\nà la mode\nSee more results »\nnow adverb [not gradable]\n(AT PRESENT)\nAdd to word list\nAdd to word list\nat the present time rather than in the past or future, or immediately: She used to work in an office, but now she works at home. It’s now 7 o’clock, time to get up or you’ll be late for work.\nJust now means either a very short time ago or at the present time: I can’t stop to talk just now, but give me a call when you get home.\nnow adverb [not gradable]\n(IN SPEECH)\nused in statements and questions to introduce or give emphasis to what you are saying: Now where was I before you interrupted me? Idiom\n(every) now and then\nnow noun [U]\n(AT PRESENT)\nthe present moment or time: That’s all for now (= until a future point in time). From now on (= Starting at this moment and continuing in the future), the front door will be locked at midnight."}