{"id":249603,"name":"nuclear","type":"adjective","us_sound":"ˈnuː.kliː.ɚ","us_link":"../audio/n/nuclear.mp3","uk_sound":"ˈnjuː.klɪər","uk_link":"../audio/n/uknowac015.mp3","content":"nuclear adjective\n(POWER)\nAdd to word list\nAdd to word list\nB2 being or using the power produced when the nucleus of an atom is divided or joined to another nucleus: nuclear energy/power a nuclear power plant the nuclear industry\nB2 relating to weapons, or the use of weapons, which use the power produced when the nucleus of an atom is divided or joined to another nucleus: a nuclear war/attack nuclear disarmament How many nations have a nuclear capability (= have nuclear weapons)?\nMore examplesFewer examplesShe is known chiefly for her commitment to nuclear disarmament.It would cost $300 million to decommission the nuclear installation.There are hundreds of nuclear missiles aimed at the main cities.The government is having difficulty finding a safe depository for nuclear waste.The abandonment of the island followed nuclear tests in the area.\nSMART Vocabulary: related words and phrases\nFuels\nbioethanol\nbiofuelled\nbiomaterial\nbriquette\ncharcoal\nCHP\ncoal\ncoalification\ncogeneration\nfuel\ngasometer\nguzzle\nhickory chips\nmesquite\nnon-fuel\nnon-petroleum\nnuclear power\noil-fired\npropellant\nsolar panel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArms & munitions in general\nnuclear adjective\n(PHYSICS)\nphysics\n&#160; specialized relating to the nucleus of an atom: nuclear fission/fusion/physics\nSMART Vocabulary: related words and phrases\nPhysics: atoms, molecules & sub-atomic particles\nacceptor\nanti-radical\nantilepton\nantimatter\nantineutrino\nbeta decay\nbeta particle\nHiggs boson\nhydroxyl ion\ninteratomic\ninterelectronic\ninterionic\nintermolecular\nmonatomic\nmulti-molecular\nmultiparticle\nmuon\nneutrino\npositron\nrelative atomic mass\nSee more results »\nnuclear adjective\n(OF ATOMS)\nAdd to word list\nAdd to word list\n[ not gradable ]\n&#160; physics us\nYour browser doesn't support HTML5 audio\n/ˈnu·kli·ər/ of or relating to a process by which the nucleus (= central part) of an atom is divided or joined to another nucleus, resulting in the release of energy\n[ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈnu·kli·ər/ relating to weapons, or the use of weapons, in which an atom is divided or joined to another nucleus to release energy in a destructive way: nuclear war nuclear disarmament (= giving up or removing a country’s nuclear weapons)\nnuclear adjective\n(OF CELLS)\n[ not gradable ]\n&#160; biology us/ˈnu·kli·ər/ of or relating to the nucleus of a cell\nAdd to word list\nAdd to word list\nENVIRONMENT, NATURAL RESOURCES, PRODUCTION relating to the power produced when the central part of an atom is divided or joined to another one: nuclear energy/power/fuel The country had agreed to disable its main nuclear fuel production plant by the end of the year. the nuclear industry a nuclear plant/facility\nrelating to weapons that use nuclear energy: a nuclear bomb/deterrent/war"}