{"id":249699,"name":"nudged","type":"verb","us_sound":"nʌdʒ","us_link":"../audio/n/nudge.mp3","uk_sound":"nʌdʒ","uk_link":"../audio/n/uknowac021.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nnudge\nnudge verb\n(TOUCH)\n[ T ] to push something or someone gently, especially to push someone with your elbow (= the middle part of your arm where it bends) to attract the person's attention: The children were giggling and nudging each other. He nudged the cat off the sofa so that he could sit down.\n[ I + adv/prep, T ] to move slowly and almost reach a higher point or level: Oil prices continue to nudge higher. Peter must be nudging 40 now.\nSMART Vocabulary: related words and phrases\nPushing and shoving\nbat\nbat something/someone away\nbring\nbring someone down\nbundle\ncounter-thrust\ndig\nelbow\ngoad\npoke\npoke/dig someone in the ribs idiom\nprod\npropel\npush off\nrib\nshoulder\nthrust\nupend\nupset\nwrangle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTouching & feeling\nSlow and moving slowly\nnudge verb\n(PERSUADE)\n[ T ] to encourage or persuade someone to do something in a way that is gentle rather than forceful or direct: He cleverly nudges us towards the conclusion he himself has reached. Do you find your parents nudging you in the direction of further study?\nMore examplesFewer examplesIf you have an always-late friend, nudge him with a phone call an hour before the party.Nudged by an inner voice, I called the transplant center and embarked on a series of tests to determine my suitability as a donor.He nudged his girlfriend towards the stage.Even a little discontent with your partner can nudge you to look around for someone else.\nSMART Vocabulary: related words and phrases\nEncouraging and urging on\nabet\nbarrack for someone\nbread\nbring\nbring someone out\nget out of here! idiom\ngo on\ngood/great/lovely stuff! idiom\ngoose\nhearteningly\nmentor\npave\npave the way idiom\npep talk\npermit\nprepare\nspur\nstimulus\nstoke\nurge\nSee more results »\nIdiom\nnudge nudge (wink wink)"}