{"id":249698,"name":"nudge","type":"verb","us_sound":"nʌdʒ","us_link":"../audio/n/nudge.mp3","uk_sound":"nʌdʒ","uk_link":"../audio/n/uknowac021.mp3","content":"nudge verb\n(TOUCH)\nAdd to word list\nAdd to word list\n[ T ] to push something or someone gently, especially to push someone with your elbow (= the middle part of your arm where it bends) to attract the person's attention: The children were giggling and nudging each other. He nudged the cat off the sofa so that he could sit down.\n[ I + adv/prep, T ] to move slowly and almost reach a higher point or level: Oil prices continue to nudge higher. Peter must be nudging 40 now.\nSMART Vocabulary: related words and phrases\nPushing and shoving\nbat\nbat something/someone away\nbring\nbring someone down\nbundle\ncounter-thrust\ndig\nelbow\ngoad\npoke\npoke/dig someone in the ribs idiom\nprod\npropel\npush\npush off\nrib\nshoulder\nupend\nupset\nwrangle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTouching & feeling\nSlow and moving slowly\nnudge verb\n(PERSUADE)\n[ T ] to encourage or persuade someone to do something in a way that is gentle rather than forceful or direct: He cleverly nudges us towards the conclusion he himself has reached. Do you find your parents nudging you in the direction of further study?\nMore examplesFewer examplesIf you have an always-late friend, nudge him with a phone call an hour before the party.Nudged by an inner voice, I called the transplant center and embarked on a series of tests to determine my suitability as a donor.He nudged his girlfriend towards the stage.Even a little discontent with your partner can nudge you to look around for someone else.\nSMART Vocabulary: related words and phrases\nEncouraging and urging on\nabet\nbarrack for someone\nbread\nbring\nbring someone out\ncheer\nget out of here! idiom\ngo on\ngood/great/lovely stuff! idiom\ngoose\nhearteningly\nmentor\npave\npave the way idiom\npep talk\npermit\nprepare\nspur\nstimulus\nurge\nSee more results »\nIdiom\nnudge nudge (wink wink)\nnudge noun [C]\n(PUSH)\nthe act of pushing someone or something gently: I gave him a nudge to wake him up.\nSMART Vocabulary: related words and phrases\nPushing and shoving\nbat\nbat something/someone away\nbring\nbring someone down\nbundle\ncounter-thrust\ndig\nelbow\ngoad\npoke\npoke/dig someone in the ribs idiom\nprod\npropel\npush\npush off\nrib\nshoulder\nupend\nupset\nwrangle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTouching & feeling\nnudge noun [C]\n(ENCOURAGEMENT)\nsomething that encourages or persuades someone to do something in a gentle way, or the act of doing this: Her words gave me the nudge I needed to learn to bake. This incentive was a nudge in the right direction.\nMore examplesFewer examplesCould a small nudge help people make the right decision?The Prime Minister believed in the \"nudge\" - the theory that politicians should seek to influence, rather than simply dictate, behaviour.He's a little shy, but with a nudge he will share some wonderful stories.\nSMART Vocabulary: related words and phrases\nEncouraging and urging on\nabet\nbarrack for someone\nbread\nbring\nbring someone out\ncheer\nget out of here! idiom\ngo on\ngood/great/lovely stuff! idiom\ngoose\nhearteningly\nmentor\npave\npave the way idiom\npep talk\npermit\nprepare\nspur\nstimulus\nurge\nSee more results »\nAdd to word list\nAdd to word list\nto push someone or something gently, sometimes to get someone’s attention: My wife nudged me to tell me to get off the phone so that she could use it. nudge noun [ C ] us\nYour browser doesn't support HTML5 audio\n/nʌdʒ/\nI gave him a nudge to wake him up.\nAdd to word list\nAdd to word list\n[ I or T ] to move by a small amount in a particular direction, especially up, or make something do this: Shares in the company nudged higher while its competitors' shares fell.nudge up Interest rates are gently nudging up.nudge sth up The Federal Reserve began nudging interest rates up.nudge (sth) down The credit card nudged down the APR of loans taken out online from 6.1% to 5.9%.\n[ T ] to be close to reaching a particular price or level: With crude nudging $72 a barrel, the price of unleaded was once again the subject of concern. Inflation is nudging 10%.\na slight change in the value or level of something, usually an increase: give sth/get a nudge Before long medical costs will get another upward nudge as the number of older people in rich countries rises.give a nudge to sth News that retail sales rose more than most had expected gave a nudge to a number of retail stocks.\na small action that encourages something to happen: Gold reacts to the smallest nudge of the US dollar."}