{"id":249748,"name":"nuisance","type":"noun","us_sound":"ˈnuː.səns","us_link":"../audio/n/nuisance.mp3","uk_sound":"ˈnjuː.səns","uk_link":"../audio/n/uknowac027.mp3","content":"Add to word list\nAdd to word list\nB2 something or someone that annoys you or causes trouble for you: I've forgotten my umbrella - what a nuisance! [ + -ing verb ] It's such a nuisance having to rewrite those letters. I hate to be a nuisance, but could you help me? Local residents claimed that the noise was causing a public nuisance. Synonyms\nannoyance\nbore (ANNOYING) informal\nbother (ANNOYING) UK\ninconvenience\nirritant (MAKING ANGRY)\na pain (in the neck) informal\npest informal\nThesaurus: synonyms, antonyms, and examples\nsomeone or something that annoys youannoyanceThe café was cash only, which was a minor annoyance as I only had my credit card with me. nuisanceIt's a nuisance to have to drive to the nearest shop.inconvenienceThank you for holding - we apologize for the inconvenience.irritationThe CEO's poor communication skills became a source of irritation to the company's investors.irritantThe noise of the building work is a constant irritant.boreIt's such a bore to have to pack everything up again.\nSee more results »\nmake a nuisance of yourself\nto cause trouble or to annoy other people: The officer reported that he was obviously very drunk and making a nuisance of himself.\nSee more\nMore examplesFewer examplesIt's a cursed nuisance, having to work late every evening!\"Was he a nuisance?\" \"No, not at all.\"Far from being a nuisance, she was a positive joy to have around.Peaceful demonstrations that do not cause a public nuisance are a fundamental right in any truly democratic country.She's a terrible nuisance.\nSMART Vocabulary: related words and phrases\nInconvenience\naggravation\naggro\nawkward\nbore\nbother\nbulky\ndisturbance\ndrag\nfag\nhave fun and games idiom\nimposition\ninconvenience\ninconvenient\ninconveniently\npisser\nput something out\nrigamarole\nrigmarole\nsnag\ntempest\nSee more results »\nAdd to word list\nAdd to word list\nsomething or someone that annoys you or causes trouble for you: It’s a nuisance filling out all these forms.\nAdd to word list\nAdd to word list\nLAW someone or something that causes a problem for other people, an area, etc. that may be able to be solved by the law: Residents claim that the company's emissions are harmful and constitute a nuisance.noise/odour/public nuisance The EPA says the landfill is a public nuisance because of the odors."}