{"id":249756,"name":"null","type":"adjective","us_sound":"nʌl","us_link":"../audio/n/cdo1121usnull3124.mp3","uk_sound":"nʌl","uk_link":"../audio/n/cdo1121uknull3286.mp3","content":"Add to word list\nAdd to word list\nhaving no legal force: The 1944 contract has since been declared null and void. About 200 marriages in the diocese were declared null last year. Buyout terms become null if the company has not broken ground for a new stadium by July 1. Synonym\ninvalid\nwith no value or effect: Will these null findings change anyone's opinion of ESP? Four decades of a null result should tell us something about the hypothesis that there are intelligent civilizations in space.\nmathematics\n&#160; specialized (of a set or matrix) containing nothing or containing only zeros: A matrix having all its elements zero is said to be null and is written 0. Failed searches are defined as null set results.\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\ndiminished responsibility\nextrajudicial\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\npower of attorney\nprecedent\npretrial\nprobate\nprovide\nthe Webster ruling\nwitness to something\nwobbler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSomething, anything, nothing, and everything\nNumbers: groups of things according to number\nan empty value or a zero: Flags may be used to prevent nulls by bringing attention to the absence of a value in a table. He took down the lengthy list of produce prices and eradicated the zeros or \"nulls\".\nSMART Vocabulary: related words and phrases\nNumbers: cardinal, including nought & zero\nB, b\nbi\ncipher\ndeca-\nduodecillion\nfifteen\nfive\nforty\ngoogol\njillion\nkazillion\nnaught\nnineteen\nninety\nsix\nsixty\nten\nthirty\ntwelve\nunit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNumbers: groups of things according to number\nto remove the effect of one thing by doing another thing that has the opposite effect: Used in very small quantities, the digestive aid nulls this effect and adds a wonderful aroma to the vegetables. The deflection of the gyro spin axis is detected and nulled by the stabilization loops. Synonym\ncancel something out\nSMART Vocabulary: related words and phrases\nDestroying and demolishing\nannihilate\nannihilation\napocalypse\nbash\nbash through (something)\nbe sacrificed on the altar of something idiom\nerosionally\nerosive\nextirpate\nextirpation\nfall in\nsacking\nsacrifice\nscarred\nself-destruct\nself-devouring\nshred\nsink\ntear\nwipe\nSee more results »\nAdd to word list\nAdd to word list\nMEASURES having a value of zero: Browser performance was improved by analysing failed searches which return null set results.\nLAW →\nnull and void : They asked the supreme court to declare their sentences null and seek compensation."}