{"id":249809,"name":"number","type":"noun","us_sound":"ˈnʌm.bɚ","us_link":"../audio/n/number.mp3","uk_sound":"ˈnʌm.bər","uk_link":"../audio/n/uknumbe001.mp3","content":"number noun\n(SYMBOL)\nAdd to word list\nAdd to word list\nA1 [ C ] (a sign or symbol representing) a unit that forms part of the system of counting and calculating: 25, 300, and a billion are all numbers. She's very good with numbers (= good at adding, subtracting, etc.).\nA1 [ C ] (written abbreviation no.) a number that is used to mark a particular example of something: They live at number 34 Orchard Street. Please write your credit card number on this form. What's our flight number?\nA1 [ C ] (written abbreviation no.) a phone number: I gave him my number.\nMore examplesFewer examplesIt's been number one in the charts for six weeks.Is he contactable at his home number?Think of a number and divide it by two.What is the number on the jar?The document number is in the top left-hand corner.\nSMART Vocabulary: related words and phrases\nNumbers generally\nbinary number\nC, c\ncardinal\ncontextual variable\ncontinuous variable\ncontrol variable\ncrore\nD, d\ndigit\nlakh\nlog\nmillion\nmode\nnos.\nordinate\noutcome variable\nplace value\nprimality\nquantitatively\nwhole number\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunications - by telephone\nnumber noun\n(AMOUNT)\nB1 [ S, + sing/pl verb ] an amount or total: The number of people killed in traffic accidents fell last month. There has been an increasing number of cases of the disease. A small number of children are educated at home. A large number of invitations has been sent. Letters of complaint were surprisingly few in number (= there were not many of them). numbers [ plural ]\na number of a particular description: Small numbers of children are educated at home. Large numbers of invitations were sent. Newspapers are produced in vast numbers. a number of things\nB2 several of a particular type of thing: I decided not to go, for a number of reasons.\n[ S, + sing/pl verb ] a group of people: On the trip, one of our number fell ill.\nMore examplesFewer examplesThe last ten years have seen a dramatic fall in the number of adoptions.The number of people claiming unemployment benefit has risen sharply this month.It was an unpopular policy and caused a number of conflicts within the party.The number of business failures rose steeply last year.The mud flats attract large numbers of birds.\nSMART Vocabulary: related words and phrases\nGeneral words for size and amount\n-sized\namount\nbulk\ncontent\nelement\nextent\nfootprint\ngood things come in small packages idiom\nhaul\nlevel\nlot\nmeasure\nmuch\norder\npercent\nquantity\nquota\nration\nsmall-scale\nstrong\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGroups of people\nnumber noun\n(PARTICULAR THING)\n[ C ] a particular copy of a magazine: Do you have last week's number of the New Yorker? He's got all the back numbers (= previous copies) of the magazine.\n[ C ] informal a piece of clothing, especially a dress, that you admire: She was wearing a stylish Dior number.\n[ C ] US slang a person with a particular characteristic: He's a real sexy number, don't you think?\n[ C ] a short tune or song: Sing one of those romantic numbers.\n[ C usually singular ] mainly US informal something that is often said: He tried the usual/that old number about how his wife didn't understand him.\nSMART Vocabulary: related words and phrases\nNewspapers & magazines\nabove/below the fold idiom\nannal\nanti-press\nback copy\nbroadsheet\ncirculation\ncomic\neditorial\nfold\nglossy magazine\nhouse journal\nhouse organ\njournal\nlad mag\norgan\nrag\nsentinel\nserialize\nSunday paper\nsupermarket tabloid\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClothing - general words\nPeople in general\nSinging\nMusical pieces\nInformal talking & conversation\nGrammar\nNumberWhen we use the word number, we refer to specific numbers: …\nNumbers: first, second, thirdNumbers such as first, second, third are ordinal numbers. We use them to put things in an order. We most commonly use ordinal numbers as determiners. When we use ordinal numbers as determiners (before nouns), we commonly use other determiners such as articles (a/an, the) and possessives (my, your) in front of them: …\nNumbers: one, two, threeNumbers such as one, five, eleven, two hundred are cardinal numbers. We most commonly use cardinal numbers as determiners (before nouns). When we use them in this way, we can use other determiners such as articles (a/an, the) and possessives (my, your) in front of them. We can use cardinal numbers + of before determiners (one of my friends): …\nAmount of, number of or quantity of?We use amount of with uncountable nouns. Number of is used with countable nouns: …\nAmount of or number of?We use amount of with uncountable nouns. Number of is used with countable nouns: …\nA quantity of or quantities of?Quantity is more formal than amount or number. A quantity of or quantities of can be followed by a countable noun or an uncountable noun. They are most commonly used with an adjective such as huge, big, large, small: …\nIdioms\nany number of things\nbeyond/without number\nby (sheer) force/weight of numbers\nby numbers\ndo a number on someone\nhave someone's number\nyour number is up\na numbers game\nnumber verb\n(WRITE SYMBOL)\nC1 [ T ] to give something a number in a series and usually to write this number on it: All the folders have been carefully numbered and filed away. Number the pages from one to ten.\nSMART Vocabulary: related words and phrases\nNumbering & counting\nabsolute value\nbinary\ncensus\ncount something out\ncountdown\ndecimal\ndecimal fraction\ndecimalization\ndecimally\ndendrochronology\ninnumeracy\nmodulus\nnumber line\nnumeration\nnumerical\nnumerically\ntot\ntot something up\nundercount\nunduplicated\nSee more results »\nnumber verb\n(AMOUNT)\nC2 [ L only + noun ] If people or things number a particular amount, there are this many of them: After the hurricane the homeless numbered over 200,000.\nSMART Vocabulary: related words and phrases\nCalculations & calculating\nalgebraic\nalgebraically\nalgo\nalgorithmic\namount\ncalculate\nguesstimate\ninterpolate\ninverse function\nlinear equation\nmathematical\nmatrix\nmiscalculate\nmiscalculation\nmiscount\nmultigrid\noperator\nsum\nsum total\nwork something out\nSee more results »\nPhrasal verb\nnumber someone/something among someone/something\nnumber noun\n(SYMBOL)\nAdd to word list\nAdd to word list\n[ C ] us\nYour browser doesn't support HTML5 audio\n/ˈnʌm·bər/ plural nos. (abbreviation no.) a unit or its symbol that forms part of a system of counting and calculating, and that represents an amount or position in a series: You can write numbers in words, such as six, seven, and eight, or with symbols, such as 6, 7, and 8.\n[ C ] us\nYour browser doesn't support HTML5 audio\n/ˈnʌm·bər/ plural nos. (abbreviation no.) A number is also a specific set of symbols in a particular order that represent someone or something: Please write down your Social Security number.\n[ C ] us\nYour browser doesn't support HTML5 audio\n/ˈnʌm·bər/ plural nos. (abbreviation no.) A number can also be a position in a series: We’re up to 10 – who has the next number?\nnumber noun\n(AMOUNT)\n[ C/U ] us\nYour browser doesn't support HTML5 audio\n/ˈnʌm·bər/ an amount or total: [ C ] A large number of tickets were sold almost immediately. [ C ] Large numbers of people (= A lot of people) crowded the streets. [ U ] Quite a number of (= Many) cases of the flu have been reported already.\n[ C/U ] us\nYour browser doesn't support HTML5 audio\n/ˈnʌm·bər/ A number of things is several of them: [ U ] There were a number of causes for the accident.\n[ C/U ] us\nYour browser doesn't support HTML5 audio\n/ˈnʌm·bər/ Any number of things is a lot of them: [ U ] He’d already heard any number of excuses.\nnumber noun\n(GRAMMAR)\n[ U ]\n&#160; grammar us/ˈnʌm·bər/ the forms of words, esp. nouns, pronouns, and verbs, that show whether they are singular or plural\nnumber noun\n(SONG)\n[ C ] us\nYour browser doesn't support HTML5 audio\n/ˈnʌm·bər/ a song, dance, or other part in a performance: The last number she sang was a beautiful, slow ballad. Idiom\nsomeone's number is up\nnumber verb\n(GIVE A NUMBER)\n[ T ] to give a different number to each of two or more things, esp. in a particular order: The software automatically numbers the footnotes.\nnumber verb\n(TOTAL)\n[ L ] to be (a total): The crowd numbered over 100,000.\nAdd to word list\nAdd to word list\n[ C ] a set of numbers that marks a particular person or thing as separate from others of the same type: account/invoice/order number Include your account number and the name of the fund in which you want to invest.contact/telephone/mobile number Please leave a contact number. a credit card/registration/identification number\n[ C ] an amount of people or things: the number of sth The number of employees taking legal action over work-related disease is increasing.a growing/increasing/declining number Regulators are seeing a growing number of stock frauds directed at small investors.the maximum/minimum/total number The total number of people in employment has increased by more than 234,000 (16.1%). a large/record number a small/limited number\na number of things/reasons/people, etc.\nseveral things, reasons, people, etc.: There are a number of factors currently influencing stock-price fluctuations.\nnumbers [ plural ]\nFINANCE the information in a company's accounts that shows its financial results and position: Citigroup described the supermarket's numbers as strong and solid.\nused to talk about how many people are involved in something: customer/passenger/staff numbers Passenger numbers increased 11.3% in the period.\nmake the numbers\nto achieve the expected results, expressed in numbers: The company culture drove employees to make the numbers without much concern for how they did it.\nrun the numbers\nFINANCE to examine the details of a particular financial situation, usually in order to make a decision about it: She ran the numbers on her mortgage and realized that refinancing was the right thing to do.\nCompare\nfigureSee also\nbank identification number\nbox number\nDUNS number\nopposite number\nPIN\nrouting number\nserial number\nSocial Security Number\n[ T ] to give something a number in a series: Documents filed under the Act must be numbered.\n[ I or T ] if people or things number 100, 1 million, etc., there are that number of them: At its peak, the workforce involved in building the new airport terminal numbered 50,000.number in the hundreds/thousands/millions, etc. Their fan base numbers in the tens of millions worldwide."}