{"id":250046,"name":"nut","type":"noun","us_sound":"nʌt","us_link":"../audio/n/nut.mp3","uk_sound":"nʌt","uk_link":"../audio/n/uknumbe023.mp3","content":"nut noun\n(FOOD)\nAdd to word list\nAdd to word list\nB2 [ C ] the dry fruit of particular trees that grows in a hard shell and can often be eaten: a Brazil/cashew nut Sprinkle some roasted chopped nuts on top.\nMore examplesFewer examplesHe cracked (open) the nuts with his hands.\"I'm allergic to nuts.\" \"So is my brother.\"Squirrels store (up) nuts for the winter.Vegans get all the protein they need from nuts, seeds, beans and cereals.These nuts are addictive - I can't stop eating them.\nSMART Vocabulary: related words and phrases\nFruits & seeds & their parts\nackee\naronia\nbarberry\nbergamot\nbur\ncaryopsis\nchaff\ncone\nflesh\npeel\npine nut\npip\npith\npoppy seed\nseed coat\nseed pod\nseedless\nsesame seed\nshea nut\nwindfall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of edible nut\nnut noun\n(METAL OBJECT)\n[ C ] a small piece of metal with a hole in it through which you put a bolt: Nuts and bolts are used to hold pieces of machinery together.\nSabirBabayev/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nNuts, bolts & screws\nbolt\nhobnail\nnail\nrivet\nscrew\nthread\nwing nut\nnut noun\n(PERSON)\n[ C ] offensive, informal an offensive word for a person who has a mental illness\n[ C ] informal a person who behaves in a very silly, stupid, or strange way: What kind of nut would leave a car on a railway track?\n[ C ] informal someone who is extremely enthusiastic about a particular activity or thing: James is a tennis nut - he plays every day. See also\nnuts adjective informal\nMore examplesFewer examplesHe's a nut, he's a crazy guy.Some people may look at me and think I'm a nut to live in such a tiny apartment.I work out seven days a week. I'm a nut.You don't have to be a car nut to care what you drive.\nSMART Vocabulary: related words and phrases\nStupid and silly people\nairhead\nberk\nbirdbrain\nblithering idiot\nblockhead\ndullard\ndumb-ass\ndummy\ndunce\ndunderhead\nmuppet\nmutt\nneed\nneed your head examined idiom\nnimrod\nsimpleton\nstupid\nthicko\ntosser\ntroglodyte\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnthusiasts\nnut noun\n(HEAD)\n[ C ] UK slang a person's head: Come on, use your nut (= think clearly)!\nSMART Vocabulary: related words and phrases\nThe head\nacephalous\nbasilar\nbean\nbonce\nbrachiocephalic\ncranium\ncrown\nheaded\nheadless\nmicrocephaly\nmulti-headed\nnoddle\noccipitalis\nocciput\npate\nscalene\nscalenes\nscalp\nskull\ntonsure\nSee more results »\nnut noun\n(MONEY)\n[ U ] US informal the amount of money necessary to operate a business or cover your costs: With two houses, three cars and child-support payments, he just couldn't meet his nut, even with a second job.\nSMART Vocabulary: related words and phrases\nAmounts of money\nappropriation\nbank\nbounty\nbuck\ncapital\ncircumstance\ncoin\nfisc\nfloat\nholdback\nliving wage\nmeans\nmoney supply\npayout\npool\nsub\nsum\ntrough\nwherewithal\nyour daily bread idiom\nSee more results »\nnut noun\n(MUSIC)\n[ C ]\n&#160; music\n&#160; specialized a small, raised piece of hard material at the top of the neck of a musical instrument such as a guitar or a violin that the strings pass over : The top two strings have been left a little high at the nut. At the nut of the bass, the neck is quite wide, with wide string spacing.\n[ C ]\n&#160; music\n&#160; specialized the bottom part of a bow (= a long, thin piece of wood with hair from the tail of a horse stretched along it, used to play musical instruments that have strings) : A violin is usually played using a bow consisting of a stick with a ribbon of horsehair strung between the tip and nut at opposite ends. Synonym\nfrog\nMore examplesFewer examplesIf you strum an open G chord, you'll hear a strange ringing noise, which is the G string vibrating behind the nut.I had to replace the nuts on both guitars because the slots were wide enough to fit two strings in each.The G should be played throughout with short bows near the nut.The strings were about an inch off the fingerboard, but I slowly started filing down the nut until I ended up with a lower action.\nSMART Vocabulary: related words and phrases\nMusical instruments\naccordion\nacoustically\naerophone\nalphorn\nalto\ndrum kit\ndrum machine\ndrumbeat\ndrumhead\ndrumroll\npanpipes\npedal steel\npenny whistle\npercussion\npercussionist\ntuning fork\ntuning peg\nukulele\nunpitched\nunplugged\nSee more results »\nIdioms\nbe off your nut\ndo your nut\na hard/tough nut to crack\nthe nuts and bolts\na tough/hard nut\nto hit someone or something with your head: The guy turned round and nutted him.\nSMART Vocabulary: related words and phrases\nHitting and beating\nat-risk\nbang away\nbang someone up\nbasher\nbashing\nbunch\nbutt\nfetch\ngut punch\nhead-butt\nhell\nkick\nmess\nswing\nswing at someone\nswing for someone\ntan someone's hide idiom\ntar\nwallop\nwhop\nSee more results »\nnut noun [C]\n(FOOD)\nAdd to word list\nAdd to word list\nthe dry fruit of some trees, consisting of an edible seed within a hard, outer shell, or the seed itself\nnut noun [C]\n(METAL OBJECT)\na small ring of metal that a bolt (= screw without a pointed end) can be screwed into to hold something in place: a wing nut (= a nut with flat edges for turning)\nnut noun [C]\n(PERSON)\ninfml a person who is crazy, foolish, or strange: What kind of nut would leave a computer in his car overnight with the doors unlocked?\ninfml A nut is also a person who is extremely enthusiastic about a particular activity or thing: Joyce is a nut for antiques – we’ve got a house full of them.\nIdiom\nthe nuts and bolts of something"}